[
    {
        "content": "<p>Hi <span class=\"user-group-mention\" data-user-group-id=\"3282\">@wg-incr-comp</span></p>",
        "id": 235333445,
        "sender_full_name": "pnkfelix",
        "timestamp": 1618921266
    },
    {
        "content": "<p>So we've sort of stalled on our bi-weekly meetings. the last two or three have all been cancelled, and I can understand why</p>",
        "id": 235333509,
        "sender_full_name": "pnkfelix",
        "timestamp": 1618921293
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"125250\">@Wesley Wiser</span> pointed out that we may want to change the meeting time, and that may be true</p>",
        "id": 235333622,
        "sender_full_name": "pnkfelix",
        "timestamp": 1618921331
    },
    {
        "content": "<p>I also think that we might benefit from setting some more concrete goals for what we will try to accomplish</p>",
        "id": 235333671,
        "sender_full_name": "pnkfelix",
        "timestamp": 1618921358
    },
    {
        "content": "<p>e.g. instead of me just saying \"hmm at some point we should discuss some of these MCP's...\", we could instead actually try to schedule synchronous time to discuss them.</p>",
        "id": 235333739,
        "sender_full_name": "pnkfelix",
        "timestamp": 1618921401
    },
    {
        "content": "<p>also, we could move to doing things on Zulip instead of Zoom. I still think synchronous meetings have value, but if the video recordings or just the \"live presence\" is causing problems, then the <em>slightly async</em> approach offered by chat systems like Zulip may be more attractice.</p>",
        "id": 235333891,
        "sender_full_name": "pnkfelix",
        "timestamp": 1618921469
    },
    {
        "content": "<p>I think trying it on Zulip instead of Zoom is a good idea. We can always switch back if we decide it isn't creating more value or participation.</p>",
        "id": 235344969,
        "sender_full_name": "Wesley Wiser",
        "timestamp": 1618926001
    },
    {
        "content": "<p>Perhaps the next meeting we have should be determining what those concrete goals are? There are few people actively working in the incr-comp space currently (<span class=\"user-mention\" data-user-id=\"248906\">@cjgillot</span>, <span class=\"user-mention\" data-user-id=\"125294\">@Aaron Hill</span> and <span class=\"user-mention\" data-user-id=\"124287\">@mw</span> come to mind). It would be great if some of those folks could attend and we could set some goals that support the work they are already doing <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 235345347,
        "sender_full_name": "Wesley Wiser",
        "timestamp": 1618926141
    },
    {
        "content": "<p>I can confirm that for me generally the barrier of entry is way lower with zulip than with zoom - not only for participating but also (and maybe even more so) for catching up on meetings/discussions I missed. I hardly ever feel that I have the time to watch a recorded meeting :)</p>",
        "id": 235360001,
        "sender_full_name": "mw",
        "timestamp": 1618931317
    },
    {
        "content": "<p>Also, publicly and indefinitely available video recordings do make me uncomfortable (as I've mentioned to <span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span> before).</p>",
        "id": 235360342,
        "sender_full_name": "mw",
        "timestamp": 1618931440
    },
    {
        "content": "<p>I completely agree we need to set some goals for the WG.<br>\nAbout meeting time: I'd prefer Zulip too, and if possible after 5:00 PM Central Europe time.</p>",
        "id": 235380433,
        "sender_full_name": "cjgillot",
        "timestamp": 1618938807
    },
    {
        "content": "<p>long time lurker <span aria-label=\"stuck out tongue\" class=\"emoji emoji-1f61b\" role=\"img\" title=\"stuck out tongue\">:stuck_out_tongue:</span> would love it shifted to zulip as well, much easier to follow</p>",
        "id": 235382664,
        "sender_full_name": "DPC",
        "timestamp": 1618939713
    },
    {
        "content": "<p>Okay so I’ve had more thoughts on this</p>",
        "id": 236734630,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619725961
    },
    {
        "content": "<p>It seems like we should absolutely switch to zulip</p>",
        "id": 236734656,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619725977
    },
    {
        "content": "<p>but also</p>",
        "id": 236734660,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619725978
    },
    {
        "content": "<p>I am thinking: Maybe we hold two short meetings on the same day, once a week</p>",
        "id": 236734688,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619725992
    },
    {
        "content": "<p>where the early meeting is meant to accommodate EU (at least)</p>",
        "id": 236734710,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619726006
    },
    {
        "content": "<p>and the later one accommodates West Coast of USA</p>",
        "id": 236734730,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619726015
    },
    {
        "content": "<p>the main question I have with that structure is whether to encourage some people to attend both meetings</p>",
        "id": 236734799,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619726043
    },
    {
        "content": "<p>to allow for some chance of overlap that isn’t just reading logs</p>",
        "id": 236734844,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619726054
    },
    {
        "content": "<p>I’ve been waking up earlier lately. Its possible I could make an earlier time work for me, especially if its hosted just on Zulip</p>",
        "id": 236734929,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619726093
    },
    {
        "content": "<p>Do we know of people the later meeting would enable to participate or is there just a hope that will allow more people to attend?</p>",
        "id": 236746126,
        "sender_full_name": "Wesley Wiser",
        "timestamp": 1619730426
    },
    {
        "content": "<p>I guess that’s a good point. I don’t know if there’s anyone on West Coast who would participate if we offered a later meeting time</p>",
        "id": 236749280,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619731279
    },
    {
        "content": "<p>but this was just as much motivated by my wanting to be able to offer a better meeting time to EU folks</p>",
        "id": 236749343,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619731299
    },
    {
        "content": "<p>maybe that’s just as much of a mistake. 8:15 EST is what, 4:15 in EU? Would an earlier time help anyone?</p>",
        "id": 236749502,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619731335
    },
    {
        "content": "<p>cjgillot asked for \"after 5:00 PM Central Europe time\"</p>",
        "id": 236749682,
        "sender_full_name": "Wesley Wiser",
        "timestamp": 1619731394
    },
    {
        "content": "<p>I think personally I would vote for 10am Eastern time which I think would be 6pm CET?</p>",
        "id": 236749922,
        "sender_full_name": "Wesley Wiser",
        "timestamp": 1619731462
    },
    {
        "content": "<p>isn’t CET 6 hours ahead?</p>",
        "id": 236750451,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619731678
    },
    {
        "content": "<p>/me looks</p>",
        "id": 236750466,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619731682
    },
    {
        "content": "<p>yeah 6pm CET is 12pm ET</p>",
        "id": 236750532,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619731701
    },
    {
        "content": "<p>May I ask what the purpose of the meeting is exactly? incr. comp. related triage? design discussions?</p>",
        "id": 236824118,
        "sender_full_name": "mw",
        "timestamp": 1619784281
    },
    {
        "content": "<p>For me, it is unlikely that I would be able to attend a meeting that is outside of regular CET office hours.</p>",
        "id": 236824715,
        "sender_full_name": "mw",
        "timestamp": 1619784656
    },
    {
        "content": "<p>so some people need it to be within CET office hours, and others need it to be outside of CET office huors</p>",
        "id": 236848454,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619794997
    },
    {
        "content": "<p>the intet of the meeting is for triage <em>and</em> design discussions</p>",
        "id": 236848534,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619795014
    },
    {
        "content": "<p>at least, that’s my take on it</p>",
        "id": 236848561,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619795020
    },
    {
        "content": "<p>we haven’t necessarily been good at either</p>",
        "id": 236848616,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619795032
    },
    {
        "content": "<p>but I think its useful to try to have synchronized chatter <em>some</em> of the time</p>",
        "id": 236848723,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619795050
    },
    {
        "content": "<p>I think, for the upcoming meeting, part of the focus should be what the WG should be doing to support the work that is being done around incremental. Maybe this is just a matter of making sure reviews are getting done but I think it would be good to have a discussion about what goals are being worked towards.</p>",
        "id": 236877529,
        "sender_full_name": "Wesley Wiser",
        "timestamp": 1619805988
    },
    {
        "content": "<p>okay, yes. My answer was a more general: “What is the standing meeting for\"</p>",
        "id": 236896517,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619814409
    },
    {
        "content": "<p>but Wesley is right that a focused conversation, especially with the expected change in participant due to the planned shift in meeting medium (and time? Not clear yet), these things mean that a focused conversation on “what are our immediate goals” would be good.</p>",
        "id": 236896634,
        "sender_full_name": "pnkfelix",
        "timestamp": 1619814478
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span>! That answers my question. I think having a standing meeting for triage makes sense. For design discussions I have the feeling that standing meetings don't work particularly well. It's often only one or two people who really know about the topic being discussed and making a commitment to read up on every topic being discussed beforehand is rarely feasible timewise. </p>\n<p>Maybe it would be a good idea to set an overarching theme or topic for the \"season\" and declare a soft goal that the entire WG will be working on that for a number of months? That way it would easier to get acquainted with a topic (which might be doubly true for newcomers) and then find reviewers. And if more folks are actually up to speed with the topic, it would be easier to have useful design discussions on a more regular basis. Just some thoughts.</p>",
        "id": 237127812,
        "sender_full_name": "mw",
        "timestamp": 1620029568
    },
    {
        "content": "<blockquote>\n<p>For design discussions I have the feeling that standing meetings don't work particularly well. It's often only one or two people who really know about the topic being discussed and making a commitment to read up on every topic being discussed beforehand is rarely feasible timewise. </p>\n</blockquote>\n<p>I agree with this. A practice Niko and I have been playing with, adopted from Amazon, is to require short write ups that are digestible <em>in the meeting</em>. So obviously for that to work, meeting topics need to be established well ahead of time.</p>\n<p>When I said the meeting was for triage and design, I was mostly thinking that having a standing slot reserved is a good idea, and that saying it was “just for triage” might be too narrow when we might want to pre-schedule topics to discuss during future meetings in that same slot</p>",
        "id": 237152975,
        "sender_full_name": "pnkfelix",
        "timestamp": 1620044875
    }
]