[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"123856\">@Vadim Petrochenkov</span>, related to your PR <a href=\"https://github.com/rust-lang/rust/issues/80765\">#80765</a>:<br>\nI have a branch embryo (a bud?) introducing an <code>HygienicIdent</code> abstraction, for just <code>Symbol + SyntaxContext</code>.<br>\nThe objective was originally to make progress on span-less HIR.<br>\nAre you interested? Do you have use cases with more immediate applications?</p>",
        "id": 221972277,
        "sender_full_name": "cjgillot",
        "timestamp": 1610040357
    },
    {
        "content": "<p>I've seen this message but didn't have a chance to answer in detail yet.<br>\n<code>SyntaxContext</code> still contains more data than necessary on a \"good path\" (e.g. info about expansions of transparent and semi-transparent macros), we should be able to do better.</p>",
        "id": 222129473,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1610141889
    },
    {
        "content": "<p>What's the minimal amount of information that is required for this?</p>",
        "id": 222130346,
        "sender_full_name": "cjgillot",
        "timestamp": 1610142330
    },
    {
        "content": "<p>Let me clarify the basics. So the general idea is that:</p>\n<ul>\n<li>Only a subset of <code>Span</code> data is used during successful compilation (\"good path\"), let's call it <code>SpanLite</code> this subset changes more rarely during successive compilations, so incremental compilation benefits from hashing it to determine that something changed instead of hashing the whole span.</li>\n<li>Full <code>Span</code> is used only on erroneous paths, or by rarely invoked \"leaf\" queries, so it can be kept in some side table with slow access to it.</li>\n</ul>",
        "id": 222761592,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1610649253
    },
    {
        "content": "<p>I think the most important thing here is to confirm that full <code>Span</code> is indeed not used on good path, because if it is used then the whole scheme breaks and we are simply slowing things down and make them more complex without any benefit.<br>\nThis property is highly non-obvious, for example in <a href=\"https://github.com/rust-lang/rust/issues/73996\">#73996</a> we naively assumed that types are not pretty-printed on good path (with path shortening such pretty-printing calls a very heavy query), but that turned out to not be true at all.</p>",
        "id": 222762184,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1610649495
    },
    {
        "content": "<p>For spans one obvious case is debuginfo - it it's generated, then full spans are used. How do you plan to deal with this case?</p>",
        "id": 222762547,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1610649643
    },
    {
        "content": "<p>Regarding the minimal amount of information, it's <code>SyntaxContext</code> with <code>normalize_to_macros_2_0</code> applied, that's what is needed for resolving names of associated items (which is always done on \"good path\").<br>\nAfter lowering to HIR unnormalized <code>SyntaxContext</code> should only be used for 1) \"are we in external macro?\" checks in lints and 2) edition checks (if I'm not forgetting anything).</p>\n<p>The lint checks can probably be performed last, only in cases when we are sure that we are going to report the lint otherwise.<br>\nThe post-AST-lowering edition checks need some audit and review, I'm not sure how often they are done and on what paths.</p>\n<p>Anyway, full unnormalized <code>SyntaxContext</code> should be a good first approximation to the <code>HygienicIdent</code> (which I would probably call just <code>hir::Ident</code>).</p>",
        "id": 222763452,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1610649986
    },
    {
        "content": "<p>One more thing - IIRC, some HIR nodes only use <code>Ident</code>s due to span locations, not hygiene, they can be turned into simple <code>Symbol</code>s without <code>SyntaxContext</code>s if span locations are outlined.</p>",
        "id": 222763622,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1610650067
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"123856\">Vadim Petrochenkov</span> <a href=\"#narrow/stream/241847-t-compiler.2Fwg-incr-comp/topic/HygienicIdent.20abstraction/near/222762547\">said</a>:</p>\n<blockquote>\n<p>For spans one obvious case is debuginfo - it it's generated, then full spans are used. How do you plan to deal with this case?</p>\n</blockquote>\n<p>worth calling out panic! and every unwrap()/expect() (track_caller method), too, in terms of location information - which is not controllable by user</p>",
        "id": 222765233,
        "sender_full_name": "simulacrum",
        "timestamp": 1610650726
    },
    {
        "content": "<p>Thanks for this detailed explanation.<br>\nI don't have a satisfactory design for storing the full span for each Ident.<br>\n1/ The simplest solution would be to add some \"hir::IdentId\" (as a newtype for HirId or a more compact representation) and store everything out of the tree (= a side table). This would lead to a lot of churn in downstream crates.<br>\n2/ Another solution would be to try some hybrid between storing the HygienicIdent in-tree and its span out. This would require some <code>ident_span: HirId -&gt; Span</code> map. Unfortunately, some HIR nodes have Idents and no HirId.<br>\nI tend to favour solution 2, since there is already an <code>ident_span</code> metadata output. Since it will be sparse, I imagine using the same kind of method as for attributes.</p>",
        "id": 225418154,
        "sender_full_name": "cjgillot",
        "timestamp": 1612627253
    }
]