[
    {
        "content": "<p>making a topic here to discuss the doc that will drive rustc steering meeting <a href=\"https://github.com/rust-lang/compiler-team/issues/490\">compiler-team#490</a>, scheduled for <time datetime=\"2022-04-01T16:00:00Z\">2022-04-01T12:00:00-04:00</time></p>",
        "id": 274999458,
        "sender_full_name": "pnkfelix",
        "timestamp": 1647017009
    },
    {
        "content": "<p>So, IIRC, the topic for meeting is going to be \"What are the concrete problems with the current incr. comp. system?\", right? I'd say this includes at least (1) robustness, (2) ease of understanding what's going on, and (3) the need to implement algorithms in a non-traditional way.</p>",
        "id": 275373643,
        "sender_full_name": "mw",
        "timestamp": 1647351511
    },
    {
        "content": "<p>I'm wondering how we should best go about this, <span class=\"user-mention\" data-user-id=\"125294\">@Aaron Hill</span>. Maybe start by collecting concrete complaints people have voiced?</p>",
        "id": 275373761,
        "sender_full_name": "mw",
        "timestamp": 1647351579
    },
    {
        "content": "<p>What structure do we want the hackmd doc to have? What could a productive discussion look like?</p>",
        "id": 275374322,
        "sender_full_name": "mw",
        "timestamp": 1647351867
    },
    {
        "content": "<p>I think one reason why the current system appears so invasive is that it turns some minor issues into potential correctness problems:</p>\n<ul>\n<li>Everything that shows up in a query key or query result must implement HashStable, but getting that implementation wrong can cause actual miscompilations. The stakes to get this right seem way too high.</li>\n<li>Query implementations must be deterministic, or we can end up with miscompilations too (such as the vtable-related one last year). Making the compiler's results as deterministic as possible is always a goal, regardless of incr. comp., but normally the error case is much less severe.</li>\n</ul>",
        "id": 275482772,
        "sender_full_name": "mw",
        "timestamp": 1647421589
    },
    {
        "content": "<p>A problem that the current setup shares with any fine-grained on-demand evaluation system is:</p>\n<ul>\n<li>Many algorithms have to be re-formulated in a way that fits that on-demand structure, adding additional complexity. E.g. an on-demand parser might look quite different from what one finds described in text books or elsewhere. This is less of a problem for things that work in a more local scope (e.g. like doing type checking for a single item) -- but for things that are, for example, based on data flowing through the tree structure of the entire crate, it is a lot of work to figure out how that can be done, and once it's done, there's a more complicated setup that has to be maintained.</li>\n</ul>",
        "id": 275495692,
        "sender_full_name": "mw",
        "timestamp": 1647429164
    },
    {
        "content": "<ul>\n<li>There are also rules/invariants around what data a query provider is allowed to access, like \"don't access untracked global state\", \"don't cache things in thread-local or global caches\", that are surprising and might seem limiting, and -- most importantly -- that are hard to teach and enforce automatically.</li>\n</ul>",
        "id": 275496091,
        "sender_full_name": "mw",
        "timestamp": 1647429434
    },
    {
        "content": "<p>Another problem with incr. comp (as opposed to simple on-demand evaluation) is:</p>\n<ul>\n<li>There is this notion of \"stability\" where we don't want local changes to have global effects (e.g. we don't want the addition of one item to shift the names/IDs of all other items in the crate). This is very hard to explain, and even for people who have worked with the system for a long time, it continues to be a kind of vague concept. It's one more unfamiliar thing that every newcomer has to learn and keep in mind.</li>\n</ul>",
        "id": 275496442,
        "sender_full_name": "mw",
        "timestamp": 1647429658
    },
    {
        "content": "<blockquote>\n<p>\"don't access untracked global state\"</p>\n</blockquote>\n<p>I think we should get rid of as much of the global state as possible. That would fix this specific issue by definition.</p>",
        "id": 275496513,
        "sender_full_name": "bjorn3",
        "timestamp": 1647429700
    },
    {
        "content": "<p>I completely agree. There are some cases where this can creep in that are not entirely obvious, like having a static inside of a query provider that is used for caching things. I guess that's not exactly \"global\" state but it definitely is untracked mutable state.</p>",
        "id": 275496876,
        "sender_full_name": "mw",
        "timestamp": 1647429894
    },
    {
        "content": "<p>Another problem of fine-grained incr. comp.:</p>\n<ul>\n<li>One has to be very careful about data dependencies, and as a consequence of separating data that is accessed separately. E.g. it might be natural and otherwise beneficial to keep the span information of an item inside of that item - but then all queries accessing this item will depend on its span, even if they don't access it unless they need to do error reporting. But splitting according to access patterns can be very cumbersome and invasive.</li>\n</ul>",
        "id": 275497921,
        "sender_full_name": "mw",
        "timestamp": 1647430608
    },
    {
        "content": "<p>Another problem with the current system:</p>\n<ul>\n<li>On-demand evaluation and automated dependency tracking incur quite a bit of overhead, for checking if something is already in the cache, for building the dependency graph, for fingerprinting query results, and even synchronization in the case of the parallel compiler. This makes calling a query more costly than e.g. a simple hash table lookup, and as a consequence algorithms have to be written differently in order to minimize the number of query calls -- something that usually doesn't exactly improve the readability of the code.</li>\n</ul>",
        "id": 275498436,
        "sender_full_name": "mw",
        "timestamp": 1647430963
    },
    {
        "content": "<p>Splitting data can be beneficial for cache usage even without incr comp. Zig for example does this really heavily if I understand it correctly. <a href=\"https://mitchellh.com/zig/astgen#anatomy-of-astgen\">https://mitchellh.com/zig/astgen#anatomy-of-astgen</a></p>",
        "id": 275498600,
        "sender_full_name": "bjorn3",
        "timestamp": 1647431079
    },
    {
        "content": "<p>Yes, I think one of the things we want to do when evaluating alternatives to the current system, is to check if a given alternative doesn't have the same problem, or if there are other reasons (like performance) for doing something that currently makes things harder. Structuring data in a cache friendly way is one of them (and incr. comp. as it is now is quite limiting there, I'd guess).</p>",
        "id": 275499015,
        "sender_full_name": "mw",
        "timestamp": 1647431355
    },
    {
        "content": "<p>Is there a hackmd?</p>",
        "id": 275739236,
        "sender_full_name": "Aaron Hill",
        "timestamp": 1647557826
    },
    {
        "content": "<p>One other problem - certain 'global' types need special handling for incremental compilation (<code>DefId</code>, <code>CrateNum</code>, <code>Span</code>, and more recently <code>ExpnId</code>)</p>",
        "id": 275761090,
        "sender_full_name": "Aaron Hill",
        "timestamp": 1647580241
    },
    {
        "content": "<p>There is no hackmd yet, no.</p>",
        "id": 275799536,
        "sender_full_name": "mw",
        "timestamp": 1647608924
    },
    {
        "content": "<p>What channel is the meeting in?</p>",
        "id": 275823131,
        "sender_full_name": "Aaron Hill",
        "timestamp": 1647619321
    },
    {
        "content": "<p>nvm, I though it was today for some reason</p>",
        "id": 275823680,
        "sender_full_name": "Aaron Hill",
        "timestamp": 1647619500
    },
    {
        "content": "<p>I'd like to try and clarify what the topic of this meeting should be. Is it one of:</p>\n<ol>\n<li>Let's chat about what the shortcomings of the current system are and try to make that list as concrete as possible.</li>\n<li>Let's discuss specific things we can do to improve maintainability in the next few months and how to prioritize them.</li>\n<li>Let's discuss if an on-demand evaluation model is just \"too weird\" from an architectural point of view and people find it to be a burden to work with such an architecture in general.</li>\n</ol>\n<p>Or is it none of the above.</p>\n<p>cc <span class=\"user-group-mention\" data-user-group-id=\"3282\">@wg-incr-comp</span></p>",
        "id": 276475392,
        "sender_full_name": "mw",
        "timestamp": 1648128648
    },
    {
        "content": "<p>I looks like <span class=\"user-group-mention silent\" data-user-group-id=\"3282\">wg-incr-comp</span> does not include some key people, so also cc <span class=\"user-group-mention\" data-user-group-id=\"492\">@T-compiler</span>, <span class=\"user-mention\" data-user-id=\"248906\">@cjgillot</span>, <span class=\"user-mention\" data-user-id=\"120989\">@nnethercote</span>, <span class=\"user-mention\" data-user-id=\"116113\">@lqd</span></p>",
        "id": 276475652,
        "sender_full_name": "mw",
        "timestamp": 1648128800
    },
    {
        "content": "<p>I think there is an unstated assumption in the above that trying to cover all of {1,2,3} is too much for one steering meeting. I agree with that assumption, but I just wanted to make it explicit.</p>",
        "id": 276479312,
        "sender_full_name": "pnkfelix",
        "timestamp": 1648130517
    },
    {
        "content": "<p>I suspect the most productive meeting would be one that covers 1+2</p>",
        "id": 276479726,
        "sender_full_name": "pnkfelix",
        "timestamp": 1648130696
    },
    {
        "content": "<p>but its possible that I'm ignoring the need to talk about 3. Or at least, if we're going to talk about throwing away the current evaluation model, we need to have one or more concrete alternative propsals to discuss, and I don't think we're going to see that within a week.</p>",
        "id": 276479830,
        "sender_full_name": "pnkfelix",
        "timestamp": 1648130753
    },
    {
        "content": "<p>I would also add that, in the context of Salsa, I've been pushing on a new form of on-demand project that (imo) is FAR more natural</p>",
        "id": 276481688,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1648131540
    },
    {
        "content": "<p>I think it might also help address some of the reproducability problems we've been encountering in practice, if not in theory</p>",
        "id": 276481744,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1648131560
    },
    {
        "content": "<p>though I'm not super close to that</p>",
        "id": 276481761,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1648131565
    },
    {
        "content": "<p>I have been contemplating trying to do a meeting with incr-comp folks to extoll its virtues and talk about whether it could be added to the compiler</p>",
        "id": 276481828,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1648131589
    },
    {
        "content": "<p>I have to say that I am nervous that even just focusing on <a href=\"https://github.com/rust-lang/rust/issues/1\">#1</a> and <a href=\"https://github.com/rust-lang/rust/issues/2\">#2</a> for a <em>design meeting</em> will not work -- i.e., the meeting ought to be more <em>coming with recommendations</em> ? not sure.</p>",
        "id": 276481923,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1648131610
    },
    {
        "content": "<p>I've not been attending design meetings for a while but my recollection is that it is hard to do detailed design with a bunch of people around :)</p>",
        "id": 276481963,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1648131623
    },
    {
        "content": "<p>Yes, IIUC, Niko's new model has two helpful additions that would solve some problems (and could be backported to the current system): </p>\n<ol>\n<li>query results can correspond to more than one dep-node. I.e. you can depend on part of a results without depending on the rest.</li>\n<li>numeric IDs (think CrateNum, DefIndex) are never re-used, so they can be compared verbatim.</li>\n</ol>",
        "id": 276482749,
        "sender_full_name": "mw",
        "timestamp": 1648131941
    },
    {
        "content": "<p>wrt to the meeting topic: yeah, \"design meeting\" is kind of a misnomer here :) It's more about dedicating time to discussing incr. comp. But I'm also a bit worried that that's going to be too free from to be useful.</p>",
        "id": 276483278,
        "sender_full_name": "mw",
        "timestamp": 1648132164
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116009\">nikomatsakis</span> <a href=\"#narrow/stream/241847-t-compiler.2Fwg-incr-comp/topic/prep.20for.20compiler-team.23490/near/276481828\">said</a>:</p>\n<blockquote>\n<p>I have been contemplating trying to do a meeting with incr-comp folks to extoll its virtues and talk about whether it could be added to the compiler</p>\n</blockquote>\n<p>Do you have a summary description of the differences between the rustc model and this salsa model?</p>",
        "id": 276519268,
        "sender_full_name": "cjgillot",
        "timestamp": 1648145897
    },
    {
        "content": "<blockquote>\n<p>numeric IDs (think CrateNum, DefIndex) are never re-used, so they can be compared verbatim.</p>\n</blockquote>\n<p>Won't that run out of 32bit identifiers rather quick? Especially when using inside an editor?</p>",
        "id": 276522749,
        "sender_full_name": "bjorn3",
        "timestamp": 1648147463
    },
    {
        "content": "<p>Also CrateNum and DefId are interned identifiers like Symbol is. They are only meant to be unique for as long as the interner is still alive which happens to be a single compilation session.</p>",
        "id": 276522920,
        "sender_full_name": "bjorn3",
        "timestamp": 1648147550
    },
    {
        "content": "<p>Instead of ids, could these all be some interned datastructure that contains their info in a unique way? So <code>type DefId&lt;'arena&gt; = &amp;'arena (CrateId&lt;'arena&gt;, DefPath)</code> or sth like that. Since they are interned, we can just compare addresses. For hashing we'll hash the contents (possibly caching the stable hash in the interned data)</p>",
        "id": 276525902,
        "sender_full_name": "oli",
        "timestamp": 1648148894
    },
    {
        "content": "<p>Crate id gets bigger, but DefId stays the same size</p>",
        "id": 276525950,
        "sender_full_name": "oli",
        "timestamp": 1648148926
    },
    {
        "content": "<p>That would be <code>type DefId&lt;'arena&gt; = &amp;'arena DefPathHash</code> I think. It could work. For <code>CrateId</code> I think it is better to simply directly use <code>StableCrateId</code> instead. Both it and a pointer are 64bit.</p>",
        "id": 276527142,
        "sender_full_name": "bjorn3",
        "timestamp": 1648149582
    },
    {
        "content": "<p>For <code>CrateId</code> and <code>DefIndex</code> we do use them as index into a vec though which means the current code expects them to be dense.</p>",
        "id": 276527250,
        "sender_full_name": "bjorn3",
        "timestamp": 1648149625
    },
    {
        "content": "<p>Are these lookups on perf critical paths? If not, we can just use a different datastructure</p>",
        "id": 276527382,
        "sender_full_name": "oli",
        "timestamp": 1648149717
    },
    {
        "content": "<p>Yes, every crate metadata lookup and every HIR lookup does this.</p>",
        "id": 276527463,
        "sender_full_name": "bjorn3",
        "timestamp": 1648149749
    },
    {
        "content": "<p>HIR lookups are moving to hash tables in various cases, maybe that'll not be an issue after querification of hir lowering</p>",
        "id": 276527587,
        "sender_full_name": "oli",
        "timestamp": 1648149831
    },
    {
        "content": "<p>That leaves crate metadata lookups. We do a CrateNum lookup and then a DefIndex lookup on pretty much every crate metadata lookup.</p>",
        "id": 276527780,
        "sender_full_name": "bjorn3",
        "timestamp": 1648149934
    },
    {
        "content": "<p>I guess we could keep cratenums and convert during deserialization and serialization?</p>",
        "id": 276530914,
        "sender_full_name": "oli",
        "timestamp": 1648151650
    },
    {
        "content": "<p>That is what we do. We remap crate nums during decoding based on the list of dependencies and their StableCrateId's.</p>",
        "id": 276534284,
        "sender_full_name": "bjorn3",
        "timestamp": 1648153319
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"248906\">@cjgillot</span> there is a somewhat outdated doc, though it's on my list to try and bring it up to date</p>",
        "id": 276537967,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1648155204
    },
    {
        "content": "<p>the biggest part for me is that writing code in this model feels very much like writing \"normal rust code\"</p>",
        "id": 276537981,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1648155214
    },
    {
        "content": "<p>it's true that we don't re-use identifiers, but that's not the whole story; we re-use them but not in adjacent revisions (and we also have a pretty good answer for when we can free up memory that no longer requires a \"mark-and-sweep\"-like approach, which is cool)</p>",
        "id": 276538098,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1648155262
    },
    {
        "content": "<p>I'll see if I can refresh the doc, but I think the next best thing might be to schedule a time to chat</p>",
        "id": 276538125,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1648155277
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116009\">nikomatsakis</span> <a href=\"#narrow/stream/241847-t-compiler.2Fwg-incr-comp/topic/prep.20for.20compiler-team.23490/near/276537981\">said</a>:</p>\n<blockquote>\n<p>the biggest part for me is that writing code in this model feels very much like writing \"normal rust code\"</p>\n</blockquote>\n<p>Yes, that's probably the most important aspect of it. From what I've seen, it does require much less restructuring of how algorithms are implemented. But I've only talked to Niko about it once a couple of months ago and I'm still unclear about many of the details -- so I think it would be great to have a chat/technical discussion about it in the compiler team.</p>\n<p>My current estimation is that, if we adopt a new evaluation model, it would be best to re-write things starting from the inputs (i.e. source files, upstream crates, commandline args), so we make sure to get the fundamental data structures right. Otherwise there's a high risk that we run into many of the exact same issues that we have now, I think.</p>",
        "id": 276591277,
        "sender_full_name": "mw",
        "timestamp": 1648198858
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116009\">nikomatsakis</span> <a href=\"#narrow/stream/241847-t-compiler.2Fwg-incr-comp/topic/prep.20for.20compiler-team.23490/near/276537967\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"248906\">cjgillot</span> there is a somewhat outdated doc, though it's on my list to try and bring it up to date</p>\n</blockquote>\n<p>Is this the \"salsa entity RFC\" document?</p>\n<p>I'm totally open to restructuring the way incr-comp works right now.  I will first have to understand your document, and to translate to the current concepts we have in rustc.</p>",
        "id": 276718912,
        "sender_full_name": "cjgillot",
        "timestamp": 1648291110
    },
    {
        "content": "<p>I'd like to try to focus the discussion on the planning for this Friday's meeting. There were a set of potential topics for the meeting posed <a href=\"#narrow/stream/241847-t-compiler.2Fwg-incr-comp/topic/prep.20for.20compiler-team.23490/near/276475392\">up above</a>. It might be good to try to reframe the question as: What are the ideal set of <em>goals</em> (as in decisions+action items) that we would like to establish by the end of this Friday's meeting. (I'll also note that, in my experience, an <em>opinionated document</em> (and I'd argue: even one with the <em>wrong opinions</em>) tends to drive these hour-long discussions a little more effectively than an open-ended survey with no opinions at all.</p>",
        "id": 276876880,
        "sender_full_name": "pnkfelix",
        "timestamp": 1648475954
    },
    {
        "content": "<p>(An example goal would be \"We <em>will</em> going to adopt a new evaluation model for incr-comp; and in this case, I'd like to at least have the list of the desired elements for the new model, and pro's and con's of switching to it.)</p>",
        "id": 276877131,
        "sender_full_name": "pnkfelix",
        "timestamp": 1648476035
    },
    {
        "content": "<p>I think an important aspect is avoiding the 'registration' that occurs with a call. We should be able to add caching that's entirely contained in one small area of the compiler (e.g. <code>thread_local</code> caches in <code>HashStable</code>, or the trait selection cache) without needing to think about how it interacts with incremental compilation</p>",
        "id": 277092351,
        "sender_full_name": "Aaron Hill",
        "timestamp": 1648613218
    },
    {
        "content": "<p>how would that be possible? when you say \"registration\", you mean \"record that a query depends on a previous query\", right?</p>",
        "id": 277093217,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1648614223
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116083\">pnkfelix</span> <a href=\"#narrow/stream/241847-t-compiler.2Fwg-incr-comp/topic/prep.20for.20compiler-team.23490/near/276876880\">said</a>:</p>\n<blockquote>\n<p>(I'll also note that, in my experience, an <em>opinionated document</em> (and I'd argue: even one with the <em>wrong opinions</em>)</p>\n</blockquote>\n<p>I think that's very insightful, <span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span>! I could put together such an opinionated document that argues that we should fix/cleanup/extend the current system instead of switching to a new one. That would surely solicit some strong reactions <code>;)</code></p>",
        "id": 277118910,
        "sender_full_name": "mw",
        "timestamp": 1648633614
    },
    {
        "content": "<p>I mean anything that dynamically 'records' the fact that a specific function call / query was called</p>",
        "id": 277155146,
        "sender_full_name": "Aaron Hill",
        "timestamp": 1648651311
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"124287\">@mw</span> I think a document that presented the tradeoffs and reached the conclusion to fix/cleanup/extend the current system could be useful indeed, as long as it doesn't include the step <a href=\"https://www.researchgate.net/figure/Then-a-Miracle-Occurs-Copyrighted-artwork-by-Sydney-Harris-Inc-All-materials-used-with_fig2_302632920\">\"And Then A Miracle Occurs.\"</a></p>",
        "id": 277218143,
        "sender_full_name": "pnkfelix",
        "timestamp": 1648685232
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"124287\">@mw</span> <span class=\"user-mention\" data-user-id=\"125294\">@Aaron Hill</span> who is owning developing the document for tomorrows meeting? if you don't mind, I'd like to take a look at it sometime today, if it exists. (If it doesn't exists, that's okay too, though it might be a sign that we should delay having the meeting.)</p>",
        "id": 277278647,
        "sender_full_name": "pnkfelix",
        "timestamp": 1648732634
    },
    {
        "content": "<p>The document does not exist yet. I planned to create an adapted version of <a href=\"https://hackmd.io/@michaelwoerister/SJf9VU1-5\">https://hackmd.io/@michaelwoerister/SJf9VU1-5</a> tomorrow.</p>",
        "id": 277279648,
        "sender_full_name": "mw",
        "timestamp": 1648733057
    },
    {
        "content": "<p>Tomorrow as in \"for tomorrow\", right?</p>",
        "id": 277281508,
        "sender_full_name": "pnkfelix",
        "timestamp": 1648733882
    },
    {
        "content": "<p>or I guess you have plenty of time before the steering meeting due to time zone difference between us</p>",
        "id": 277281565,
        "sender_full_name": "pnkfelix",
        "timestamp": 1648733908
    },
    {
        "content": "<p>right?</p>",
        "id": 277281576,
        "sender_full_name": "pnkfelix",
        "timestamp": 1648733911
    },
    {
        "content": "<p>Yes, the meeting is at 4pm for me and I blocked off all morning for creating the doc.</p>",
        "id": 277282158,
        "sender_full_name": "mw",
        "timestamp": 1648734185
    },
    {
        "content": "<p>anyway, it sounds like the best way I can help <em>today</em> would be to review the text of <a href=\"https://hackmd.io/@michaelwoerister/SJf9VU1-5\">https://hackmd.io/@michaelwoerister/SJf9VU1-5</a> and add whatever feedback I can there, in terms of items that I think need more explanation</p>",
        "id": 277282165,
        "sender_full_name": "pnkfelix",
        "timestamp": 1648734186
    },
    {
        "content": "<p>Yes, I'll leave some comments there for things that I consider outdated</p>",
        "id": 277282532,
        "sender_full_name": "mw",
        "timestamp": 1648734309
    },
    {
        "content": "<p>I also just saw that <span class=\"user-mention\" data-user-id=\"248906\">@cjgillot</span> left a few comments that I haven't seen yet.</p>",
        "id": 277282574,
        "sender_full_name": "mw",
        "timestamp": 1648734331
    },
    {
        "content": "<p>that would be helpful, thank you. also, if there's anything that you ntoice that you think will be outright <em>omitted</em> from the doc you make (as in, \"felix should not waste time advising on improvements to this part\"), maybe note that too.</p>",
        "id": 277282632,
        "sender_full_name": "pnkfelix",
        "timestamp": 1648734360
    }
]