[
    {
        "content": "<p>Hello to everyone who's joined the wg-debugging stream thus far! <span class=\"user-mention\" data-user-id=\"125250\">@Wesley Wiser</span> and <span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span> are still working out exactly what our plans are here, and as part of that, I wanted to try to gauge people's interest/planned involvement</p>",
        "id": 274901809,
        "sender_full_name": "pnkfelix",
        "timestamp": 1646949856
    },
    {
        "content": "<p>Specifically, I wanted to know which people are interested in participating at a somewhat dedicated level of engaging in recurring meetings (similar to weekly triage), helping with issue management or other organization stuff, ...</p>",
        "id": 274904087,
        "sender_full_name": "pnkfelix",
        "timestamp": 1646950849
    },
    {
        "content": "<p>... versus which people are solely interested in specific domain specific topics (e.g. <code>gdb</code> support, or improving our DWARF output, etc), and are not planning to be following along every week with whatever is happening ...</p>",
        "id": 274904141,
        "sender_full_name": "pnkfelix",
        "timestamp": 1646950894
    },
    {
        "content": "<p>... (And I'm sure there are other categories of people, such as those who are interested in <em>using</em> debuggers but do not feel comfortable putting themselves into either of the aforementioned buckets yet. I care about you too! You're our \"customers\", to use Amazon speak. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> !)</p>",
        "id": 274904150,
        "sender_full_name": "pnkfelix",
        "timestamp": 1646950900
    },
    {
        "content": "<p>Anyway, feel free to say Hi, and maybe put a <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> into whichever of the above buckets you think you fall into. If its bucket <a href=\"https://github.com/rust-lang/rust/issues/3\">#3</a>, I invite you to say more about it.</p>",
        "id": 274904259,
        "sender_full_name": "pnkfelix",
        "timestamp": 1646950947
    },
    {
        "content": "<p>Hi, i'm unsure what bucket I fit in exactly.<br>\nI haven't yet contributed to rust, but motivated by the 'rust compiler ambitions' blog post I would like to help out with the debugging initiative.<br>\nI have written my own compiler frontend to x86 backend but don't have any particular experience with debuggers, except for using gdb every now and then.<br>\nEventually, I'd love to be in the first bucket but want to get my feet wet first.</p>",
        "id": 274920082,
        "sender_full_name": "neuring",
        "timestamp": 1646961459
    },
    {
        "content": "<p>I expect recurring meetings to happen here on Zulip, so the bar for \"listening in\" should be rather low.</p>",
        "id": 274951782,
        "sender_full_name": "mw",
        "timestamp": 1646991653
    },
    {
        "content": "<p>I'm interested in participating at a \"somewhat dedicated\" level. </p>\n<p>(I'm currently in China and will be for a few more months, so my timezone is inhospitable to attending much of anything, but upon my return to the UK, I'll be more actively participating)</p>",
        "id": 275766754,
        "sender_full_name": "davidtwco",
        "timestamp": 1647587421
    },
    {
        "content": "<p>I don't have a <em>ton</em> of time to dedicate, but I'd love to help out in three ways:</p>\n<ul>\n<li><span class=\"user-mention\" data-user-id=\"211722\">@Yoshua Wuyts [he/they]</span> and I started working on a VS Code extension that conforms to the VS Code <a href=\"https://code.visualstudio.com/api/extension-guides/debugger-extension\">debugger adapter protoco</a>. This could be a way for us to experiment with more Rust specific debugger front end experiences. </li>\n<li>PM work: I'd be happy to do a bit of project management work. </li>\n<li>Documentation: It would be fantastic if we not only had great debugger support but also world class documentation for how to use various debuggers to debug Rust</li>\n</ul>",
        "id": 275805699,
        "sender_full_name": "rylev",
        "timestamp": 1647611844
    },
    {
        "content": "<p>I am potentially interested in contributing depending on how relevant <a href=\"https://github.com/rust-minidump/rust-minidump\">rust-minidump</a> is to this (rust-minidump is mozilla's ongoing rewrite of breakpad, the multi-platform minidump writer/analyzer; the analyzer side is good enough that we're running it in production. the writer side is ramping up.)</p>",
        "id": 275876490,
        "sender_full_name": "Gankra",
        "timestamp": 1647647926
    },
    {
        "content": "<p>As Pernosco is becoming a part of what we do in Rustc Reading Club along with gdb, I expect that I will learn more about how and where I can contribute with time.  Our use is unique I suppose, but I would like to take what I learn there and apply it to debugging in rustc.</p>",
        "id": 275920399,
        "sender_full_name": "Doc Jones",
        "timestamp": 1647711068
    },
    {
        "content": "<p>I am the creator of the <a href=\"http://lldb.llvm.org\">LLDB</a> debugger and happy to help scope out what work can be done within LLDB to make rust debugging better for developers. I also know quite a bit about DWARF after having dealt with DWARF for over 20 years in developer tools. So I am happy to attend meetings when time permits and also answer any questions people might have on anything debugging related.</p>",
        "id": 276128663,
        "sender_full_name": "Greg Clayton",
        "timestamp": 1647906790
    },
    {
        "content": "<p>Hello, I am working on debugging support in <a href=\"https://github.com/intellij-rust/intellij-rust/\">IntelliJ Rust</a>. Besides IDE-specific things, I am the author of GDB/LLDB pretty-printers, originally written for IntelliJ Rust and shipped with rustc <a href=\"https://github.com/rust-lang/rust/pull/72357\">since 1.46</a>. I am also developing custom LLDB versions bundled with JetBrains IDEs.</p>\n<p>I would like to attend the meetings periodically, and probably contribute to rustc. As for domain-specific topics, I am mostly interested in improving LLDB support and debuginfo generation (DWARF and PDB).</p>",
        "id": 276223079,
        "sender_full_name": "Artem Mukhin",
        "timestamp": 1647969160
    }
]