[
    {
        "content": "<p>so I had a good conversation <span class=\"user-mention\" data-user-id=\"235180\">@Jack Moffitt</span> recently, who was telling me of their difficulties getting started with the async book</p>",
        "id": 173224412,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1565804007
    },
    {
        "content": "<p>it seemed like a lot of it stemmed from (a) it being hard and confusing to figure out which versions of everything to be using; (b) the hello world examples don't spell out enough stuff like \"which feature gate to use\" and which version of futures crate; (c) the futures crate itself that is most prominently on <a href=\"http://docs.rs\" target=\"_blank\" title=\"http://docs.rs\">docs.rs</a> is 0.1.28 which includes its own version of Future and doesn't have many of the fns that appear in the book</p>",
        "id": 173224488,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1565804071
    },
    {
        "content": "<p>anyway I asked them to come and jot some notes here</p>",
        "id": 173224529,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1565804116
    },
    {
        "content": "<p>sounds like useful feedback! I'm excited to hear more</p>",
        "id": 173225278,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565804763
    },
    {
        "content": "<p>I think <a href=\"https://internals.rust-lang.org/t/async-await-ecosystem-experience-report/10707\" target=\"_blank\" title=\"https://internals.rust-lang.org/t/async-await-ecosystem-experience-report/10707\">this message from internals</a> perhaps captures the \"essence\" of <span class=\"user-mention\" data-user-id=\"235180\">@Jack Moffitt</span>'s experience, if not the details.</p>",
        "id": 173225938,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1565805313
    },
    {
        "content": "<blockquote>\n<p>I still remain excited about async in rust, but feel like I need to wait a few more months for the ecosystem to continue to build out and up </p>\n</blockquote>\n<p>sounds like a reasonable summary to me</p>",
        "id": 173227413,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565806203
    },
    {
        "content": "<p>I wouldn't expect anything different</p>",
        "id": 173227459,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565806218
    },
    {
        "content": "<p>but I am interested to know about details of the book that could've helped in the problem-solving</p>",
        "id": 173227479,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565806228
    },
    {
        "content": "<p>That internals message is indeed, similar, but he made it farther than I did.</p>\n<p>My experience started with a teammate reporting a strange compiler error. Specifically there was a function that returned <code>impl Future&lt;Output = ()&gt;</code> and he was trying to return <code>future::ok::&lt;(),()&gt;(())</code>. I first looked at the docs, which I found via Google. They showed that future::ok returned FutureResult and that FutureResult impled Future, so the code looked fine, even though it wouldn't compile. It was clear after a bit of digging that these were outdated or perhaps newer docs.</p>\n<p>Next I decided I'd mock this up on the playground and see what happened, but I couldn't get anything to compile. That wasn't too surprising, since I hadn't written any async code before in Rust. I then went to the async book and decided I'd just start from the beginning until I got something simple working, which I could then progress to a simplified example of the future::ok thing.</p>\n<p>Here I got stuck because executor::block_on didn't exist, and nothing I did seemed to help. I started trying to figure out which version of futures i needed, whether I needed tokio or not, etc. And there I stopped for the evening.</p>",
        "id": 173227694,
        "sender_full_name": "Jack Moffitt",
        "timestamp": 1565806352
    },
    {
        "content": "<blockquote>\n<p>but I am interested to know about details of the book that could've helped in the problem-solving</p>\n</blockquote>\n<p>One thing is that none of the examples run in the playground. They give approximately the same errors I was getting, which makes it seem like the book is out of date. Fixing that will help.</p>\n<p>I also think having some kind of Chapter 0 that addresses this transition period would be helpful. Here's what you need to try this out now, and here are the major libs involved and their current state. And keep that page as up to date as possible. Part of my problem is there is no foothold to start to build my knowledge base. I know only that a) std:<span aria-label=\"future\" class=\"emoji emoji-1f52e\" role=\"img\" title=\"future\">:future:</span>:Future is stable, async and .await will soon be stable (and are currently supported in nightly), and beyond that I have no idea which libraries will be needed/useful and the difference between the state right now and the desired end state.</p>\n<p>It appears I need to be using futures-preview, feature(async_await), and aside from toy examples, some runtime like the runtime crate or tokio.</p>",
        "id": 173228090,
        "sender_full_name": "Jack Moffitt",
        "timestamp": 1565806646
    },
    {
        "content": "<blockquote>\n<p>One thing is that none of the examples run in the playground. They give approximately the same errors I was getting, which makes it seem like the book is out of date. Fixing that will help.</p>\n</blockquote>\n<p>The book isn't out of date-- it seems like you weren't using the correct version of hte <code>futures-preview</code> crate</p>",
        "id": 173228242,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565806749
    },
    {
        "content": "<p>or weren't using <code>futures-preview</code> at all</p>",
        "id": 173228249,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565806756
    },
    {
        "content": "<p>the examples cannot be made to work on the playground because the playground does not include <code>futures-preview</code></p>",
        "id": 173228265,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565806770
    },
    {
        "content": "<p>I wasn't using it at all, which is part of hte problem. Where was I supposed to learn about this? I realize now I can get to the book's example code repo and see it there, but the book doesn't talk about this.</p>",
        "id": 173228297,
        "sender_full_name": "Jack Moffitt",
        "timestamp": 1565806794
    },
    {
        "content": "<p>in the very first example there is a sample of what your cargo.toml should look like: <a href=\"https://rust-lang.github.io/async-book/01_getting_started/05_http_server_example.html\" target=\"_blank\" title=\"https://rust-lang.github.io/async-book/01_getting_started/05_http_server_example.html\">https://rust-lang.github.io/async-book/01_getting_started/05_http_server_example.html</a></p>",
        "id": 173228379,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565806824
    },
    {
        "content": "<p>It also describes how to get the proper version of rustc using <code>rustup</code></p>",
        "id": 173228403,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565806854
    },
    {
        "content": "<p>Is there another way this could have been communicated more clearly?</p>",
        "id": 173228427,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565806872
    },
    {
        "content": "<p>(all the \"applied\" sections have similar Cargo.toml samples)</p>",
        "id": 173228714,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565807059
    },
    {
        "content": "<p>I gave up on the page before that one, that had the hello world example I couldn't get to work. <a href=\"https://rust-lang.github.io/async-book/01_getting_started/04_async_await_primer.html\" target=\"_blank\" title=\"https://rust-lang.github.io/async-book/01_getting_started/04_async_await_primer.html\">https://rust-lang.github.io/async-book/01_getting_started/04_async_await_primer.html</a></p>\n<p>I see there is a \"State of Asynchronous Rust\" page already there, but it is written as if I know what lots of these things are and does not mention futures-preview.</p>",
        "id": 173228717,
        "sender_full_name": "Jack Moffitt",
        "timestamp": 1565807064
    },
    {
        "content": "<p>Okay. Those were only intended as examples and not as runnable code, but it seems like that was confusing so perhaps that section should be amended to include a Cargo.toml as well</p>",
        "id": 173228791,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565807128
    },
    {
        "content": "<p>My suggestion is perhaps reordering that stuff a bit. Make a Chapter 0 which is \"The State of Asynchronous Rust\". Spurce that up a bit so it's more newbie friendly. Describe the major players, the desired end state (as it is understood right now), and the current state. Then show exactly what's needed to get the stuff from the book to work, that is necessary now but wouldn't necessarily be needed in the future.</p>\n<p>Can we turn off run buttons and such until those will work? Can we update playground to work with the ideal current state?</p>\n<p>Maybe we can make a special note on each page pointing back at chapter 0 saying \"Asynchronous Rust is in active development, and is not yet done. If you have any trouble with the examples here, please make sure you read or re-read  Chapter 0 which describes how to use async Rust during this transition period.\"</p>",
        "id": 173229207,
        "sender_full_name": "Jack Moffitt",
        "timestamp": 1565807420
    },
    {
        "content": "<p>There's an open issue about the run buttons. I don't have a way to control that that I know of, but it is worthy of investigation. I also don't have a way to control which crates appear in the playground, and I don't think it would be correct for the playground to start using futures 0.3 anyways until async/await is stable</p>",
        "id": 173229768,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565807770
    },
    {
        "content": "<p>once async/await staabilizes and futures-preview is released as futures 0.3, that problem will solve itself</p>",
        "id": 173229792,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565807792
    },
    {
        "content": "<p>If you think that could work, I can try drafting a PR. I'm happy to pitch in here.</p>",
        "id": 173229851,
        "sender_full_name": "Jack Moffitt",
        "timestamp": 1565807844
    },
    {
        "content": "<blockquote>\n<p>The State of Asynchronous Rust</p>\n</blockquote>\n<p>there already is a section under this name-- feel free to send PRs to add things to it if you think it's unclear</p>",
        "id": 173230148,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565808104
    },
    {
        "content": "<p>in general feel free to open PRs or issues for any difficulties you're experiencing or ideas you have</p>",
        "id": 173230219,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565808136
    },
    {
        "content": "<p>and I'll do my best to respond in a timely manner</p>",
        "id": 173230228,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565808144
    }
]