[
    {
        "content": "<p>Hey all, it's not quite meeting time yet but I can't make today's meeting time so figured I'd share my updates early. Which is to say: I'm still working on my talk, and haven't made any progress on the streams yet.</p>",
        "id": 172598992,
        "sender_full_name": "Yoshua Wuyts",
        "timestamp": 1565105215
    },
    {
        "content": "<p>I'll read the meeting notes back tomorrow. Hope y'all have a good week!</p>",
        "id": 172599020,
        "sender_full_name": "Yoshua Wuyts",
        "timestamp": 1565105236
    },
    {
        "content": "<p>Okay. I put up a PR for select/join here: <a href=\"https://github.com/rust-lang/async-book/pull/28\" target=\"_blank\" title=\"https://github.com/rust-lang/async-book/pull/28\">https://github.com/rust-lang/async-book/pull/28</a></p>",
        "id": 172604441,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565108839
    },
    {
        "content": "<p>Hi all! I'm a bit new here but I've been hanging around the ecosystems group. I'm interested in helping out, any sections that could use some help? I see there are a few issues but none seem super active. I'm also happy to help review :)</p>",
        "id": 172606177,
        "sender_full_name": "Lucio Franco",
        "timestamp": 1565110137
    },
    {
        "content": "<p>There are a lot of things to do, and they don't seem super active because there aren't a lot of people working on it, so your help would be super appreciated! :)</p>",
        "id": 172606236,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565110194
    },
    {
        "content": "<p>feel free to pick whichever remaining todo section you feel comfortable explaining and leave a comment on the issue (or open a new corresponding issue) saying you're planning to tackle it.</p>",
        "id": 172606315,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565110230
    },
    {
        "content": "<p>Cool, let me know what would be the most valuable. I see there are a bunch of sections later on that are still TODO like modeling request/response. Are these in scope? I have a lot of experience around the ecosystem and designing applications with futures etc I could take a stab at those sections? Unless there are higher priorities.</p>",
        "id": 172606526,
        "sender_full_name": "Lucio Franco",
        "timestamp": 1565110398
    },
    {
        "content": "<p>Filling out the sections on <code>AsyncRead</code> and <code>AsyncWrite</code> would probably be the most valuable at this point, IMO</p>",
        "id": 172606558,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565110436
    },
    {
        "content": "<p>cool, ill try and take a stab at it over the next week or so :) thanks</p>",
        "id": 172606683,
        "sender_full_name": "Lucio Franco",
        "timestamp": 1565110539
    },
    {
        "content": "<p>great! yeah of course</p>",
        "id": 172606692,
        "sender_full_name": "Taylor Cramer",
        "timestamp": 1565110547
    }
]