[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> you mentioned before you wanted polonius to basically compute all loans in scope for all origins, and I wondered about that, did we absolutely need all loans for a reason that I didn't know yet (I was wondering whether that would be needed for diagnostics for example). I was looking for ways to avoid materializing and propagating loans if possible, or at least delaying them or computing them lazily for as long as we could until we knew for sure that there was an error. (I do realize that right now propagating loans is <em>how</em> we detect errors, and would require an alternative way of doing so)</p>",
        "id": 205812148,
        "sender_full_name": "lqd",
        "timestamp": 1596470383
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116113\">@lqd</span> I don't recall expressing an opinion about this ...</p>",
        "id": 205813518,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1596471103
    },
    {
        "content": "<p>off the top of my head I can't see why we need to compute all loans in scope for all origins</p>",
        "id": 205813551,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1596471121
    },
    {
        "content": "<p>and if we <em>did</em> need it for diagnostics, which I don't think we do, I imagine we could compute it on demand</p>",
        "id": 205813616,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1596471145
    },
    {
        "content": "<p>I mean we currently eagerly compute all loans contained at every point in the cfg (with some possible filtering wrt \"all origins\") but couldn't see a reason that we absolutely had to and wanted to make sure I wasn't missing something :)</p>",
        "id": 205814179,
        "sender_full_name": "lqd",
        "timestamp": 1596471443
    },
    {
        "content": "<p>nope, I think I always expected us to use feedback to limit that</p>",
        "id": 205814209,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1596471461
    },
    {
        "content": "<p>nice, thank you :)</p>",
        "id": 205814287,
        "sender_full_name": "lqd",
        "timestamp": 1596471485
    }
]