[
    {
        "content": "<p>I can't remember if we formally decided on not having a meeting today (and I am guessing we aren't), but I'm going to have a meeting with myself anyway and report on what I have done during the week. Hope everyone are enjoying themselves at a) the conference or b) whatever else they are doing!</p>\n<p>I have:<br>\n- extended rustc-perf to run an extra check round with Polonius, analogous to how NLL benchmarks are run<br>\n- used this extended version of the benchmarks to extract relative runtime and memory usage measurements<br>\n- plotted the results, and done manual and k-means clustering to figure out the sorts of performance outliers (compared to <strong>NLL</strong>) we are looking at<br>\n- done the work to Polonius and sub-crates to integrate the necessary facts for liveness analysis<br>\n- produced a probably slightly to moderately rubbish implementation of the liveness analysis as described in <a href=\"https://github.com/rust-lang/polonius/issues/104\" target=\"_blank\" title=\"https://github.com/rust-lang/polonius/issues/104\">Polonius#104</a> (<a href=\"https://github.com/rust-lang/polonius/pull/105\" target=\"_blank\" title=\"https://github.com/rust-lang/polonius/pull/105\">PR</a>, concerns described in the PR)<br>\n- cleaned up a few Clippy errors (in separate commits) as I went by </p>\n<p>For the remainder of the \"week\" (which may or may not be aligned to the actual week) I will focus on preparing the paperwork for my master's project (I have still not formally registered for the project course and err am no longer formally a student at all, in fact), and, time permitting, on poking around rustc and seeing  if I can figure out what to do to extend the fact generation parts to accommodate the new liveness analysis on my own.</p>",
        "id": 161988721,
        "sender_full_name": "Amanda Stjerna",
        "timestamp": 1553804142
    },
    {
        "content": "<p>Great meeting. Can I use this opportunity to elect myself to something cool?</p>",
        "id": 161989271,
        "sender_full_name": "Amanda Stjerna",
        "timestamp": 1553804569
    }
]