[
    {
        "content": "<p>I need to catch up but I wanted to write down a thought I had. I think the names I like best are:</p>\n<ul>\n<li>origins =&gt; leases</li>\n<li>loans =&gt; lessors</li>\n</ul>\n<p>Lessor isn't perhaps <em>quite</em> right, since we want not only the <em>place</em> the data was borrowed from but also the <em>way</em> it was borrowed (<code>&amp;</code> vs <code>&amp;mut</code>), but it's awfully close, and I like the intuition it brings. i.e., when you do <code>&amp;x</code> you get back a reference with a lease of <code>{x}</code> (borrowed from \"x\")</p>",
        "id": 260671632,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1636385134
    },
    {
        "content": "<p>I believe that whoever invents a concept should also name it. While that doesn't always lead to the best outcomes—especially in fields where productivity is measured in theorems per academic year—that person is in the best position to come up with some coherent terminology that reflects their intuition. Go with your gut, and feel free to ignore the feedback below <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> .</p>\n<p>I find \"lease\" and \"lessor\" too similar and suspect I would confuse them. To me, those names suggest a one-to-many relationship between lessors and leases, when in Polonius it's the other way around.</p>\n<p>To be constructive, I half-jokingly proposed \"tranche\" in another thread because in finance it refers to a set of loans (usually mortgages). I think this is too clever, and we should find something in common usage. Did you consider \"loan\"/\"loan-set\" or \"lease\"/\"lease-set\"?  I think of loans and leases as basically the same thing (the first is when you rent capital, the second is when you rent something tangible), so I don't mind either way.</p>",
        "id": 261553069,
        "sender_full_name": "Dylan MacKenzie (ecstatic-morse)",
        "timestamp": 1637007445
    }
]