[
    {
        "content": "<p>So I'd like to setup a regular meeting time and I think we should talk about kind of figuring out concrete, actionable next steps. I'd also like to get some idea of who wants to be involved in this effort and how much time they have.</p>\n<p>I was telling <span class=\"user-mention\" data-user-id=\"116266\">@Santiago Pastorino</span> that I'm aiming to kind of \"dial back\" my own 'leadership role' when it comes to compiler working groups and focus primarily on Polonius, Traits, and meta + documentation sort of things, at least for now (for want of time, mostly).</p>",
        "id": 158927165,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1550616714
    },
    {
        "content": "<p>I think one obvious thing would be just running the existing <code>-Zpolonius</code> integration on some of the perf test cases that caused us trouble (e.g., html5ever?) for NLL. It'd be good to try and come up with a list of which those were</p>",
        "id": 158927266,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1550616787
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> remember me what does -Zpolonius does or maybe asked differently what's the current status of rustc and polonius integration that happens with -Zpolonius</p>",
        "id": 158927412,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1550616907
    },
    {
        "content": "<p>I don't remember exactly what things are implemented in Polonius and which ones doesn't</p>",
        "id": 158927435,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1550616939
    },
    {
        "content": "<p>Well, good question. Right now -Zpolonius will (I think) run:</p>\n<ul>\n<li>the MIR borrow check</li>\n<li><em>also</em> the polonius check</li>\n</ul>\n<p>We would therefore expect there to be overhead, I think it's doing twice as much work</p>",
        "id": 158927548,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1550617032
    },
    {
        "content": "<p>but what I'm interested in is seeing where we see like 10x perf spikes (or more)</p>",
        "id": 158927557,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1550617043
    },
    {
        "content": "<p>Let's spin off a topic on this actually</p>",
        "id": 158927560,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1550617052
    },
    {
        "content": "<p>I said so before, but just to put it on the record; I have roughly 20 weeks full time, under the assumption that I can work on things that can be squeezed into the format of a Master's project.</p>",
        "id": 158945134,
        "sender_full_name": "Amanda Stjerna",
        "timestamp": 1550636832
    }
]