[
    {
        "content": "<p>So I think we should do another sprint week -- which really I think means like 3 dedicated mornings? maybe 4? :) Or at least <em>I</em> would like to do that. Probably early to mid June.</p>",
        "id": 198206525,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1589984970
    },
    {
        "content": "<p>Maybe we can start planning a bit the dates and agenda?</p>",
        "id": 198206537,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1589984978
    },
    {
        "content": "<p>As usual I feel completely lost and don't remember where we were, but it'd be cool to line up some goals etc</p>",
        "id": 198206563,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1589984995
    },
    {
        "content": "<p>early to mid june sounds good to me</p>",
        "id": 198206737,
        "sender_full_name": "lqd",
        "timestamp": 1589985065
    },
    {
        "content": "<p>as for agenda, what I had in mind was:</p>\n<ul>\n<li>(go over some of the recent work I've done (which I have yet to open PRs for anyway))</li>\n<li>a bit of planning / design: I'd like to talk with you all about our plans, especially about some of the feature parity work we're doing, which might have an unavoidable cost. That's absolutely fine for a reference implementation, say, but maybe not for production. We're redoing some dataflow work, in a more general setting which cannot take advantage of the dataflow setting, i.e oversimplifying, there's no super easy way to take advantage of computing over a CFG rather than an arbitrary relation.</li>\n<li>talk about the \"Locations::All\" fix I had in mind and prototyped, and how it impacts our rules</li>\n<li>computing subset errors in the optimized variant (which I'd like to keep for now even if Niko probably wouldn't want to :)</li>\n<li>I walked through the valley of the shadow of death while looking at NLLs performance on the whole clap crate, so maybe talk about location-insensitivity, how I think we could do it outside of datafrog  since it's in my mind actually just a case of graph traversal here, etc (which I also have prototyped)</li>\n<li>(if, and it's a big if, I manage to actually <em>achieve</em> anything with them: maybe talk about the other ideas I had wrt polonius' model itself -- and if I don't you'll never hear about this again)</li>\n<li>maybe some design work for niko, about the equality variant :) check the couple rules I \"had\" to add to it, maybe we try to understand why one or two rustc tests failed with the variant, those kinds of things</li>\n<li>actually emit the move errors to validate our rules, I haven't been able to look at this yet so it'd be reassuring to do so</li>\n</ul>",
        "id": 198209577,
        "sender_full_name": "lqd",
        "timestamp": 1589986279
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116155\">@Jake Goulding</span> is that a good <span aria-label=\"astonished\" class=\"emoji emoji-1f632\" role=\"img\" title=\"astonished\">:astonished:</span> emoji or a bad <span aria-label=\"astonished\" class=\"emoji emoji-1f632\" role=\"img\" title=\"astonished\">:astonished:</span> emoji ? :)</p>",
        "id": 198211832,
        "sender_full_name": "lqd",
        "timestamp": 1589987197
    },
    {
        "content": "<p>It's me being a spoiled brat, really... I'm super excited to see Polonius happen, but I haven't seen any progress <em>here</em> so I figured that everyone was busy with other things. I'm happy to see that the work just wasn't being logged here (which I don't have any right to expect in the first place).</p>",
        "id": 198212403,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1589987453
    },
    {
        "content": "<p>ah sorry about that, I should have thought more about the people following the work here</p>",
        "id": 198213317,
        "sender_full_name": "lqd",
        "timestamp": 1589987772
    },
    {
        "content": "<p>Not at all. If the choice is between y'all making 2x progress vs 1x progress and 1x progress updates, I'm OK with the former.</p>",
        "id": 198214367,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1589988186
    },
    {
        "content": "<p>I guess I would be a good candidate for looking at emitting move errors, and documenting the new rules in the Book</p>",
        "id": 199022214,
        "sender_full_name": "Amanda Stjerna",
        "timestamp": 1590672591
    },
    {
        "content": "<p>(I'm still here, but I have done exactly nothing since my thesis, so it's exactly what it looks like)</p>",
        "id": 199022316,
        "sender_full_name": "Amanda Stjerna",
        "timestamp": 1590672622
    },
    {
        "content": "<p>Early June may work for me, but I also have vacation basically late June to early August</p>",
        "id": 199022435,
        "sender_full_name": "Amanda Stjerna",
        "timestamp": 1590672685
    },
    {
        "content": "<p>Early June is coming up</p>",
        "id": 199045564,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1590683168
    },
    {
        "content": "<p>(as I'll take vacation days off of work for this, the exact scheduling is open for me, to whenever y'all are available)</p>",
        "id": 199120784,
        "sender_full_name": "lqd",
        "timestamp": 1590736591
    }
]