[
    {
        "content": "<p>This is admittedly not a dev tools topic but starting here in the hopes someone can point me in the right direction because i'm not sure where to ask.</p>\n<p>I saw an email earlier that went out to leads which referenced a prior mail that I gather was sent to <code>all@rust-lang.org</code> (or something to that effect). However, I did not receive that other email and it reminded me of past occasions where emails were alluded to but which I also did not receive.</p>\n<p>So the question, is there indeed such an \"everyone\" DL, and if so does it really include everyone/am I not receiving some communications? I'm wondering if perhaps the team vs. working group distinction could be a factor as well given that rustfmt is a WG</p>",
        "id": 275831798,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1647622543
    },
    {
        "content": "<p>You are correct that <code>all</code> does not include working groups.</p>\n<p>It's not really clear to me why rustfmt and rustup are \"working groups\".  I always associate that with a group working towards some specific goal, not ongoing maintenance and development.</p>",
        "id": 275834699,
        "sender_full_name": "Eric Huss",
        "timestamp": 1647623718
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"120518\">Eric Huss</span> <a href=\"#narrow/stream/301329-t-devtools/topic/email.20distribution.20lists/near/275834699\">said</a>:</p>\n<blockquote>\n<p>You are correct that <code>all</code> does not include working groups.</p>\n<p>It's not really clear to me why rustfmt and rustup are \"working groups\".  I always associate that with a group working towards some specific goal, not ongoing maintenance and development.</p>\n</blockquote>\n<p>Ah, that helps thank you. I've always felt fuzzy on the differences between the teams vs wgs given some of the working groups that are out there (including rustup and rustfmt). If that's indeed an intended distinction, with wgs being more comparatively short term, with a finitely scoped set of objectives, then having rustup and rustfmt as wgs seems quite odd/wrong indeed</p>",
        "id": 275842773,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1647627346
    },
    {
        "content": "<p>The only definition I'm aware of is alluded to in <a href=\"https://rust-lang.github.io/rfcs/2856-project-groups.html\">RFC 2856</a>.  However, I don't think it is well defined.</p>\n<p>For example, an IETF working group is defined by:</p>\n<blockquote>\n<p>Working groups are typically created to address a specific problem or to produce one or more specific deliverables (a guideline, standards specification, etc.).  Working groups are generally expected to be short-lived in nature.  Upon completion of its goals and achievement of its objectives, the working group is terminated.</p>\n</blockquote>\n<p>The <a href=\"https://en.wikipedia.org/wiki/Working_group\">wiki definition</a> also alludes to it being goal-oriented and finite duration.</p>",
        "id": 275844151,
        "sender_full_name": "Eric Huss",
        "timestamp": 1647628053
    },
    {
        "content": "<p>ha yeah, i think rustfmt and rustup are quite a poor fit for that definition</p>",
        "id": 275844832,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1647628408
    },
    {
        "content": "<p>What IETF calls working groups we call project groups I believe.</p>",
        "id": 275846382,
        "sender_full_name": "bjorn3",
        "timestamp": 1647629180
    },
    {
        "content": "<p>regardless of terminology, something about the current state of affairs feels wrong to me, as folks on the rustup and rustfmt &lt;&lt;insert preferred term for group of people&gt;&gt; are not receiving communications they arguably should be, except in cases where individuals also happen to be a member of some other \"team\".</p>\n<p>i believe something should change, whether that means we need to convert working groups to teams, or somehow expand the list of who is included, or something else</p>",
        "id": 275854061,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1647633032
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"223910\">@Daniel Silverstone</span> <span class=\"user-mention\" data-user-id=\"132040\">@Manish Goregaokar</span> curious what your thoughts are on this</p>",
        "id": 275855243,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1647633634
    },
    {
        "content": "<p>I do think rustfmt and rustup should both just be part of devtools as subteams, alongside Cargo; I think that makes sense.</p>",
        "id": 275860978,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647636665
    },
    {
        "content": "<p>Given I have no idea what I may have missed, I'm not sure what to say.  I do receive <code>all@</code> mail though as well as <code>leads@</code> - are we talking about something else?</p>",
        "id": 275862893,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1647637677
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"223910\">@Daniel Silverstone</span> You are a member of the \"devtools\" team, that's how you get \"all\".</p>",
        "id": 275863491,
        "sender_full_name": "Eric Huss",
        "timestamp": 1647638016
    },
    {
        "content": "<p>Right. So <span class=\"user-mention\" data-user-id=\"223910\">@Daniel Silverstone</span> I think it's more a question of, do you think rustup folks should be recieving <code>all@</code> comms/how would you feel if you weren't receiving them? I'd guess <code>rbtcollins</code> is in a similar boat as me, seeing <code>leads@</code> but not any of the <code>all@</code> and <code>hi-rustin</code> isn't receiving anything (assuming neither of them are also members of other proper teams like you are w/devtools)</p>",
        "id": 275869702,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1647642082
    },
    {
        "content": "<p>I'd say 95% of what I receive via <code>all@</code> is spam, which isn't a terribly useful metric, but it's the truth.  It's hard to say whether I'd be sad not getting it because I appear to have received only six or seven emails via it which still remain in my archive since the start of 2020.</p>",
        "id": 275870751,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1647642871
    },
    {
        "content": "<p>If I were to express any opinion it'd be that <code>all@</code> is a bad alias name and we should drop it entirely.  If we have role/team-membership aliases only, then people would be able to work out who they want to email by those and send it to two or three addresses as appropriate.</p>",
        "id": 275870857,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1647642942
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"320317\">@Caleb Cartwright</span> <span class=\"user-mention\" data-user-id=\"223910\">@Daniel Silverstone</span> yeah i think y'all should be teams, that decision predates me and I don't think it makes sense anymore</p>",
        "id": 275871744,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1647643673
    },
    {
        "content": "<p>i gather there's really two aspects then, whether rustup &amp; rustfmt should be teams instead of wgs, and then what, if any impact, there is on a \"collective of maintainers\" having one classification vs another.</p>\n<p>sounds like an overwhelming consensus of yes on the former, while there's some differing perspectives on the latter. i think that's reasonable and not unexpected; in the case of missed comms, those that have received those communications may not be as concerned based on what they've received whereas those that haven't may be  in the uneasy \"don't know what i don't know\" posture.</p>\n<p>my only thought is that if certain parties, e.g. the Foundation, are attempting to communicate to the entire project then i want to make sure i receive those comms, even if that also comes paired with loads of spam. i've not really thought about it beyond devtools, but obviously there could be other wgs and or project groups that could be in a similar boat <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span></p>",
        "id": 276428711,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1648091939
    },
    {
        "content": "<p>yeah i think y'all def should be in those lists</p>",
        "id": 276488786,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1648134279
    }
]