[
    {
        "content": "<p>could be the wrong channel, however: Is there a possibility to use the -Z minimal-version flag for older Versions and not nightly only? I've found the versions in the Json format, but the dep-tree is way to much, to do it manually. Maybe using an old commit for the repo, where the Json data is not up to date? Are there any workarounds? (The compiled legacy software (firefox) just runs in a sandbox without internet connection)</p>",
        "id": 276331745,
        "sender_full_name": "Luca Mayr",
        "timestamp": 1648041808
    },
    {
        "content": "<p>Might be better for the t-cargo stream.</p>\n<p>I'm a little confused as to why you are needing <code>-Z minimal-versions</code> though (e.g. what the json format versions even are, what you are doing with the dep-tree manually, what an old commit has to do with it) to see how to best answer your question.</p>",
        "id": 276337776,
        "sender_full_name": "Ed Page",
        "timestamp": 1648044320
    },
    {
        "content": "<p>I need to compile several old commits of firefox. There are some requirements for the rust version as well as cbindgen. However, installing cbindgen with cargo (specific version of cbindgen with specific rust version set before) downloads the newest dependencies for this crate, which the old rustc cannot compile. On the <a href=\"http://crates.io\">crates.io</a> repo, there are json formatted minimal requirements for each version of the package of the dependency tree, which are very likely compileable.<br>\nThis is totally against the philisophy of rust, I know, but there has to be some possibility to compile older code that has a dep-tree &gt; 1</p>",
        "id": 276344344,
        "sender_full_name": "Luca Mayr",
        "timestamp": 1648046981
    },
    {
        "content": "<p>You can use <code>cargo install cbindgen --version &lt;some version&gt;</code> to install a specific cbindgen version.</p>",
        "id": 276344669,
        "sender_full_name": "bjorn3",
        "timestamp": 1648047116
    },
    {
        "content": "<p>The problem isn't cbindgen itself but its dependencies.</p>",
        "id": 276344779,
        "sender_full_name": "Ed Page",
        "timestamp": 1648047145
    },
    {
        "content": "<p>Passing <code>--locked</code> should make it respect the <code>Cargo.lock</code> of cbindgen if it has one.</p>",
        "id": 276344986,
        "sender_full_name": "bjorn3",
        "timestamp": 1648047240
    },
    {
        "content": "<p>Cargo started uploading them to <a href=\"http://crates.io\">crates.io</a> in rustc 1.37.</p>",
        "id": 276345119,
        "sender_full_name": "bjorn3",
        "timestamp": 1648047278
    },
    {
        "content": "<p>If you need an older version, cbindgen has the Cargo.lock in its repo, so you could install from that.</p>",
        "id": 276345240,
        "sender_full_name": "Ed Page",
        "timestamp": 1648047319
    },
    {
        "content": "<p>It seems, even older cargo versions offer --locked. When adding --locked to the cargo install --version x.y.z --locked, it should use the Cargo lock file right? There is one such file in the repo, but is ignored. However, many thanks for the help, was about to write some service on my own <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 276350793,
        "sender_full_name": "Luca Mayr",
        "timestamp": 1648049415
    }
]