[
    {
        "content": "<p>Hi lang team! The 2021 annual survey is almost ready: <a href=\"https://github.com/rust-lang/surveys/blob/main/surveys/2021-annual-survey/questions.md\">https://github.com/rust-lang/surveys/blob/main/surveys/2021-annual-survey/questions.md</a> This year we have changed things a lot more from previous years than has been done in the past, so we'd really like people from the teams to give some feedback. Please take a look and either file issues or leave comments here. Further, if anyone from the lang team could attend a video meeting with Ryan and I in the next week or so, that would be very useful. Please let me know if you're able to do that.</p>",
        "id": 257660546,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1634285082
    },
    {
        "content": "<p><span class=\"user-group-mention\" data-user-group-id=\"1172\">@WG-async-foundations</span>  - I think some async folk were interested in the survey, so we'd be particularly keen to hear from you!</p>",
        "id": 257660874,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1634285278
    },
    {
        "content": "<p>I think for async it'd be interesting to understand quantitatively what people are using async for and how good they think it is for each use case. This can use the existing \"technology domains\" question, but as the question notes it can be ambiguous how to answer</p>",
        "id": 257723409,
        "sender_full_name": "tmandry",
        "timestamp": 1634314335
    },
    {
        "content": "<p>It might be useful to break that question into two.. what kind of machine does your application run on (server/pc/mobile/IoT or smart home/embedded) and what kind of \"UI\" does it have (web/native app/cli/...)</p>",
        "id": 257723701,
        "sender_full_name": "tmandry",
        "timestamp": 1634314469
    },
    {
        "content": "<p>hello <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span>  i hope it's not too late for some comments from a non-lang-team person</p>\n<p>(firstly:  the survey looks quite good already, nice job)</p>",
        "id": 262664512,
        "sender_full_name": "Andrew Chin (eminence)",
        "timestamp": 1637812471
    },
    {
        "content": "<p>On <code>Please indicate how vital to your workflow each of the following tools are when programming with Rust</code> could there be an \"other\" field?  I'm thinking that maybe someone might have essential tool in their workflow that's not in the prepopulated list   (things like cargo-edit, cargo-expand, cargo-outdated, etc come to mind)</p>",
        "id": 262664535,
        "sender_full_name": "Andrew Chin (eminence)",
        "timestamp": 1637812537
    },
    {
        "content": "<p>The <code>To what extent is Rust currently being used by your company?</code> and <code>Are you using Rust at work?</code> questions seem quite similar.  This isn't a problem per-se, though as I was reading through the questions, when I came upon the second one, I thought to myself \"Didn't I already answer that?\"</p>",
        "id": 262664619,
        "sender_full_name": "Andrew Chin (eminence)",
        "timestamp": 1637812657
    },
    {
        "content": "<p>On <code>What about your usage of Rust has been challenging?</code>  maybe it would be worthwhile adding \"at work\" somewhere in the question (just like the previous questions)</p>",
        "id": 262664680,
        "sender_full_name": "Andrew Chin (eminence)",
        "timestamp": 1637812736
    },
    {
        "content": "<p>On <code>Which categories best describes the tech domain(s) you currently write or design software in?</code>, I think the question is soliciting answers covering all programming languages, not just rust.  Maybe a clarifying note about this could be added.</p>",
        "id": 262665145,
        "sender_full_name": "Andrew Chin (eminence)",
        "timestamp": 1637813284
    },
    {
        "content": "<p>On the topic of async, there's so many things we might want to know :)   In addition to the above suggestions from tmandry, I'm also wondering about things like \"How comfortable do you feel with async rust\" or \"How productive do you feel with async rust\"</p>",
        "id": 262665701,
        "sender_full_name": "Andrew Chin (eminence)",
        "timestamp": 1637814233
    },
    {
        "content": "<p>Thanks for commenting! There's some interesting stuff there which would be good to ask. Unfortunately the survey has been translated already and is ready for publication (we would have done so already, but have delayed due to the mod team stuff and thanksgiving holiday in the US). I'll file these as issues so that they can be taken into account next year.</p>",
        "id": 262689849,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1637836610
    },
    {
        "content": "<p>my fault for being 6 weeks late to your call for feedback <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span>  i look forward to filling out the survey!</p>",
        "id": 262717839,
        "sender_full_name": "Andrew Chin (eminence)",
        "timestamp": 1637853543
    },
    {
        "content": "<p>Feedback from one user (not me) you are unlikely to see submitted:</p>\n<blockquote>\n<p>it's [expletive] too long<br>\nI give up<br>\nCompleting this survey should take about 10–30 minutes<br>\ntoo long</p>\n</blockquote>",
        "id": 264208617,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1638992281
    },
    {
        "content": "<p>Another user:</p>\n<blockquote>\n<p>IMO [the question about the playground is] biased: it's not an essential tool for experienced users because they can find other solutions for experimenting but it's an essential tool for enrolling, for new users to try things before they have a productive env, for sharing, for helping users on SO, etc. I think Rust can't not have a good and efficient playground even if I don't use it much myself</p>\n</blockquote>\n<p>meta commentary: that user's first language is not English, so I'm not sure how strong to read \"bias\" literally</p>",
        "id": 264208934,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1638992420
    },
    {
        "content": "<p>This topic was moved by <span class=\"user-mention silent\" data-user-id=\"239881\">Josh Triplett</span> to <a class=\"stream-topic\" data-stream-id=\"294169\" href=\"/#narrow/stream/294169-t-community.2Frust-survey-2021/topic/2021.20survey.20feedback\">#t-community/rust-survey-2021 &gt; 2021 survey feedback</a></p>",
        "id": 264251665,
        "sender_full_name": "Notification Bot",
        "timestamp": 1639019670
    }
]