[
    {
        "content": "<p>so right now if you pass an extern to rustc with a global alloc or a panic handler or #[no_mangle] or #[used] or whatever, it doesn't get actually get linked unless you use something from it or explicitly put <code>extern crate foo</code> in your code. this behaviour seems weird to me, but maybe it is intended? i couldn't find anything explicitly documenting it. if it isn't intended i'd be interested in making it so that the externs are always linked.</p>",
        "id": 221723968,
        "sender_full_name": "devsnek",
        "timestamp": 1609896039
    },
    {
        "content": "<p>I think for the most part is intended. There is a brief oblique mention of the behavior in <a href=\"https://doc.rust-lang.org/reference/items/extern-crates.html#underscore-imports\">https://doc.rust-lang.org/reference/items/extern-crates.html#underscore-imports</a> and <a href=\"https://doc.rust-lang.org/rustc/lints/listing/allowed-by-default.html#unused-extern-crates\">https://doc.rust-lang.org/rustc/lints/listing/allowed-by-default.html#unused-extern-crates</a> (the fact that <code>extern crate foo as _</code> exists solely to force linking implies extern crates are otherwise not linked if unused). Unfortunately linking is a bit of a black art and not well documented.   One example is in Cargo, you can have multiple targets, but not all of them will use every dependency, so those would be sort of wasted work to link.  It was maybe clearer in the past when <code>extern crate</code> was required, but with 2018 edition is maybe less clear.</p>",
        "id": 221725861,
        "sender_full_name": "Eric Huss",
        "timestamp": 1609898341
    },
    {
        "content": "<p>I found the bit about <code>as _</code>, the thing here is that you don't need it. rust thinks they are used if you put extern crate without that, but doesn't link them unless you do.</p>",
        "id": 221728112,
        "sender_full_name": "devsnek",
        "timestamp": 1609901166
    },
    {
        "content": "<p>in any case if the idea is that you need to explicitly do something in the source text to make a crate be considered for linking, it is more or less working as intended then.</p>",
        "id": 221728145,
        "sender_full_name": "devsnek",
        "timestamp": 1609901256
    },
    {
        "content": "<p>Yea, <code>as _</code> isn't really necessary since <code>unused_extern_crates</code> lint is allow-by-default.  I think there was some intent to turn it into a warning, but it was reverted due to issues with the lint.</p>",
        "id": 221728665,
        "sender_full_name": "Eric Huss",
        "timestamp": 1609901982
    }
]