[
    {
        "content": "<p>I've been working on the <code>impl Trait</code> explainer: </p>\n<p><a href=\"https://rust-lang.github.io/impl-trait-initiative/explainer.html\">https://rust-lang.github.io/impl-trait-initiative/explainer.html</a></p>\n<p>It includes a certain amount of context that is not stabilized nor even RFC'd, but I've tried to be explicit about that. I'll be updating the evaluation doc with some of the details and considerations for those items. It definitely needs work (PRs welcome!) but I believe it contains the right <em>table of contents</em>. I am aiming for a comprehensive introduction to \"all things impl Trait\". <span class=\"user-mention\" data-user-id=\"124288\">@oli</span> you may be interested in the (rather brief) description of the new inference algorithm we were talking about.</p>\n<p>I'd love it if people could look it over and give me their thoughts, especially if there are things that ought to be covered!</p>",
        "id": 256660029,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1633645847
    },
    {
        "content": "<p>I would love to see a more detailed rationale regarding the \"output impl trait can't capture lifetimes in scope\" (unless they appear in the bounds) limitation: why exactly couldn't that limitation be lifted? (note that I am talking about lifetimes being <em>capturable</em> but not necessarily <em>captured</em>, exactly like it happens for type parameters: that the underlying type alias impl be generic over all the lifetime parameters in scope)</p>",
        "id": 256731476,
        "sender_full_name": "Daniel Henry-Mantilla",
        "timestamp": 1633695872
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"232018\">@Daniel Henry-Mantilla</span> I'll extend the site with the rationale</p>",
        "id": 256743718,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1633701595
    },
    {
        "content": "<p>it was discussed in the relevant RFC</p>",
        "id": 256743805,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1633701610
    },
    {
        "content": "<p>but let me write it on the site, rather than here, and point you at that :)</p>",
        "id": 256743842,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1633701619
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 256745912,
        "sender_full_name": "Daniel Henry-Mantilla",
        "timestamp": 1633702479
    }
]