[
    {
        "content": "<p>I've opened <a href=\"https://github.com/rust-lang/lang-team/issues/18\">https://github.com/rust-lang/lang-team/issues/18</a> to discuss a possible design meeting topic around const evaluation. This is using the template for meeting proposals that I added, and I think this is the process we should be using to evaluate and discuss what to discuss. =) </p>\n<p>I'm somewhat curious whether folks think Zulip or Github would be better: I've started to re-evaluate my push to move things like this to Zulip, but I'm open to feedback. If we do want to have it on Zulip, I should badger <span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> to connect the compiler-team machinery to create topics automatically (and we should make a dedicated <code>#t-lang/meetings</code> stream).</p>",
        "id": 200427727,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591801149
    },
    {
        "content": "<p>Also I saw a number of problems with the template as written =)</p>",
        "id": 200427776,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591801166
    },
    {
        "content": "<p>Should be as easy as copying and slightly adjusting the triagebot.toml; I can take a look later I think.</p>",
        "id": 200427901,
        "sender_full_name": "simulacrum",
        "timestamp": 1591801204
    },
    {
        "content": "<p>I'm a big fan of having it on Zulip, and I would love to see that automation.</p>",
        "id": 200428284,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1591801356
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> Maybe we can extract that functionnality from the prioritize command and generalize it a bit?</p>",
        "id": 200428598,
        "sender_full_name": "Léo Lanteri Thauvin",
        "timestamp": 1591801488
    },
    {
        "content": "<p>We already have the functionality, just needs to be configured for this repo</p>",
        "id": 200428690,
        "sender_full_name": "simulacrum",
        "timestamp": 1591801527
    },
    {
        "content": "<p>Oh, sorry, I thought you meant the <code>I-prioritize</code> shenanigans, but you are talking about MCPs, right? Sorry for the noise</p>",
        "id": 200428903,
        "sender_full_name": "Léo Lanteri Thauvin",
        "timestamp": 1591801629
    }
]