[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"239881\">Josh Triplett</span> <a href=\"#narrow/stream/268952-edition-2021/topic/reserved.20prefixes/near/240497399\">said</a>:</p>\n<blockquote>\n<p>As well as making maintenance scale; a full crater run may not be an option forever.</p>\n</blockquote>\n<p>This comment reminded me of something that came to mind reading crater docs the other week.</p>\n<p>We often run crater runs for changes that we're allowed to make, just out of caution.  Given that crater can run in a \"top-N\" mode, I wonder if it would make sense (for sustainability and just keeping the queue shorter) to have some policy like \"if we're just looking at the impact of a new warning lint or similar, we'll only run on the top 10,000 crates\".</p>\n<p>That seems especially fine for things like lints where we can always tune things later, should feedback come in about some code pattern that wasn't considered.</p>",
        "id": 240500798,
        "sender_full_name": "scottmcm",
        "timestamp": 1622135660
    },
    {
        "content": "<p>Interesting. That seems reasonable, assuming whatever mode we use accounts for popular dependencies too. (Which it almost certainly does through download counts.)</p>",
        "id": 240509954,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1622139777
    },
    {
        "content": "<p>my fear for top-N is that I expect that biases toward highly-maintained idiomatic code, missing the fringes of weird stuff that people may write</p>",
        "id": 240518705,
        "sender_full_name": "cuviper",
        "timestamp": 1622143635
    },
    {
        "content": "<p>we certainly don't want to regress top crates, but it's just not as interesting</p>",
        "id": 240518762,
        "sender_full_name": "cuviper",
        "timestamp": 1622143673
    },
    {
        "content": "<p>Perhaps we can have a sampling mechanism that's broader: top N crates, some sample of the rest, plus anything that's ever regressed before in any other crater run.</p>",
        "id": 240526416,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1622147168
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"138448\">cuviper</span> <a href=\"#narrow/stream/213817-t-lang/topic/Officially-minor.20changes.20and.20crater/near/240518705\">said</a>:</p>\n<blockquote>\n<p>my fear for top-N is that I expect that biases toward highly-maintained idiomatic code, missing the fringes of weird stuff that people may write</p>\n</blockquote>\n<p>I think that might be ok, though, for things we're allowed to affect, especially when it's something we can roll back later, like lints.  I'm just thinking of things like \"I don't really care that we added a bunch of warnings to Alex's repo of Advent of Code solutions from 2018\".</p>\n<p>Certainly for something like \"can we make <code>k#foo</code> a hard error?\" we'd need to look at everything still.</p>",
        "id": 240544653,
        "sender_full_name": "scottmcm",
        "timestamp": 1622158173
    },
    {
        "content": "<p>Yeah, I think that's a valuable distinction. \"sample the ecosystem to see if this would be invasively noisy and if we should fix a few popular crates first\" is different than \"exhaustively test the ecosystem to see if this soundness fix breaks things\".</p>",
        "id": 240544903,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1622158346
    }
]