[
    {
        "content": "<p>Hey <span class=\"user-group-mention\" data-user-group-id=\"1977\">@T-lang</span>, so I've been thinking about this idea of stating the \"values of Rust\" or \"design principles of Rust\" more explicitly, so that we can use them to help us think about design questions.</p>\n<p>I thought a good place to start would be brainstorming.</p>\n<p>To that end, I've created a <a href=\"https://paper.dropbox.com/doc/Values-of-Rust--AyLr~TNTDPn78n7bhfPPYLeRAg-pXv14DptpYiwCxPq1PSnS\" title=\"https://paper.dropbox.com/doc/Values-of-Rust--AyLr~TNTDPn78n7bhfPPYLeRAg-pXv14DptpYiwCxPq1PSnS\">Dropbox Paper</a> and I'm going to start dropping some notes in there from time to time. I don't know if this will turn out to be productive or not, but I thought it might be interesting at least. =)</p>",
        "id": 194227635,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1586984818
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> do you want to keep that lang-only? :)</p>",
        "id": 194228395,
        "sender_full_name": "simulacrum",
        "timestamp": 1586985242
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> </p>\n<blockquote>\n<p>it should not be possible to have undefined behavior without the unsafe keyword.</p>\n</blockquote>\n<p>Is it \"undefined behavior\" you want to flag here? That statement is <em>true</em>, but it seems somewhat separate from the primary things unsafe exists to address.</p>",
        "id": 194229359,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1586985778
    },
    {
        "content": "<p>I feel like that's related to what unsafe means, but not directly what unsafe means.</p>",
        "id": 194229413,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1586985811
    },
    {
        "content": "<p>I added a subsection under \"Portability\" regarding the ability to use non-portable features of a platform (but the desire that doing so requires intent rather than accident).</p>",
        "id": 194230793,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1586986494
    },
    {
        "content": "<p>Safe in rust usually just means memory safe but that's only of value _because of_ the UB when you break memory safety</p>",
        "id": 194264745,
        "sender_full_name": "Lokathor",
        "timestamp": 1587021476
    },
    {
        "content": "<p>UB is the real foe</p>",
        "id": 194264769,
        "sender_full_name": "Lokathor",
        "timestamp": 1587021482
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116122\">simulacrum</span> <a href=\"#narrow/stream/213817-t-lang/topic/values.20of.20Rust/near/194228395\" title=\"#narrow/stream/213817-t-lang/topic/values.20of.20Rust/near/194228395\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"116009\">nikomatsakis</span> do you want to keep that lang-only? :)</p>\n</blockquote>\n<p>not necessarily</p>",
        "id": 194317681,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1587049366
    },
    {
        "content": "<p>I was expecting folks to add things</p>",
        "id": 194317748,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1587049398
    },
    {
        "content": "<p>I just didn't want it to like show up on reddit or something</p>",
        "id": 194317768,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1587049404
    },
    {
        "content": "<p>I would add two other major things:</p>\n<ul>\n<li>Awesome tooling</li>\n<li>Awesome community</li>\n</ul>\n<p>Also, under performance: fearless concurrency<br>\nAnd under maintainability: stability/backwards-compatibility guarantees (without stagnation)</p>",
        "id": 194323458,
        "sender_full_name": "mark-i-m",
        "timestamp": 1587051362
    },
    {
        "content": "<p>Unfortunately, outside of our community, we have a reputation of being an extremely toxic community</p>",
        "id": 194357250,
        "sender_full_name": "Lokathor",
        "timestamp": 1587066238
    },
    {
        "content": "<p>I've heard from multiple people in multiple places that they don't even want to learn Rust the language, regardless of the merits as a language, because of the Rust community.</p>",
        "id": 194357481,
        "sender_full_name": "Lokathor",
        "timestamp": 1587066289
    },
    {
        "content": "<p>Could you elaborate a bit on the flavor of \"toxic\" that the community is perceived as? Because that's new to me.</p>",
        "id": 194358776,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587066976
    },
    {
        "content": "<p>Is this an issue of the loud RIIR/RESF crowd being perceived as part of the community?</p>",
        "id": 194358821,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587066998
    },
    {
        "content": "<p>Yes exactly that, and the, uh, \"actix event\" <em>really</em> put a pin on it.</p>",
        "id": 194358859,
        "sender_full_name": "Lokathor",
        "timestamp": 1587067020
    },
    {
        "content": "<p>Gaaah.</p>",
        "id": 194358894,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587067042
    },
    {
        "content": "<p>I find myself wondering if there'd be value in putting out a statement from the lang and core teams basically saying that the whole RESF joke is not something that we appreciate and is doing more harm than good, and we'd appreciate people not doing it?</p>",
        "id": 194359017,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587067095
    },
    {
        "content": "<p>It might not <em>stop</em> everyone from doing it, but it would at least say \"this isn't welcome here\".</p>",
        "id": 194359057,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587067121
    },
    {
        "content": "<p>I think that, \"No, that wouldn't help at all, the kind of people who do this aren't listening to you to begin with\", but also \"Software is like a bridge or a house, and if you build an unsafe thing <em>someone</em> has to tell people to not walk on that bridge or live in that house because it's dangerous; so I somewhat see their point\" and also \"the internet has to learn to not dog-pile on situations (which of course it won't)\".</p>",
        "id": 194359326,
        "sender_full_name": "Lokathor",
        "timestamp": 1587067255
    },
    {
        "content": "<p>So, regarding the first of those three points, the message wouldn't be primarily for the people who do this. It would be for the people affected by people who do this.</p>",
        "id": 194359657,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587067412
    },
    {
        "content": "<p>Saying \"this is neither appreciated nor welcome in our community\" has some value, at least, in setting an example and helping people know \"any sufficiently popular thing will have its trolls\" versus \"the trolls are part of the community\".</p>",
        "id": 194359862,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587067480
    },
    {
        "content": "<p>I don't think that it'd hurt.</p>",
        "id": 194359966,
        "sender_full_name": "Lokathor",
        "timestamp": 1587067534
    },
    {
        "content": "<p>I would be on board with such a statement; I might want to go further and as part of this endeavor try to put it up as more than \"just a blog post\" but e.g. a values page similar to CoC (and perhaps even enforced, to some extent).</p>",
        "id": 194360109,
        "sender_full_name": "simulacrum",
        "timestamp": 1587067581
    },
    {
        "content": "<p>I think that one way to help things long term would be if there was a <em>blessed</em> team of people who would have crate soundness issues reported to <em>them</em>, then they'd actually raise it with individual crate maintainers, and thus communication with actual crate maintainers would go through a very limited number of people who are selected for being able to stay diplomatic as much as possible.</p>",
        "id": 194360173,
        "sender_full_name": "Lokathor",
        "timestamp": 1587067617
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224471\">@Lokathor</span> Do you happen to know if the set of people currently working on the secure code working group and the safety-dance project are such people?</p>",
        "id": 194360291,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587067669
    },
    {
        "content": "<p>With all due respect to the people involved, I happen to know that they're not really, because, well, that's how this happened in the first place.</p>",
        "id": 194360397,
        "sender_full_name": "Lokathor",
        "timestamp": 1587067710
    },
    {
        "content": "<p>Bugs need to be fixed, but there's probably a reasonable way to fix issues silently and then announce a fix after the fact, instead of opening a github issue that everyone can go to and jump on. At least for most bugs.</p>\n<p>and sure, if the bug lingers then open an issue and let it be known that there's a bug that can't be fixed right away and so on,</p>",
        "id": 194360572,
        "sender_full_name": "Lokathor",
        "timestamp": 1587067799
    },
    {
        "content": "<p>but at \"reddit speeds\" things get toxic</p>",
        "id": 194360670,
        "sender_full_name": "Lokathor",
        "timestamp": 1587067839
    },
    {
        "content": "<p>I was just looking at their repo, and...<a href=\"https://twitter.com/rustsecurecode/header_photo\" title=\"https://twitter.com/rustsecurecode/header_photo\">ugh</a>.</p>",
        "id": 194360771,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587067895
    },
    {
        "content": "<p>Yeah, you're right.</p>",
        "id": 194360853,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587067924
    },
    {
        "content": "<p>I know the Ring dev specifically has a declared and firm \"only disclose publicly on the github issue tracker\" policy, i bet most people would like to have private notice first though.</p>",
        "id": 194360952,
        "sender_full_name": "Lokathor",
        "timestamp": 1587067976
    },
    {
        "content": "<p>I've also been thinking about writing a personal post about this topic. There have been multiple incidents recently that I've found quite troubling.</p>",
        "id": 194361895,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1587068430
    },
    {
        "content": "<blockquote>\n<p>Bugs need to be fixed, but there's probably a reasonable way to fix issues silently and then announce a fix after the fact, instead of opening a github issue that everyone can go to and jump on. At least for most bugs.</p>\n</blockquote>\n<p>I am very surprised by this. IMO that's exactly what github issues are for -- reporting bugs. maybe with the exception of security vulnerabilities (re: responsible disclosure), but that does not seem to be the concern here. notably responsible disclosure is about protecting users of the software from exploits, not protecting software authors from (fair or unfair) criticism.<br>\nI don't feel like \"a bug was properly and respectfully reported on github\" is part of the failure chain that lead to the actix \"event\".</p>",
        "id": 194368852,
        "sender_full_name": "RalfJ",
        "timestamp": 1587071998
    },
    {
        "content": "<p>I wonder about that myself. The piling on and drive-bys shouldn't have happened, but was the filing of the issue in the first place a primary problem?</p>",
        "id": 194368998,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587072076
    },
    {
        "content": "<p><em>Just</em> filing the issue, wasn't a problem, no. However, as soon as that issue if filed it quickly got put many places and the discussion between two or three people became watched by many many people and it all spiraled.</p>",
        "id": 194369222,
        "sender_full_name": "Lokathor",
        "timestamp": 1587072197
    },
    {
        "content": "<blockquote>\n<p>Do you happen to know if the set of people currently working on the secure code working group and the safety-dance project are such people?</p>\n</blockquote>\n<p>That's a no from me as well. It's mostly me who handles the organization of safety-dance, and I'm also the person who has set off the latest Actix incident. I am trying to improve, but I don't quite trust myself to do dramatically better quite yet.</p>",
        "id": 194371067,
        "sender_full_name": "Shnatsel",
        "timestamp": 1587073315
    },
    {
        "content": "<p>Plus reputation is also a factor. The last thing I want a recepient of a message about soundness issues to think is \"Oh no, it's from the guy who destroyed Actix\".</p>",
        "id": 194371352,
        "sender_full_name": "Shnatsel",
        "timestamp": 1587073495
    },
    {
        "content": "<p>FWIW I am trying to separate my views (like the HTTP clients article) from WG activities (such as safety-dance) and generally not associate my name with the WG. It seems to be working well so far.</p>",
        "id": 194371873,
        "sender_full_name": "Shnatsel",
        "timestamp": 1587073812
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"127617\">@Shnatsel</span> Self-awareness is a very admirable trait, especially when combined with a desire for improvement. :)</p>",
        "id": 194373287,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587074648
    },
    {
        "content": "<p>Could I ask you to please pick a different Twitter banner? :)</p>",
        "id": 194373313,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587074670
    },
    {
        "content": "<p>Something less \"you're not smart enough to use unsafe\" and more safety-related?</p>",
        "id": 194373384,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587074714
    },
    {
        "content": "<p>Right. I don't use Twitter so I wasn't even aware of that banner. I'll talk to the people involved to put something less divisive in there</p>",
        "id": 194373412,
        "sender_full_name": "Shnatsel",
        "timestamp": 1587074737
    },
    {
        "content": "<p>Thank you!</p>",
        "id": 194373707,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587074894
    },
    {
        "content": "<p>I've messaged the relevant people just now. Thanks for bringing this up!</p>",
        "id": 194373749,
        "sender_full_name": "Shnatsel",
        "timestamp": 1587074919
    },
    {
        "content": "<p>FWIW, positioning aside, I appreciate the work that safety-dance is doing.</p>",
        "id": 194373979,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587075045
    },
    {
        "content": "<p>It makes me happy that you're finding cases where programs can get what they need without <code>unsafe</code>, and in particular when you take those learnings and bring them to the language or libraries.</p>",
        "id": 194374039,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587075070
    },
    {
        "content": "<p>We need to organize the identified issues better, by the way. There is a bunch of quite specific things that people are missing safe abstractions for and have to resort to hand-rolled <code>unsafe</code> that could be done once and for all, but that list is currently not published anywhere, or even written down. <br>\nWhile we're at it, any tips on organizing that? I was considering starting a repo under Secure Code WG and put those in the issue tracker, but I'm not sure it's a good path because that's quite removed from the places people would normally read. OTOH rust-lang/rust has so many issues that these ones would just get drowned.</p>",
        "id": 194374373,
        "sender_full_name": "Shnatsel",
        "timestamp": 1587075266
    },
    {
        "content": "<p>You might start by tagging issues in the existing secure code WG with a \"potential-pattern\" tag or something like that.</p>",
        "id": 194374458,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587075330
    },
    {
        "content": "<p>And then opening issues tagged as \"pattern-proposal\".</p>",
        "id": 194374477,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587075345
    },
    {
        "content": "<p>You could brainstorm them, try to come up with an implementation or specification of the pattern in practice, and then bring <em>that</em> to internals as a pre-RFC.</p>",
        "id": 194374567,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587075378
    },
    {
        "content": "<p>The Twitter banner is removed</p>",
        "id": 194379315,
        "sender_full_name": "Shnatsel",
        "timestamp": 1587078967
    },
    {
        "content": "<p>Hmm... well, I'm late to the game, but thanks for bringing that up <span class=\"user-mention\" data-user-id=\"224471\">@Lokathor</span> ... I'm not on twitter or reddit, so I was unaware that anything happened at all until I saw Steve's blog post, and even then I didn't realize how big it was...</p>",
        "id": 194459819,
        "sender_full_name": "mark-i-m",
        "timestamp": 1587138108
    },
    {
        "content": "<p>That said, regardless of whether we do a good job at it or not, I still think \"having an awesome community\" is a value of rust -- that is, it's something we definitively work for, right?</p>",
        "id": 194459977,
        "sender_full_name": "mark-i-m",
        "timestamp": 1587138171
    },
    {
        "content": "<p>this topic seems to be about principles that help guide Rust design, so \"awesome community\" seems unrelated</p>",
        "id": 194469972,
        "sender_full_name": "Tshepang Lekhonkhobe",
        "timestamp": 1587142709
    },
    {
        "content": "<p>It's not often something that <em>directly</em> informs language design, but we do think about the community and ecosystem impact of language changes. For instance, I know of at least one feature we're thinking about where we're talking about whether that feature would lead to a specific kind of strife between members of the community (making a specific thing opt-in per crate, which could generate a large number of \"please enable this in your crate so I can use it when using your crate\" messages).</p>",
        "id": 194470471,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587142916
    },
    {
        "content": "<p>The compiler once allowed code accepted by ast-borrowck that got rejected by mir-borrowck, with just a warning, to give people time to fix their code. Would that be another good example?</p>",
        "id": 194471340,
        "sender_full_name": "Tshepang Lekhonkhobe",
        "timestamp": 1587143286
    },
    {
        "content": "<p>crater and perf runs too, I suppose</p>",
        "id": 194471507,
        "sender_full_name": "Tshepang Lekhonkhobe",
        "timestamp": 1587143375
    },
    {
        "content": "<p>I mean, at the end of the day everything we do is trying to make things better for the Rust community, so I wouldn't want to overstretch that as a value, but I do think it's worth recording and keeping in mind.</p>",
        "id": 194471780,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1587143488
    },
    {
        "content": "<p>I think I like the \"[language] design principles\" phrasing for this better -- I'm most excited for this as a starting point for \"why do we <code>reviewed</code>/<code>concern</code> something?\".  Broader values are also a valuable conversation, but are a much bigger thing than a t-lang stream.</p>",
        "id": 194500474,
        "sender_full_name": "scottmcm",
        "timestamp": 1587157809
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"125270\">@scottmcm</span> I like that too</p>",
        "id": 194538548,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1587207462
    },
    {
        "content": "<p>one other thing. I thnk this document is in danger of being \"all the things\" -- i.e., rust language tries to be everything. Of course, that's true, but it's good for us to put some hard thinking also into the places where we <em>fail</em> (or choose not to) uphold a given principle, and why.</p>",
        "id": 194538836,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1587207886
    },
    {
        "content": "<p>As an example, I was thinking about \"forwards compatibility\" or \"resilience\"</p>",
        "id": 194538842,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1587207903
    },
    {
        "content": "<p>(maybe encapsulation is the right name?)</p>",
        "id": 194538854,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1587207943
    },
    {
        "content": "<p>basically the idea that making changes to your fns doesn't cause your callers to stop compiling (nor, ideally, to stop <em>Working</em>)</p>",
        "id": 194538895,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1587207968
    },
    {
        "content": "<p>I think we do a lot of work to maintain this, but there are some places that we fail, notably adding <code>AsRef</code> impls</p>",
        "id": 194538899,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1587207982
    },
    {
        "content": "<p>I guess the \"modularity in the abstract sense\" goes in this direction</p>",
        "id": 194538902,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1587208015
    }
]