[
    {
        "content": "<p>A new proposal has been announced: <a href=\"https://github.com/rust-lang/compiler-team/issues/366\">Change Allocation error default behaviour #366</a>. It will be announced at the next meeting to try and draw attention to it, but usually MCPs are not discussed during triage meetings. If you think this would benefit from discussion amongst the team, consider proposing a design meeting.</p>",
        "id": 210678544,
        "sender_full_name": "triagebot",
        "timestamp": 1600626181
    },
    {
        "content": "<p>See also the discussion around hyper’s C API where this recently came up. <a href=\"https://github.com/hyperium/hyper/issues/2265\">https://github.com/hyperium/hyper/issues/2265</a></p>",
        "id": 210678692,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1600626369
    },
    {
        "content": "<p>One notable constraint: if panicking because an allocation failed, the panic and unwind cannot allocate any memory.</p>",
        "id": 210678732,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1600626462
    },
    {
        "content": "<p>Also, see <a href=\"https://github.com/rust-lang/rust/issues/66740\">https://github.com/rust-lang/rust/issues/66740</a> and <a href=\"https://github.com/rust-lang/rust/issues/66741\">https://github.com/rust-lang/rust/issues/66741</a> .</p>",
        "id": 210678786,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1600626513
    },
    {
        "content": "<p>This seems like a duplicate of <a href=\"https://github.com/rust-lang/rust/issues/66741\">https://github.com/rust-lang/rust/issues/66741</a></p>",
        "id": 210678892,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1600626703
    },
    {
        "content": "<p>Not quite, at least in the PR that’s purposed in that issue. That adds a new error handler for no_std environments that is panic. I’m proposing changing this line in std’s implementation from abort to panic. <a href=\"https://github.com/rust-lang/rust/blob/97eb606e4b2becd17d46a67d87169f52b210e67c/library/std/src/alloc.rs#L331\">https://github.com/rust-lang/rust/blob/97eb606e4b2becd17d46a67d87169f52b210e67c/library/std/src/alloc.rs#L331</a></p>",
        "id": 210679228,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1600627141
    },
    {
        "content": "<p>Ah, okay. I was wondering why this was in t-compiler, but that makes sense as part of libstd implementation details.</p>",
        "id": 210680198,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1600628643
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"219696\">@XAMPPRocky</span> I think it would be helpful to include a description of why you think this is something T-compiler can change (i.e., why this is not a T-libs thread, basically)</p>",
        "id": 210681338,
        "sender_full_name": "simulacrum",
        "timestamp": 1600630406
    },
    {
        "content": "<p>I guess the argument is that it's not stabilized either way, but I imagine there needs to be some thought about this -- in particular, programs may be written such that they assume allocation failure would mean abort and would otherwise not be safe. (i.e., unsafe code could rely on this)</p>",
        "id": 210681394,
        "sender_full_name": "simulacrum",
        "timestamp": 1600630466
    },
    {
        "content": "<p>and really I would feel much better about changing this with more background etc on the topic :)</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"143274\">@Amanieu</span> who I think has been sort of driving allocref and allocators in general recently</p>",
        "id": 210681415,
        "sender_full_name": "simulacrum",
        "timestamp": 1600630530
    },
    {
        "content": "<p>There are concerns that unsafe code may not handle \"new\" sources of unwinding properly.</p>",
        "id": 210681584,
        "sender_full_name": "Amanieu",
        "timestamp": 1600630688
    },
    {
        "content": "<p>Oh <span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> already mentioned that. I think that's really the main concern here.</p>",
        "id": 210681608,
        "sender_full_name": "Amanieu",
        "timestamp": 1600630732
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> It’s an implementation detail. Someone could fork and distribute an API compatible version of rustc that panics by default rather than aborts.</p>",
        "id": 210681620,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1600630762
    },
    {
        "content": "<p>Just saying \"implementation detail\" isn't really sufficient IMO, you need to justify why people cannot depend on this -- and it seems to me that we know of at least one type of code where people <em>can</em>. So you need to argue why breaking that code, potentially introducing UB, is okay / trade-off is worth it.</p>",
        "id": 210681677,
        "sender_full_name": "simulacrum",
        "timestamp": 1600630823
    },
    {
        "content": "<p>It's possible to work around the issue of unwinding needing to allocate memory by allocating an exception object on startup just in case of OOM. The C++ standard library already does this.</p>",
        "id": 210681689,
        "sender_full_name": "Amanieu",
        "timestamp": 1600630856
    },
    {
        "content": "<p>I would have to triple-check my unsafe code to see if it handles unwinding on alloc failure correctly. I think <code>parking_lot</code> isn't unwind-safe if allocation can unwind, but I'll have to double-check.</p>",
        "id": 210681719,
        "sender_full_name": "Amanieu",
        "timestamp": 1600630911
    },
    {
        "content": "<p>frankly it makes me feel <em>very</em> concerned about change here without some kind of opt-in or something on a relatively granular level if even \"foundational\" crates written by people likely aware of the possibility of this changing are potentially unsound with this</p>",
        "id": 210681773,
        "sender_full_name": "simulacrum",
        "timestamp": 1600630973
    },
    {
        "content": "<p>at the very least we'd need an audit of std, and that seems quite hard.</p>",
        "id": 210681783,
        "sender_full_name": "simulacrum",
        "timestamp": 1600630994
    },
    {
        "content": "<p>I do agree on principle that unwinding is a <em>great</em> way to handle OOM situations: the destructors will free any memory used by the \"task\" that caused the OOM, which usually allows the rest of the process to continue. Most OOM situations happen due to a single excessively large allocation (e.g. due to bad user input) rather than from actual address space exhaustion.</p>",
        "id": 210681845,
        "sender_full_name": "Amanieu",
        "timestamp": 1600631080
    },
    {
        "content": "<p>It'd be interesting for me to see the code size / performance impact of those additional unwinding edges</p>",
        "id": 210681881,
        "sender_full_name": "simulacrum",
        "timestamp": 1600631159
    },
    {
        "content": "<p>It's probably insignificant in a <code>panic=unwind</code> build since there are many functions that the compiler has to assume can unwind.</p>",
        "id": 210681956,
        "sender_full_name": "Amanieu",
        "timestamp": 1600631248
    },
    {
        "content": "<p>I had a quick look at <code>parking_lot</code>: I don't think it's unsound, but it will leave some locks permanently locked because the internal code uses manual lock/unlock instead of lock guards.</p>",
        "id": 210682093,
        "sender_full_name": "Amanieu",
        "timestamp": 1600631429
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> Well I'll leave <em>how</em> to change the default up to the compiler team, but I could see this as an edition change to have that kind of opt-in you mentioned.</p>\n<blockquote>\n<p>you need to justify why people cannot depend on this</p>\n</blockquote>\n<p>This is not my motivation. If you wanted to depend on aborting for OOM errors you should be able to, this is more about it being the default. My motivation is that this default is very unintuitive for using Rust from other languages, and is counter to Rust's goals of having parity  with C in terms of interop. With the current default you cannot ship stable libraries that don't abort on OOM, which makes Rust a non-starter for use in a lot of large mission critical systems, and even if you could requiring every Rust to C FFI API to expose a <code>unset_oom_abort</code> or equivalent functionality to override the hook before use wouldn't be a good situation for library authors or users either.</p>",
        "id": 210703643,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1600667490
    },
    {
        "content": "<p>My point is that the proposal as it stands doesn't talk about the - seemingly quite real, based on what <span class=\"user-mention\" data-user-id=\"143274\">@Amanieu</span> says and my recollection of std - possibility of a change in defaults here introducing unsoundness or at least incorrect behavior into existing code.</p>\n<p>Given that I'd personally say this needs a full RFC to discuss various tradeoffs it's making and lay out the rationale in more detail than the current short proposal.</p>",
        "id": 210729564,
        "sender_full_name": "simulacrum",
        "timestamp": 1600688661
    },
    {
        "content": "<p>In my opinion this kind of choice is <em>not</em> an implementation detail</p>",
        "id": 210752937,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1600700129
    },
    {
        "content": "<p>I think that it should be a T-libs choice, with T-lang \"kept informed\"</p>",
        "id": 210752988,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1600700150
    },
    {
        "content": "<p>At least if I'm understanding, this feels like a pretty user visible change</p>",
        "id": 210753034,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1600700164
    },
    {
        "content": "<p>Okay, I’m going to close this MCP for now then. Thanks for the feedback everyone!</p>",
        "id": 210762672,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1600704189
    },
    {
        "content": "<p>FWIW, there was an interesting conversation about allocation in the Linux Plumbers Conference discussions around Rust in the Linux kernel. Linux has some different ways to allocate memory, and it may be important to handle allocation failure in better ways, as well as providing ways to affect <em>how</em> memory is allocated (e.g. \"is it safe to go try to free up some memory before returning from the allocator\").</p>",
        "id": 210801284,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1600722977
    },
    {
        "content": "<p>Yeah, Rust <em>certainly</em> needs to improve in this area.</p>\n<p>The fact that code might be unsound in the presence of unwinding allocation failure instead of aborting allocation failure really just means that <em>such code needs to be found and fixed</em>. It's essentially just \"Not Acceptable\" for abort-on-OOM to be the eternal situation. It's fine if this is a long term project that takes N years to transition instead of a 1 month PR, but we should slowly drive in this direction.</p>\n<p>Particularly because you can change the oom hook (only on Nightly, yes yes) and then the unsound code would just plain become unsound. Having that outcome from two distant pieces of code both thinking they have enough knowledge of how a global thing works is just a bad time.</p>",
        "id": 210804119,
        "sender_full_name": "Lokathor",
        "timestamp": 1600724625
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224471\">@Lokathor</span> I definitely agree, especially given the oom hook on nightly, but I think my perspective is that <em>yes</em> we might want this but it needs more thought than an MCP can give, and likely RFC style feedback.</p>",
        "id": 210815717,
        "sender_full_name": "simulacrum",
        "timestamp": 1600733352
    },
    {
        "content": "<p>yeah yeah, probably the most an MCP could do here directly is found a group to begin the long term work and position us for the change later.</p>",
        "id": 210815814,
        "sender_full_name": "Lokathor",
        "timestamp": 1600733428
    },
    {
        "content": "<p>Also note that the answer is not as easy as \"change it on the next edition\" or \"application-level opt-in\"; neither of these do anything to protect against crates somewhere in the dependency tree getting this wrong.</p>",
        "id": 212218471,
        "sender_full_name": "RalfJ",
        "timestamp": 1601809964
    },
    {
        "content": "<p>Yeah, this absolutely can't be edition related.</p>",
        "id": 212233707,
        "sender_full_name": "Lokathor",
        "timestamp": 1601834351
    }
]