[
    {
        "content": "<p>A new proposal has been announced: <a href=\"https://github.com/rust-lang/compiler-team/issues/421\">Rename -Cllvm-args to something backend agnostic #421</a>. It will be announced at the next meeting to try and draw attention to it, but usually MCPs are not discussed during triage meetings. If you think this would benefit from discussion amongst the team, consider proposing a design meeting.</p>",
        "id": 231777862,
        "sender_full_name": "triagebot",
        "timestamp": 1616668761
    },
    {
        "content": "<p>I prefer the name <code>-Cbackend-args</code>. codegen args is already the (internal) name for the whole <code>-C</code> family.</p>",
        "id": 231778478,
        "sender_full_name": "bjorn3",
        "timestamp": 1616669063
    },
    {
        "content": "<p>It did be nice if <code>-Cbackend-args</code> would support being passed multiple times with the args being concattenated.</p>",
        "id": 231778656,
        "sender_full_name": "bjorn3",
        "timestamp": 1616669137
    },
    {
        "content": "<p>Maybe it should also require passing the backend name again to either ignore or error when a different backend is used? It could be something like <code>\"-Cbackend-args=llvm:arg1 arg2\"</code>.</p>",
        "id": 231778953,
        "sender_full_name": "bjorn3",
        "timestamp": 1616669250
    },
    {
        "content": "<p>I mean I'm definitely in favour of a smarter version of the flag, but I'd be happy with it as is, just with a different name.</p>\n<p>Not sure if requiring the name be passed in would be worth it though unless we'd want people to support multiple backends by always passing all of the arguments for all of the backends they support e.g. <code>-Cbackend-args=\"llvm:--help cranelift:--help\"</code>.</p>",
        "id": 231780715,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1616670123
    },
    {
        "content": "<p>Oh wait I see what you meant now. Hmm, maybe that is useful. Though maybe having as its own flag makes more sense like <code>-Cbackend-flavor=cranelift</code> so that it could apply to other things and then <code>-Cllvm-args</code> could expand to just <code>-Cbackend-args=\"...\" -Cbackend-flavor=llvm</code>.</p>",
        "id": 231792073,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1616675659
    },
    {
        "content": "<p>We already have <code>-Zcodegen-backend=llvm/cranelift</code>. I was concerned about the case where someone uses <code>RUSTFLAGS</code> to pass one of <code>-Zcodegen-backend</code> or <code>-Cbackend-args</code> and <code>.cargo/config.toml</code> (or a profile in <code>Cargo.toml</code>) for the other flag. In that case you may accidentally end up with a mismatch between expected and actual codegen backend.</p>",
        "id": 231792398,
        "sender_full_name": "bjorn3",
        "timestamp": 1616675830
    },
    {
        "content": "<p>I think “llvm” should be at least somewhere in the argument - if not in the argument name, then as part of the value like <span class=\"user-mention\" data-user-id=\"133247\">@bjorn3</span> suggested.  The options exposed by llvm-args tend to be very low level and implementation specific, so I wouldn’t expect any other backends to have compatibility with them, now or in the future.  As such, it’s good for the compiler to know that the user is trying to pass arguments to LLVM, so it can produce a proper error if a different codegen backend is in use, rather than having that backend complain that the flags are unrecognized.</p>",
        "id": 231873278,
        "sender_full_name": "comex",
        "timestamp": 1616705120
    },
    {
        "content": "<p>Also, I could imagine rustc someday supporting using multiple backends for different functions in the same crate.  (You might want to prioritize runtime performance for some functions and compile time for others.)  In that case, there would need to be a way to specify options for each backend, which also benefits from naming the backend as part of the argument.</p>",
        "id": 231873996,
        "sender_full_name": "comex",
        "timestamp": 1616705426
    },
    {
        "content": "<p>However, if the backend name is part of the argument, using <code>-Cbackend-args=llvm:arg</code> instead of <code>-Cllvm-args=arg</code> feels to me like it’s more verbose for no reason.  Why not just keep <code>-Cllvm-args</code> but change it to only work for LLVM, and add <code>-Ccranelift-args</code> for Cranelift?</p>",
        "id": 231874327,
        "sender_full_name": "comex",
        "timestamp": 1616705601
    },
    {
        "content": "<p>That would require hard-coding all possible backends in rustc as by the time the codegen backend to use is determined, all arguments have already been parsed.</p>",
        "id": 231874512,
        "sender_full_name": "bjorn3",
        "timestamp": 1616705683
    },
    {
        "content": "<p>We already have a number of arguments that have 2 levels (<code>--extern=crate=path</code> for example)</p>",
        "id": 231874623,
        "sender_full_name": "nagisa",
        "timestamp": 1616705748
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"133247\">@bjorn3</span> Is that such a big deal?</p>",
        "id": 231874780,
        "sender_full_name": "comex",
        "timestamp": 1616705820
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"123586\">@nagisa</span> True; on the other hand, <code>-Cllvm-args</code> already exists and adding a new syntax would be not-strictly-necessary churn.</p>",
        "id": 231874858,
        "sender_full_name": "comex",
        "timestamp": 1616705860
    },
    {
        "content": "<p>there are already a number of out-of-tree backends.</p>",
        "id": 231874883,
        "sender_full_name": "nagisa",
        "timestamp": 1616705875
    },
    {
        "content": "<p>The list of possible backends is potentially infinite. In addition how would an unofficial codegen backend be handled? Adding a <code>-C...-args</code> would make it look official and the backend may end up getting abandoned.</p>",
        "id": 231875000,
        "sender_full_name": "bjorn3",
        "timestamp": 1616705913
    },
    {
        "content": "<p><code>-Cllvm-args</code> doesn't need to be deprecated or removed IMO, it can be transparently rewritten to <code>-Ccodegen-args=llvm=...</code> or similar.</p>",
        "id": 231875010,
        "sender_full_name": "nagisa",
        "timestamp": 1616705920
    },
    {
        "content": "<p>(My vote is on <code>-Ccg-args</code> or <code>-Ccodegen-args</code>)</p>",
        "id": 231875063,
        "sender_full_name": "nagisa",
        "timestamp": 1616705961
    },
    {
        "content": "<p>The problem with <code>-Ccodegen-args</code> in my opinion is that <code>-C</code> flags are already called codegen arguments. So this would be the ‘“codegen arguments” codegen argument’, which is why my preference is for something like <code>backend-args</code> or something that has some other distinguishing word than codegen.</p>",
        "id": 232299587,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1617036934
    },
    {
        "content": "<p><code>-Cbackend-args</code> sounds like a good match for <code>-Zcodegen-backend</code>, especially if the latter is stabilized as <code>-Cbackend</code></p>",
        "id": 232302094,
        "sender_full_name": "cuviper",
        "timestamp": 1617037893
    },
    {
        "content": "<p><span class=\"user-group-mention\" data-user-group-id=\"492\">@T-compiler</span>: Proposal <a href=\"https://github.com/rust-lang/compiler-team/issues/421#issuecomment-820450073\">#421</a> has been seconded, and will be approved in 10 days if no objections are raised.</p>",
        "id": 234681755,
        "sender_full_name": "triagebot",
        "timestamp": 1618495662
    },
    {
        "content": "<p>Would it be possible to approach this the other way around, and let the codegen backend deal with all flags under a common prefix? That is <code>-C llvm-*</code> and <code>-C cranelift-*</code>. <code>-C llvm-args</code> is by far not the only LLVM-specific option we have, and it would be a shame if it would be necessary to shove all codegen backend specific configuration under a single flag.</p>",
        "id": 234749009,
        "sender_full_name": "Nikita Popov",
        "timestamp": 1618519252
    },
    {
        "content": "<p>are the possible backends a hard-coded list? I don't think it would be good if that has to be open to arbitrary names</p>",
        "id": 234758852,
        "sender_full_name": "cuviper",
        "timestamp": 1618522860
    },
    {
        "content": "<p>No, can have arbitrary backend a out of tree too.</p>",
        "id": 234759342,
        "sender_full_name": "nagisa",
        "timestamp": 1618523131
    },
    {
        "content": "<p>another option would be to keep <code>-Cllvm-args</code> but also add <code>-Cbackend-args</code> … i.e. truly LLVM specific stuff would continue to be fed via <code>-Cllvm-args</code>, while flags that are generic enough to be shared across backends would be lifted to <code>-Cbackend-args</code> ...</p>",
        "id": 234780230,
        "sender_full_name": "pnkfelix",
        "timestamp": 1618536145
    },
    {
        "content": "<p>(or is there some way that you expect to specify LLVM-specific stuff <em>in</em> the <code>-Cbackend-args</code> list?, in a manner that gets automatically filtered somehow?)</p>",
        "id": 234780268,
        "sender_full_name": "pnkfelix",
        "timestamp": 1618536203
    },
    {
        "content": "<p>I wonder if we should be supporting random arguments without filtering of some kind, I guess maybe the ship has sailed with LLVM at least... but it seems like a clear stability hole, right? We just get away with it because few people set these options.</p>",
        "id": 234782373,
        "sender_full_name": "simulacrum",
        "timestamp": 1618538154
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116083\">pnkfelix</span> <a href=\"#narrow/stream/233931-t-compiler.2Fmajor-changes/topic/Rename.20-Cllvm-args.20to.20something.20backend.20a.E2.80.A6.20compiler-team.23421/near/234780230\">said</a>:</p>\n<blockquote>\n<p>another option would be to keep <code>-Cllvm-args</code> but also add <code>-Cbackend-args</code> … i.e. truly LLVM specific stuff would continue to be fed via <code>-Cllvm-args</code>, while flags that are generic enough to be shared across backends would be lifted to <code>-Cbackend-args</code> ...</p>\n</blockquote>\n<p>For cg_clif I put a couple of flags that will only be supported by cg_clif behind <code>-Cllvm-args</code> like \"codegen-mode\" which allows chosing between AOT compilation and various JIT modes. <a href=\"https://github.com/bjorn3/rustc_codegen_cranelift/blob/b477a5472d4530066ad4a2205d24a3830159da6b/src/config.rs#L32-L66\">https://github.com/bjorn3/rustc_codegen_cranelift/blob/b477a5472d4530066ad4a2205d24a3830159da6b/src/config.rs#L32-L66</a></p>",
        "id": 234819626,
        "sender_full_name": "bjorn3",
        "timestamp": 1618564089
    },
    {
        "content": "<p>I am fine with putting everything behind <code>-Zunstable-features</code>.</p>",
        "id": 234819739,
        "sender_full_name": "bjorn3",
        "timestamp": 1618564136
    },
    {
        "content": "<p>This proposal has been accepted: <a href=\"https://github.com/rust-lang/compiler-team/issues/421\">#421</a>.</p>",
        "id": 237697042,
        "sender_full_name": "triagebot",
        "timestamp": 1620321886
    }
]