[
    {
        "content": "<p>I am the maintainer of <a href=\"https://github.com/openbsd/ports/tree/master/lang/rust\">lang/rust</a> on OpenBSD. We currently actively support x86_64, i686, and sparc64 architectures, and I intent to add support for more archs. It should be mostly just add target spec files. Does I need to open MCP for each new proposed arch ? The target tier policy documents stands that it might need only for substantial changes on shared code (\"A proposed target or target-specific patch that substantially changes code shared with other targets (not just target-specific code) must be reviewed and approved by the appropriate team for that shared code before acceptance\")</p>",
        "id": 265407013,
        "sender_full_name": "Sebastien Marie (semarie)",
        "timestamp": 1639817779
    },
    {
        "content": "<p>Just to note that I sent <a href=\"https://github.com/rust-lang/rust/pull/92061\">#92061</a> as part of my work of adding more archs support (libc update + std change for char signess of archs)</p>",
        "id": 265407235,
        "sender_full_name": "Sebastien Marie (semarie)",
        "timestamp": 1639818071
    },
    {
        "content": "<p>I don't know if MCPs are really needed. In the mean time, you can prepare the PRs and hopefully the right people can guide you in the right direction :)</p>",
        "id": 265411530,
        "sender_full_name": "fee1-dead",
        "timestamp": 1639824312
    },
    {
        "content": "<p>I think you could reasonably propose several tier 3 targets in one go, if the answers to the questions are all the same.</p>",
        "id": 265437361,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1639855624
    },
    {
        "content": "<p>(other than architecture)</p>",
        "id": 265437365,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1639855634
    },
    {
        "content": "<p>Also, you might consider doing an MCP anyway, and having it encompass the existing targets as well, since they've never had one and it would be great to get documentation on file.</p>",
        "id": 265437391,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1639855682
    }
]