[
    {
        "content": "<p>Hi folks!</p>\n<p>I am around since long time, mostly coorganizing Rust Wrocław events (meetups before, webinars for now). I am also working with Rust on some 5g project (before I was involved in some traveling related project, in Rust too).</p>\n<p>Recently I figured out, that doing my toy project is no longer this fun for me, as \"noone waits\" for them. I decided, that I might be helpfull contributing to Rust itself - I think I have pretty good knowledge of the language (not like 10/10, or even 8/10, but let say solid), I have also experience with many other languages and paradigms, so my POV is wide(ish). My strongest background is C++ and system programming in general (but I would say, that I know Rust way better than C++, as for 2 years I develop only in Rust).</p>\n<p>If I can help with something it would be great to be pointed somewhere - I am not exactly sure where help is needed at most. I could help both with code, but maybe also with some documentation, or something like this. My preference would be something around generic constants/specializations/try blocks/GATs/polonius, as those are feature I am waiting for at most, but being honest - I would be happy to contribute to anything Rust specific.</p>",
        "id": 198056922,
        "sender_full_name": "Bartłomiej Kuras",
        "timestamp": 1589891100
    },
    {
        "content": "<p>Then I guess chalk crate could be good starter?</p>",
        "id": 198058197,
        "sender_full_name": "Wojciech Polak",
        "timestamp": 1589891796
    },
    {
        "content": "<p>The chalk stream is <a class=\"stream\" data-stream-id=\"144729\" href=\"/#narrow/stream/144729-wg-traits\">#wg-traits</a>. The repo is <a href=\"https://github.com/rust-lang/chalk\">https://github.com/rust-lang/chalk</a>.</p>",
        "id": 198058744,
        "sender_full_name": "bjorn3",
        "timestamp": 1589892058
    },
    {
        "content": "<p>Yup, chalk is one think I am loking at and probably I will take closer look on this weekend (or maybe even earlier)</p>",
        "id": 198058961,
        "sender_full_name": "Bartłomiej Kuras",
        "timestamp": 1589892159
    }
]