[
    {
        "content": "<p>Hello, I'm trying to compile the rust compiler for a new target, I patched LLVM, rustc, std and all the necessary crates with support for my target and managed to build the compiler using this command: <code>./x.py build -i --stage 2 --host x86_64-unknown-aero-system --target x86_64-unknown-aero-system -j 4</code> but it fails to link with the following error: <a href=\"https://gist.github.com/czapek1337/597b229ecebeaabcb13058cc70962c82\">https://gist.github.com/czapek1337/597b229ecebeaabcb13058cc70962c82</a><br>\nAlready having compiled a host cargo that can compile using a host compiler with support for that target I know I need to pass <code>-C link-args=-no-pie</code> to the rust compiler, but I'm unsure how because setting the <code>RUSTFLAGS</code> env will affect all invocations of rustc, which is not something I want to happen, and I can't find anything in config.toml that would let me do that.</p>",
        "id": 268072658,
        "sender_full_name": "czapek",
        "timestamp": 1642194324
    },
    {
        "content": "<p>You can set <code>postion_independent_executables</code> to false in the target spec for the new target.</p>",
        "id": 268082680,
        "sender_full_name": "bjorn3",
        "timestamp": 1642199671
    },
    {
        "content": "<p>Also you probably want to add the host triple to <code>--target</code>. Otherwise build scripts and proc macros can't be compiled by the resulting rustc.</p>",
        "id": 268082735,
        "sender_full_name": "bjorn3",
        "timestamp": 1642199708
    },
    {
        "content": "<p>So I would set that field in the spec in the <code>rustc_target</code> crate instead of passing the option through the command line? Also I am only interested in building a compiler that can be ran on the target architecture, should I still add the host triple I am building on to the <code>--target</code>s?</p>",
        "id": 268083389,
        "sender_full_name": "czapek",
        "timestamp": 1642200133
    },
    {
        "content": "<p>Okay that seems to have solved the issue, now I'm just getting some linker errors but I'll try to figure that out myself, thanks! :)</p>",
        "id": 268085481,
        "sender_full_name": "czapek",
        "timestamp": 1642201390
    }
]