[
    {
        "content": "<p>Hi guys, sorry I have a question that I don't know is appropriate to ask here or not but I need help about it to decide<br>\nI really love writing compilers and I want to learn it so last year I started contributing on rust compiler and I picked an issue about ICE messages and fixed that with much help from guys here, and after 3 months of trying to get understand the compiler I decided to stop and go for just making ordinary rust applications, I mean just coding with rust not compiler, but I saw Esteban Kuber talk in rust conf that said contributing is not hard as you think and this is the way you should do it<br>\nso one side of my brain is telling me to go for doing it again, but I'm worried to get the same feeling again and face with defeat again<br>\nI wanted to see that is there anyone else with the same experience that I have? or maybe expert guys have some advice for me<br>\nthanks</p>",
        "id": 253465385,
        "sender_full_name": "hossein dindar",
        "timestamp": 1631730914
    },
    {
        "content": "<p>Perhaps it's not what you want to hear, but you could contribute to <code>rust-analyzer</code>. It's  not exactly a compiler, but they have things in common, and it's slightly easier to get started (<code>cargo</code> works like in every other Rust project).</p>",
        "id": 253465940,
        "sender_full_name": "Laurențiu",
        "timestamp": 1631731153
    },
    {
        "content": "<p><code>rustc</code> is a very big rust codebase and so it's not surprising that it's difficult to understand in depth. I am new here, but perhaps one strategy is to just focus on one fairly small piece and work outwards - rather than attempting to understand everything.</p>",
        "id": 253675886,
        "sender_full_name": "Tim McNamara",
        "timestamp": 1631842129
    },
    {
        "content": "<blockquote>\n<p>I wanted to see that is there anyone else with the same experience that I have? or maybe expert guys have some advice for me</p>\n</blockquote>\n<p>my only suggestion is:  if you're really motivated, don't give up. As suggested, start small (even a one line fix!) and little by little get yourself familiar with the codebase. You will always find people reviewing and helping with your contributions.</p>",
        "id": 253714960,
        "sender_full_name": "apiraino",
        "timestamp": 1631871174
    },
    {
        "content": "<p>What everyone else is saying is true: the codebase is huge and intimidating. You <em>can't</em> understand the whole thing. Pick small pieces and work up from there. <em>\"How do you eat a whole elephant? One bite at a time.\"</em></p>",
        "id": 253743145,
        "sender_full_name": "Esteban Küber",
        "timestamp": 1631885959
    },
    {
        "content": "<p>Hey all, I've been a long-time rust user and I'd like to contribute to the compiler. However, I was wondering if that's even something you want. Is it normal to look for an issue and try to resolve it when you're for example not yet that experienced with rustc internals? Or would I just be getting in the way of other people? Or is it more usual to file your own issue which you then resolve yourself?</p>",
        "id": 253872664,
        "sender_full_name": "Jonathan Dönszelmann",
        "timestamp": 1631975821
    },
    {
        "content": "<p>Im not on any of the teams or anything, but from what I’ve gathered any and all help is very welcome. You can look through issues to work on or create ones yourself and work on those too.</p>\n<p>The community is very helpful and encouraging to those who want to contribute, so just dive in!</p>",
        "id": 253872890,
        "sender_full_name": "Timothy Maloney",
        "timestamp": 1631976004
    },
    {
        "content": "<p>thanks for your reply, that give me some confidence :)</p>",
        "id": 253873431,
        "sender_full_name": "Jonathan Dönszelmann",
        "timestamp": 1631976620
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"370197\">@Jonathan Dönszelmann</span> <a href=\"https://youtu.be/9H9SO2u6Q20\">https://youtu.be/9H9SO2u6Q20</a> this is very relevant for you I feel :D</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"9H9SO2u6Q20\" href=\"https://youtu.be/9H9SO2u6Q20\"><img src=\"https://uploads.zulipusercontent.net/4f82b82945c3ab77d2fb0a61a5362f6867d75785/68747470733a2f2f692e7974696d672e636f6d2f76692f394839534f3275365132302f64656661756c742e6a7067\"></a></div>",
        "id": 253874307,
        "sender_full_name": "Emil Gardström",
        "timestamp": 1631977523
    },
    {
        "content": "<p>thanks guys, yeah I am totally agree, I should start with small parts</p>",
        "id": 254214383,
        "sender_full_name": "hossein dindar",
        "timestamp": 1632233896
    }
]