[
    {
        "content": "<p>Hello everyone and happy holidays in advance!</p>\n<p>I found rust is cool and want to contribute - is there any projects or libraries that need more contributors?</p>\n<p>I'm new to open source but have 10+ years experience programming, should be able to speed up quickly. As a beginner I want to find a project that somebody else already have a requirement &amp; design. </p>\n<p>Not picky on project and I can learn fast :)</p>\n<p>Thank you</p>",
        "id": 220545423,
        "sender_full_name": "isoosiss7",
        "timestamp": 1608511754
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"372875\">@isoosiss7</span> Welcome!</p>",
        "id": 220553555,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1608526759
    },
    {
        "content": "<p>Are there any particular areas you're interested in? I know you said you aren't picky, but what's exciting to you? Web, command line, low-level systems stuff, data formats, tools...?</p>",
        "id": 220553598,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1608526807
    },
    {
        "content": "<p>thank you</p>\n<p>I found rust is an awesome programming language but my current job doesn't use it. So I want to find an open source project to enjoy rust and improve my skills. I came from backend background so command line, low level systems, tools may fit my experience better.</p>",
        "id": 220651281,
        "sender_full_name": "isoosiss7",
        "timestamp": 1608601710
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"372875\">@isoosiss7</span> A few possibilities then:</p>\n<ul>\n<li>The \"clap\" command-line argument parser could use people helping to finish the move to clap 3.0.</li>\n<li>The <code>async-std</code> and <code>smol</code> projects are working on reimplementing all of <code>std</code> in an asynchronous way, and could potentially use help. See <a href=\"https://http-rs.zulipchat.com/\">https://http-rs.zulipchat.com/</a> for that.</li>\n<li>If <code>io_uring</code> is at all interesting to you, there are several projects working to integrate it with Rust, such as <code>ringbahn</code>.</li>\n<li>The gitoxide project is a low-level reimplementation of Git, if that sounds interesting.</li>\n</ul>",
        "id": 220662736,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1608618778
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span> <br>\nThank you very much, these all sound like very good projects to me, I'll reach out to them.</p>",
        "id": 220709509,
        "sender_full_name": "isoosiss7",
        "timestamp": 1608655405
    }
]