[
    {
        "content": "<p>Hey! I am also a newcomer to the Rust language with some background in C++ and C. Currently I am creating a PoC project to deepen my understanding and oh boy, so much new things emerged (probably chose too ambitious project - visualizing realtime audio streams :). I wish to expand upon the language, and fix some of its shortcomings once I get good grasp of all the features (so in a few years :D).</p>\n<p>On top of that, I am totally in love with this language and I only sometimes grumble about my struggles with compiler which does a good job of suggesting  nice fixes to errors but sometimes falls short of explaining the problem precisely enough (maybe this is where I could help as a newcomer).</p>",
        "id": 210605574,
        "sender_full_name": "Jakub Duchniewicz",
        "timestamp": 1600506594
    },
    {
        "content": "<p>Hi, I'm a Firefox dev and long-time Rust user (and minor contributor). I was involved in the very early discussions on error-handling, so of course interested in this :)</p>",
        "id": 210606214,
        "sender_full_name": "David Teller",
        "timestamp": 1600507457
    },
    {
        "content": "<p>Hey Everyone! My name is Drew and  I'm a SWE,. I know there is so much I can learn from this language and this community. I'm about to quit my job and take a gap year and want to contribute to this language as much as I can and learn as much as I can. I just saw the blog post for <a href=\"https://blog.rust-lang.org/2020/09/14/wg-prio-call-for-contributors.html\">https://blog.rust-lang.org/2020/09/14/wg-prio-call-for-contributors.html</a> and will reach out for more guidance on what I can do to help :)</p>",
        "id": 210607141,
        "sender_full_name": "Drew Gonzales",
        "timestamp": 1600508943
    },
    {
        "content": "<p>Hi everyone! </p>\n<p>I'm Nelson, I've been mainly a full stack web developer with a focus on backend development.<br>\nMost recently I've been working with Kotlin and Go but I keep feeling the urge to learn more low level languages specially Rust, and I don't really know why.  <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span>  I might need an intervention.</p>\n<p>My Rust experience is still very limited, but i'm working to change that.</p>\n<p>Thanks for having me!</p>",
        "id": 210904134,
        "sender_full_name": "Nelson J Morais",
        "timestamp": 1600795686
    },
    {
        "content": "<p>Hello! I'm also a Nelson ;) Welcome to Rust!</p>",
        "id": 210905075,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1600796107
    },
    {
        "content": "<p>thanks Nelson! :)</p>",
        "id": 210906787,
        "sender_full_name": "Nelson J Morais",
        "timestamp": 1600796873
    }
]