[
    {
        "content": "<p>Hi Rust community, I'm Eric. I've followed Rust since 2014, and used it in a hobby capacity since 2015. I'm fascinated by systems-level performance, parallel compute, and compiler technologies in general. I'm looking to get involved in the Rust project in the capacity of code contribution and documentation. I'm interested in multiple working groups (async-await, parallel-rustc, and anything related to the type system traits/polonious/polymorph) but I'd be happy to start just acclimating on priority tasks, bug fixes, and take things from there. Let me know where I might be put to work! I hope to get spun up rather quick so I can make use of some idle time that I've found myself with. Cheers!!!</p>",
        "id": 219375021,
        "sender_full_name": "Eric Schirtzinger",
        "timestamp": 1607537416
    },
    {
        "content": "<p>There are Zulip channels for everything you cited I think, you can also look up the rust-lang/rust repo and the E-easy/E-mentor labels <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 219380838,
        "sender_full_name": "Poliorcetics",
        "timestamp": 1607540016
    },
    {
        "content": "<p>hey Eric, welcome to the project! Most of the interesting work in traits happens in <a class=\"stream\" data-stream-id=\"144729\" href=\"/#narrow/stream/144729-wg-traits\">#wg-traits</a> around <a href=\"https://github.com/rust-lang/chalk\">chalk</a>. Async/await is in <a class=\"stream\" data-stream-id=\"187312\" href=\"/#narrow/stream/187312-wg-async-foundations\">#wg-async-foundations</a> and parallel-rustc is stalled for now, although I think <span class=\"user-mention\" data-user-id=\"274471\">@Arlie Davis</span> has been working on it some</p>",
        "id": 219380853,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1607540021
    },
    {
        "content": "<p>There is also the rustc dev guide <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 219380953,
        "sender_full_name": "Poliorcetics",
        "timestamp": 1607540047
    },
    {
        "content": "<p>Hi Eric! If you're interested in wg-traits at all, we have weekly meetings Tuesdays at 4 PM EST (though we may or may not be resuming them next year due to holidays). Also feel free to check out the Chalk repo (linked above), which has a few good first issues. Or stop #wg-traits and we can discuss if there is something else you might be interested in!</p>",
        "id": 219382205,
        "sender_full_name": "Jack Huey",
        "timestamp": 1607540566
    },
    {
        "content": "<p>Thanks for the tips, I subscribed to a few streams. They make for a nice overview of ongoing work! I should be able to attend those meetings, I'd love to sit in on one.</p>",
        "id": 219383448,
        "sender_full_name": "Eric Schirtzinger",
        "timestamp": 1607541093
    }
]