[
    {
        "content": "<p>Hey hey! I hope y'all are having a great day. I managed to get my first PR merged in the compiler last week and I'm quite proud and I'd like to become way more involved in the future as I've been using and preaching Rust for a while now. I'm a bit lost to be fully honest tho. I stumbled randomly upon for the PR i worked on. Any part of the compiler someone could point me at? The project is so big that it's a bit hard to know where to start</p>",
        "id": 245611595,
        "sender_full_name": "Lambinoo",
        "timestamp": 1626016085
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"426197\">@Lambinoo</span> is there anything in particular you're interested in working on? there are a lot of open issues haha, almost anything will need work</p>",
        "id": 245611794,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1626016354
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"426197\">@Lambinoo</span> if you're looking for suggestions, some Rust lang components have a list of \"good first issues\" up for grab, you can start from there<br>\n<a href=\"https://forge.rust-lang.org/#help-wanted\">https://forge.rust-lang.org/#help-wanted</a></p>",
        "id": 245611800,
        "sender_full_name": "apiraino",
        "timestamp": 1626016366
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"232545\">@Joshua Nelson</span>  Honestly, that's the main problem. The whole compiler <em>feels</em> interesting and I'm kind of having a Netflix effect where there's a lot of issues, a lot of layers in rustc and picking one is hard <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> The only part I touched randomly involved stability markers in rustc_passes so i got to play a bit with the const providers and HIR but that was a stroke of luck to find this one</p>",
        "id": 245611897,
        "sender_full_name": "Lambinoo",
        "timestamp": 1626016536
    },
    {
        "content": "<p>if you're up for something a little tricky, I would <em>love</em> for this issue to get fixed: <a href=\"https://github.com/rust-lang/rust/issues/64762\">https://github.com/rust-lang/rust/issues/64762</a></p>",
        "id": 245611952,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1626016579
    },
    {
        "content": "<p>rustdoc had to implement its own reachability pass because rustc's is broken</p>",
        "id": 245611957,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1626016590
    },
    {
        "content": "<p>you could probably copy some code from <code>visit_ast</code> into rustc and see if that fixes it</p>",
        "id": 245611966,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1626016607
    },
    {
        "content": "<p>Ahah! Here's what I needed. A challenge and someone just taking a decision for me! Let me see what I can do :D</p>",
        "id": 245612291,
        "sender_full_name": "Lambinoo",
        "timestamp": 1626017082
    },
    {
        "content": "<p>if you get stuck, both I and <span class=\"user-mention silent\" data-user-id=\"123856\">Vadim Petrochenkov</span> would be good people to ask for help</p>",
        "id": 245612296,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1626017104
    }
]