[
    {
        "content": "<p>Hi all! I'm Ludvig, and I'm a bit interested in getting involved in Rust language design. Something I would be passionate about would be an actual grammar for the language. However, I had no luck finding support for this on the Discord, so I'll try here. If anyone could help, please write!</p>",
        "id": 241310835,
        "sender_full_name": "Ludvig Janiuk",
        "timestamp": 1622663635
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"417915\">@Ludvig Janiuk</span>!  There isn't a canonical grammar for the language.  There are a few different places you can look:</p>\n<ul>\n<li>The <a href=\"https://doc.rust-lang.org/nightly/reference/\">reference</a>. It has some known bugs, and doesn't cover some ambiguities, but is generally correct.</li>\n<li>The <a href=\"https://github.com/rust-lang/wg-grammar\">grammar working group</a> was an attempt to make a grammar specification, but it fizzled out.</li>\n<li>Rust-analyzer uses <a href=\"https://github.com/rust-analyzer/ungrammar/blob/master/rust.ungram\">this definition</a>, though I don't think it handles ambiguities? </li>\n</ul>\n<p>There are a bunch of older grammars out there, but I think most of them are quite out of date now.  The main source of truth is still <a href=\"https://github.com/rust-lang/rust/tree/master/compiler/rustc_parse\">rustc's implementation</a>.  <code>syn</code> is also a good parser, but I'm not sure how it compares to <code>rustc</code>.</p>",
        "id": 241319877,
        "sender_full_name": "Eric Huss",
        "timestamp": 1622667957
    },
    {
        "content": "<p>That rust-analyzer definition explicitly doesn't handle ambiguities. It only defines the shape of the language and allows more than the actual rust grammar.</p>",
        "id": 241321952,
        "sender_full_name": "bjorn3",
        "timestamp": 1622669139
    },
    {
        "content": "<p>Thanks for responding! The reference looks valuable, but is an informal description. I'll have to take a closer look at the Rust-analyzer ungrammar. Does anyone know some people that were leading the grammar working group that I could get in touch with, to talk about why it fizzled out?</p>",
        "id": 241377856,
        "sender_full_name": "Ludvig Janiuk",
        "timestamp": 1622719939
    },
    {
        "content": "<p>Looking at the WG's <a href=\"https://github.com/rust-lang/team/blob/master/teams/wg-grammar.toml\">team file</a> the current leads are <span class=\"user-mention silent\" data-user-id=\"119009\">eddyb</span> and <span class=\"user-mention silent\" data-user-id=\"116013\">qmx</span></p>",
        "id": 241379437,
        "sender_full_name": "Léo Lanteri Thauvin",
        "timestamp": 1622721024
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"255061\">@Léo Lanteri Thauvin</span>, I have reached out to them.</p>",
        "id": 241379887,
        "sender_full_name": "Ludvig Janiuk",
        "timestamp": 1622721329
    }
]