[
    {
        "content": "<p>Hey folks -- <span class=\"user-mention\" data-user-id=\"116011\">@Steve Klabnik</span> and I were working on a draft RFC regarding Rust 2021 and future editions. <a href=\"https://hackmd.io/jJflujmLS_-sFPUkYo417g?view\">The text is available in this hackmd</a>, feel free to leave comments. The gist of it is as follows:</p>\n<p>The plan for editions was laid out in [RFC 2052] and Rust had its first edition in 2018. This effort was in many ways a success but also resulted in some difficult lessons. As part of this year's roadmap, one of the major questions we identified was that we need to decide whether we are going to do more editions and -- if so -- how we are going to manage the process.</p>\n<p>[RFC 2052]: <a href=\"https://github.com/rust-lang/rfcs/blob/master/text/2052-epochs.md\">https://github.com/rust-lang/rfcs/blob/master/text/2052-epochs.md</a></p>\n<p>This RFC proposes a specific answer to those questions:</p>\n<ul>\n<li>We will do new Rust editions on a regular, three-year cadence.<br>\n    * We will roll out an edition regardless of whether there are breaking changes.</li>\n<li>Unlike Rust 2018, we will avoid using editions as a \"deadline\" to tie together high-priority projects.<br>\n    * Instead, we embrace the train model, but editions are effectively a \"somewhat bigger release\", giving us an opportunity to give an overview of all the work that has landed over the previous three years.</li>\n<li>We specify a cadence for Edition lints.<br>\n    * \"Edition idiom\" lints for Edition N will warn for editions before N, and become \"deny by default\" in Edition N.<br>\n    * Since it would be disruptive to introduce deny-by-default lints for Rust 2018 now, the Rust 2018 lints are repurposed into Rust 2021 Edition lints.</li>\n<li>We specify a policy on reserving keywords and other prospective changes.<br>\n    * In short, reserving keywords is allowed only as part of an active project group.</li>\n</ul>",
        "id": 203513614,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594391675
    },
    {
        "content": "<p>Interesting. Was there any thought to extending the \"train\" schedule period to four (or even five) years instead of three? New features are not generally blocked on edition releases, and I haven't gotten the feeling that a hypothetical 2021 edition will be particularly notable. So I wonder if setting in stone a three-year cadence might be overly aggressive for no reason.</p>",
        "id": 203555229,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1594413436
    },
    {
        "content": "<p>15 to 18 is 3, and people would hate it forever, and i mean quite literally <strong>forever</strong>, if one edition time frame was 3 and all the rest were some not-3 value.</p>",
        "id": 203558856,
        "sender_full_name": "Lokathor",
        "timestamp": 1594415872
    },
    {
        "content": "<p>The general idea was that EITHER:</p>\n<ul>\n<li>editions are something with a predictable schedule. if something misses an edition, it can make the next one</li>\n<li>editions happen when sufficient things pile up and are on their own schedule and unpredictable</li>\n</ul>\n<p>we went with the former. it's fine if the editions aren't notable, we would actually prefer for the editions to not be super notable, 2018 ended up being a lot of work to do at once</p>",
        "id": 203558943,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1594415924
    },
    {
        "content": "<p>2021 actually has at least one breaking change lined up for it so far, and even one such change is enough when part of the point is also to keep to a schedule so as to keep the process smooth.</p>",
        "id": 203559007,
        "sender_full_name": "Lokathor",
        "timestamp": 1594415994
    },
    {
        "content": "<p>(rather, it's <em>proposed</em> for 2021 but not fully ratified, etc etc)</p>",
        "id": 203559118,
        "sender_full_name": "Lokathor",
        "timestamp": 1594416057
    },
    {
        "content": "<p>IMO 5 years feels a bit on the long side, 3 years feels like a good cadence -- sort of exploration/development/polish type cycling</p>",
        "id": 203559234,
        "sender_full_name": "simulacrum",
        "timestamp": 1594416139
    },
    {
        "content": "<p>possible prior art: Haskell also lets you specify the spec you target (but no practical project follows those specs since everyone uses extensions all the time)</p>",
        "id": 203559951,
        "sender_full_name": "Lokathor",
        "timestamp": 1594416706
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224471\">@Lokathor</span> I've seen mention of a couple of potential changes; which one did you have in mind that's breaking?</p>",
        "id": 203580820,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1594443178
    },
    {
        "content": "<p>Ah, there I was thinking of the \"unsafe calls require unsafe blocks even within unsafe fn\" going from allow by default to deny by default.</p>",
        "id": 203580834,
        "sender_full_name": "Lokathor",
        "timestamp": 1594443240
    },
    {
        "content": "<p>Ah, that.</p>",
        "id": 203580879,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1594443318
    },
    {
        "content": "<p>I think we haven't <em>completely</em> committed to that changing in the 2021 edition; it seems likely, but we need to see how the warning does in the ecosystem first, I think.</p>",
        "id": 203580884,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1594443341
    },
    {
        "content": "<p>And we've seen a couple of cases where it introduce a lot of <code>unsafe fn foo() { unsafe {</code>, so it may be important to think about those ergonomics and that phrasing.</p>",
        "id": 203580928,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1594443388
    },
    {
        "content": "<p>As long as it's deny by default and never ever an unchangeable hard error it's fine</p>",
        "id": 203581004,
        "sender_full_name": "Lokathor",
        "timestamp": 1594443562
    },
    {
        "content": "<p>people can simply put an allow on their module</p>",
        "id": 203581007,
        "sender_full_name": "Lokathor",
        "timestamp": 1594443573
    },
    {
        "content": "<p>And speaking as a person who mostly writes libraries full of hundreds of unsafe functions and unsafe calls, it's a good thing for people to <em>by default</em> have an extra guard rail on.</p>",
        "id": 203581074,
        "sender_full_name": "Lokathor",
        "timestamp": 1594443662
    },
    {
        "content": "<p>Reading at the draft wouldn't the \"unsafe in unsafe\" be an \"idiom lint\" and thus be warn by default in 2021 not deny by default?</p>",
        "id": 203584173,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1594450430
    },
    {
        "content": "<p>There are several proposed \"migrations\"</p>",
        "id": 204134590,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594929277
    },
    {
        "content": "<p>the one I keep bringing up as an example is <a href=\"https://github.com/rust-lang/rfcs/issues/2229\">rfc#2229</a></p>",
        "id": 204134610,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594929294
    },
    {
        "content": "<p>another I just saw is a proposed change to the semantics of <code>panic!(\"{var}\")</code>, so that it would mean <code>panic!(\"{}\", var)</code>, essentially</p>",
        "id": 204134655,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594929320
    },
    {
        "content": "<p>there were more, too, but I forget =) I think one of the things we also talked about was reserving space for keyword arguments, but I'd be reluctant to do that (per this RFC) without active work going on in that space</p>",
        "id": 204134692,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594929351
    },
    {
        "content": "<p>it's hard to know the \"perfect\" duration for editions though indeed the hope is that they will be small and regular</p>",
        "id": 204134794,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594929401
    },
    {
        "content": "<p>what do you mean by \"reserving space\" here?</p>",
        "id": 204138249,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1594931240
    },
    {
        "content": "<p>I updated the RFC appendix with those two examples</p>",
        "id": 204206652,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594993198
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"120076\">BatmanAoD (Kyle Strand)</span> <a href=\"#narrow/stream/217588-project-leads.20(public)/topic/Edition.20policy/near/204138249\">said</a>:</p>\n<blockquote>\n<p>what do you mean by \"reserving space\" here?</p>\n</blockquote>\n<p>I meant basically making things like <code>foo(a=a)</code> become an error so that at some point the syntax can be repurposed for named arguments</p>",
        "id": 204206721,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594993217
    },
    {
        "content": "<p>just make it <code>foo(a:a)</code> instead</p>",
        "id": 204207351,
        "sender_full_name": "Lokathor",
        "timestamp": 1594993566
    },
    {
        "content": "<p>that is also valid syntax today</p>",
        "id": 204210082,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594994983
    },
    {
        "content": "<p>(type ascription)</p>",
        "id": 204210086,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594994987
    },
    {
        "content": "<p>(unstable, though)</p>",
        "id": 204210090,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594994990
    },
    {
        "content": "<p>but anyway the point is that the RFC, as written, prevents us from \"reserving syntactic space\" without a real plan. It would instead say that we should have an accepted RFC with the syntax we want and a plan to implement it -- and then we can make it an error as a first step in the next edition.</p>",
        "id": 204210223,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594995042
    },
    {
        "content": "<p>This works best if editions come out \"regularly\"</p>",
        "id": 204210248,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594995054
    }
]