[
    {
        "content": "<p>I'm looking at the conversation at <a href=\"https://github.com/rust-lang/rust/pull/95026\">https://github.com/rust-lang/rust/pull/95026</a> and <a href=\"https://github.com/rust-lang/compiler-team/issues/493\">https://github.com/rust-lang/compiler-team/issues/493</a> and I feel that it'd be a good idea to publicize this as widely as possible. I see that this will likely go out in the release notes and blog, but I was thinking of tweeting this out now, ahead of the official communications:</p>\n<blockquote>\n<p>PSA: The Rust team is considering increasing the minimum glibc required by some Tier 1 targets from 2.11 to 2.17.</p>\n</blockquote>\n<blockquote>\n<p>One of the reasons is LLVM is expected to raise the toolchain baseline to GCC 7.1, which is not supported by crosstool-ng versions that support glibc 2.11.</p>\n</blockquote>\n<blockquote>\n<p>For glibc, the minimum version is important for CI builds to have the desired compatibility in ELF symbol versions. RHEL 7 has glibc 2.17, while SLES 12 started with 2.19 and updated to 2.22 in SP2.</p>\n</blockquote>\n<blockquote>\n<p>You can see more information on the rationale at <a href=\"https://github.com/rust-lang/compiler-team/issues/493\">https://github.com/rust-lang/compiler-team/issues/493</a></p>\n</blockquote>\n<blockquote>\n<p>If you're a platform maintainer that might be affected, the announcement will likely be part of the next stable release's release notes, but the change will be made at a later release.</p>\n</blockquote>",
        "id": 276665891,
        "sender_full_name": "Esteban Küber",
        "timestamp": 1648235561
    },
    {
        "content": "<p>Would anyone object to me doing that? I'm concerned about driving low-effort comments to the PR (which is why I'm not posting to it directly), and can wait until official comms are sent out. But it felt like it'd be useful to leverage as many channels as possible for this change.</p>",
        "id": 276665989,
        "sender_full_name": "Esteban Küber",
        "timestamp": 1648235623
    },
    {
        "content": "<p>I'd personally do that only once we're in fcp and we have a timeline</p>",
        "id": 276666202,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1648235730
    },
    {
        "content": "<p>FCP makes sense</p>",
        "id": 276666228,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1648235748
    },
    {
        "content": "<p>My thinking is to make it so that interested parties can influence the fcp process, but I can understand if that is not desired at this stage</p>",
        "id": 276667067,
        "sender_full_name": "Esteban Küber",
        "timestamp": 1648236189
    },
    {
        "content": "<p>There's still time to comment once the issue enters FCP, but do you mean <span class=\"user-mention\" data-user-id=\"119031\">@Esteban Küber</span> that it'd better to get feedback before that point?</p>",
        "id": 276668367,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1648236805
    },
    {
        "content": "<p>Yeah</p>",
        "id": 276668395,
        "sender_full_name": "Esteban Küber",
        "timestamp": 1648236819
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"121055\">@Pietro Albini</span> do we have a mailing list for downstream packagers?</p>",
        "id": 276668596,
        "sender_full_name": "Esteban Küber",
        "timestamp": 1648236904
    },
    {
        "content": "<p>no</p>",
        "id": 276669558,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1648237431
    },
    {
        "content": "<p>I would personally avoid tweeting and such until you have a link to a blog post, potentially one dedicated to this - that way there's an easy official artifact to point to.</p>\n<p>If you have bandwidth to write that up, that'd be amazing - I imagine the content would be pretty similar to the suggested tweets.</p>",
        "id": 276737385,
        "sender_full_name": "simulacrum",
        "timestamp": 1648316938
    },
    {
        "content": "<p>I like that idea (sorry, way delayed)</p>",
        "id": 277309258,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1648745126
    }
]