[
    {
        "content": "<p>I think we need a new RFC template. Or maybe additional alternative templates, as alternatives to the one we have now.</p>\n<p>The one we have now is structured with these \"Guide-level explanation\" and \"Reference-level explanation\" sections, which doesn't really work well for things that aren't new language features. In my RFCs, I've mostly ignored them and divided it up in different sections that work better for what I'm trying to get across, but it seems that most RFC authors try to force their rfc into this format even when it doesn't fit nicely.</p>\n<p>I think the current template can sometimes form a bit of a barrier for someone to write an RFC, if they just want to explain their new library api idea for example, but now need to somehow find a way to split their explanation in these sections.</p>\n<p>I was thinking to add a few different styles of templates. E.g. a \"problem(s)\" and \"solution(s)\" template, or a \"goal(s)\" and \"plan\" template, or a template that's more focussed on changing or removing something rather than adding something new.</p>\n<p>Or alternatively to just simplify the current template, saying that everyone is free to pick their own structure, as long as the document addresses the motivation, alternatives, drawbacks, etc., and has enough detail.</p>\n<p><span class=\"user-group-mention\" data-user-group-id=\"1977\">@T-lang</span> <span class=\"user-group-mention\" data-user-group-id=\"2645\">@T-libs-api</span> <span class=\"user-group-mention\" data-user-group-id=\"3139\">@T-cargo</span> <span class=\"user-group-mention\" data-user-group-id=\"3925\">@T-rustdoc</span> thoughts?</p>",
        "id": 274728577,
        "sender_full_name": "Mara",
        "timestamp": 1646849150
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> for revising the template. I think we've had some pending improvements for a while, and some of them have stalled due to lack of clear reviewer/ownership. I think we need to move past that and start making some rough-consensus improvements.</p>",
        "id": 274733590,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646851507
    },
    {
        "content": "<p>I would ideally love to keep a single unified template; there's value in process similarity. But we need to make it easy to use for many different teams.</p>",
        "id": 274733731,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646851566
    },
    {
        "content": "<p>And I agree with telling people that it's better to tweak the structure of the template than to hammer your documentation until it precisely fits that template.</p>",
        "id": 274733860,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646851626
    },
    {
        "content": "<p>I think it would be great to make some improvements to the template.  It might be helpful to collect some specific examples of where following the template didn't work well.</p>\n<p>I could have sworn there was already something written somewhere that said to not fill in sections that are not relevant, but I can't find it.</p>",
        "id": 274734709,
        "sender_full_name": "Eric Huss",
        "timestamp": 1646852016
    },
    {
        "content": "<p>I don't quite see the value in keeping a single template if different use-cases are expected to have substantially different RFC structures. The overall process can be the same; but shoehorning diverse needs into a single template seems a bit like the meta-level version of shoehorning diverse content into a single template.</p>\n<p>That said, I'm not sure whether it's actually true that different use cases will have such different structures, or if it's just the existence of the \"guide level explanation\" section that isn't always applicable.</p>",
        "id": 274740789,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1646854555
    },
    {
        "content": "<p>here's an example of an rfc where i used a different structure: <a href=\"https://rust-lang.github.io/rfcs/3007-panic-plan.html\">https://rust-lang.github.io/rfcs/3007-panic-plan.html</a></p>",
        "id": 274741427,
        "sender_full_name": "Mara",
        "timestamp": 1646854856
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120076\">@BatmanAoD (Kyle Strand)</span> I actually think \"guide-level explanation\" (with a different title) is one of the sections more likely to be common: \"explain this to an end user\" seems appropriate.</p>",
        "id": 274741911,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646855077
    },
    {
        "content": "<p>The distinction between that and \"reference-level explanation\" seems less common, and I'd love to combine that with earlier documentation.</p>",
        "id": 274741988,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646855117
    },
    {
        "content": "<ul>\n<li>Title/Summary/metadata</li>\n<li>What problem are you proposing to solve? (formerly \"motivation\")</li>\n<li>What's your proposed solution?</li>\n<li>How would you explain the solution to an end user, if it were already available?</li>\n<li>What are the downsides of your proposal?</li>\n<li>What are some alternative solutions (including not solving the problem at all), and the tradeoffs between them?</li>\n<li>Are there open questions that you expect to solve through experimentation after this proposal is accepted?<br>\n...</li>\n</ul>",
        "id": 274742131,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646855184
    },
    {
        "content": "<p>Er, sorry, I meant reference-level.</p>",
        "id": 274743301,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1646855737
    },
    {
        "content": "<p>Perhaps different teams should be creating slightly different templates? I think the guide/reference thing works well for lang features, but not necessarily other things</p>",
        "id": 274750760,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1646859201
    },
    {
        "content": "<p>Or perhaps we have flexibility in the exact choice of sections (you can have a single \"explanation\" section if it wouldn't go in the guide)</p>",
        "id": 274750786,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1646859214
    },
    {
        "content": "<p>also lol \"guide level explanation\" comes from back when we _had_ a guide (now it's the book, and not everything belongs there)</p>",
        "id": 274750925,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1646859265
    },
    {
        "content": "<p>i do like josh's proposal</p>",
        "id": 274750938,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1646859269
    },
    {
        "content": "<p>i prefer a \"these questions need to be answered by your document\" over a \"these sections you need to fill in\" template.</p>",
        "id": 274752443,
        "sender_full_name": "Mara",
        "timestamp": 1646859992
    },
    {
        "content": "<p>i recently said this in another thread:</p>\n<blockquote>\n<p>if the standard RFC template doesn't work, feel free to structure it differently. the document just needs to have all the information/answers/motivation so an informed decision can be made, in whatever way is most useful. (I'm saying this because the standard 'guide level explanation' and 'reference level explanation' sections in the rfc template are more focussed at new (language) features, and might not work well for proposals like this.)</p>\n</blockquote>",
        "id": 274752554,
        "sender_full_name": "Mara",
        "timestamp": 1646860060
    },
    {
        "content": "<p>A few thoughts:</p>",
        "id": 274906139,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1646952058
    },
    {
        "content": "<p>I've come to think of RFCs as mostly about specifying \"how does this feel to an end-user\"</p>",
        "id": 274906153,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1646952068
    },
    {
        "content": "<p>and much less about details</p>",
        "id": 274906164,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1646952078
    },
    {
        "content": "<p>there have to be enough to convince everyone that it can work and pin down imp't questions</p>",
        "id": 274906207,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1646952100
    },
    {
        "content": "<p>in other words, I think that the initiative process kind of changes the game about what should go where</p>",
        "id": 274906231,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1646952117
    },
    {
        "content": "<p>also: I really think every RFC should have a FAQ section, it's a very useful structure</p>",
        "id": 274906301,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1646952138
    },
    {
        "content": "<p>I've noticed that when I author similar documents, I tend to break it down into like</p>\n<ul>\n<li>Motivation and intro</li>\n<li>High-level description</li>\n<li>Details</li>\n<li>FAQ</li>\n</ul>",
        "id": 274906367,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1646952179
    },
    {
        "content": "<p>I think the whole structure of RFCs is wrong and we probably should rely more on initiatives and other structures to do open design. However, I think it is worth changing the template as an incremental change. Like Mara, I would much rather see a description of requirements rather than a prescription of the structure of the RFC. I think a hybrid approach is probably best, e.g., have a template which is the metadata at the top, a title (please lets add a title to RFCs!), a summary (which is missing at the moment and necessary IMO), a freeform area, and a FAQ (which might be initially empty and built up during discussion). We specify that the freeform part should motivate the change, describe them in detail from a user's perspective, and discuss implementation details as appropriate for the feature. For the latter, we should encourage linking out to preliminary implementations, a repo or initiative for design work, or whatever.</p>",
        "id": 274959040,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1646995856
    },
    {
        "content": "<p>What I like about initiatives is that the design is not a \"single document\" but a focus more on an iterative process</p>",
        "id": 275276117,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1647281372
    },
    {
        "content": "<p>Anyway, mostly just \"agree\"</p>",
        "id": 275276135,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1647281378
    }
]