[
    {
        "content": "<p>An interesting question came up in <a href=\"https://github.com/rust-lang/rust/issues/73450#issuecomment-650463347\">this comment</a>. We currently ban the frame pointer from being used as an operand because LLVM will miscompile if the function happens to need a frame pointer. However if the function does <em>not</em> need a frame pointer then LLVM might choose to use the frame pointer for a <code>reg</code> operand. This can lead to some code being subtly wrong as shown in the linked comment.</p>",
        "id": 202258687,
        "sender_full_name": "Amanieu",
        "timestamp": 1593383758
    },
    {
        "content": "<p>I would ultimately call this a bug in LLVM, frame pointer is not something that must be preserved throughout the function I think</p>",
        "id": 202259956,
        "sender_full_name": "nagisa",
        "timestamp": 1593385931
    },
    {
        "content": "<p>some approaches to unwinding could rely on it…  I guess.</p>",
        "id": 202259964,
        "sender_full_name": "nagisa",
        "timestamp": 1593385975
    },
    {
        "content": "<p>but that’s a platform-specific, or even a project-specific concern, not something that should be enforced globally.</p>",
        "id": 202259975,
        "sender_full_name": "nagisa",
        "timestamp": 1593386002
    },
    {
        "content": "<p>maybe there's some other reason I don’t know about, though.</p>",
        "id": 202260039,
        "sender_full_name": "nagisa",
        "timestamp": 1593386101
    },
    {
        "content": "<p>So, there's an interesting similarity between this and vector registers.</p>",
        "id": 202347069,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1593453821
    },
    {
        "content": "<p>There are environments where you cannot safely use any of the vector registers, such as because you're in an OS kernel and userspace is using them.</p>",
        "id": 202347160,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1593453860
    },
    {
        "content": "<p>But you may be able to use vector registers and vector instructions in a function that carefully arranges to be able to do so.</p>",
        "id": 202347257,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1593453926
    }
]