[
    {
        "content": "<p>The triage group asked for an update on a PR intended to fix the soundness hole that enables <code>panic</code>s to propagate across a <code>nounwind</code> function boundary without the use of <code>unsafe</code>. This PR is one of many related to <code>nounwind</code> safety with <code>extern</code> functions.</p>\n<p>I don't believe it is within this group's purview to make recommendations to the language team <em>before</em> submitting an RFC, but the topic is very closely related to our efforts, so I have left a comment there paraphrasing the three \"immediately ready\" fixes for the soundness issue and explaining that the project group has no timeline for delivering an RFC that will resolve the concerns that have kept the \"immediate\" fixes from being adopted.</p>\n<p><a href=\"https://github.com/rust-lang/rust/pull/64315#issuecomment-554135743\" target=\"_blank\" title=\"https://github.com/rust-lang/rust/pull/64315#issuecomment-554135743\">https://github.com/rust-lang/rust/pull/64315#issuecomment-554135743</a></p>",
        "id": 180788544,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1573775159
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> maybe I should have discussed that with you first... I forgot about it during our chat earlier. Sorry!</p>",
        "id": 180788632,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1573775211
    },
    {
        "content": "<p>Thanks for the summary, I think it properly covers all options I'm at least aware of <span class=\"user-mention\" data-user-id=\"120076\">@Kyle Strand</span> .</p>",
        "id": 180830122,
        "sender_full_name": "gnzlbg",
        "timestamp": 1573823505
    },
    {
        "content": "<p>FWIW I don't think my solution is great, it just the most minimal way of fixing the soundness bug I was able to come up with. Having <code>unsafe</code> affect codegen is weird at best, and many argue that it is a bad idea.</p>",
        "id": 180830235,
        "sender_full_name": "gnzlbg",
        "timestamp": 1573823607
    },
    {
        "content": "<p>@gnzlbg Thanks! I think it's clear from the thread that many people think it's a bad idea, but if you no longer think it's a good idea, I would almost suggest closing the PR. (In fact, RalfJ's PR is already closed, but I still listed it as one of the possibilities for an \"immediate fix\".)</p>",
        "id": 180833540,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1573826079
    },
    {
        "content": "<p>I think its bad, but its the best alternative I've heard.</p>",
        "id": 180835989,
        "sender_full_name": "gnzlbg",
        "timestamp": 1573827635
    },
    {
        "content": "<p>AFAICT the alternatives are \"not closing the soundness bug\", or waiting for somebody to properly analyze the impact / implications of ralf's PR, which seem less controversial, but haven't made progress either (which is also bad).</p>",
        "id": 180836053,
        "sender_full_name": "gnzlbg",
        "timestamp": 1573827685
    },
    {
        "content": "<p>My solution can be merged right now, and it closes the soundness bug, with minimal changes right now.</p>",
        "id": 180836083,
        "sender_full_name": "gnzlbg",
        "timestamp": 1573827712
    },
    {
        "content": "<p>If at some point Ralf's solution has consensus, it can also be applied, since it doesn't introduce the soundness bug.</p>",
        "id": 180836144,
        "sender_full_name": "gnzlbg",
        "timestamp": 1573827733
    },
    {
        "content": "<p>Like, as long as the soundness bug is not re-introduced, I don't really mind.</p>",
        "id": 180836174,
        "sender_full_name": "gnzlbg",
        "timestamp": 1573827752
    },
    {
        "content": "<p>I personally would favor applying Ralf's change to stop applying nounwind.</p>",
        "id": 180883444,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1573861609
    },
    {
        "content": "<blockquote>\n<p>I personally would favor applying Ralf's change to stop applying nounwind.</p>\n</blockquote>\n<p>I think it's entirely up to the lang team, so I shall not give further input until asked for my opinion! :D</p>",
        "id": 180884869,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1573863179
    },
    {
        "content": "<p>(It is a strenuous exercise in self-control.)</p>",
        "id": 180884891,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1573863213
    },
    {
        "content": "<p>So, the last time this came up in a lang team meeting, the general sentiment was very much \"let's leave it up to the ffi-unwind team\". :)</p>",
        "id": 180908098,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1573902573
    },
    {
        "content": "<p>Ah! I had thought that the decision was to wait for us to provide a \"full\" solution, i.e., one that would introduce the \"opt out\" mechanism. But that was back when we were fairly confident that an opt-out mechanism was needed, and that the default abort-on-unwind behavior should be stabilized as soon as an opt-out was stabilized. Now that we are reconsidering the default, and don't see a \"quick\" path to a full solution, I think the situation is substantially different and does require another lang-team decision (even if the decision is \"we'll land whichever of those three solutions you recommend\", or \"the project-FFI group should choose between these two options\").</p>",
        "id": 180909948,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1573906403
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 180922994,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1573929000
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120076\">@Kyle Strand</span> We've talked about the individual RFCs and PRs, and in each case we want to defer both short-term and long-term solutions to the recommendations of the ffi-unwind team.</p>",
        "id": 180923062,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1573929075
    },
    {
        "content": "<p>We do have the same concern about solutions that would make <code>unsafe</code> have semantic significance.</p>",
        "id": 180923110,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1573929128
    },
    {
        "content": "<p>But, for instance, a short-term PR that removes nounwind, or a similar short-term solution, is one we'd be happy to merge if recommended by the ffi-unwind team.</p>",
        "id": 180923147,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1573929197
    },
    {
        "content": "<p>And I think such a recommendation would help us unstick things that have not made forward progress.</p>",
        "id": 180923203,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1573929250
    },
    {
        "content": "<p>Okay. I would recommend RalfJ's PR then.</p>",
        "id": 180923716,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1573930190
    },
    {
        "content": "<p>This does bring to my attention that this group has an extremely loose concept of membership and no mechanism for voting or consensus...</p>",
        "id": 180924113,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1573930872
    },
    {
        "content": "<blockquote>\n<p>But, for instance, a short-term PR that removes nounwind, or a similar short-term solution, is one we'd be happy to merge if recommended by the ffi-unwind team.</p>\n</blockquote>\n<p>What I said on the meeting is basically that I would be willing to listen to arguments, but that any decision is not delegated to the WG; also I haven't heard anything new that would make me happy to merge the PR</p>",
        "id": 180932469,
        "sender_full_name": "centril",
        "timestamp": 1573946099
    },
    {
        "content": "<p>In this case, the lang team could try a \"veto\" approach. It sounds like Centril would veto the approach of no longer emitting nounwind by default, and JoshT would veto the approach of changing the codegen based on the presence of <code>unsafe</code> (a veto that I agree with). That leaves the option of re-stabilizing the abort logic. If no one on the lang team feels equally strongly against that option, perhaps it's the best temporary solution.</p>",
        "id": 180933027,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1573947195
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"126931\">@centril</span> I'm not suggesting that we're delegating the decision; I'm suggesting that we're seeking a recommendation.</p>",
        "id": 180936369,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1573953507
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120076\">@Kyle Strand</span> Several people on the lang team felt uncomfortable with the abort approach precisely because it breaks existing code. I don't think that has changed.</p>",
        "id": 180936383,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1573953561
    },
    {
        "content": "<p>In its current state (with <code>nounwind</code>), the code is already broken (even without the \"it's UB so it's broken by definition\" argument). Also, there are at least two projects that previously would have been broken by this change but no longer will be. rlua (and anything else using <code>longjmp</code>) was fixed by Alex Crichton (I can find the PR later, but this is explained in the PR thread for <a href=\"https://github.com/rust-lang/rust/issues/64315\" target=\"_blank\" title=\"https://github.com/rust-lang/rust/issues/64315\">#64315</a>), and Lucet is now on nightly and uses <code>#[unwind(allowed)]</code>.</p>",
        "id": 180936573,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1573953960
    },
    {
        "content": "<p>This one? <a href=\"https://github.com/rust-lang/rust/pull/48572\" target=\"_blank\" title=\"https://github.com/rust-lang/rust/pull/48572\">https://github.com/rust-lang/rust/pull/48572</a></p>",
        "id": 180949080,
        "sender_full_name": "Amanieu",
        "timestamp": 1573980253
    },
    {
        "content": "<p>Yes, thanks!</p>",
        "id": 180955210,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1573992488
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"126931\">@centril</span> One reason I think RalfJ's PR is the best one to merge is because it is the one with the least-visible effect, which allows this group to continue working on a permanent solution. We would still consider the behavior undefined, and we would not encourage users to unwind across FFI boundaries. But we would be making user code less risk/error/UB prone in the case that this feature _is_ being used.</p>\n<p>Conversely, if we re-stabilize abort-on-unwind, that simply forces users to do one of the following:</p>\n<ul>\n<li>pin their rust version - possibly to one that emits <code>nounwind</code> in a way that breaks their code in a more subtle and dangerous way</li>\n<li>switch to nightly - not something I feel we should encourage in general</li>\n<li>use the \"bootstrap trick\" to enable <code>unwind(allowed)</code> on stable - this also seems like something we generally want to discourage where possible</li>\n<li>Stop unwinding over FFI boundaries - I doubt many users who are intentionally doing so will stop when the other options are available</li>\n</ul>",
        "id": 180974720,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1574028214
    }
]