[
    {
        "content": "<p>Hello all! I'm looking to provide a very brief and very high level summary of <a href=\"https://github.com/rust-lang/rfcs/pull/2945\">https://github.com/rust-lang/rfcs/pull/2945</a> on this week's \"This Week in Rust\" podcast. Does this summary sound accurate?</p>\n<ul>\n<li>Unwinding is what happens when a program you are running encounters an exception. When the exception is thrown, the runtime for the program will unwind the stack and essentially traverse backward through it, calling any clean up or error recovery code.</li>\n<li>\n<p>Even though Rust does not implement exceptions the way languages like Java or C++ do, it does support unwinding under two conditions<br>\n1) When rust code panics, it unwinds the stack<br>\n2) When Rust is interfacing with another programming language with exceptions, like C++, it can call functions in that language to unwind the stack.</p>\n</li>\n<li>\n<p>Currently, when foreign code - that means code not written in Rust - invokes Rust code and the Rust code panics and unwinds, the result of that unwind will not be available to the foreign code.</p>\n</li>\n<li>Likewise when Rust code calls foreign code and that foreign code throws an exception and unwinds, the result of that unwind will not be available to the Rust code</li>\n<li>This RFC seeks to change that by defining an ABI - or Application Binary Interface - that would enable unwinding from other languages (such as C++) into Rust frames and from Rust into other languages.</li>\n</ul>",
        "id": 201679679,
        "sender_full_name": "Nell Shamrell-Harrington",
        "timestamp": 1592875186
    },
    {
        "content": "<p>Looking forward to the podcast!</p>\n<p>This RFC is somewhat more limited than that; it won't provide a way for Rust to actually access an exception object itself thrown by C++, or for C++ to access a <code>panic</code> object. The <code>\"C unwind\"</code> ABI will simply make it safe to unwind C++ frames with a Rust <code>panic</code> (or Rust frames with a C++ exception), which some crates are already doing even though it is currently undefined behavior. In order to recover from a <code>panic</code> and resume normal execution, the <code>panic</code> must still be caught by Rust, not by C++; similarly, C++ exceptions can only be caught by C++.</p>\n<p>Otherwise, that summary seems fairly good, though I'd suggest a few tweaks. We're defining a new ABI string, but not a new ABI per se; also, I would say \"throws an exception\" rather than \"encounters an exception\". (You could also combine the first two bullets; it's probably sufficient to define unwinding as \"how C++ exceptions and Rust <code>panic</code>s are implemented.\")</p>",
        "id": 201689629,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1592890956
    },
    {
        "content": "<p>That is very helpful, thank you!</p>",
        "id": 201749298,
        "sender_full_name": "Nell Shamrell-Harrington",
        "timestamp": 1592929788
    }
]