[
    {
        "content": "<p>I tried out <code>const_evaluatable_checked</code> — it's very cool (and worked better than I thought), but I have a question about the design:</p>\n<p>Is there an intention that eventually the bounds it requires for expressions to be inferred eventually? I don't mind it so much in the module defining the type (although it gets very tedious on every impl block), but code using the type have to repeat the exact bound (if it instantiates using const generics), which feels like a abstraction leak a little (especially when a tweak to that expression requires many updates to usage codes bounds...)</p>\n<p>I know I can write a const fn to alleviate this, I'm more asking: is this deliberate — or am I just cutting myself on a bleeding edge?</p>",
        "id": 215973827,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1604783657
    },
    {
        "content": "<p>do you have a concrete example of what you mean here?</p>",
        "id": 215978124,
        "sender_full_name": "lcnr",
        "timestamp": 1604790840
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209168\">@Thom Chiovoloni</span> I think this is deliberate: Technically any such change is a breaking change and you generally want that to be obvious. If you forsee the bound changing often, definitely abstract it into a <code>const fn</code>.</p>",
        "id": 216002801,
        "sender_full_name": "jplatte",
        "timestamp": 1604835089
    },
    {
        "content": "<p>I get that, but it means making apis with it is fragile in a way almost nothing else in rust is. It defaults to all the implementation details being important.</p>",
        "id": 216124587,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1604946323
    },
    {
        "content": "<p>This has been discussed at length in <a href=\"https://github.com/rust-lang/rust/issues/68436\">https://github.com/rust-lang/rust/issues/68436</a>. My takeaway is that there's just not going to be implicit bounds, for good reasons. Maybe there will be some inference for them, but only in the kind of ways that are also being explored / worked on for type generics.</p>",
        "id": 216125943,
        "sender_full_name": "jplatte",
        "timestamp": 1604946963
    },
    {
        "content": "<blockquote>\n<p>I get that, but it means making apis with it is fragile in a way almost nothing else in rust is. It defaults to all the implementation details being important.</p>\n</blockquote>\n<p>can you please add an example?</p>",
        "id": 216142726,
        "sender_full_name": "lcnr",
        "timestamp": 1604955886
    }
]