[
    {
        "content": "<p>So I've really tried to understand this but I don't really get it. It's probably my lack of arm/aarch64 knowledge but in &lt;<a href=\"https://github.com/rust-lang/rust/pull/84725/files\">https://github.com/rust-lang/rust/pull/84725/files</a>&gt;, why is only the code in the <code>target_arch = \"aarch64\"</code> macro branch changed to do <code>crate::arch::aarch64::__isb(crate::arch::aarch64::SY)</code> instead of <code>crate::arch::aarch64::__yield()</code> when the code in the <code>target_arch = \"arm\"</code> macro branch below could also be changed to do <code>crate::arch::arm::__isb(crate::arch::arm::SY)</code> instead of <code>crate::arch::arm::__yield()</code>? Why weren't both changed to use <code>__isb</code>? (Note: in the files view click on Expand Down to see the second macro branch)</p>",
        "id": 236793001,
        "sender_full_name": "ruster",
        "timestamp": 1619765465
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"376093\">@ruster</span> Nothing special about aarch64 here. Rather, aarch64 processors implement a similar instruction set to other Arm processors, but can have very distinct performance characteristics because they exclusively are in the set of \"application\" microprocessors for Arm v8 or v9, which are designed for conventional software instead of embedded use-cases, and are of a particular generation, so there's no reason to immediately assume that other Arm chips have similar performance characteristics and thus would actually benefit.</p>",
        "id": 236795196,
        "sender_full_name": "Jubilee",
        "timestamp": 1619766852
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281757\">@Jubilee</span>  Oh I see, so it would be better to benchmark before assuming it's faster. Makes sense now.</p>",
        "id": 236795599,
        "sender_full_name": "ruster",
        "timestamp": 1619767166
    },
    {
        "content": "<p>Right. Certain instructions can even be faster on an Arm v7 chip than on an Arm v8, in spite of Arm v8 being an overall improvement, and even within the same \"subset\" (application or embedded or realtime processors). I know of at least one example of that cropping up on Arm, and that's certainly the case with x86 chips. Probably common when the pipelines change in some way?</p>",
        "id": 236796461,
        "sender_full_name": "Jubilee",
        "timestamp": 1619767787
    }
]