[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"369415\">xFrednet</span> has marked this topic as resolved.</p>",
        "id": 266610374,
        "sender_full_name": "Notification Bot",
        "timestamp": 1641124145
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"369415\">xFrednet</span> <a href=\"#narrow/stream/182449-t-compiler.2Fhelp/topic/.E2.9C.94.20Target.20release.20channel.20for.20Clippy/near/266568600\">said</a>:</p>\n<blockquote>\n<p>Now I'm looking a bit at the bootstrapping process to figure out if we can potentially enable/disable a feature based on the channel <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>\n</blockquote>\n<p>The right way to do this is with UnstableFeatures. If you make it conditional on the channel, tests will start failing when the release team promotes the toolchain to beta.</p>",
        "id": 266637254,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1641164108
    },
    {
        "content": "<p>Thank you for pointing that out <span class=\"user-mention\" data-user-id=\"232545\">@Joshua Nelson</span>. Would it be sufficient to ignore the tests based on the channel? I'm currently trying to make all the relevant changes at compile time, which means that <code>Unstablefeatures</code> are not available</p>",
        "id": 266664032,
        "sender_full_name": "xFrednet",
        "timestamp": 1641200485
    },
    {
        "content": "<p>that's a question for <span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> or <span class=\"user-mention\" data-user-id=\"121055\">@Pietro Albini</span></p>",
        "id": 266740356,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1641246377
    },
    {
        "content": "<p>I'm confused by the desire -- maybe you can elaborate a bit more?</p>",
        "id": 266740467,
        "sender_full_name": "simulacrum",
        "timestamp": 1641246466
    },
    {
        "content": "<p>The general goal has always been that rustc tools are equivalent regardless of the target channel (so that RUSTC_BOOTSTRAP ~always works)</p>",
        "id": 266740540,
        "sender_full_name": "simulacrum",
        "timestamp": 1641246504
    },
    {
        "content": "<p><a href=\"https://github.com/rust-lang/rust-clippy/issues/6623\">https://github.com/rust-lang/rust-clippy/issues/6623</a> seems to suggest the motivation is to stop folks from seeing lint warnings \"too soon\" (i.e., keeping things to nightly), but a UnstableFeatures based switch should be good enough for that in theory.</p>",
        "id": 266740744,
        "sender_full_name": "simulacrum",
        "timestamp": 1641246647
    },
    {
        "content": "<p>(modulo what <span class=\"user-mention silent\" data-user-id=\"116122\">simulacrum</span> said, <code>// only-nightly</code> is what you should use for compiletests)</p>",
        "id": 266740783,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1641246679
    },
    {
        "content": "<p>But adding a bunch of those increases risk at e.g. beta backport time, so it should be very cautiously done in general.</p>",
        "id": 266740964,
        "sender_full_name": "simulacrum",
        "timestamp": 1641246790
    },
    {
        "content": "<p>I might be missing something, but I don't see how that would increase the risk at beta backport time: both clippy having more lints in nightly, and some clippy tests only being executed in nightly won't have effects on the promotion from stable to beta nor backporting stuff to beta, as beta strictly accepts more code and runs more tests</p>",
        "id": 266741281,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1641247031
    },
    {
        "content": "<p>even though, if we go with the \"some clippy lints are only enabled on nightly\" rule it'd be better if the tests were annotated with the clippy lint name in the attribute, so that the \"nightly-only\" could be removed from the test along with the lint being ungated</p>",
        "id": 266741415,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1641247126
    },
    {
        "content": "<p>(it'd be annoying if we just end up with a bunch of tests annotated \"nightly-only\" without a programmatic way to determine <em>why</em> they were marked that way, even though that currently applies for a lot of our test suite anyway)</p>",
        "id": 266741471,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1641247162
    },
    {
        "content": "<p>If the disabling of the lint is faulty (e.g., it ICEs when that lint doesn't run or similar), then the test may 'pass' on the beta channel due to only-nightly hiding that.</p>\n<blockquote>\n<p>as beta strictly accepts more code and runs more tests</p>\n</blockquote>\n<p>I'm confused by this -- only-nightly at least on a surface level implies running <strong>less</strong> tests?</p>",
        "id": 266741890,
        "sender_full_name": "simulacrum",
        "timestamp": 1641247338
    },
    {
        "content": "<p>typo, sorry <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 266741965,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1641247404
    },
    {
        "content": "<blockquote>\n<p>If the disabling of the lint is faulty (e.g., it ICEs when that lint doesn't run or similar)</p>\n</blockquote>\n<p>do you mean the clippy code handling the disable of the lint ICEs, or the compiler ICEs if the lint doesn't prevent that code pattern?</p>",
        "id": 266742057,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1641247456
    },
    {
        "content": "<p>for the latter, if the lint would prevent the compiler ICEing it shouldn't be in clippy IMO</p>",
        "id": 266742085,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1641247474
    },
    {
        "content": "<p>clippy code ICEs (e.g., no longer sets some global variable, who knows)</p>",
        "id": 266742184,
        "sender_full_name": "simulacrum",
        "timestamp": 1641247551
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116122\">simulacrum</span> <a href=\"#narrow/stream/182449-t-compiler.2Fhelp/topic/.E2.9C.94.20Target.20release.20channel.20for.20Clippy/near/266740744\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://github.com/rust-lang/rust-clippy/issues/6623\">https://github.com/rust-lang/rust-clippy/issues/6623</a> seems to suggest the motivation is to stop folks from seeing lint warnings \"too soon\" (i.e., keeping things to nightly), but a UnstableFeatures based switch should be good enough for that in theory.</p>\n</blockquote>\n<p>In the past, we had some lints which were on nightly for only two weeks until beta was branched off, in that time we got some feedback and false positive reports which couldn't be fixed in time. To improve this, we would like to restrict new lints to nightly for some time to get feedback and to ensure that only fully tested and discussed lints are stabilized. Additionally, it would be nice if only lint passes with stable lints would be registered to avoid some ICEs on stable. (This references ICEs in Clippy code or due to incorrect rustc API usage)</p>\n<p>I had an idea how this could be done with a bunch of compile time checks and some fancy logic. That's why I asked if the targeted release channel is known at compile time. After a debate with other team members, getting your feedback and looking a bit into my idea, I think that it's not the best and correct solution. </p>\n<p>Instead, I have proposed another solution which can use <code>Unstablefeatures</code> and doesn't use compile time checks. The new implementation would register the lint as usual but change the lint level based on the value of <code>Unstablefeatures</code> and only registering nightly lints in their lint group if <code>Unstablefeatures</code> are enabled. This would not prevent ICEs from the LintPass, but prevent lint emissions on stable as long as the user doesn't specifically change the lint level. As an added benefit, it's comparatively easy to implement. We can also test on all releases as long as we include a <code>#[warn]</code> attribute for the tested lint  :upside_down_face:</p>",
        "id": 266751134,
        "sender_full_name": "xFrednet",
        "timestamp": 1641253786
    },
    {
        "content": "<p>Can you say more about not being able to fix them in time? I'd expect a beta backport making the lint allow by default to be the typical solution to false positives, for example, and a complete removal if it causes ices - it's not clear to me that the unstable features bit is necessarily a good idea: generally behavior differences like that can be pretty annoying (e.g., if you're reproducing a bug report and want to pass some -Z flag on stable compilers, now that becomes painful if it breaks things in a dependency when RUSTC_BOOTSTRAP is set).</p>",
        "id": 266754133,
        "sender_full_name": "simulacrum",
        "timestamp": 1641256058
    },
    {
        "content": "<p>At minimum I would recommend an env variable to opt out of this specific behavior (or -Z flag, maybe).</p>",
        "id": 266754205,
        "sender_full_name": "simulacrum",
        "timestamp": 1641256095
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116122\">simulacrum</span> <a href=\"#narrow/stream/182449-t-compiler.2Fhelp/topic/.E2.9C.94.20Target.20release.20channel.20for.20Clippy/near/266754133\">said</a>:</p>\n<blockquote>\n<p>Can you say more about not being able to fix them in time?</p>\n</blockquote>\n<p>ICE Fixes for lints are typically parted back to beta, that is true. Setting a lint to allow by default has been a solution for lints with a high FP rate. However, often these are just fixed on master and then released with the next version. Back porting every  fix would be a lot of work and might introduce new bugs. Changing the lint level and group whenever we get a significant FP report still takes some work. The idea was to also reduce the need to back port for these cases. </p>\n<p><span class=\"user-mention silent\" data-user-id=\"116122\">simulacrum</span> <a href=\"#narrow/stream/182449-t-compiler.2Fhelp/topic/.E2.9C.94.20Target.20release.20channel.20for.20Clippy/near/266754133\">said</a>:</p>\n<blockquote>\n<p>It's not clear to me that the unstable features bit is necessarily a good idea: generally behavior differences like that can be pretty annoying (e.g., if you're reproducing a bug report and want to pass some -Z flag on stable compilers, now that becomes painful if it breaks things in a dependency when RUSTC_BOOTSTRAP is set).</p>\n</blockquote>\n<p>Aren't <code>UnstableFeatures</code> used to determine if unstable features are enabled? My understanding was that these should only be enabled on nightly, like the -Z flags as well. <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span> Introducing an environment value to disable nightly filtering is definitely possible and something I'll suggest <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 266787612,
        "sender_full_name": "xFrednet",
        "timestamp": 1641289535
    },
    {
        "content": "<p>One obvious concern is that if the testing population is split largely between stable and nightly (with very few on beta), behavioral differences between nightly and beta further increase the risk of a bug slipping through.</p>\n<p>Most of the time unstable features are enabled with a feature gate being explicitly set - that's just an error to do outside of either the compiler being built to target nightly or RUSTC_BOOTSTRAP set (this is what UnstableFeatures is checking for). The lack of the feature gate means users would be prevented from \"clippy nightly\" xor \"some other nightly feature\" (in either direction), which seems concerning to me.</p>\n<p>I definitely hear it being extra work to backport things, though I'll also suggest that talking about how we can reduce that overhead would be good - in theory, it should be pretty simple (\"just\" another PR). If we are seeing a truly high rate here, looking at root causes, trying to understand how that might be mitigated would also be good, I think. Ultimately nightly users getting a bad experience sort of pushes them to stable (or at least beta) which just hurts over time.</p>",
        "id": 266788757,
        "sender_full_name": "simulacrum",
        "timestamp": 1641290274
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116122\">simulacrum</span> <a href=\"#narrow/stream/182449-t-compiler.2Fhelp/topic/.E2.9C.94.20Target.20release.20channel.20for.20Clippy/near/266788757\">said</a>:</p>\n<blockquote>\n<p>One obvious concern is that if the testing population is split largely between stable and nightly (with very few on beta), behavioral differences between nightly and beta further increase the risk of a bug slipping through.</p>\n</blockquote>\n<p>This is true, having an environment value to disable/enable this behavior on stable/beta might help.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"116122\">simulacrum</span> <a href=\"#narrow/stream/182449-t-compiler.2Fhelp/topic/.E2.9C.94.20Target.20release.20channel.20for.20Clippy/near/266788757\">said</a>:</p>\n<blockquote>\n<p>Most of the time unstable features are enabled with a feature gate being explicitly set - that's just an error to do outside of either the compiler being built to target nightly or RUSTC_BOOTSTRAP set (this is what UnstableFeatures is checking for). The lack of the feature gate means users would be prevented from \"clippy nightly\" xor \"some other nightly feature\" (in either direction), which seems concerning to me.</p>\n</blockquote>\n<p>Adding a feature flag to enable nightly lints was also mentioned in <a href=\"https://github.com/rust-lang/rust-clippy/issues/8211\">clippy#8211</a>. As a result, users using this would lock themselves into nightly. We get some helpful reports from people who usually use stable, but regularly run the nightly compiler and nightly Clippy on their code. Having a feature flag would make this less simple than it currently is.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"116122\">simulacrum</span> <a href=\"#narrow/stream/182449-t-compiler.2Fhelp/topic/.E2.9C.94.20Target.20release.20channel.20for.20Clippy/near/266788757\">said</a>:</p>\n<blockquote>\n<p>I definitely hear it being extra work to backport things, though I'll also suggest that talking about how we can reduce that overhead would be good - in theory, it should be pretty simple (\"just\" another PR). If we are seeing a truly high rate here, looking at root causes, trying to understand how that might be mitigated would also be good, I think. Ultimately nightly users getting a bad experience sort of pushes them to stable (or at least beta) which just hurts over time.</p>\n</blockquote>\n<p>The extra work current arises from Clippy being split into two repos. Back porting is documented in our repo, but in practice is typically done by just one member (Something we should work on. Yes). To be clear, this nightly restriction is intended for lints which we consider to be stable and ready to be released. Unstable and WIP lints are handled differently. It's correct that nightly users should ideally not get a worse experience, and that's not the plan. However, by the nature of accessing new lints they will be less tested than lints on stable, which have been on nightly and beta before.</p>\n<blockquote>\n<p>If we are seeing a truly high rate here, looking at root causes, trying to understand how that might be mitigated would also be good</p>\n</blockquote>\n<p>Most of Clippy's issues are related to false positives. We have tools like a mini crater to run lints on several crates before merging them. Even with this, we miss some edge cases or just get feedback from users that lints should be reconsidered. Having an additional nightly stage would not remove these problems but can potentially improve the stability of lints on stable and that's the main idea behind this.</p>",
        "id": 266794988,
        "sender_full_name": "xFrednet",
        "timestamp": 1641294262
    }
]