[
    {
        "content": "<p>Hey all, I've opened <a href=\"https://github.com/rust-lang/rust/issues/90665\">#90655</a> to track a shortcoming in the compiler diagnostics that I believe has much deeper roots in the trait selection system. There seems to be a bad interaction between auto traits and specialization that causes trait selection to fail to see that there is a missing auto trait obligation.</p>",
        "id": 260558779,
        "sender_full_name": "Ben Reeves",
        "timestamp": 1636268799
    },
    {
        "content": "<p>I'm in <em>way</em> over my head with all of this. I had initially hoped that the diagnostic could be improved by just beefing up <code>rustc_trait_selection::traits::error_reporting</code>, but I found out that the problem exists somewhere in trait fulfillment.</p>",
        "id": 260558782,
        "sender_full_name": "Ben Reeves",
        "timestamp": 1636268821
    },
    {
        "content": "<p>Getting this fixed is somewhat urgent for me. I first encountered this problem when working with a hacked version of <code>std::result::Result</code> that has a specialized <code>FromResidual</code> implementation. You can see a minimal reproduction of that use case in Example 4 of <a href=\"https://github.com/rust-lang/rust/issues/90601\">#90601</a>. This specialized <code>Result</code> type is going to power <a href=\"https://ziglang.org/documentation/master/#Error-Return-Traces\">return</a> <a href=\"#narrow/stream/257204-project-error-handling/topic/track_caller.20error.20crate\">tracing</a> for errors in our Rust code at Qumulo (where I work). But until these error messages are improved, our developers will be scratching their heads any time they forget to add the proper <code>From</code> impl for their error types, because all they will get from the compiler is:</p>\n<blockquote>\n<p>the <code>?</code> operator can only be used in a function that returns <code>Result</code> or <code>Option</code></p>\n</blockquote>",
        "id": 260558838,
        "sender_full_name": "Ben Reeves",
        "timestamp": 1636268894
    },
    {
        "content": "<p>So with all that said, I'm hoping there's somebody who knows roughly how this could be improved and could guide me to the proper places in the trait fulfillment code. What I really want to know is, is this even going to be possible to improve without major changes?</p>",
        "id": 260558841,
        "sender_full_name": "Ben Reeves",
        "timestamp": 1636268920
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> <span class=\"user-mention\" data-user-id=\"116118\">@Matthew Jasper</span> I'm told that you would be pretty knowledgeable on trait selection. I understand it may take some time until you can look more closely at this, but I would really appreciate your input on what could be done to improve things here, whenever you get a chance.</p>\n<p>The impact of this has spread beyond my place of work and into <a class=\"stream\" data-stream-id=\"257204\" href=\"/#narrow/stream/257204-project-error-handling\">#project-error-handling</a>, where I'm trying to put together a crate that combines auto traits and specialization to enable easy return tracing for errors: <a href=\"#narrow/stream/257204-project-error-handling/topic/track_caller.20error.20crate/near/260720556\">https://rust-lang.zulipchat.com/#narrow/stream/257204-project-error-handling/topic/track_caller.20error.20crate/near/260720556</a></p>",
        "id": 260722510,
        "sender_full_name": "Ben Reeves",
        "timestamp": 1636407484
    },
    {
        "content": "<p>It's hard to give a good answer to this. This isn't the only problem with the current specialization implementation and any fix would only really make sense as part of a larger rework. Unfortunately I don't think there's anyone on the lang or compiler teams that's trying to move this forwards. I'm not even sure if the extent of the problems with the current version of specialization is either well know or agreed upon.</p>",
        "id": 260985708,
        "sender_full_name": "Matthew Jasper",
        "timestamp": 1636549554
    }
]