[
    {
        "content": "<p>As I've been working on a PR for rustc, I've had to switch back and forth between multiple targets during development and testing, primarily {x86_64,i686}-pc-windows-msvc.  I'm finding it harder than I'd like to switch back and forth between these two platforms, and I'm wondering if this is expected behavior in x.py.</p>\n<p>In the most recent case, after fixing a bug that only affected i686-pc-windows-msvc, I wanted to switch back to x86_64 to ensure I didn't introduce regressions there, but running <code>x.py test --build=x86_64-pc-windows-msvc ...</code> wasn't sufficient; it still tried to build the i686 version of rustc.  I was able to fix this by deleting build/bootstrap and rerunning x.py, which suggests that the target triple is baked into bootstrap in some sense, and that x.py doesn't realize that bootstrap is stale and needs to be rebuilt.  But it's kind of a hassle to have to do this to switch architectures -- is this expected behavior?</p>",
        "id": 241088773,
        "sender_full_name": "Richard Cobbe",
        "timestamp": 1622590379
    },
    {
        "content": "<p>Hm, that's strange. It seems to work OK for me, though there certainly is a lot of complexity in how the build/host/targets are computed. Do you have anything in <code>config.toml</code>? </p>\n<p>The default <code>build</code> target will get embedded in the bootstrap binary based on the <code>--build</code> flag or the config value or the computed value. But it should honor the <code>--build</code> flag if you later choose a different value.  It is \"sticky\" in a sense if you later run x.py without <code>--build</code> or a config value, it will use whatever it was built with the first time.</p>\n<p>However, I would recommend not necessarily switching <code>build</code> around. That is only relevant for the build system (like rustbuild itself), and it should be fine to leave that as x86_64-pc-windows-msvc, and switch the <code>host</code> as needed (or just the <code>target</code> if you are only testing the compiled results of tests, and not the compiler itself).</p>",
        "id": 241093080,
        "sender_full_name": "Eric Huss",
        "timestamp": 1622594201
    },
    {
        "content": "<p>No, my config.toml is pretty minimal:</p>\n<div class=\"codehilite\"><pre><span></span><code>profile = &quot;compiler&quot;\nchangelog-seen = 2\n\n[rust]\ndebug-logging = true\n\n[llvm]\ndownload-ci-llvm = true\n</code></pre></div>\n<p>I didn't know that about the --build, --host, and --target switches, though, thanks!  (Cross-compilers can be a little confusing.)  It sounds like either <code>--host</code> or <code>--target</code> is what I'm looking for; I'll try that in the future.  Thanks!</p>",
        "id": 241093651,
        "sender_full_name": "Richard Cobbe",
        "timestamp": 1622594723
    }
]