[
    {
        "content": "<p>I know Rust's bootstrap system uses the latest beta as stage 0. is building the current trunk with a recent but slightly older trunk toolchain supported?</p>",
        "id": 271494584,
        "sender_full_name": "Collin Baker",
        "timestamp": 1644527338
    },
    {
        "content": "<p>obviously any particular revision of rust can build itself, but I'm not sure if that means yesterday's nightly can build today's nightly</p>",
        "id": 271494694,
        "sender_full_name": "Collin Baker",
        "timestamp": 1644527388
    },
    {
        "content": "<p>even if this should work in principle, would it be expected to work in practice?</p>",
        "id": 271494899,
        "sender_full_name": "Collin Baker",
        "timestamp": 1644527481
    },
    {
        "content": "<p><a href=\"https://rustc-dev-guide.rust-lang.org/building/bootstrapping.html#complications-of-bootstrapping\">https://rustc-dev-guide.rust-lang.org/building/bootstrapping.html#complications-of-bootstrapping</a></p>",
        "id": 271494902,
        "sender_full_name": "Collin Baker",
        "timestamp": 1644527483
    },
    {
        "content": "<p>the situation I'm worried about is this: the trunk code conditionally uses an unstable feature for stage1+. a later revision changes the way the feature works, and test coverage ensures rustc can still compile itself. but the way the feature worked in the previous revision is now incompatible with the latest revision</p>",
        "id": 271495112,
        "sender_full_name": "Collin Baker",
        "timestamp": 1644527603
    },
    {
        "content": "<p>We verify builds with a particular beta (pinned in src/stage0.json, alongside checksums), though in principle any beta should work.</p>\n<p>A slightly older trunk is significantly less likely to work; in general a reasonable rule of thumb is likely that any patch which changes/adds cfg(bootstrap) code anywhere is a 'breaking point'.</p>",
        "id": 271496123,
        "sender_full_name": "simulacrum",
        "timestamp": 1644528024
    },
    {
        "content": "<p>But yes, even changes that just change features can also in theory cause trouble, though typically that is rare if they're not updating code covered by cfg(bootstrap) at the same time.</p>",
        "id": 271496187,
        "sender_full_name": "simulacrum",
        "timestamp": 1644528060
    }
]