[
    {
        "content": "<p>Hi all, my project uses quite a number of dependencies such as tokio. Notice that when compiling my executable, these dependencies mostly is produced as .rlib. Can i check if it is possible to produce them as .a (static lib) instead of .rlib?</p>",
        "id": 257891755,
        "sender_full_name": "Gladys",
        "timestamp": 1634450229
    },
    {
        "content": "<p>rlibs are not just object code, they contain a lot of metadata, one important bit being the MIR of generic and <code>#[inline]</code> functions. Machine code cant really encoded generics so its a bit impossible to use them as intermediate reprs of depedencies. Besides, rust doesnt have a stable ABI so it needs to check if version matches or stuff could blow up.</p>",
        "id": 257896019,
        "sender_full_name": "Riccardo D'Ambrosio",
        "timestamp": 1634454668
    },
    {
        "content": "<p>if you were to do this anyways, i dont see the benefit, because you couldnt shared dependency static libs because some generic functions may not be monomorphized to what one executable needs, or they could be built with different versions or targets, or with different cfgs, features, etc.</p>",
        "id": 257896270,
        "sender_full_name": "Riccardo D'Ambrosio",
        "timestamp": 1634454958
    },
    {
        "content": "<p>Hi, reason for compiling to .a (static libs) is because i wanted to add custom llvm pass to the rustc emitted .bc. Which i could then convert the .bc to .s and then use clang to compile into final executable. problem is the linkage, clang would definitely not recognize .rlib. Appreciate if anyone know if it is possible to produce those dependencies in .a instead of .rlib. thanks!</p>",
        "id": 258016540,
        "sender_full_name": "Gladys",
        "timestamp": 1634558163
    },
    {
        "content": "<p>Can you use linker plugin LTO and then tell the linker to use this custom LLVM pass or use a wrapper around the linker that runs this LLVM pass?</p>",
        "id": 258054585,
        "sender_full_name": "bjorn3",
        "timestamp": 1634573586
    },
    {
        "content": "<p>Hi bjorn3, will read up and try your suggestion. I am actually new to rust, appreciate if you could give me more direction or example. Thanks :)</p>",
        "id": 258125005,
        "sender_full_name": "Gladys",
        "timestamp": 1634604734
    }
]