[
    {
        "content": "<p>hiya, i'm planning on putting up a draft PR sometime over the weekend to warn/deny \"almost\" trivial bounds with HRTBs like <code>fn foo() where for&lt;'a&gt; &amp;'a mut (): Clone {}</code> and i want to start a crater run..</p>",
        "id": 277348318,
        "sender_full_name": "Michael Goulet (compiler-errors)",
        "timestamp": 1648765615
    },
    {
        "content": "<p>is there any courtesy around starting a crater run, or am i allowed to start one if i think it's significant enough?</p>",
        "id": 277348322,
        "sender_full_name": "Michael Goulet (compiler-errors)",
        "timestamp": 1648765619
    },
    {
        "content": "<p>it just occurred to me to ask, since it's significantly more resources than just doing a perf run, lol</p>",
        "id": 277348342,
        "sender_full_name": "Michael Goulet (compiler-errors)",
        "timestamp": 1648765633
    },
    {
        "content": "<p>Well... resources are allocated and paid for anyway, so if the queue runs empty, that would be a waste <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 277348537,
        "sender_full_name": "oli",
        "timestamp": 1648765787
    },
    {
        "content": "<p>hehe good point :P</p>",
        "id": 277348611,
        "sender_full_name": "Michael Goulet (compiler-errors)",
        "timestamp": 1648765818
    },
    {
        "content": "<p>alright, unless there's a ton queued up, i'll just go for it</p>",
        "id": 277348621,
        "sender_full_name": "Michael Goulet (compiler-errors)",
        "timestamp": 1648765825
    },
    {
        "content": "<p>Anyway, this sounds exactly like something that we run crater for. In the future, when you know which crates are interesting for your case, you can even limit the run to those</p>",
        "id": 277348650,
        "sender_full_name": "oli",
        "timestamp": 1648765868
    },
    {
        "content": "<p>Especially since it sounds like this could be a <code>check</code> run (no test failure relevance), which is somewhat cheaper, queuing it sounds fine.</p>\n<p>One good thing you might do is mention the priority of your run in the comment that kicks it off -- I've had people ask if it's ok to cancel (or deprioritize) one I've kicked, so if yours is \"I'd like this but it's not critical for the release next week\" that can be a good thing to note in your thread.</p>",
        "id": 277354273,
        "sender_full_name": "scottmcm",
        "timestamp": 1648770039
    }
]