[
    {
        "content": "<p>Is there a way to enable the built-in check in RA, where it is activated by something else then a save?</p>",
        "id": 247579928,
        "sender_full_name": "Mossa",
        "timestamp": 1627563831
    },
    {
        "content": "<p>No, the files need to be saved to the disk for rustc to be able to see them. See <a href=\"https://github.com/rust-analyzer/rust-analyzer/issues/3107\">https://github.com/rust-analyzer/rust-analyzer/issues/3107</a></p>",
        "id": 247580269,
        "sender_full_name": "bjorn3",
        "timestamp": 1627563973
    },
    {
        "content": "<p>Yeah, I understand that, but I want to re-map the checking to another button :)</p>",
        "id": 247580601,
        "sender_full_name": "Mossa",
        "timestamp": 1627564144
    },
    {
        "content": "<p>you can do that on the client-side, but the files do still need to be saved for it to work</p>",
        "id": 247580666,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1627564197
    },
    {
        "content": "<p>Yeah, I'm only finding the <code>\"rust-analyzer.checkOnSave.enable\": false,</code> and clicking on the rust-analyzer button doesn't do it either.</p>",
        "id": 247580990,
        "sender_full_name": "Mossa",
        "timestamp": 1627564360
    },
    {
        "content": "<p>ah, so you want a dedicated command for running <code>cargo check</code>, that makes sense</p>",
        "id": 247581057,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1627564406
    },
    {
        "content": "<p>I have customized it a bit so it builds examples, tests, and bins. Inside of the vscode settings JSON. I want to run that after I've fixed a \"selection\" of my issues. Right now, I get 120 problems/errors. I fix 4 of them in one file, press save, and then RA runs the check.. But I don't need it to do that just yet. I just need to go through some more of the problems.<br>\nIf I have a <code>cargo watch</code> going, it is the same thing.<br>\nSo I thought, I can just press the RA-tag on the buttom line. But that doesn't run a check. It runs something else.</p>",
        "id": 247581327,
        "sender_full_name": "Mossa",
        "timestamp": 1627564545
    }
]