[
    {
        "content": "<p>Hello! First, thank you all for your work on the Rust compiler. I've been trying to fix this issue: <a href=\"https://github.com/rust-lang/rust/issues/90817\">https://github.com/rust-lang/rust/issues/90817</a>, which seems to be related to specialization, although the code itself does not use specialization. I've commented here <a href=\"https://github.com/rust-lang/rust/issues/90817#issuecomment-992008088\">https://github.com/rust-lang/rust/issues/90817#issuecomment-992008088</a> what I think is the cause of the problem, but I'm not sure of how to resolve it.</p>\n<p>I think that the problem could be solved by changing <a href=\"https://github.com/rust-lang/rust/blob/6bda5b331cfe7e04e1fe348c58a928fc2b650f4f/compiler/rustc_trait_selection/src/traits/specialize/mod.rs#L123-L129\">https://github.com/rust-lang/rust/blob/6bda5b331cfe7e04e1fe348c58a928fc2b650f4f/compiler/rustc_trait_selection/src/traits/specialize/mod.rs#L123-L129</a> to return false whenever specialization is enabled in neither of the crates where the impls are found. However, I'm not sure how to determine the features enabled in the crates using the <code>TyCtxt&lt;'_&gt;</code> and the <code>DefId</code> of  the impls.</p>\n<p>Alternatively, this could be resolved by avoiding the loop while evaluating the candidate impls, but I don't know if or how this could be done.</p>\n<p>I would appreciate any advice you have about this issue. Thank you!</p>",
        "id": 264657467,
        "sender_full_name": "Patrick",
        "timestamp": 1639362471
    },
    {
        "content": "<p>There's no way to determine what features were active in a dependency without reparsing the attributes, which is usually discouraged because erroring on missing feature gates in dependencies is a really bad idea</p>",
        "id": 264677996,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1639386122
    },
    {
        "content": "<p>That makes sense, thanks</p>",
        "id": 264952446,
        "sender_full_name": "Patrick",
        "timestamp": 1639530492
    }
]