[
    {
        "content": "<p>I'm working on <a href=\"https://github.com/rust-lang/rust/pull/81642\">https://github.com/rust-lang/rust/pull/81642</a> which looks to implement a trait for all enums, and some feedback was to either implement this as an AST pass, or as part of HIR lowering - I agree that these are probably better places to do this, but I'm not sure which one makes more sense.</p>\n<p>From reading around a bit, it looks like AST passes currently seem to be readonly, and not modify the structure itself, which pushes me towards lowering, but it seems like at lowering-time I'd be looking at much lower-level constructs (which is fine, but feels like it will be quite verbose)... Any thoughts? <span class=\"user-mention\" data-user-id=\"133247\">@bjorn3</span>?</p>",
        "id": 252854405,
        "sender_full_name": "Daniel Wagner-Hall",
        "timestamp": 1631309932
    },
    {
        "content": "<p>Not sure what the best way would be. My expertise is more around the backend rather than the frontend.</p>",
        "id": 252854645,
        "sender_full_name": "bjorn3",
        "timestamp": 1631310104
    },
    {
        "content": "<p>You can mimic other magically implemented traits, e.g. Pointee, DiscriminantKind, Unsize, etc.</p>",
        "id": 252858478,
        "sender_full_name": "Gary Guo",
        "timestamp": 1631312402
    },
    {
        "content": "<p>They are magically implemented in rustc_trait_selection/src/traits/select/candidate_assembly.rs</p>",
        "id": 252858595,
        "sender_full_name": "Gary Guo",
        "timestamp": 1631312473
    },
    {
        "content": "<p>Ooh fabulous, I will do some reading - thanks!</p>",
        "id": 252860229,
        "sender_full_name": "Daniel Wagner-Hall",
        "timestamp": 1631313619
    },
    {
        "content": "<p>I've successfully got the trait solver seeing that the trait is implemented for the correct types, but I'm struggling to see how an actual implementation gets put in place... I see <code>ImplSource</code>, some of the variants of which contain actual vtables/similar, but all of the uses of it I can see are just used to translate <code>Obligation</code>s into other <code>Obligation</code>s via indirections... Any pointers to where an <code>ImplSource</code> gets resolved into \"Here is the actual code to invoke\"?</p>",
        "id": 252899439,
        "sender_full_name": "Daniel Wagner-Hall",
        "timestamp": 1631355799
    }
]