[
    {
        "content": "<p>Hi, everyone. I recently made a PR to fix an issue (<a href=\"https://github.com/rust-lang/rust/issues/88434\">https://github.com/rust-lang/rust/issues/88434</a>) but then I realized there was another, older issue which seems somewhat similar because it has the same error message (<a href=\"https://github.com/rust-lang/rust/issues/87573\">https://github.com/rust-lang/rust/issues/87573</a>). There's a comment saying this issue no longer ICEs so the issue seems to be fixed at this point, but out of curiosity, I tried to duplicate this issue by installing the nightly toolchain from July by installing <code>rustup toolchain install nightly-2021-07-28</code>. When I run <code>rustc +nightly-2021-07-28 -V --verbose</code>, I get the same commit hash and version that they show in the issue. However, when I compile their example code, I get:</p>\n<div class=\"codehilite\"><pre><span></span><code>warning: static is never used: `STATIC_BOOL`\n --&gt; test.rs:3:1\n  |\n3 | static STATIC_BOOL: bool = true;\n  | ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  |\n  = note: `#[warn(dead_code)]` on by default\n\nerror: requires `start` lang_item\n\nerror: aborting due to previous error; 1 warning emitted\n</code></pre></div>\n<p>This is clearly not the error that they show in the issue, and it is not even an ICE, so I must be replicating the nightly version wrong somehow. Does anyone have any tips as to how I would replicate this ICE? Thanks for the help.</p>",
        "id": 252240931,
        "sender_full_name": "Noble Mushtak (he/him)",
        "timestamp": 1630979978
    },
    {
        "content": "<p>Just to double check, did you pass <code>--crate-type=staticlib</code>?  When I do that, it does generate an ICE (though different from the issue).</p>",
        "id": 252244961,
        "sender_full_name": "Eric Huss",
        "timestamp": 1630984175
    },
    {
        "content": "<p>I hadn't seen that compiler flag before, but I just did <code>rustc +nightly-2021-07-28 --crate-type=staticlib test.rs</code>, and it seems to be giving the same ICE as in the issue. Thank you for the help!</p>",
        "id": 252302994,
        "sender_full_name": "Noble Mushtak (he/him)",
        "timestamp": 1631020609
    }
]