[
    {
        "content": "<p>Hi! My company has been building with Rust to create a cross-platform SDK and iOS is a major market. We have been trying to figure out how to make bitcode support work, following the various threads: <a href=\"https://github.com/rust-lang/rust/issues/35968\" target=\"_blank\" title=\"https://github.com/rust-lang/rust/issues/35968\">https://github.com/rust-lang/rust/issues/35968</a>. It seems there is an incompatibility with LLVM and there is a general challenge in keeping up with the changes Apple makes. We would be happy to help but are not sure where to start. Furthermore, our company would be willing to financially support the effort entirely if someone else can assist? Who would be the best to talk to about this? Thanks!</p>",
        "id": 174155001,
        "sender_full_name": "Adam Fish",
        "timestamp": 1566835719
    },
    {
        "content": "<p>This is a difficult issue for officially distributed rustc, but I think it should be fairly easy to match the versions if you compile rustc with <code>system-llvm</code> support; if apple allows for that, at least.</p>",
        "id": 174175508,
        "sender_full_name": "nagisa",
        "timestamp": 1566852447
    },
    {
        "content": "<p>Do keep in mind that whenever you're shipping a rustc based on an unusual LLVM version, the bulk of the difficulty is not making rustc compile but finding &amp; handling the various small bugs which invariably exists in any given snapshot of LLVM. The rustc-picked LLVM probably has about as many of those as any other random revision, but there's a rather big community testing it, filing bugs, minimizing reproducers, and importing the bug fixes that happen upstream. If you ship a rustc with a different LLVM, you're more on your own with those tasks.</p>",
        "id": 174176108,
        "sender_full_name": "Hanna Kruppe",
        "timestamp": 1566852906
    },
    {
        "content": "<p>Thanks for the replies, sorry I didn’t have notifications to see them! I will try compiling with older LLVM but my real hope was to get something more built in for this and to enable it for others since it is clear from the issues this is a deal breaker for some looking at the language. Do you see anyway that this could be possible?</p>",
        "id": 174644766,
        "sender_full_name": "Adam Fish",
        "timestamp": 1567309266
    },
    {
        "content": "<p>Petition Apple to either use a stock LLVM or make public (or at least linkable) their LLVM.</p>",
        "id": 174683573,
        "sender_full_name": "nagisa",
        "timestamp": 1567385290
    },
    {
        "content": "<p>As long as Apple has no intent on allowing other languages be first class citizens on iOS devices, it will not happen.</p>",
        "id": 174683587,
        "sender_full_name": "nagisa",
        "timestamp": 1567385394
    },
    {
        "content": "<p>That’s disappointing since I assume you know how tall of a request that is. If there was a way to get the community to test when each new build of Xcode came out, this seems a bit more achievable?</p>",
        "id": 174928670,
        "sender_full_name": "Adam Fish",
        "timestamp": 1567636175
    },
    {
        "content": "<p>The problem is IIRC is that you cannot link to the Apple’s LLVM at all in the first place, because they do not ship something necessary to do that. We can try linking to a similar version of LLVM, but since apple modifies their own, it is likely that those versions will be incompatible in one way or another.</p>",
        "id": 174938333,
        "sender_full_name": "nagisa",
        "timestamp": 1567648674
    },
    {
        "content": "<p>I know I originally suggested <code>use-system-llvm</code> but I had forgotten about that particular detail back then</p>",
        "id": 174938378,
        "sender_full_name": "nagisa",
        "timestamp": 1567648705
    },
    {
        "content": "<p>This overall means that for a good support of this use-case we need to get Apple to make it possible to link to its LLVM.</p>",
        "id": 174938385,
        "sender_full_name": "nagisa",
        "timestamp": 1567648731
    },
    {
        "content": "<p>otherwise you will end up threading a thin line which might not appear to be broken based on the superficial testing we could do.</p>",
        "id": 174938411,
        "sender_full_name": "nagisa",
        "timestamp": 1567648801
    },
    {
        "content": "<p>I still think that <code>use-system-llvm</code> with whatever workarounds necessary to make it work, will be the best way forward for anybody wanting to pursue this use-case</p>",
        "id": 174938523,
        "sender_full_name": "nagisa",
        "timestamp": 1567648918
    },
    {
        "content": "<p>(this might involve e.g. using the header files from public LLVM and attempting to link against apples llvm dylib, if it exists at all)</p>",
        "id": 174938569,
        "sender_full_name": "nagisa",
        "timestamp": 1567648946
    },
    {
        "content": "<p>(if it doesn’t then all the bets are pretty much off)</p>",
        "id": 174938575,
        "sender_full_name": "nagisa",
        "timestamp": 1567648954
    },
    {
        "content": "<p>Ok that helps clarify, I had forgotten that there is a potential distinction between what Apple is using and public. Thank you for discussing.</p>",
        "id": 174948456,
        "sender_full_name": "Adam Fish",
        "timestamp": 1567665024
    },
    {
        "content": "<p>Just wanted to share that we published this toolchain to help others with bitcode: <br>\n<a href=\"https://github.com/getditto/rust-bitcode\" target=\"_blank\" title=\"https://github.com/getditto/rust-bitcode\">https://github.com/getditto/rust-bitcode</a></p>",
        "id": 176293512,
        "sender_full_name": "Adam Fish",
        "timestamp": 1569126567
    }
]