[
    {
        "content": "<p>Hi! I think I could give type checking (some of the) lang items a go - issue <a href=\"https://github.com/rust-lang/rust/issues/9307\">#9307</a>.</p>\n<p>What I have in mind is checking Struct targets by adding the ability to create a string signature (maybe by using Encodable?) for VariantData and compare that to what's defined for lang items that target Structs. Does anybody have a strong opinion about this approach?</p>",
        "id": 211152731,
        "sender_full_name": "Dániel Buga",
        "timestamp": 1600963355
    },
    {
        "content": "<p>I'm not sure I understand the approach. Can you give an example?</p>",
        "id": 211153308,
        "sender_full_name": "oli",
        "timestamp": 1600963602
    },
    {
        "content": "<p>Let's take OwnedBox for example. Instead of defining it's target as simply Target::Struct, I'd change it to Target::Struct(\"Box(T)\") or something like that, and I'd make it possible for the struct's hir ItemKind to construct this signature string</p>",
        "id": 211153716,
        "sender_full_name": "Dániel Buga",
        "timestamp": 1600963790
    },
    {
        "content": "<p>In essence, serialize the relevant piece of data in the hir, and compare it against a signature defined for the lang item's Target. I'm not sure, though, if I'm allowed to allocate strings</p>",
        "id": 211155401,
        "sender_full_name": "Dániel Buga",
        "timestamp": 1600964594
    },
    {
        "content": "<p>Hmm, since I only need to compare a known string against something dynamic, in theory I can do this without allocation, but that would require refactoring how the actual_target is passed around</p>",
        "id": 211155784,
        "sender_full_name": "Dániel Buga",
        "timestamp": 1600964767
    },
    {
        "content": "<p>I don't know if that's possible at all</p>",
        "id": 211155789,
        "sender_full_name": "oli",
        "timestamp": 1600964769
    },
    {
        "content": "<p>I mean, you could check the list of generic params and the name of the thing... but at that point you're just duplicating all the info in a second place</p>",
        "id": 211155947,
        "sender_full_name": "oli",
        "timestamp": 1600964842
    },
    {
        "content": "<p>ok... I guess any approach will do that</p>",
        "id": 211155985,
        "sender_full_name": "oli",
        "timestamp": 1600964861
    },
    {
        "content": "<p>I'd definitely choose something more structured than a string format. we do have symbols, so you could check the name against a symbol</p>",
        "id": 211156134,
        "sender_full_name": "oli",
        "timestamp": 1600964912
    },
    {
        "content": "<p>Though the name isn't very meaningful for the compiler, even though it's nice if the names used in the compiler match up with those from libstd</p>",
        "id": 211156225,
        "sender_full_name": "oli",
        "timestamp": 1600964952
    },
    {
        "content": "<p>I'm not sure how that would look, I'm a bit concerned about making this look nice as part of the current lang item table, that's why I'm thinking about strings. Naming the thing would help with providing an approximate signature in the error message more simple IMO.</p>",
        "id": 211156430,
        "sender_full_name": "Dániel Buga",
        "timestamp": 1600965029
    },
    {
        "content": "<p>But I guess that can be omitted as well</p>",
        "id": 211156489,
        "sender_full_name": "Dániel Buga",
        "timestamp": 1600965057
    },
    {
        "content": "<p>there's already a name in the table, maybe we just reuse that and then sync it up?</p>",
        "id": 211156731,
        "sender_full_name": "oli",
        "timestamp": 1600965164
    },
    {
        "content": "<p>(likely some lang item names are differently from the name of the item itself)</p>",
        "id": 211156794,
        "sender_full_name": "oli",
        "timestamp": 1600965200
    },
    {
        "content": "<p>I think we can also reuse the actual name given by the user. The signature itself doesn't need to contain it, if the name is not important.</p>",
        "id": 211156975,
        "sender_full_name": "Dániel Buga",
        "timestamp": 1600965276
    },
    {
        "content": "<p>But this is rather theoretical at this point <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 211157011,
        "sender_full_name": "Dániel Buga",
        "timestamp": 1600965293
    }
]