[
    {
        "content": "<p>There seems to be serious memory allocation issues with all rust tools on mac os 12.0 per <a href=\"https://github.com/rust-lang/rust/issues/92173\">https://github.com/rust-lang/rust/issues/92173</a>.</p>",
        "id": 277779659,
        "sender_full_name": "Michael Mileusnich",
        "timestamp": 1649099315
    },
    {
        "content": "<p>bump?</p>",
        "id": 277901470,
        "sender_full_name": "Michael Mileusnich",
        "timestamp": 1649174313
    },
    {
        "content": "<p>what are you asking? the problem is already tracked in the issue you linked.</p>",
        "id": 277904620,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1649175481
    },
    {
        "content": "<p>Apologies for not being clear, just wondering it the team is looking at it or if I can assist.  There just needs to be a rebuild of the darwin binaries on x86-64 I believe.  But the tools are really broken currently and it is very painful to use on Mac.</p>",
        "id": 277907037,
        "sender_full_name": "Michael Mileusnich",
        "timestamp": 1649176478
    },
    {
        "content": "<p>Don't know why a rebuild would help. But I think someone mentioned it's fixed on beta, so it will hopefully work after the 1.60 release that's happening Thursday</p>",
        "id": 277908032,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1649176891
    },
    {
        "content": "<p>oh sound good!  I didn't know there was any code fix?  All I did was updated xcode and rebuilt all rust tools locally.</p>",
        "id": 277908238,
        "sender_full_name": "Michael Mileusnich",
        "timestamp": 1649176971
    },
    {
        "content": "<p>Yeah I think it's unclear to everyone why it's broken</p>",
        "id": 277908357,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1649177020
    },
    {
        "content": "<p>thanks for the response have a good day</p>",
        "id": 277908813,
        "sender_full_name": "Michael Mileusnich",
        "timestamp": 1649177209
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"232545\">@Joshua Nelson</span> Why do you say it is fixed in beta?  I'm not aware of any fixes implemented.</p>\n<p>A possible fix is for the tools to use jemalloc.  It would be a bit messy, as it requires copying/pasting a bunch of code.  Perhaps that can be shared somehow, but it's not particularly trivial.</p>\n<p>It sounds like someone had success using XCode 13.3.  Unfortunately that doesn't appear to be available on CI, yet.  That also might not be a \"full\" fix, since we don't have any information on the underlying error.  The error seems to be very sensitive to the code layout, so it could just be that the newer xcode causes things to shift around a little.</p>",
        "id": 277922258,
        "sender_full_name": "Eric Huss",
        "timestamp": 1649182868
    },
    {
        "content": "<p>someone mentioned it was fixed on nightly: <a href=\"https://github.com/rust-lang/rust-clippy/issues/8470#issuecomment-1050341164\">https://github.com/rust-lang/rust-clippy/issues/8470#issuecomment-1050341164</a><br>\nnot sure whether anyone tested on beta</p>",
        "id": 277923248,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1649183226
    },
    {
        "content": "<p>Ah, good to see it seems to be resolved on newer versions.  It's hard to say if it is definitively fixed if we don't know what is causing it.  In my experiments, slight adjustments of unrelated code would make it go away which indicates it is susceptible to small changes in code layout.</p>",
        "id": 277928040,
        "sender_full_name": "Eric Huss",
        "timestamp": 1649185090
    }
]