[
    {
        "content": "<p>Hi there!</p>\n<p>I'm trying to figure out the implications of all of the different LTO modes that rust supports. I've been prodding around in the source, but I feel none wiser.</p>\n<p>So we have:</p>\n<div class=\"codehilite\"><pre><span></span><code>  pub enum Lto {\n      /// Don&#39;t do any LTO whatsoever\n      No,\n\n      /// Do a full crate graph LTO with ThinLTO\n      Thin,\n\n      /// Do a local graph LTO with ThinLTO (only relevant for multiple codegen\n      /// units).\n      ThinLocal,\n\n      /// Do a full crate graph LTO with &quot;fat&quot; LTO\n      Fat,\n  }\n</code></pre></div>\n<p>I know that one of these modes is where a linker plugin is used. Is that  <code>fat</code>? Or can any of the (non-off) options use a linker plugin?</p>\n<p>I'm also confused as to what \"full crate\" and \"local\" mean in this context?</p>\n<ul>\n<li>Does \"full crate\" mean \"one whole crate\" or \"all crates\"?</li>\n<li>Is \"Local\" meaning \"local to a codegen unit\", or \"local to a crate\"?</li>\n</ul>\n<p>I'm happy to raise a PR to improve the comments if others think this would be worthwhile too.</p>\n<p>Context: I would like to embed post-lto llvm bitcode into binary outputs. It looks like the liblto plugin <a href=\"https://reviews.llvm.org/rGc8e0bb3b2c24ef59556d81a275fb1f5db64899d3\">can do this</a> but it's not clear if and when I could use this from rustc, or if using a plugin is the only way to get what I'd like.</p>\n<p>Ideally I'd be able to get this without changes to rustc, but that may not be possible.</p>\n<p>Thanks.</p>",
        "id": 235196034,
        "sender_full_name": "Edd Barrett",
        "timestamp": 1618844647
    },
    {
        "content": "<p><code>ThinLocal</code> applies thin lto on the crate that is currently being compiled and then emits regular object files. This allows for inlining of functions between codegen units within the same crate without having to do all LTO just before linking. <code>ThinLocal</code> is the default in release mode when lto is neither explicitly enabled, nor disabled.</p>",
        "id": 235196590,
        "sender_full_name": "bjorn3",
        "timestamp": 1618844789
    },
    {
        "content": "<p>None of these options use a linker plugin. LTO is handled solely by rustc. You can enable linker plugin LTO with <code>-Clinker-plugin-lto</code> instead.</p>",
        "id": 235196843,
        "sender_full_name": "bjorn3",
        "timestamp": 1618844857
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"223288\">@Edd Barrett</span></p>",
        "id": 235196870,
        "sender_full_name": "bjorn3",
        "timestamp": 1618844863
    },
    {
        "content": "<p>Hi Bjorn!</p>\n<blockquote>\n<p>None of these options use a linker plugin. LTO is handled solely by rustc.</p>\n</blockquote>\n<p>OK, that clears that aspect up.</p>\n<blockquote>\n<p>ThinLocal applies thin lto on the crate that is currently being compiled and then emits regular object files.</p>\n</blockquote>\n<p>OK, so I take \"local graph\" to mean \"intra-crate graph\", which means that \"full crate graph\" means \"inter-crate graph\".</p>\n<p>Then from reading <a href=\"https://www.reddit.com/r/rust/comments/ijwya5/whats_the_deal_with_lto/g3hkm4p/?utm_source=reddit&amp;utm_medium=web2x&amp;context=3\">this</a> I take the difference between \"Thin\" and \"Fat\" to be \"Fat\" just inlines more aggressively. Is that right?</p>",
        "id": 235200761,
        "sender_full_name": "Edd Barrett",
        "timestamp": 1618846246
    },
    {
        "content": "<p>I wouldn't characterize \"thin\" vs \"fat\" as being more or less aggressive.  Sometimes thin can generate better code.  I think <a href=\"http://blog.llvm.org/2016/06/thinlto-scalable-and-incremental-lto.html\">http://blog.llvm.org/2016/06/thinlto-scalable-and-incremental-lto.html</a> is a pretty good explanation of what it does.</p>",
        "id": 235203979,
        "sender_full_name": "Eric Huss",
        "timestamp": 1618847495
    },
    {
        "content": "<p>I'm not sure if you've seen the documentation for <a href=\"https://doc.rust-lang.org/nightly/rustc/codegen-options/index.html#lto\">lto</a> and <a href=\"https://doc.rust-lang.org/nightly/rustc/codegen-options/index.html#linker-plugin-lto\">linker-plugin-lto</a> which has its own <a href=\"https://doc.rust-lang.org/nightly/rustc/linker-plugin-lto.html\">chapter</a>.</p>",
        "id": 235205180,
        "sender_full_name": "Eric Huss",
        "timestamp": 1618847992
    },
    {
        "content": "<p>Ah, I had missed these docs. Thank you!</p>",
        "id": 235213104,
        "sender_full_name": "Edd Barrett",
        "timestamp": 1618851097
    },
    {
        "content": "<p>OK, those docs make it really clear.</p>\n<p>My only remaining question is: if I defer LTO to the linker, can one still choose thin/fat LTO, or is that implicitly a fat LTO at that point?</p>\n<p>(I'm trying to figure out at which layer I should implement embedding the post-lto bitcode)</p>",
        "id": 235214587,
        "sender_full_name": "Edd Barrett",
        "timestamp": 1618851727
    },
    {
        "content": "<p>Local thin lto is impossible with linker plugin lto by default. I would expect that the linker plugin does support regular thin lto though.</p>",
        "id": 235214786,
        "sender_full_name": "bjorn3",
        "timestamp": 1618851808
    },
    {
        "content": "<p>Linker plugin lto is the only option for C/C++ as far as I know and thin lto is not a rust invention.</p>",
        "id": 235214908,
        "sender_full_name": "bjorn3",
        "timestamp": 1618851846
    },
    {
        "content": "<p>I've raised <a href=\"https://github.com/rust-lang/rust/pull/84365\">this PR</a> in an attempt to improve the docstrings of the <code>Lto</code> struct. Let me know what you think.</p>",
        "id": 235314356,
        "sender_full_name": "Edd Barrett",
        "timestamp": 1618911046
    },
    {
        "content": "<p>Well, I managed to get a LTO linker plugin working, although it wasn't as easy as I'd hoped:<br>\n<a href=\"https://github.com/rust-lang/rust/issues/60059#issuecomment-823302769\">https://github.com/rust-lang/rust/issues/60059#issuecomment-823302769</a></p>",
        "id": 235349811,
        "sender_full_name": "Edd Barrett",
        "timestamp": 1618927811
    }
]