[
    {
        "content": "<p>I would like to know who is the designated openbsd target maintainer (which is mandatory per Target Tier Policy)</p>",
        "id": 265407431,
        "sender_full_name": "Sebastien Marie (semarie)",
        "timestamp": 1639818378
    },
    {
        "content": "<p>all targets are Tier 3. I did x86_64, i686 and sparc64 initial port (and maintain them on openbsd side)</p>",
        "id": 265407449,
        "sender_full_name": "Sebastien Marie (semarie)",
        "timestamp": 1639818443
    },
    {
        "content": "<p>a powerpc target was added, but without any contact with openbsd developers (and I am unsure it is functional: no libc support until very recently, and invalid char signess in std)</p>",
        "id": 265407512,
        "sender_full_name": "Sebastien Marie (semarie)",
        "timestamp": 1639818522
    },
    {
        "content": "<p>I would be fine to participate to maintainership of all openbsd targets</p>",
        "id": 265407575,
        "sender_full_name": "Sebastien Marie (semarie)",
        "timestamp": 1639818617
    },
    {
        "content": "<p>Likely no one, since most of those targets predate the policy's acceptance - if you want to list yourself, filing PRs which pretend that the target didn't exist before (i.e. listing out the requirements for tier 3 from scratch) is likely the way to go.</p>\n<p><a href=\"https://github.com/rust-lang/rust/tree/master/src/doc/rustc/src/platform-support\">https://github.com/rust-lang/rust/tree/master/src/doc/rustc/src/platform-support</a> is the directory with currently listed maintainers.</p>",
        "id": 265418546,
        "sender_full_name": "simulacrum",
        "timestamp": 1639834135
    },
    {
        "content": "<p>It is \"acceptable\" for tier 3 targets to be nonfunctional, though we obviously appreciate help in making them be less. They are expected to be in a liminal state, where they might <strong>theoretically</strong> build with... maybe various degrees of hacking.</p>",
        "id": 265429939,
        "sender_full_name": "Jubilee",
        "timestamp": 1639848573
    },
    {
        "content": "<p>openbsd targets are tier 3 mostly because of crosscompilation requirement: LLVM doesn't build of out-of-box for targeting OpenBSD. all targets I am maintaining built natively and are effectively used to build programs and libraries on OpenBSD (like firefox, librsvg, py-cryptography, ...)</p>",
        "id": 265468818,
        "sender_full_name": "Sebastien Marie (semarie)",
        "timestamp": 1639902804
    }
]