[
    {
        "content": "<p>Hi! I work with the <a href=\"https://github.com/ossf/wg-best-practices-os-developers\">Developer Best Practices Working Group</a> of the Linux Foundation's Open Source Security Foundation (OpenSSF) <a href=\"https://github.com/ossf/great-mfa-project\">\"Great Multi-Factor Authentication (MFA) Distribution Project\"</a>.</p>\n<p>We'd like to give your project <em>free</em> MFA hardware tokens from Google and GitHub, for use by your maintainers.  We'd especially like to give them to any of your maintainers who aren't already using any.  Our goal is to help improve the security of open source software (OSS)/Free Software projects.  For example, these tokens can counter attacks that release source code updates and/or packages using stolen passwords.</p>\n<p>By <strong>2021-12-20</strong> and preferably much sooner, please let me know:</p>\n<ol>\n<li>If you want any tokens, and if so...</li>\n<li>How many Titan tokens from Google (up to 5)</li>\n<li>How many Yubikey tokens from GitHub (up to 5)</li>\n<li>The <em>private</em> email address to send codes to (this email must <em>not</em> go to the public, as these are use-once codes that can be used to get the tokens)</li>\n<li>If you could use more, how many more.</li>\n</ol>\n<p>We would send you coupon codes and validation codes to the private email address.  You would then distribute those codes to the maintainers you choose.  The recipients would use the coupon codes and validation codes to \"buy\" the tokens from the Google Store and/or GitHub Shop, who would ship the tokens directly to recipients.  These codes are use-once, so make sure you can keep the codes private until they're used by the intended person.</p>\n<p><strong>Important</strong>: The Google coupon codes <strong>must be used by 2021-12-31</strong> on the Google Store or they expire.</p>\n<p>How can you trust us? You don't need to. You would get the MFA tokens from Google and GitHub; we're simply offering codes to make them no-cost.  We'll provide some documentation on how to use them, but you don't need to use our documents.</p>\n<p>To qualify, each token recipient must:</p>\n<ol>\n<li>Be a maintainer or contributor to this critical open source software (OSS) project, or to another OSS project that this project depends on (the dependency may be indirect).</li>\n<li>Try to use an MFA token once they receive the token.  We'd like recipients to use MFA tokens from then on, but at least try.</li>\n<li>Not reuse the token between different people (the token must not be shared).</li>\n<li>Consider providing feedback to us (so we can try to fix problems).</li>\n</ol>\n<p>We also need each project that receives coupon codes and/or validation codes<br>\nto tell us these numbers (preferably within 30 days of getting the codes):</p>\n<ol>\n<li>How many tokens did you distribute from just Google? From just GitHub?</li>\n<li>How many people received tokens from just Google? From just GitHub?  From both?</li>\n<li>How many people didn’t have hardware tokens they used for OSS who received tokens from just Google? From just GitHub? From both?</li>\n</ol>\n<p>We ask for this information so we can tell others some simple measures of success. We don't need nor want the names of any individuals participating. It's fine to ask the people who got the codes for that information and provide a best-effort summary.</p>\n<p>The MFA tokens are shipped from the US.  They can be shipped internationally, but there are various limitations on where each can be shipped.</p>\n<p>In particular, we can't ship somewhere if that is forbidden (sanctioned) under US law.  So at this time we are unable to ship to individuals in China, Afghanistan, Russia, Ukraine, North Korea, Iran, Sudan, and Syria.  Sorry about that.  See the Google and GitHub sites for more shipping information.  <a href=\"https://home.treasury.gov/policy-issues/financial-sanctions/sanctions-programs-and-country-information\">More sanction information is available</a>.</p>\n<p>For more information including how-tos and other setup information can be found at the <a href=\"https://github.com/ossf/great-mfa-project\">\"Great Multi-Factor Authentication (MFA) Distribution Project\" site</a>.</p>",
        "id": 264491996,
        "sender_full_name": "John Naulty",
        "timestamp": 1639162436
    },
    {
        "content": "<p>This topic was moved by <span class=\"user-mention silent\" data-user-id=\"239881\">Josh Triplett</span> to <a class=\"stream-topic\" data-stream-id=\"122651\" href=\"/#narrow/stream/122651-general/topic/OpenSSF.20MFA.20Hardware.20Donation.20to.20Critical.20OSS.20Projects\">#general &gt; OpenSSF MFA Hardware Donation to Critical OSS Projects</a></p>",
        "id": 264501736,
        "sender_full_name": "Notification Bot",
        "timestamp": 1639167213
    }
]