[
    {
        "content": "<p>Hi,<br>\nI port Rust to AIX. I am able to cross-compile the standard library on Linux with AIX target (not tested yet). However, it is really hard to reproduce, because it needs an AIX server (for assembler and linker), some workaround on Rust and a patched version of LLVM...<br>\nDoes the community prefer a big patch with all OK, or lot of patches to add a specific functionality (one for triplet, another for AIX archive support, a third for libc...)?<br>\nMy goal is to report all patches needed to build community Rust with community LLVM.</p>",
        "id": 240300478,
        "sender_full_name": "Etienne Guesnet",
        "timestamp": 1622022731
    },
    {
        "content": "<p>Does LLVM (with your patches) understand how to handle the architecture, including assembling and linking?</p>",
        "id": 240348695,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1622045104
    },
    {
        "content": "<p>A port that requires the AIX-native assembler wouldn't be upstreamable.</p>",
        "id": 240348867,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1622045172
    },
    {
        "content": "<p>No, it does not. At least for now: no integrated assembly on AIX, and AIX linker (in an AIX server) must be used.<br>\nThe point is: is it possible to upstream now what is upstreamable, even if port is partial?</p>",
        "id": 240426748,
        "sender_full_name": "Etienne Guesnet",
        "timestamp": 1622098760
    },
    {
        "content": "<p>I think your best bet at this point would be to try to improve LLVM's support for your platform.</p>",
        "id": 240427682,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1622099468
    },
    {
        "content": "<p>You might also look at the target tier policy, and the requirements to add a new tier 3 target (which is where all new targets start).</p>",
        "id": 240427753,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1622099518
    }
]