[
    {
        "content": "<p>Hey folks,</p>\n<p>I have a fairly complex program that exibits a really weird bug in rustc. It's apparently fixed on the latest nightlies, but it's weird enough (probably a codegen bug) that I would like to figure out what it actually is to make sure it doesn't crop up again. Unfortunately, it is exhibited in the program at runtime, with fairly complex requirements. Any pro-level tips and tricks to get it to something that's better for a bug report?</p>",
        "id": 248261647,
        "sender_full_name": "Steve Klabnik",
        "timestamp": 1628016051
    },
    {
        "content": "<p>alternatively, if this sounds like any recent bugs that were fixed, that would also be of use:</p>\n<blockquote>\n<p>The symptom is that if I call a function that itself takes a closure as an argument in this particular function, the program explodes its memory use and ultimately dies. The flamegraph shows what I would expect if I were pushing something onto a Vec in a loop.</p>\n</blockquote>\n<p>I couldn't think of any, but haven't been reading the tracker as closely for the last few weeks.</p>",
        "id": 248262127,
        "sender_full_name": "Steve Klabnik",
        "timestamp": 1628016284
    },
    {
        "content": "<p>do you have an idea on when it started appearing by any chance ?</p>",
        "id": 248262420,
        "sender_full_name": "lqd",
        "timestamp": 1628016424
    },
    {
        "content": "<p>that is a good question. turns out that i have figured out what changed. it disappeared with the move to llvm 12. nightly was older than i expected. so, unlikely to be a useful bug report to rustc. thank you!</p>",
        "id": 248262794,
        "sender_full_name": "Steve Klabnik",
        "timestamp": 1628016618
    },
    {
        "content": "<p>it's always right after you ask for help that you figure something out, haha <span aria-label=\"confused\" class=\"emoji emoji-1f615\" role=\"img\" title=\"confused\">:confused:</span> appreciate it</p>",
        "id": 248262946,
        "sender_full_name": "Steve Klabnik",
        "timestamp": 1628016694
    },
    {
        "content": "<p>You can try running some automated reduction tooling (e.g., creduce, perses) on it to try to minify the test case, presuming it's reproducible, but generally if it's fixed on nightly / with llvm 12 it's unlikely to be too important. Could be a nice codegen test though!</p>",
        "id": 248263174,
        "sender_full_name": "simulacrum",
        "timestamp": 1628016808
    },
    {
        "content": "<p>this sounded familiar to me at least, but older than the last few weeks</p>",
        "id": 248263179,
        "sender_full_name": "lqd",
        "timestamp": 1628016811
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116011\">@Steve Klabnik</span> if you have a repro we can try to help minimizing it</p>",
        "id": 248263698,
        "sender_full_name": "lqd",
        "timestamp": 1628017050
    },
    {
        "content": "<p>thanks! yeah the issue is that like, it manifests when you run this code and you have a certain peripheral connected to your computer; i don't even have the necessary things to reproduce right now and it's my job, heh. if we manage to get it to something more reasonably reproducible, ill file something or ask more. there's no unsafe code.</p>",
        "id": 248264471,
        "sender_full_name": "Steve Klabnik",
        "timestamp": 1628017367
    },
    {
        "content": "<p>yeah it's older than a few weeks, </p>\n<div class=\"codehilite\"><pre><span></span><code>C:\\Users\\steve\\Documents\\Oxide\\pmbus(rework)&gt; rustc +nightly-2021-03-04 --version --verbose\nrustc 1.52.0-nightly (476acbf1e 2021-03-03)\nbinary: rustc\ncommit-hash: 476acbf1e9965b5e95c90f0d7d658709812b7003\ncommit-date: 2021-03-03\nhost: x86_64-pc-windows-msvc\nrelease: 1.52.0-nightly\nLLVM version: 11.0.1\nC:\\Users\\steve\\Documents\\Oxide\\pmbus(rework)&gt; rustc +nightly-2021-03-05 --version --verbose\nrustc 1.52.0-nightly (45b3c2851 2021-03-04)\nbinary: rustc\ncommit-hash: 45b3c28518e4c45dfd12bc2c4400c0d0e9639927\ncommit-date: 2021-03-04\nhost: x86_64-pc-windows-msvc\nrelease: 1.52.0-nightly\nLLVM version: 12.0.0\n</code></pre></div>\n<p>bug before, no bug after</p>",
        "id": 248264527,
        "sender_full_name": "Steve Klabnik",
        "timestamp": 1628017401
    },
    {
        "content": "<p>I would suggest rust-reduce --even if it's slow -- instead of the other tools mentioned above, because it likely involves multiple files. And if it also involves reducing over multiple crates at the same time, it's going to be a pain even with that. In any case, let us know if you need help reducing</p>",
        "id": 248264849,
        "sender_full_name": "lqd",
        "timestamp": 1628017547
    },
    {
        "content": "<p>yep, that is exactly it. appreciate it.</p>",
        "id": 248265020,
        "sender_full_name": "Steve Klabnik",
        "timestamp": 1628017602
    },
    {
        "content": "<p>i forgot about rust-reduce, will give it a try though, thank you.</p>",
        "id": 248265130,
        "sender_full_name": "Steve Klabnik",
        "timestamp": 1628017650
    },
    {
        "content": "<p>hopefully it gets you to a single-file repro where the other tools can also help (sometimes even for multiple-crate projects, the issue can be localized to a single one and ultimately the others can be removed instead of also reduced)</p>",
        "id": 248265675,
        "sender_full_name": "lqd",
        "timestamp": 1628017859
    },
    {
        "content": "<p>once you're there I'd also suggest lithium (I myself have not been able to make perces work)</p>",
        "id": 248265748,
        "sender_full_name": "lqd",
        "timestamp": 1628017895
    },
    {
        "content": "<p>(maybe also check under cargo-bisect-rustc just to make sure it was indeed fixed by the LLVM update and not another PR on the same nightly -- although the CI artifacts may be gone already. And also if you want to have an idea of when it was introduced, just in case something interesting comes up there as well, if it's not another LLVM update)</p>",
        "id": 248270156,
        "sender_full_name": "lqd",
        "timestamp": 1628019919
    },
    {
        "content": "<p>closing the loop here: we tracked it down to <a href=\"https://github.com/rust-lang/rust/issues/78283\">https://github.com/rust-lang/rust/issues/78283</a>, which has an llvm fix from <span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span> <span aria-label=\"muscle\" class=\"emoji emoji-1f4aa\" role=\"img\" title=\"muscle\">:muscle:</span> thanks again</p>",
        "id": 248523775,
        "sender_full_name": "Steve Klabnik",
        "timestamp": 1628191404
    },
    {
        "content": "<p>(technically the fix that landed on LLVM was from <span class=\"user-mention\" data-user-id=\"133224\">@Nikita Popov</span> ; my proposed fix was problematic in multiple ways. But glad to hear your problem was addressed, nonetheless!)</p>",
        "id": 248524192,
        "sender_full_name": "pnkfelix",
        "timestamp": 1628191594
    }
]