[
    {
        "content": "<p>Is there a simple way to determine for what release channel Clippy or tools in general are being built during the compilation? I want to implement a functionality in Clippy that should only be available in the Nightly version. The targeted channel should ideally be usable with a <code>#[cfg()]</code> attribute.</p>\n<p>I've looked into the <code>CARGO_*</code> environment values, but I believe that they are not set during the complication with <code>x.py</code> (I can be wrong on this one)</p>",
        "id": 266566608,
        "sender_full_name": "xFrednet",
        "timestamp": 1641058004
    },
    {
        "content": "<p>I now found <a href=\"https://doc.rust-lang.org/nightly/nightly-rustc/rustc_feature/enum.UnstableFeatures.html\"><code>UnstableFeatures</code></a> which seem to indicate what the build is currently targeting, but that information is sadly unavailable at compile time, from what I can tell</p>",
        "id": 266567577,
        "sender_full_name": "xFrednet",
        "timestamp": 1641059521
    },
    {
        "content": "<p>I don't think that can be directly done. Can you say more about why you are trying to do that?</p>",
        "id": 266568379,
        "sender_full_name": "Eric Huss",
        "timestamp": 1641060729
    },
    {
        "content": "<p>In <a href=\"https://github.com/rust-lang/rust-clippy/issues/6623\">clippy#6623</a> it was suggested to introduce new lints only in the nightly version of Clippy and then enable them afterwards to have less false positives on the stable version. Similar to how rustc uses features that users can opt in while the stable channel remains stable. I'm trying to implement this without adding a new feature (which would be a possibility) and little to no overhead.  I have a pretty good idea how I can implement this behavior if the target channel is known at the compile time.</p>",
        "id": 266568549,
        "sender_full_name": "xFrednet",
        "timestamp": 1641061062
    },
    {
        "content": "<p>Now I'm looking a bit at the bootstrapping process to figure out if we can potentially enable/disable a feature based on the channel <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 266568600,
        "sender_full_name": "xFrednet",
        "timestamp": 1641061130
    },
    {
        "content": "<p>The <code>CFG_RELEASE_CHANNEL</code> env var is set by the rust build system while compiling. <code>dev</code> and <code>nightly</code> should both result in enabling nightly features.</p>",
        "id": 266568675,
        "sender_full_name": "bjorn3",
        "timestamp": 1641061243
    },
    {
        "content": "<p>Having an environment value during compilation should work, thank you for the hint! Now I've also found the corresponding code in src/bootstrap. I'll try to work with this. Thank you very much!</p>",
        "id": 266568968,
        "sender_full_name": "xFrednet",
        "timestamp": 1641061710
    }
]