[
    {
        "content": "<p>I'm working on PR <a href=\"https://github.com/rust-lang/rust/issues/82815\">#82815</a>, which involves <em>a lot</em> of small tedious changes. Unfortunately, at the same time someone was working (<a href=\"https://github.com/rust-lang/rust/issues/82088\">#82088</a>) on splitting up one of the main files my PR touches, and I've ended up with massive conflicts. The approach I'm taking to fix the conflicts is to accept all the upstream changes and then manually reapply my changes. But this is frustrating since there's a lot of tedious changes that must be reapplied and it's easy to miss stuff.</p>\n<p>Does anyone have tips on how to make this process easier? Like, is there a flag I can pass to <code>git rebase</code> that will make it smarter about moved lines (something like <code>--color-moved</code> for <code>git diff</code>)?</p>",
        "id": 229043693,
        "sender_full_name": "Noah Lev",
        "timestamp": 1614988054
    },
    {
        "content": "<p>Hmm, <a href=\"https://stackoverflow.com/q/3491270\">this Stack Overflow question</a> might be helpful.</p>",
        "id": 229043970,
        "sender_full_name": "Noah Lev",
        "timestamp": 1614988227
    },
    {
        "content": "<p>I guess the issue is that in my scenario only part of the file was moved...</p>",
        "id": 229044001,
        "sender_full_name": "Noah Lev",
        "timestamp": 1614988251
    },
    {
        "content": "<p>(Feel free to ping me if you reply!)</p>",
        "id": 229044184,
        "sender_full_name": "Noah Lev",
        "timestamp": 1614988354
    },
    {
        "content": "<p>Yeah, whole file moves should be detected automatically. For partial moves maybe lowering the rename threshold could help. So could using a 3way conflict resolution tool, e.g. kdiff3. if you rebase multiple commits which face the same conflict over and over then you could enable rerere.</p>",
        "id": 229913274,
        "sender_full_name": "The 8472",
        "timestamp": 1615491896
    },
    {
        "content": "<p>Luckily I was able to fix the conflicts without <em>too</em> much hassle, at least compared to <a href=\"https://github.com/rust-lang/rust/issues/82356\">#82356</a> <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> </p>\n<p>For this PR it was a lot of tedious changes but thankfully the compiler would error if I made a mistake.</p>\n<blockquote>\n<p>For partial moves maybe lowering the rename threshold could help.</p>\n</blockquote>\n<p>Hmm, I wonder if that would work given that IIUC the rename threshold is lowering the threshold for whole file renames, not partial moves.</p>\n<blockquote>\n<p>if you rebase multiple commits which face the same conflict over and over then you could enable rerere.</p>\n</blockquote>\n<p>I've never heard of that, I'll look into it, thanks!</p>",
        "id": 229913780,
        "sender_full_name": "Noah Lev",
        "timestamp": 1615492094
    }
]