[
    {
        "content": "<p>Hi! I am a new rust user and trying to write my first commit to the rust project. I was browsing open issues with the tag E-easy and saw <a href=\"https://github.com/rust-lang/rust/issues/90698\">#90698</a> (<a href=\"https://github.com/rust-lang/rust/issues/90698\">https://github.com/rust-lang/rust/issues/90698</a>), which seems to a reasonable problem for beginner like me. I am wondering that if  someone can be so kind to give me advice on where to start roughly. <span aria-label=\"grimacing\" class=\"emoji emoji-1f62c\" role=\"img\" title=\"grimacing\">:grimacing:</span></p>",
        "id": 266488160,
        "sender_full_name": "Chen Zhaoyang",
        "timestamp": 1640936618
    },
    {
        "content": "<p>Hello! It looks like that issue has been claimed by another contributor. I recommend following allow with the progress on that issue, to see how it gets fixed. You can learn a lot that way!</p>\n<p>Also, if the person assigned hasn't made any progress after a while (one month or more) you can ping the issue again.</p>\n<p>In the meantime, keep browsing the issues! <span aria-label=\"innocent\" class=\"emoji emoji-1f607\" role=\"img\" title=\"innocent\">:innocent:</span></p>",
        "id": 266516660,
        "sender_full_name": "pierwill",
        "timestamp": 1640974127
    },
    {
        "content": "<p>Ok cool! I have actually emailed the assignee to ask their progress, potentially we might be able to collaborate on this issue. And yeah I will definitely keep browsing issues, I am sure I will eventually find one problem that I can solve.</p>\n<p>Thanks! <span aria-label=\"crab\" class=\"emoji emoji-1f980\" role=\"img\" title=\"crab\">:crab:</span></p>",
        "id": 266536835,
        "sender_full_name": "Chen Zhaoyang",
        "timestamp": 1641006527
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"390463\">@Chen Zhaoyang</span> <a href=\"#narrow/stream/182449-t-compiler.2Fhelp/topic/Trying.20to.20Implement.20.2390698/near/266536835\">said</a>:</p>\n<blockquote>\n<p>And yeah I will definitely keep browsing issues, I am sure I will eventually find one problem that I can solve.</p>\n</blockquote>\n<p>With over 7,000 open issues, there's almost certainly something you can solve!</p>\n<p>Pro-tip: the E-easy tag is actually very underused in my opinion; the vast majority of issues have not yet been tagged with any E-{easy,medium,hard} tag. <a href=\"#narrow/stream/122651-general/topic/Ideas.20for.20beginner.20contributors\">This thread</a> has some more suggestions for things beginner contributors can do. A great starting point can be looking through A-diagnostics issues!</p>",
        "id": 266537552,
        "sender_full_name": "Ben Reeves",
        "timestamp": 1641007814
    }
]