[
    {
        "content": "<p>Why does most of rustc_target::spec::Target members use string as their type ?<br>\nFor example: <code>target_endian</code> could be an enum Endian .</p>",
        "id": 212173694,
        "sender_full_name": "lzutao",
        "timestamp": 1601733489
    },
    {
        "content": "<p>@luzato I think it was chosen because it's easiest to map those values between json and Rust. Also because of configurability. The point of json is to enable you to avoid having to modify compiler sources to add a new target, at least in cases where this is possible. Originally the target operating system <a href=\"https://github.com/rust-lang/rust/blob/ff00edb7e1fd669b7a333e0b3842f3751ee6d573/src/rustc/driver/session.rs#L13\">was an enum</a> for example, so if you wanted to add a new OS, you'd have to modify compiler sources. Strings give you thus the maximum freedom.</p>\n<p>However, the current implementation is too extremely string based. The rule of thumb should be: is it possible for a target to add a new value not seen in the builtin targets without having to modify rustc to do something special about the new value? Endianness is a clear example. A target can decide that its values are two dimensional quadratic matrices and the bytes are stored in cantor pairing fashion, which would be something other than big or little endian for the endinaness, but it would obviously require deep changes of rustc and llvm :). Operating system vendors are another example. Maybe amazon wants to add unknown-linux-amazon or something, but doesn't need any changes of the compiler code itself to handle it. If there is ambiguity, one should err on the side of strings, but not as much as the current implementation :).</p>",
        "id": 213479005,
        "sender_full_name": "est31",
        "timestamp": 1602791634
    },
    {
        "content": "<p>I understand the flexibility of using string.<br>\nrust and LLVM only accepts and processes two endianness value: little and big.<br>\nSo even if users add a json target with endian different than those, they still have to change rustc and llvm<br>\nto process that.</p>",
        "id": 213520142,
        "sender_full_name": "lzutao",
        "timestamp": 1602825817
    },
    {
        "content": "<p>another possibility is to <code>impl FromStr for Endian</code>, then use <code>\"little\".parse().unwrap()</code>.</p>",
        "id": 213520204,
        "sender_full_name": "lzutao",
        "timestamp": 1602825877
    },
    {
        "content": "<p>also, for OS, I think we could use <code>Other(String)</code> variant for unknown OSes.<br>\nthe json processing part could change to convert between string and enum.</p>",
        "id": 213520278,
        "sender_full_name": "lzutao",
        "timestamp": 1602825999
    },
    {
        "content": "<p>Yes to make it clear, endian should definitely become an enum.</p>",
        "id": 215912808,
        "sender_full_name": "est31",
        "timestamp": 1604702322
    }
]