[
    {
        "content": "<p>What is the best approach to mapping values for MIR variables back to values for Rust variables?</p>\n<p>We are writing a verification tool and have a tool for displaying error traces to the user, but the tool works on MIR and the trace is rendered as</p>\n<ul>\n<li>A sequence of assignments to MIR variables, and we'd like to turn it into a sequence of assignments to Rust variables.</li>\n<li>Annotated html stepping through lines of the Rust program, and we would like to render the trace in visual studio code, probably as a new kind of debugger.</li>\n</ul>\n<p>We have read the <a href=\"https://rustc-dev-guide.rust-lang.org/\">rustc developer's guide</a> and know about the HIR but had not made use of it yet.</p>",
        "id": 226679005,
        "sender_full_name": "Mark R. Tuttle",
        "timestamp": 1613577774
    },
    {
        "content": "<p>Take a look at the <code>var_debug_info</code> field of <code>mir::Body</code>. For stepping through lines, every statement and terminator has <code>SourceInfo</code> associated with it. This contains the span of the code.</p>",
        "id": 226679850,
        "sender_full_name": "bjorn3",
        "timestamp": 1613577969
    },
    {
        "content": "<p>There is no mapping from MIR back to HIR.</p>",
        "id": 226679904,
        "sender_full_name": "bjorn3",
        "timestamp": 1613577982
    },
    {
        "content": "<p>Thanks for this help.  We knew about <code>SourceInfo</code> but not <code>var_debug_info</code>.</p>",
        "id": 226760704,
        "sender_full_name": "Mark R. Tuttle",
        "timestamp": 1613619128
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"133247\">bjorn3</span> <a href=\"#narrow/stream/182449-t-compiler.2Fhelp/topic/Writing.20debuggers/near/226679904\">said</a>:</p>\n<blockquote>\n<p>There is no mapping from MIR back to HIR.</p>\n</blockquote>\n<p>I want to find out which function contains this <code>LocalDecl</code> (Which if I understand correctly, there is just one function at a time that has MIR representation) So If I want HIR of that function, what should I do? I need HIR for finding is that function inside of impl of trait or not.</p>",
        "id": 237889929,
        "sender_full_name": "hkalbasi",
        "timestamp": 1620421483
    }
]