[
    {
        "content": "<p>FYI, I am considering a stable point release. We have a number of stable-accepted patches, including a soundness fix. <a href=\"https://github.com/rust-lang/rust/pull/78151\">https://github.com/rust-lang/rust/pull/78151</a></p>\n<p><span class=\"user-mention\" data-user-id=\"211727\">@Jonas Schievink</span> do you perhaps have some insight into how common the soundness problem that PR exposes? Do we have a test case in \"rust code\", or is it theoretical?</p>",
        "id": 214196514,
        "sender_full_name": "simulacrum",
        "timestamp": 1603377597
    },
    {
        "content": "<p>I can only speculate, but I think switches on discriminant values often end up using SSA values in LLVM codegen, on which storage statements have no effects. That might limit the practical impact.</p>",
        "id": 214203818,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1603380601
    },
    {
        "content": "<p>Hm. Okay. We're 4 weeks out from the next release, and realistically I'd probably not want to release until at least Thursday next week -- which puts us at 3 weeks out. I think that might not make it something we want to do, especially given the likely lack of impact.</p>",
        "id": 214211998,
        "sender_full_name": "simulacrum",
        "timestamp": 1603384037
    },
    {
        "content": "<p>note that I just disabled the infra pieces needed to put out a point release (azure pipelines gating on CI)</p>",
        "id": 214291234,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1603445468
    },
    {
        "content": "<p>I'm not sure why that's broken, but since a point release is unlikely and we'll fully retire it when 1.48 comes out I'm not sure it's worth the time fixing it</p>",
        "id": 214291313,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1603445518
    },
    {
        "content": "<p>if we decide to actually put out a point release I'll look into the issue again</p>",
        "id": 214291369,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1603445533
    },
    {
        "content": "<p>Sounds good</p>",
        "id": 214301576,
        "sender_full_name": "simulacrum",
        "timestamp": 1603452865
    },
    {
        "content": "<p>I guess <a href=\"https://github.com/rust-lang/rust/issues/78283\">https://github.com/rust-lang/rust/issues/78283</a> is now also relevant, though not having a fix yet, well, seems unclear that we'd have a point release for it</p>",
        "id": 214324269,
        "sender_full_name": "simulacrum",
        "timestamp": 1603465181
    }
]