[
    {
        "content": "<p>Hi release-team, I've opened an issue at <a href=\"https://github.com/rust-lang/release-team/issues/9\">https://github.com/rust-lang/release-team/issues/9</a> about the current support for Android. Any chance to get some feedback on it? Thanks</p>",
        "id": 228204788,
        "sender_full_name": "Thiébaud Weksteen",
        "timestamp": 1614593027
    },
    {
        "content": "<p>I don't think we're going to be able to come to good conclusions there yet, but I'm hopeful that as we move forward on target tier policy and so forth, we can better judge the support tier for android API levels along a similar framework to target triple support; they seem like really similar concepts to me.</p>",
        "id": 228259876,
        "sender_full_name": "simulacrum",
        "timestamp": 1614616025
    },
    {
        "content": "<p>Right, so if I'm interpreting <a href=\"https://github.com/rust-lang/rfcs/pull/2803/files#diff-42e166b941abc9c20783eda62a247871e9d409dec38fb3fc788b7d1c9db2edb0R290\">https://github.com/rust-lang/rfcs/pull/2803/files#diff-42e166b941abc9c20783eda62a247871e9d409dec38fb3fc788b7d1c9db2edb0R290</a> correctly, for the -android target, that would mean creating a new pull request to capture how this (new) target satisfies all the criteria of tier2? I think the proposal I linked would also tick the \"document its baseline expectations for [..] operating systems, libraries, runtime environments[..]\" part of that RFC. Have the \"target maintainers\" been defined for -android yet?</p>",
        "id": 228924275,
        "sender_full_name": "Thiébaud Weksteen",
        "timestamp": 1614936879
    },
    {
        "content": "<p>No, that rfc hasn't even been accepted quite yet :) I'd need to re read it to be sure of the right steps per it, but there's not really a policy other than that laid out in the rfc either.</p>",
        "id": 228952477,
        "sender_full_name": "simulacrum",
        "timestamp": 1614950931
    },
    {
        "content": "<p>Right, I understand. And on the target maintainers question, is there any point of contact I could reach to? Thanks</p>",
        "id": 229454064,
        "sender_full_name": "Thiébaud Weksteen",
        "timestamp": 1615285480
    },
    {
        "content": "<p>Hm, you mean to volunteer as a target maintainer? I don't think we've defined how to do so yet.</p>",
        "id": 229467885,
        "sender_full_name": "simulacrum",
        "timestamp": 1615292735
    }
]