[
    {
        "content": "<p>Hey hey,</p>\n<p>The release of 1.53 is close, which includes the <code>IntoIterator for [T; N]</code> trait implementation. However, it also includes the original <code>array_into_iter</code> lint which isn't updated yet. It produces some messages that are confusing/wrong:</p>\n<ul>\n<li><code>[..] but that might change in the future when `IntoIterator` impls for arrays are added.</code> (that implementation is already added. and that does not change anything in the current edition)</li>\n<li><code>it will become a hard error in a future release!</code> (not true)</li>\n</ul>\n<p>Since this trait implementation is one of the bigger features shipping in this release and will get some attention, I'm wondering it's worth backporting updates to this lint (<a href=\"https://github.com/rust-lang/rust/issues/85682\">#85682</a>).</p>",
        "id": 242207177,
        "sender_full_name": "Mara",
        "timestamp": 1623332374
    },
    {
        "content": "<p>I'm not inclined to backport something that hasn't been merged yet</p>",
        "id": 242209161,
        "sender_full_name": "simulacrum",
        "timestamp": 1623333078
    },
    {
        "content": "<p>yeah. hm. the main reason it isn't merged yet is because some unrelated test was depending on this lint to trigger a future-incompatibility lint which it no longer does, and it's not clear what to do with that test. but that's not really relevant outside of the main branch.</p>\n<p>anyway, if this gets merged today, do you think it's worth backporting this or not?</p>",
        "id": 242210332,
        "sender_full_name": "Mara",
        "timestamp": 1623333520
    },
    {
        "content": "<p>I'm not opposed</p>",
        "id": 242210882,
        "sender_full_name": "simulacrum",
        "timestamp": 1623333707
    },
    {
        "content": "<p>i <a href=\"https://github.com/rust-lang/rust/pull/85682#issuecomment-860728379\">declined</a>. Its not the end of the world for 1.53 to ship with that inconsistency.</p>",
        "id": 242605085,
        "sender_full_name": "pnkfelix",
        "timestamp": 1623680887
    }
]