[
    {
        "content": "<p>Following up from the seeming lack of volunteers for crater triage for this cycle, I wanted to inquire with folks on the release team on several questions:</p>\n<ul>\n<li>Are folks generally able/interested, but need forewarning? (e.g., is a rotation helpful for making sure we have someone?)</li>\n<li>If not, is this due to lack of time in general or some particular attribute of this task? What can we do to make it possible for those currently on release to participate?</li>\n</ul>\n<p>cc <span class=\"user-group-mention\" data-user-group-id=\"2907\">@T-release</span></p>",
        "id": 244748516,
        "sender_full_name": "simulacrum",
        "timestamp": 1625254624
    },
    {
        "content": "<p>Rotation and forewarning would be extremely helpful, IMO</p>",
        "id": 244748724,
        "sender_full_name": "tmandry",
        "timestamp": 1625254735
    },
    {
        "content": "<p>ideally there would be a \"secondary\" who's more experienced, in case the primary needs help</p>",
        "id": 244749051,
        "sender_full_name": "tmandry",
        "timestamp": 1625254927
    },
    {
        "content": "<p>One impediment is that sometimes I don't know what I'm signing up for, since I've never done it before. In my head it's a potentially unbounded use of my time that I may not have all the requisite skills for, which makes me hesitant to volunteer, which is also unfair.</p>",
        "id": 244749239,
        "sender_full_name": "tmandry",
        "timestamp": 1625255060
    },
    {
        "content": "<p>to summarize: I want to help, I want there to be fairness, and I want to know I'll have support if I need it</p>",
        "id": 244749660,
        "sender_full_name": "tmandry",
        "timestamp": 1625255368
    },
    {
        "content": "<p>for me it's mostly that I have a huge pile of things to do around the project and I need to prioritize :(</p>",
        "id": 244750373,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1625255756
    },
    {
        "content": "<p>I would have had time if if were ok to wait for the weekend. I don't know if that was a hard deadline or you just thought no one would step up because I hadn't said anything.</p>",
        "id": 244770175,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1625271397
    },
    {
        "content": "<p>That no one said anything; I wanted it over with since I wasn't sure I'd find energy on the weekend.</p>",
        "id": 244772456,
        "sender_full_name": "simulacrum",
        "timestamp": 1625274625
    },
    {
        "content": "<p>I don't have any capacity for additional work at the moment myself.</p>",
        "id": 244786972,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1625296083
    }
]