[
    {
        "content": "<p>Sorry for the late reply, this discussion does have me thinking, if there are some low effort ways we can improve communication around critical issues.</p>\n<p>What would people think about a <code>#critical-ops</code> (or w/e name) stream where you could safely <code>@everyone</code> to alert in the channel about critical issues?</p>\n<p>The messages could just link to the discussion in another stream or to the GitHub comment, but it would provide people a separate bucket that they can make sure they get alerted on.</p>",
        "id": 243203553,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1624047104
    },
    {
        "content": "<p>Hm. Can you say more about what \"critical issues\" are? If you mean P-critical, I don't think that's a good interpretation of the meaning -- they don't really mean that all hands need to be fixing or caring about them, just that we aim to have a resolution by the associated release (ideally via the milestone).</p>",
        "id": 243204271,
        "sender_full_name": "simulacrum",
        "timestamp": 1624047622
    },
    {
        "content": "<p>I don’t think the intention is to have all hands on deck, but it allows people to see what’s going on at very high level even if they’re not a part of fixing it.</p>\n<p>Because I know for some GitHub’s notifications are still pretty overwhelming and it can be easier to miss.</p>\n<p>Just speaking for myself I get no GitHub notifications outside of me deliberately choosing to go to the website or app, but I get Zulip notifications on my phone.</p>",
        "id": 243204768,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1624047891
    },
    {
        "content": "<p>Sure, but -- I guess -- what would your goal be with having P-critical notify you? From my perspective, T-release members shouldn't need to know until late in the cycle -- T-compiler is in charge of the implementation/fixing. Weekly reports, though, on progress and status might help -- but to be honest from my perspective it's really hard to gauge whether something will happen</p>",
        "id": 243205750,
        "sender_full_name": "simulacrum",
        "timestamp": 1624048476
    },
    {
        "content": "<p>Well personally I think information should be shared as soon as possible even if it’s not considered actionable yet, it’s easier to take action when you’re already caught up with the situation.</p>\n<p>I also just think there’s inherent value in having a dedicated release-ops to collect this information in one place. Easier to spend 5 minutes every couple days reading one stream, then spending a half hour reading through a long GitHub thread to understand the context.</p>",
        "id": 243207338,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1624049543
    },
    {
        "content": "<p>We can feed issues labeled automatically into a stream, but it's a lot of work to prepare summaries and information on a regular basis</p>",
        "id": 243207556,
        "sender_full_name": "simulacrum",
        "timestamp": 1624049708
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116122\">simulacrum</span> <a href=\"#narrow/stream/241545-t-release/topic/critical-ops/near/243205750\">said</a>:</p>\n<blockquote>\n<p>From my perspective, T-release members shouldn't need to know until late in the cycle -- T-compiler is in charge of the implementation/fixing.</p>\n</blockquote>\n<p>I do see T-release as having a responsibility to shepherd issues for beta/stable, even though we don't own the development work</p>",
        "id": 243208318,
        "sender_full_name": "cuviper",
        "timestamp": 1624050242
    },
    {
        "content": "<p>I don’t really see a high value in creating new summary reports, I imagined it more as a place for “in-flight” updates or in a “as it happens” format.</p>",
        "id": 243208874,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1624050682
    },
    {
        "content": "<p>Discussions or updates don't currently really happen on any regular basis outside T-compiler meetings though; I'm not sure what updates to the channel would be provided (or who would create them).</p>",
        "id": 243209519,
        "sender_full_name": "simulacrum",
        "timestamp": 1624051239
    },
    {
        "content": "<p>If we want to run through all issues during each T-release meeting, that could work</p>",
        "id": 243209682,
        "sender_full_name": "simulacrum",
        "timestamp": 1624051384
    },
    {
        "content": "<p>let's try that -- we can refine if that feels too tedious/burdensome</p>",
        "id": 243209877,
        "sender_full_name": "cuviper",
        "timestamp": 1624051548
    },
    {
        "content": "<p>Do you want to own that project in terms of leading those discussion(s) going forward?</p>",
        "id": 243210221,
        "sender_full_name": "simulacrum",
        "timestamp": 1624051835
    },
    {
        "content": "<p><a href=\"/user_uploads/4715/Ij7qu2TP_0dVcS0aazbbEgHf/C04CE145-2DB8-40FE-97C7-49D30F6B78FE.jpg\">C04CE145-2DB8-40FE-97C7-49D30F6B78FE.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/4715/Ij7qu2TP_0dVcS0aazbbEgHf/C04CE145-2DB8-40FE-97C7-49D30F6B78FE.jpg\" title=\"C04CE145-2DB8-40FE-97C7-49D30F6B78FE.jpg\"><img src=\"/user_uploads/4715/Ij7qu2TP_0dVcS0aazbbEgHf/C04CE145-2DB8-40FE-97C7-49D30F6B78FE.jpg\"></a></div>",
        "id": 243210320,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1624051931
    },
    {
        "content": "<p>Hmm I meant to post a message with that but the Zulip app deleted it.</p>",
        "id": 243210335,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1624051950
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> I think just linking to where in the meetings the discussion happened would be a big improvement, as someone not in regular attendance the compiler meeting stream can be very busy.</p>",
        "id": 243210387,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1624052018
    },
    {
        "content": "<p>A good portion of each meeting is about backports and regressions -- in fact, it's rare that anything else really gets discussion time.</p>",
        "id": 243210442,
        "sender_full_name": "simulacrum",
        "timestamp": 1624052057
    },
    {
        "content": "<p>But I am still not fully connecting whether considerable value can be derived from those discussions</p>",
        "id": 243210456,
        "sender_full_name": "simulacrum",
        "timestamp": 1624052084
    },
    {
        "content": "<p>Sure but not all regressions are equally impactful as something like the incr comp issues.</p>",
        "id": 243210635,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1624052262
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> you have your hands in so many things that I don't expect you will get much value at all. <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 243210725,
        "sender_full_name": "cuviper",
        "timestamp": 1624052323
    },
    {
        "content": "<p>I can own that part of the meeting</p>",
        "id": 243210766,
        "sender_full_name": "cuviper",
        "timestamp": 1624052358
    },
    {
        "content": "<p>I think the goal for T-release is not even discussion most of the time, just checking status</p>",
        "id": 243210890,
        "sender_full_name": "cuviper",
        "timestamp": 1624052477
    },
    {
        "content": "<p>I was trying to extrapolate to others to be clear. I am subscribed to rust-lang/rust globally, and try to skim each thread at a high level, so I definitely don't think I would derive much value -- but if we think there is value for others, that might be helpful.</p>",
        "id": 243210897,
        "sender_full_name": "simulacrum",
        "timestamp": 1624052491
    },
    {
        "content": "<p>basically triage, but with higher priority and visibility</p>",
        "id": 243210923,
        "sender_full_name": "cuviper",
        "timestamp": 1624052514
    },
    {
        "content": "<p>(I don't know how you drink from that fire hose!)</p>",
        "id": 243210989,
        "sender_full_name": "cuviper",
        "timestamp": 1624052560
    },
    {
        "content": "<p>I think part of it is that I think the status on most P-critical issues goes from no activity (80% of time open) -&gt; PR (10% of time) -&gt; Closed (10% of time) in the happy path, with obviously some +/- on that, but generally this is not actionable at any point without being able to coordinate engineering resources, IMO.</p>",
        "id": 243210998,
        "sender_full_name": "simulacrum",
        "timestamp": 1624052580
    },
    {
        "content": "<p>(Which, obviously, realistically none of us have the ability to do).</p>",
        "id": 243211011,
        "sender_full_name": "simulacrum",
        "timestamp": 1624052595
    },
    {
        "content": "<p>if P-critical means release-blocking, we need to have some influence</p>",
        "id": 243211127,
        "sender_full_name": "cuviper",
        "timestamp": 1624052696
    },
    {
        "content": "<p>The problem is \"over who\" :)</p>",
        "id": 243211160,
        "sender_full_name": "simulacrum",
        "timestamp": 1624052727
    },
    {
        "content": "<p>from polite nagging, to asking other team leads, as the situation may fit</p>",
        "id": 243211163,
        "sender_full_name": "cuviper",
        "timestamp": 1624052730
    },
    {
        "content": "<p>Like, to some extent, that happens naturally through T-compiler meetings. I think we can add atop of that, perhaps, but I'm not sure that it will be of much help.</p>",
        "id": 243211195,
        "sender_full_name": "simulacrum",
        "timestamp": 1624052762
    },
    {
        "content": "<p>our part might just be a summary, \"here's what T-compiler (or whoever) is saying\"</p>",
        "id": 243211583,
        "sender_full_name": "cuviper",
        "timestamp": 1624053108
    },
    {
        "content": "<p>I would also hope that this stream would have value for non-team members to help out when possible.</p>\n<p>For example, in the early stages of a new regression when there’s no MCVE currently available for the issue. Or help with testing a fix in nightly in their production code. Things that anyone could do, but don’t really have a channel to communicate those tasks.</p>",
        "id": 243211592,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1624053119
    },
    {
        "content": "<p>We do! Or, at least, that part is potentially much easier.</p>",
        "id": 243211651,
        "sender_full_name": "simulacrum",
        "timestamp": 1624053144
    },
    {
        "content": "<p>@rustbot ping cleanup or similar pings a whole bunch of people specifically interested in helping with that kind of work</p>",
        "id": 243211687,
        "sender_full_name": "simulacrum",
        "timestamp": 1624053187
    },
    {
        "content": "<p>Creating a stream on Zulip for such issues would be pretty easy.</p>",
        "id": 243211724,
        "sender_full_name": "simulacrum",
        "timestamp": 1624053222
    },
    {
        "content": "<p>Yeah, having a stream with pings like that is kinda what I’m after. The problem I have with groups is it requires deciding to opt into the group, which is not a visible concept in Zulip really, and it might give people impression that they’re signing up to do it forever, or at least repeatedly which is maybe not what they can do.</p>",
        "id": 243212085,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1624053542
    },
    {
        "content": "<p>(To be clear, no such groups on Zulip exist today; we only have the triagebot lists controlled via the team repo)</p>",
        "id": 243212145,
        "sender_full_name": "simulacrum",
        "timestamp": 1624053597
    },
    {
        "content": "<p>But forwarding ping groups to streams / topics here on Zulip would be easy; the code is basically all written, just a few connecting lines need drawing.</p>",
        "id": 243212211,
        "sender_full_name": "simulacrum",
        "timestamp": 1624053622
    },
    {
        "content": "<p>Is that not the same thing, I thought the triagebot lists were Zulip groups?</p>",
        "id": 243212234,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1624053644
    },
    {
        "content": "<p>Oh right @rustbot is only on GitHub.</p>",
        "id": 243212283,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1624053691
    },
    {
        "content": "<p>no, triagebot doesn't know anything about zulip groups</p>",
        "id": 243212559,
        "sender_full_name": "simulacrum",
        "timestamp": 1624053877
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116122\">simulacrum</span> <a href=\"#narrow/stream/241545-t-release/topic/critical-ops/near/243212211\">said</a>:</p>\n<blockquote>\n<p>But forwarding ping groups to streams / topics here on Zulip would be easy; the code is basically all written, just a few connecting lines need drawing.</p>\n</blockquote>\n<p>This sounds like an interesting idea. The supposed benefits are, IIUC: 1. zulip is better ingrated with mobile devices than github for some contributors, and 2. zulip is better than github for ad-hoc discussion in response to a live ping... Does that sounds right?</p>",
        "id": 243835609,
        "sender_full_name": "pnkfelix",
        "timestamp": 1624563304
    },
    {
        "content": "<p>Yeah, Zulip notifications are more managable for myself, so they are louder and easier to reach me. I could get GitHub notifications to my phone (and do use the mobile app), but enabling push notifications would be enabling dozens notifications a day (nearly all of which I don't need or want to handle immediately). There's no way fine grained way currently to be like \"only give notifications for the project board in <code>rust-lang/rust</code>\"  in Github at the moment.</p>\n<p>Where as on Zulip that can be accomplished by just having a stream.</p>",
        "id": 243836903,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1624563934
    }
]