[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"220273\">@Jane Lusby</span> said that there was no discussion of how <code>#[derive(Default)]</code> on enums (<a href=\"https://github.com/rust-lang/rfcs/pull/3107\">RFC 3107</a>) would interact with <code>#[non_exhaustive]</code>. I see no reason the enum itself could not be marked <code>#[non_exhaustive]</code>, and the RFC as currently written does not prohibit this. However, the RFC <em>does</em> prohibit tagging a non-exhaustive <em>variant</em> due to concerns about future compatibility with regard to generated bounds. While I am modifying the RFC to only apply to unit variants, I believe that it would be best to maintain this restriction. This would allow us to punt on the derived bounds, maintaining both forward and backward compatibility. Thoughts?</p>",
        "id": 241600776,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1622846275
    },
    {
        "content": "<p>Anyone mind weighing in on this?</p>",
        "id": 241849287,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1623104564
    },
    {
        "content": "<p>just quickly looking at the comments, i am somewhat sympathetic to <span class=\"user-mention\" data-user-id=\"125270\">@scottmcm</span>'s perspective. in particular, it doesn't really seem to buy much. but maybe other derives don't either, individually, and yet they are undeniably convenient. but they also don't come with their own attribute.</p>\n<p>in contrast to Scott's -0, i think i'm more like +0. in particular, i would love to see more sophisticated derives make their way into std (error handling seems like a particularly good candidate, although not necessarily a slam dunk), and this might be a good first step toward that.</p>",
        "id": 241850290,
        "sender_full_name": "BurntSushi",
        "timestamp": 1623105299
    },
    {
        "content": "<p>Respectfully, I was more asking about this specific thing (from <span class=\"user-mention\" data-user-id=\"220273\">@Jane Lusby</span>):</p>\n<blockquote>\n<p>One proposal that we discussed is initially only allowing <code>#[default]</code> on unit variants. </p>\n</blockquote>\n<p>I just wasn't sure if the libs team preferred to maintain the restriction on allowing <code>#[default]</code> to be placed on a <code>#[non_exhaustive]</code> unit variant.  Obviously the RFC has been stripped down <em>a lot</em>, but Jane said \"all in all I'd say we're interested in something like this\", so I figured I could update the text to match what they were thinking. Not sure if you were in that meeting, of course.</p>",
        "id": 241850606,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1623105566
    },
    {
        "content": "<p>I think that <code>#[default]</code> on a non-exhaustive variant would be fine, because it'd be a compilation error inside the derive to add a field without a default to that variant.  Said otherwise, <code>non_exhaustive</code> only affects other crates, but <code>derive</code>s happen in the same crate.</p>\n<p>(I see this case as different from the non-exhaustive struct with FRU case, because the FRU can happen in a different crate without the defining crate ever seeing a problem.)</p>",
        "id": 241852304,
        "sender_full_name": "scottmcm",
        "timestamp": 1623106958
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"222471\">BurntSushi</span> <a href=\"#narrow/stream/219381-t-libs/topic/.23.5Bderive.28Default.29.5D.20on.20enums.20.E2.80.94.20non-exhaustive.20interaction/near/241850290\">said</a>:</p>\n<blockquote>\n<p>in particular, it doesn't really seem to buy much. but maybe other derives don't either, individually, and yet they are undeniably convenient. but they also don't come with their own attribute.</p>\n</blockquote>\n<p>Certainly <code>Eq</code> has no methods, so \"would be easy to write on its own\" isn't an argument against a derive.</p>\n<p>I think the \"non-structuralness\" is the bigger factor.  Every other derive (that generates any methods) cares about all the variants.  This would be the only one that doesn't.</p>\n<p>And it's the other things that come along with that too, like this being the only one that generates its bounds based on something other that the parameter list.</p>",
        "id": 241852939,
        "sender_full_name": "scottmcm",
        "timestamp": 1623107442
    },
    {
        "content": "<p>...I'd forgotten that the RFC has a different rule for type parameter bounds.  That changes my previous answer, because it subtly changes the trait bounds.</p>",
        "id": 241852983,
        "sender_full_name": "scottmcm",
        "timestamp": 1623107493
    },
    {
        "content": "<p>RFC is being updated to remove the bounds altogether, given that it'll be a unit variant (at least for now). It's pretty widely accepted that the derived bounds can be wrong (see <a href=\"https://github.com/rust-lang/rust/issues/26925\">#26925</a>), but that's being avoided altogether by requiring a unit variant.</p>",
        "id": 241854014,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1623108252
    },
    {
        "content": "<p>ah sorry, i missed that you were asking a deeper question here. no, indeed, i was not at that meeting (nor any libs meeting unfortunately). so i'll let other folks respond. :)</p>",
        "id": 241854110,
        "sender_full_name": "BurntSushi",
        "timestamp": 1623108346
    },
    {
        "content": "<blockquote>\n<p>(error handling seems like a particularly good candidate, although not necessarily a slam dunk), and this might be a good first step toward that.</p>\n</blockquote>\n<p>my thoughts exactly</p>",
        "id": 241854163,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1623108364
    },
    {
        "content": "<p>No problem. Just wasn't sure if you realized that's what I was asking.</p>",
        "id": 241854168,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1623108366
    },
    {
        "content": "<blockquote>\n<p>I think the \"non-structuralness\" is the bigger factor. Every other derive (that generates any methods) cares about all the variants. This would be the only one that doesn't.</p>\n</blockquote>\n<p>this strikes me as a justification after the fact, I'm not confident that this is the source of the current unstated policy. My guess at the history of derives all being very structural is that it's because those were the easiest / least bikeshed-y, not because people didn't want to go beyond that.</p>",
        "id": 241854398,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1623108562
    },
    {
        "content": "<p>regarding <code>#[non_exhaustive]</code> honestly it just makes me more worried about the difference in bounds behaviour</p>",
        "id": 241855059,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1623109154
    },
    {
        "content": "<p>the reason this isn't an issue with the other derives is because they don't have any sort of conditionally introduced dependencies on type parameters. If they add a type parameter to the struct it's a breaking change, and the only way to change type parameters is to add one</p>",
        "id": 241855135,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1623109221
    },
    {
        "content": "<p>with the enum derive you can break things by adding an existing generic to the default variant</p>",
        "id": 241855147,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1623109236
    },
    {
        "content": "<p>presumably the <code>#[derive(Default)]</code> for the struct will still have the same bounds behaviour of other macros</p>",
        "id": 241855161,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1623109257
    },
    {
        "content": "<p>which is extra surprising</p>",
        "id": 241855165,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1623109261
    },
    {
        "content": "<p>Having to move from a derive to an explicit impl whenever you add members to the default variant of an enum seems like a good way to avoid this footgun by forcing users specify the bounds themselves</p>",
        "id": 241855286,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1623109413
    },
    {
        "content": "<p>so I'm not optimistic for us ever being able to add members, particularly with generic types, to the default variant of the derive</p>",
        "id": 241855356,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1623109461
    },
    {
        "content": "<p>but I don't want to rule it out since there might be some way to resolve all of this that we haven't thought of yet</p>",
        "id": 241855372,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1623109479
    },
    {
        "content": "<p>so I think overall my lean is to ban the combination of <code>#[non_exhaustive]</code> and <code>#[default]</code> with very clear diagnostics as to why the error exists, but with an expectation that we very well may remove the restriction in the future if we ever give up on a more complex derive</p>",
        "id": 241855413,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1623109537
    }
]