[
    {
        "content": "<p>Is there value in an <code>ErrorKind</code> that does not apply to all platforms?</p>\n<p>In Windows files can be locked by another process whereas *nix does not have file locks. This means that there is no *nix equivalent of the Windows <code>ERROR_SHARING_VIOLATION</code>. However, cross platform code will likely still want to account for the possibility of a file being temporarily locked. For example, if encountering this error they could retry accessing the file or give a more helpful error message.</p>\n<p>Therefore my thinking is that it's useful to have something like <code>ErrorKind::FileLocked</code>, even though it's (as far as I'm aware) only applicable to Windows. This way cross platform code needn't have to be aware of Windows error codes. And having an <code>ErrorKind</code> gives a strong hint that this is indeed a likely error.</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"220273\">@Jane Lusby</span></p>",
        "id": 240185341,
        "sender_full_name": "Chris Denton",
        "timestamp": 1621948638
    },
    {
        "content": "<p>Possibly, but if the existing PR to add new ErrorKinds is an indicator we probably don't want to start with adding a variant like this in std. ErrorKinds are insta stable and so I think we might prefer to see an external library implementing the platform specific checks that shows the ErrorKinds are a good fit.</p>",
        "id": 240199436,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1621954375
    },
    {
        "content": "<p>Tho there was an update that we might not have to make them insta stable</p>",
        "id": 240199513,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1621954412
    },
    {
        "content": "<p>So actually I need to check in on that and see where we stand atm</p>",
        "id": 240199555,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1621954430
    },
    {
        "content": "<p>Sure! At the moment I'm really just trying to clarify where people stand in principle. In the github issue you seemed to have some concerns about being too platform specific but I felt like I'd be derailing that discussion by carrying on with this topic.</p>",
        "id": 240200217,
        "sender_full_name": "Chris Denton",
        "timestamp": 1621954662
    }
]