[
    {
        "content": "<p>Rust CI is currently not gated on running the std tests on any targets that rely on compiler_builtins/libm. See e.g. this test failure <a href=\"https://github.com/rust-lang/rust/pull/85925#discussion_r654904770\">https://github.com/rust-lang/rust/pull/85925#discussion_r654904770</a> This makes some sense, since none of these targets are tier 1. However, these components are used in many tier 2/tier 3 targets. Would it make sense to try to somehow run the Rust test suite with compiler_builtins in CI?</p>",
        "id": 243482297,
        "sender_full_name": "Jethro",
        "timestamp": 1624348205
    },
    {
        "content": "<p>additional background: LLVM will insert calls to various functions as part of code generation. On e.g. Linux these functions are fulfilled by linking libc, libm, libgcc, etc. For platforms that don't have these functions natively (bare metal etc.), the Rust project has developed the compiler_builtins and libm crates.</p>",
        "id": 243482301,
        "sender_full_name": "Jethro",
        "timestamp": 1624348211
    },
    {
        "content": "<p>I already discussed this with the infra team and they seem ok with doing testing on some easy-to-support target (e.g. Linux, but with compiler_builtins) if some other team (likely you folks?) decides this would be useful.</p>",
        "id": 243482312,
        "sender_full_name": "Jethro",
        "timestamp": 1624348219
    },
    {
        "content": "<p>(on a related note: when is the next libs-impl team meeting? I don't see it in the google calendar)</p>",
        "id": 243482581,
        "sender_full_name": "Jethro",
        "timestamp": 1624348420
    },
    {
        "content": "<blockquote>\n<p>Would it make sense to try to somehow run the Rust test suite with compiler_builtins in CI?</p>\n</blockquote>\n<p>Yes, absolutely. That'd be great. Check with <a class=\"stream\" data-stream-id=\"242791\" href=\"/#narrow/stream/242791-t-infra\">#t-infra</a> for the details though. They manage the CI and test suite.</p>",
        "id": 243490718,
        "sender_full_name": "Mara",
        "timestamp": 1624353753
    },
    {
        "content": "<blockquote>\n<p>already discussed this with the infra team</p>\n</blockquote>\n<p>Ah ^^</p>",
        "id": 243490741,
        "sender_full_name": "Mara",
        "timestamp": 1624353766
    },
    {
        "content": "<blockquote>\n<p>if some other team (likely you folks?) decides this would be useful.</p>\n</blockquote>\n<p>We're also (indirectly) responsible for compiler_builtins, so having that properly tested would be great.</p>",
        "id": 243490902,
        "sender_full_name": "Mara",
        "timestamp": 1624353862
    },
    {
        "content": "<blockquote>\n<p>when is the next libs-impl team meeting? I don't see it in the google calendar</p>\n</blockquote>\n<p>Oh, I forgot to set the meeting to repeat. The (non-api) libs meeting is every wednesday, before the libs API meeting. So next one is tomorrow</p>",
        "id": 243491090,
        "sender_full_name": "Mara",
        "timestamp": 1624353968
    },
    {
        "content": "<p>ok, do you want to put this on the agenda for tomorrow?</p>",
        "id": 243491374,
        "sender_full_name": "Jethro",
        "timestamp": 1624354130
    },
    {
        "content": "<p>unless you think this is ready for a PR?</p>",
        "id": 243493224,
        "sender_full_name": "Jethro",
        "timestamp": 1624355285
    },
    {
        "content": "<p>i don't think there's much to discuss. we should test things like this. so if you send a PR that fixes that (without increasing the CI times too much), I'll approve it.</p>",
        "id": 243495967,
        "sender_full_name": "Mara",
        "timestamp": 1624357157
    }
]