[
    {
        "content": "<p>(moved from t-lang/doc)</p>\n<p><code>std::ptr::eq</code> claims that it compares <code>*const dyn Trait</code> by address and implementation,</p>\n<blockquote>\n<p>Compares raw pointers for equality.<br>\n...<br>\nTraits are also compared by their implementation.</p>\n</blockquote>\n<p>but this is not always correct (it may have false negatives (I don't know if it can have false positives; it was mentioned in the t-lang/doc topic that it might))</p>\n<p>Since vtables are not guaranteed to be unique, two <code>*const dyn Trait</code> that point to the same address, with the same type, may compare unequal if the vtable pointers are different (despite them containing the same functions (they may contain different compilations of the same function))</p>\n<p>Example: <a href=\"https://rust.godbolt.org/z/dhM3v9nz7\">https://rust.godbolt.org/z/dhM3v9nz7</a> (prints <code>false</code> despite <code>y</code> and <code>z</code> both being <code>&amp;dyn T</code> references to <code>x: i32</code>).</p>\n<p>Should the the documentation for <code>std::ptr::eq</code> be changed? For example to something like </p>\n<blockquote>\n<p>Traits are also compared by their implementation <strong>on a best-effort basis (i.e. two pointers to different locations will never compare equal, but two pointers to the same location may or may not compare equal)</strong></p>\n</blockquote>\n<p>or </p>\n<blockquote>\n<p>Traits are also compared by their <del>implementation</del> <strong>vtable pointer (i.e. two pointers to the same location and type may not compare equal,</strong> <strong><em>(but no two pointers two different types or locations will compare equal (?))</em></strong> <strong>)</strong></p>\n</blockquote>\n<p>?</p>\n<p>(I think this could also be resolved by ensuring that vtable pointers are unique per (type minus lifetimes, trait) pair, but that would be a much bigger change than just documentation.)</p>",
        "id": 273027035,
        "sender_full_name": "Zachary Sample",
        "timestamp": 1645659165
    },
    {
        "content": "<p>important comment by <span class=\"user-mention\" data-user-id=\"352985\">@tm</span> </p>\n<blockquote>\n<p>AFAIK, the current code generation allows to for comparison to have both false positives and false negatives, since methods can be merged together, and subsequently complete vtable for different types could be merged as well.</p>\n</blockquote>",
        "id": 274255022,
        "sender_full_name": "RalfJ",
        "timestamp": 1646501183
    }
]