[
    {
        "content": "<p>So, in &lt;<a href=\"https://internals.rust-lang.org/t/typeid-structuraleq-is-this-necessary-or-planned-to-be-useful-in-the-future/14167?u=infernodeity\">https://internals.rust-lang.org/t/typeid-structuraleq-is-this-necessary-or-planned-to-be-useful-in-the-future/14167?u=infernodeity</a>&gt;. I brought up the fact that TypeId is StructuralEq in rustc's implementation, which seems to be an artifact of the implementation deriving PartialEq and Eq.  I also note an implementation of TypeId I seek to use, which solves the soundness issue with collisions, but is incompatible with derive(PartialEq,Eq). </p>\n<p>Based on some discussion on the Rust Community Discord, it turns out a few more types (most notably, String),  also have these same artifacts. Currently they are not affecting the well-formedness of any code, but it is something to consider.</p>\n<p>Currently, there is a semantic difference between deriving PartialEq or Eq, and providing equivalent manual implementations.  It may be a good idea for someone (and I do certainly volunteer myself in the neer future) to go through the standard library and remove the derives from places they currently are not effective (replacing them instead with manual implementations that are equivalent). I would also think it's a good idea to explicitly document which types are supposed to derive either and/or both, due to the semantic difference. Would the latter part require an RFC, or something similar? Given the fact the former is explicitly only affecting types which cannot be used in structural match, I assume that would not, but would require a crater run (please correct me if I am wrong).</p>",
        "id": 231690417,
        "sender_full_name": "Connor Horman",
        "timestamp": 1616612521
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"257758\">@Connor Horman</span> Some kind of proposal document would be nice. Maybe an RFC isn't the right thing here, but a document or github issue explaining the situation, the problem, and your plan to fix/change things, would be great. Then we have something concrete to discuss and give an opinion on.</p>",
        "id": 231696271,
        "sender_full_name": "Mara",
        "timestamp": 1616614756
    },
    {
        "content": "<p>replacing them all with manual implementations doesn't sound great though. maybe the problem can be fixed in some other way. but it's definitely a problem we should discuss</p>",
        "id": 231696450,
        "sender_full_name": "Mara",
        "timestamp": 1616614821
    },
    {
        "content": "<p>Indeed, repetative structural impls would not be great. It could possibly be fixed by an unstable derive macro (is that possible), or a declmacro that does it the same way as the derive (but without the extra Structrual{Partial,}Eq impls).<br>\nI can certainly file an issue on Github if that's the way to go.</p>",
        "id": 231706149,
        "sender_full_name": "Connor Horman",
        "timestamp": 1616619035
    },
    {
        "content": "<p>I opened an issue for this: <a href=\"https://github.com/rust-lang/rust/issues/84391\">https://github.com/rust-lang/rust/issues/84391</a>.</p>",
        "id": 237072050,
        "sender_full_name": "Connor Horman",
        "timestamp": 1619980509
    }
]