[
    {
        "content": "<p>Is there difference between <code>Vec::iter()</code> and <code>&lt;Vec as IntoIterator&gt;::into_iter()</code> other than <code>Vec::iter()</code> taking <code>&amp;self</code> and <code>into_iter()</code> taking owned <code>self</code>?</p>",
        "id": 213672430,
        "sender_full_name": "Noah Lev",
        "timestamp": 1602971562
    },
    {
        "content": "<p>I couldn't find any documentation on when you should use one over the other.</p>",
        "id": 213672436,
        "sender_full_name": "Noah Lev",
        "timestamp": 1602971578
    },
    {
        "content": "<p>TL;DR: No, there isn't really much more to it. </p>\n<ul>\n<li><code>Vec.iter()</code> == \"iterate over all elements in that vector\"</li>\n<li><code>Vec.into_iter()</code> == \"turn the vector into an iterator which yields all values which had been in the vector\"</li>\n<li><code>iter</code> does not consume the vector and returns references to the values (iter_mut() returns mutable references).</li>\n<li><code>into_iter</code> moves the vector into the iterator consuming it and returns owned values (like you mentioned)</li>\n<li><code>iter</code>/<code>iter_mut</code> are implemented on slice and accesses through auto-dereferencing the vec to a slice</li>\n<li><code>into_iter</code> is a generic trait implemented for <code>Vec</code>. You can be generic over anything implementing <code>IntoIterator</code> but not  over anything having a iter/iter_mut method. Through <code>IntoIterator</code> is implemented for references  (e.g. <code>impl&lt;'a, T&gt; IntoIterator for &amp;'a Vec&lt;T&gt;</code> )acting like the <code>.iter()</code> function.</li>\n</ul>",
        "id": 213675260,
        "sender_full_name": "Philipp Korber",
        "timestamp": 1602976222
    },
    {
        "content": "<p>So if you still need the <code>Vec</code> after iteration use <code>.iter()</code>/<code>.iter_mut()</code>.</p>\n<p>If not and especially if you might move the elements from the vector somewhere else <code>.into_iter()</code> is likely a good idea.</p>",
        "id": 213675659,
        "sender_full_name": "Philipp Korber",
        "timestamp": 1602976870
    },
    {
        "content": "<p>Is it bad for performance to use <code>iter()</code> when you could use <code>into_iter()</code>? (I.e., when you don't need to use the vector later, but you also don't need owned values.)</p>",
        "id": 213676062,
        "sender_full_name": "Noah Lev",
        "timestamp": 1602977457
    },
    {
        "content": "<p>The main reason I ask for that is because <code>iter()</code> is shorter <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 213676077,
        "sender_full_name": "Noah Lev",
        "timestamp": 1602977482
    },
    {
        "content": "<p>Normally not.</p>\n<p>The only difference would be that the vector is dropped later then it would be else wise. <br>\nThis can matter in some case but in many it doesn't.</p>",
        "id": 213676279,
        "sender_full_name": "Philipp Korber",
        "timestamp": 1602977738
    },
    {
        "content": "<p>But thinks can be somewhat complicated.</p>\n<p>Like e.g. if the vector now lives across a <code>.await</code> boundary and didn't before it now needs to be moved into the generator, or if it's big and you spend a lot of time between you no longer using it and it being dropping  it might wast some memory uneccesary. But often the  difference is  small, like if it lives across a <code>.await</code> boundary the size of the generate grows by ~3*usize and if the the vector is not very big the memory allocated longer then necessary might not have been needed by the system eitherway.</p>\n<p>In some cases where <code>Drop</code>'ing the elements in the vector is expensive dropping it later can even be good.</p>\n<p>But in many use-cases the only relevant drawback is that the memory is freed <em>slightly</em> later, which often doesn't matter either.</p>\n<p>So for the beginning I would not worry about it to much. Only if I realize my program is too slow or uses too much memory would I spend time one improving this.  Later when you have a better understanding of how freeing up memory earlier can affect performance and how it can affect generators/futures you might just do thinks more optimal from the get to go. But the main priority is to produce thinks which work correctly, and only if the do optimize for  performance (at least for me).</p>",
        "id": 213676821,
        "sender_full_name": "Philipp Korber",
        "timestamp": 1602978413
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"307537\">@Camelid</span> I'd say that if you don't need ownership, then <code>.iter()</code> helps communicate that so it's perfectly reasonable.</p>",
        "id": 213677782,
        "sender_full_name": "scottmcm",
        "timestamp": 1602979731
    },
    {
        "content": "<p>For some uses into_iter can reuse the allocation and thus be more efficient than iter()</p>",
        "id": 217327303,
        "sender_full_name": "The 8472",
        "timestamp": 1605818360
    }
]