[
    {
        "content": "<p>In the <code>core::arch</code> modules for x86 and x86_64 some of the avx instructions are listed as also requiring sse or sse2, as follows:</p>\n<ul>\n<li>avx,sse. _mm_cmp_ps</li>\n<li>avx,sse. _mm_cmp_ss</li>\n<li>avx,sse. _mm_permute_ps</li>\n<li>avx,sse. _mm256_loadu2_m128</li>\n<li>avx,sse. _mm256_storeu2_m128</li>\n<li>avx,sse. _mm256_zextps128_ps256</li>\n<li>avx,sse2. _mm_cmp_pd</li>\n<li>avx,sse2. _mm_cmp_sd</li>\n<li>avx,sse2. _mm_permute_pd</li>\n<li>avx,sse2. _mm256_loadu2_m128d</li>\n<li>avx,sse2. _mm256_loadu2_m128i</li>\n<li>avx,sse2. _mm256_storeu2_m128d</li>\n<li>avx,sse2. _mm256_storeu2_m128i</li>\n<li>avx,sse2. _mm256_zextpd128_pd256</li>\n<li>avx,sse2. _mm256_zextsi128_si256</li>\n</ul>\n<p>Given that no <em>other</em> avx instructions are listed as being avx + some sse level this seems rather out of place. I think that one of the following is most likely:</p>\n<ul>\n<li>The docs are wrong for these, and it shouldn't list <code>sse</code> or <code>sse2</code> as being required.</li>\n<li>The docs are wrong for <em>all other</em> functions, and all other functions should also list <code>sse</code> or whatever else as part of the requirements.</li>\n<li>These functions are truly extra special in some way, and they're the only intrinsics out of all the hundreds of intrinsics that really do need to have both CPU features set.</li>\n</ul>\n<p>And yes, I know that it would be deeply unlikely to have avx enabled without also having both sse and sse2 enabled. However, I would still like the clarification and if it's the first case we could perhaps fix the listings.</p>",
        "id": 197104974,
        "sender_full_name": "Lokathor",
        "timestamp": 1589178953
    },
    {
        "content": "<p><code>avx</code> implies <code>sse2</code>, which in turn implies <code>sse</code>. It is impossible to have the <code>avx</code> feature enabled without the <code>sse</code> feature.</p>",
        "id": 197109695,
        "sender_full_name": "Amanieu",
        "timestamp": 1589182549
    },
    {
        "content": "<p>So I guess that rules out option 3.</p>",
        "id": 197109747,
        "sender_full_name": "Amanieu",
        "timestamp": 1589182563
    },
    {
        "content": "<p>Hmm those functions are marked as <code>#[target_feature(enable = \"avx,sse\")]</code> and a git blame shows that this dates back to the original version of the AVX intrinsics.</p>",
        "id": 197110188,
        "sender_full_name": "Amanieu",
        "timestamp": 1589182831
    },
    {
        "content": "<p>I think it's safe to just change those to <code>#[target_feature(enable = \"avx\")]</code>.</p>",
        "id": 197110208,
        "sender_full_name": "Amanieu",
        "timestamp": 1589182849
    },
    {
        "content": "<p>I seem to recall that past discussions of <code>target_feature</code> were dominated by \"we don't (yet) want to get into the business of defining implications/hierarchies between different features\", so I guess that's why? In a cursory search I can't find evidence that this position has changed, but maybe LLVM's own implications between target features kick in (<code>rustc --print cfg -Ctarget-feature=+avx</code> indeed lists SSE up to 4.1 as enabled)</p>",
        "id": 197111888,
        "sender_full_name": "Hanna Kruppe",
        "timestamp": 1589183934
    },
    {
        "content": "<p>Also worth noting, <code>target_feature_11</code> (allow safe calls if the required target_features are enabled in the caller) as implemented in <a href=\"https://github.com/rust-lang/rust/issues/69274\">#69274</a> does not consider any such implications, it just checks if the set of <code>target_feature(enable=\"foo\")</code> attributes on one function are a superset of the attributes on the other function.</p>",
        "id": 197112120,
        "sender_full_name": "Hanna Kruppe",
        "timestamp": 1589184059
    },
    {
        "content": "<p>(To be clear, that's is not just an arbitrary choice in the implementation PR, it matches the RFC text, but you could argue that this part of the RFC should be re-considered too.)</p>",
        "id": 197112412,
        "sender_full_name": "Hanna Kruppe",
        "timestamp": 1589184226
    },
    {
        "content": "<p>Hmm, even if Rust wasn't making a decision about target feature relationships:</p>\n<ul>\n<li>either those functions don't need <code>sse</code> in the requirements, because the data types used for inputs and outputs are there even without <code>sse</code>, after all.</li>\n<li>or many, many other functions are actually wrong and they should also be declaring \"foo\" + \"bar\" for a bunch of situations, and they need to have their requirements updated accordingly.</li>\n</ul>\n<p>I guess we need to handle the hierarchy eventually, but for now i will proceed under the assumption that the docs are simply wrong for that small set of functions and that <code>avx</code> is the only true requirement.</p>",
        "id": 197180809,
        "sender_full_name": "Lokathor",
        "timestamp": 1589219245
    }
]