[
    {
        "content": "<p>Hello everyone!<br>\nI am wondering what exactly would be necessary in order to get libstd working on tvOS? I already forked the compiler+libc and made some changes to the sources of libc and std, mostly changing cfg(platform) stuff since iOS is very very similar to tvOS, and while it compiles, the outputted library is apparently a macOS library file. (Although it is arm64 arch). What exactly is necessary to get std to work on an unsupported os?</p>",
        "id": 243795485,
        "sender_full_name": "Hindrik Stegenga",
        "timestamp": 1624545450
    },
    {
        "content": "<p>I am not familiar with the intricacies of the Apple ecosystem and compiling for it, but based on that limited information I would hazard a guess your issue is not in libstd but in the need to educate the compiler itself about your target as well, including possibly defining a <a href=\"https://docs.rust-embedded.org/embedonomicon/custom-target.html\">https://docs.rust-embedded.org/embedonomicon/custom-target.html</a> or even editing the compiler source's handling of Apple stuff inside it.</p>\n<p>That, or you need to provide more information on what exactly you've done so far. ^^;</p>",
        "id": 243874302,
        "sender_full_name": "Jubilee",
        "timestamp": 1624595077
    },
    {
        "content": "<p>the target should already exist (actually, multiple targets — <code>x86_64-apple-tvos</code> for the simulator, and <code>aarch64-apple-tvos</code> for the actual device). that said i dont think these get a lot of testing, and may need someone to dust them off</p>",
        "id": 243875995,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1624597438
    },
    {
        "content": "<p>ahhhh.</p>",
        "id": 243877572,
        "sender_full_name": "Jubilee",
        "timestamp": 1624599547
    },
    {
        "content": "<p>Yes, I can compile code for no-std, with a custom build of the compiler, but I am trying to figure out how exactly and what is necessary to add support for compiling std. I already hacked around in libc/std, as the iOS APIs are very very close to tvOS, so most of all the c based function interfaces can be direct ports, but I am not completely sure what exactly is necessary besides that. I basically just added #cfg platform=tvOS attributes to all places where there is ios code. It seemed I could get stuff to compile... somewhat and with a lot of hackery to get my custom libc/std working. It still doesn't quite work for me, as it doesn't recognize the outputted library format for example. So I am wondering what the normal process is for adding support to libc/std?</p>",
        "id": 244387022,
        "sender_full_name": "Hindrik Stegenga",
        "timestamp": 1625038530
    },
    {
        "content": "<p>That sounds like a bug honestly.</p>",
        "id": 244396898,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1625045037
    },
    {
        "content": "<p>Unfortunataely, IDK who has the expertise here to help you track it down</p>",
        "id": 244396960,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1625045055
    },
    {
        "content": "<p>Hmm, do you know where it's specified in what format exactly libraries are compiled and what libc implementation is linked to?</p>",
        "id": 244399345,
        "sender_full_name": "Hindrik Stegenga",
        "timestamp": 1625046419
    },
    {
        "content": "<p>you might ask in <a class=\"stream\" data-stream-id=\"182449\" href=\"/#narrow/stream/182449-t-compiler.2Fhelp\">#t-compiler/help</a></p>",
        "id": 244400193,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1625046932
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"374054\">@Hindrik Stegenga</span> Anything that only touches a Darwin API would probably be better cfg’ed under <code>target_vendor = “apple”</code> in my opinion, all Apple devices run Darwin under the hood. For linking libraries look at std’s <code>build.rs</code></p>",
        "id": 244451906,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1625070918
    },
    {
        "content": "<p>I've done this in the past, but it makes some assumptions about apples future product line that seem dubious. It's pretty clearly a standin for some sort of <code>cfg(target_family = \"darwin\")</code> too (which I still think we should do — although it would have to still accept <code>target_family = \"unix\"</code> too — so it would make target_family be a multi-valued cfg...)</p>",
        "id": 244467667,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1625077558
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209168\">@Thom Chiovoloni</span> I believe target family is already multi-value (just added during the last release cycle.)</p>",
        "id": 244470715,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1625078994
    },
    {
        "content": "<p>oh, that's exciting. darwin should be a target_family then, IMO</p>",
        "id": 244471925,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1625079527
    },
    {
        "content": "<p>Hmm, interesting. I will dig into it a bit more then this weekend. Atleast it seems relatively easy to port libc/std as it only seems to require some #cfg_target_os changes. While I won't be able to build release ready libs, as bitcode support is enforced for app releases on apple tv, in theory, I should be able to build developer signed apps for my local device.</p>",
        "id": 244537272,
        "sender_full_name": "Hindrik Stegenga",
        "timestamp": 1625130390
    }
]