[
    {
        "content": "<p>Recently I was involved in quite a few std related PRs and ideas that turned out to be difficult to implement because of backwards compatibility. For example, my own \"impl <code>IntoIterator</code> for arrays\" and this <a href=\"https://github.com/rust-lang/rust/pull/66504\" target=\"_blank\" title=\"https://github.com/rust-lang/rust/pull/66504\">impl <code>Add&lt;char&gt; for String&gt;</code></a> one (btw I agree with closing it). It feels like only few (if any) people were really aware that those future changes would be hard or impossible to do when designing the current API. </p>\n<p>So I thought about creating some kind of list with examples of backwards compatibility footguns for people designing an API. This can be used by everyone but would mainly be useful for high-stakes APIs like libstd. </p>\n<p>Any opinions? Is there something like this already? If not and you think it could be useful, I would take a stab at writing a list soon.</p>",
        "id": 185290265,
        "sender_full_name": "Lukas Kalbertodt",
        "timestamp": 1578644238
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"118772\">@Lukas Kalbertodt</span> would it be possible to just add tests to libstd to cover those cases ?</p>",
        "id": 185291436,
        "sender_full_name": "gnzlbg",
        "timestamp": 1578645781
    },
    {
        "content": "<p>(I think that documenting backward-compat footguns is something worth doing, but ideally we would do so in such a way that backward-incompatible changes break libstd test suite)</p>",
        "id": 185291518,
        "sender_full_name": "gnzlbg",
        "timestamp": 1578645869
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"132920\">@gnzlbg</span> Interesting idea. So those can't be simple unit tests, right? I think writing automated tests for this is really really hard. But surely worth investigating.</p>",
        "id": 185296125,
        "sender_full_name": "Lukas Kalbertodt",
        "timestamp": 1578650480
    },
    {
        "content": "<p>We have run-pass, run-fail, compile-pass, and compile-fail tests in rustc.</p>",
        "id": 185296157,
        "sender_full_name": "gnzlbg",
        "timestamp": 1578650521
    },
    {
        "content": "<p>So if we have a pattern that should compile and pass some assert succesfully, you add a run-pass test, and if the pattern should not compile, you add a compile-fail test.</p>",
        "id": 185296221,
        "sender_full_name": "gnzlbg",
        "timestamp": 1578650552
    },
    {
        "content": "<p>Right now most of these are all in the src/test directory, and I would be fine with adding libstd tests there if that simplifies things, e.g., for compile-fail tests at least.</p>",
        "id": 185296266,
        "sender_full_name": "gnzlbg",
        "timestamp": 1578650610
    },
    {
        "content": "<p>If this becomes a common thing it shouldn't be too hard to set up compile-fail tests for libstd or liballoc themselves in their directories.</p>",
        "id": 185296335,
        "sender_full_name": "gnzlbg",
        "timestamp": 1578650646
    },
    {
        "content": "<p>no we really don't need separate directories</p>",
        "id": 185306865,
        "sender_full_name": "simulacrum",
        "timestamp": 1578660493
    },
    {
        "content": "<p>like, these tests can just go in <code>src/test/ui/std/foo.rs</code></p>",
        "id": 185306875,
        "sender_full_name": "simulacrum",
        "timestamp": 1578660508
    },
    {
        "content": "<p>I think I didn't properly explain myself. I am talking about general patterns. Like take the <code>Add&lt;char&gt; for String</code> problem. The root problem here is that when resolving a trait method call and there is only one implementation, the compiler tries eagerly to coerce the argument expression into the expected type. Type inference is also working in that case. So adding a second impl means that those eager coercion and type inferences are not made anymore. This can lead to breakage. Just check the link above for more information.</p>\n<p>We can of course add specific tests for <code>String</code>, but I am talking about the general pattern here. The problem was that we weren't aware of that problem when designing the <code>Add</code> impls for <code>String</code>, so we couldn't have added a test either. So we would need a lint that checks all types/impls of the public API for these kinds of problems. And that's not a simple test.</p>",
        "id": 185325445,
        "sender_full_name": "Lukas Kalbertodt",
        "timestamp": 1578673594
    },
    {
        "content": "<p>But maybe I should just start creating the list, as we can discuss more properly then ^_^</p>",
        "id": 185325485,
        "sender_full_name": "Lukas Kalbertodt",
        "timestamp": 1578673620
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"118772\">@Lukas Kalbertodt</span> This is the kind of thing we started <a href=\"https://github.com/rust-lang/rust-forge/blob/master/src/libs/maintaining-std.md\" target=\"_blank\" title=\"https://github.com/rust-lang/rust-forge/blob/master/src/libs/maintaining-std.md\">the libs forge docs</a> for <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 185372354,
        "sender_full_name": "Ashley Mannix",
        "timestamp": 1578714376
    }
]