[
    {
        "content": "<p>TL;DR: Is there any place with a more concise/up-to-date review of any possible correctness issues in parking_lot, and is there any way I could help push it towards std acceptance?</p>\n<p>Context: So, I've been looking into parking_lot as the backing of std, for allowing const new for sync types. I've found <a href=\"https://github.com/rust-lang/rust/pull/56410\">rust/56410</a>, <a href=\"https://github.com/faern/parking_lot/pull/1\">Alex Crichton's review</a>, and more recently <a href=\"https://github.com/Amanieu/parking_lot/issues/268\">This issue</a>. The new issue notes that most of the issues have been fixed, but that its correctness is not yet fully there. The review hasn't been updated in a while, and I'm hesitant to start trying to compare 2 year old comments with current code.</p>",
        "id": 220198037,
        "sender_full_name": "CraftSpider",
        "timestamp": 1608169212
    },
    {
        "content": "<p>FYI you can just write <code>#56410</code> and Zulip will auto-link to <a href=\"https://github.com/rust-lang/rust/issues/56410\">#56410</a> :)</p>",
        "id": 220201290,
        "sender_full_name": "Noah Lev",
        "timestamp": 1608172832
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"319144\">@Rune Tynan</span>  I've been working a bit over the past few months on improving the synchronization primitives. so we no longer promise that condvars panic when used on different mutexes, the windows, wasm, and linux thread parkers no longer use mutexes+condvars, we now support mutex implementations that can be moved (so do not need to be boxed), etc. etc. all of these things should help towards parking_lot or something parking_lot-like.</p>",
        "id": 220229680,
        "sender_full_name": "Mara",
        "timestamp": 1608202885
    },
    {
        "content": "<p>and some of the original feedback like <em>'we can't use windows keyed events because we don't have experience with it in std'</em> is now getting resolved, as rust 1.50 now uses that api in std for thread parker</p>",
        "id": 220229793,
        "sender_full_name": "Mara",
        "timestamp": 1608202944
    }
]