[
    {
        "content": "<p>Hi all, I hope this is the right stream to post in. I'm hoping to help make some forward progress on this issue that's a few years old: <a href=\"https://github.com/rust-lang/rust/issues/52331\">https://github.com/rust-lang/rust/issues/52331</a></p>\n<p>A seemingly backwards-compatible way of solving this was proposed in <a href=\"https://github.com/rust-lang/rust/issues/52331#issuecomment-405018941\">https://github.com/rust-lang/rust/issues/52331#issuecomment-405018941</a> but it seems like there wasn't really any consensus on whether that was agreeable to the libs team, and the issue has kind of stagnated. I'm hoping to get some feedback here to find a path forward, since there is now another OS target that might benefit from having a trait extension like this besides Redox (<code>armv6k-nintendo-3ds</code>).</p>\n<p>So the basic question: is deprecating an API only on specific targets like this typical or allowed? If not, does it seem okay to deprecate this API entirely, and provide a Windows-specific extension trait to replace it, and allow for other OS extension traits as needed? I'm also not a Windows developer, so if anyone has experience in that area that would probably be helpful too. </p>\n<p>Thanks!</p>",
        "id": 275752805,
        "sender_full_name": "Ian Chamberlain",
        "timestamp": 1647569965
    },
    {
        "content": "<p>Hi, hope it's okay that I'm bumping this topic again (maybe I should have posted in <a class=\"stream\" data-stream-id=\"265478\" href=\"/#narrow/stream/265478-t-libs.2Fapi-guidelines\">#t-libs/api-guidelines</a> ?). Can anyone here help, or is there maybe a label or @ we can apply on the GitHub issue to try and get some input from the libs team (or libs-api?) for a path forward? The original reporter of the issue has expressed that they are happy to implement the requested change, but needs some guidance around how to make the API backwards compatible and/or deprecate it.</p>",
        "id": 276560705,
        "sender_full_name": "Ian Chamberlain",
        "timestamp": 1648171115
    }
]