[
    {
        "content": "<p>hey -- is there context on <a href=\"https://github.com/rust-lang/rust/pull/89167\">https://github.com/rust-lang/rust/pull/89167</a> from recent meetings or so? I'm wondering if y'all would like to FCP that inclusion (it's all unstable). Otherwise I feel comfortable just approving it once we hash out details on that thread, since it's just adding unstable APIs. But there's also some pending RFCs and the like, so not quite sure how libs feels about shipping those unstable APIs without review yet...</p>",
        "id": 255992041,
        "sender_full_name": "simulacrum",
        "timestamp": 1633308324
    },
    {
        "content": "<p>My understanding is that the previous discussion had aimed to get it in front of people and get lots of usage feedback <em>before</em> a specific RFC was written and accepted.</p>\n<p>the logic being that basically the RFC can say \"we want to do this in general\" and <strong>not</strong> specify any specific design/API details, or the RFC can come after people have kicked the tires in Nightly and then specify some or all of the design/API details, but what can't realistically happen for something this large is trying to RFC a particular design/API without solid experimentation on what's actually good to use.</p>",
        "id": 255993387,
        "sender_full_name": "Lokathor",
        "timestamp": 1633309735
    },
    {
        "content": "<p>Ah, yes. Specifically we were chartered in <a href=\"https://github.com/rust-lang/rfcs/pull/2977\">https://github.com/rust-lang/rfcs/pull/2977</a> for</p>\n<blockquote>\n<ul>\n<li>Determine the shape of the portable SIMD API.</li>\n<li>Get an unstable <code>std::simd</code> and <code>core::simd</code> API in the standard library. This may mean renaming <code>packed_simd</code> to <code>stdsimd</code> and working directly on it, or creating a new repository and pulling in chunks of code as needed.</li>\n<li>Produce a stabilization plan to allow portions of <code>std::simd</code> to be stabilized when they're ready, and coordinate with other unstable features.</li>\n<li>Respond to user feedback and review contributions to the API.</li>\n<li>Update [RFC 2948] based on the final API and stabilization plan.</li>\n<li>Stabilize <code>std::simd</code>!</li>\n</ul>\n</blockquote>",
        "id": 256179194,
        "sender_full_name": "Jubilee",
        "timestamp": 1633410823
    }
]