[
    {
        "content": "<p>I have <a href=\"https://github.com/rust-lang/rust/issues/76204\">#76204</a> on me to review, and it adds new unstable APIs.  As unstable I know it doesn't need a full libs FCP, but is there a suggestion of how much of an FYI to give?  Should I avoid r+'ing until at least one libs member says \"ok, that seems reasonable\"?</p>\n<p>(The request in the issue makes sense to me, it's a thing that's been valuable in the iterator implementation for years now, I'd like to have it for the <code>Try</code> implementation, and ecstatic-morse would also like it for graph traversals (like the OP) in rust.  But none of those are an explicit libs ok...)</p>",
        "id": 208722981,
        "sender_full_name": "scottmcm",
        "timestamp": 1598982634
    },
    {
        "content": "<p>FWIW one of my PRs got approved with only one reviewer <a href=\"https://github.com/rust-lang/rust/pull/72310\">https://github.com/rust-lang/rust/pull/72310</a></p>",
        "id": 208723161,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1598982729
    },
    {
        "content": "<p>although <span class=\"user-mention silent\" data-user-id=\"119235\">David Tolnay</span> is very well known for libs work so maybe not a 1-1 comparison ^^</p>",
        "id": 208723202,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1598982750
    },
    {
        "content": "<p>Yes, unstable API additions need only one libs team \"seems good,\" and not necessarily of the exact API (e.g., a comment on an issue is usually sufficient)</p>",
        "id": 208724402,
        "sender_full_name": "simulacrum",
        "timestamp": 1598983328
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"232545\">@Joshua Nelson</span> I can comment on that patch if you want, I have some suggestions.</p>",
        "id": 208834118,
        "sender_full_name": "pickfire",
        "timestamp": 1599057684
    },
    {
        "content": "<p>if you have api suggestions go for it :) but i don't think the implementation is worth worrying about since it's on nightly without much use</p>",
        "id": 208834371,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1599057778
    },
    {
        "content": "<p>Nah, just some comments on the documentation and type signature.</p>",
        "id": 208835423,
        "sender_full_name": "pickfire",
        "timestamp": 1599058202
    },
    {
        "content": "<p>I don't know why but I do seemed to comment quite a lot on documentations, including misdreavus ones.</p>",
        "id": 208835508,
        "sender_full_name": "pickfire",
        "timestamp": 1599058225
    }
]