[
    {
        "content": "<p>Would I be able to convince a team member to propose an FCP to stabilize the <code>thread_local_const_init</code>, tracked at <a href=\"https://github.com/rust-lang/rust/issues/84223\">https://github.com/rust-lang/rust/issues/84223</a>, to enable faster access to thread locals on supported platforms?</p>",
        "id": 251744525,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1630600495
    },
    {
        "content": "<p>It looks like an inline const block, so probably it isn't a good idea to stablise it before inline const block syntax is stablised?</p>",
        "id": 251747826,
        "sender_full_name": "Gary Guo",
        "timestamp": 1630601795
    },
    {
        "content": "<p>It's worth noting that this is a macro so the syntax doesn't need to be staiblized in the sense that the macro can be stable as it's not actually using the <code>const { ... }</code> syntax. That doesn't change the fact, though, that if <code>const</code>-blocks get a totally different syntax then the <code>thread_local!</code> macro would be using a different one and would need some sort of migration/update.</p>",
        "id": 251764386,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1630607765
    },
    {
        "content": "<p>I think we are all happy with the syntax, it's just some logic around generics that is still whacky, so <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> from me</p>",
        "id": 251860488,
        "sender_full_name": "oli",
        "timestamp": 1630666185
    },
    {
        "content": "<p>I fear I may not know the procedure for this kind of stabilization nowadays, does anyone know what the next steps might be for something like this? (is this the wrong channel to ask this in?)</p>",
        "id": 253259706,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1631629372
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116015\">@Alex Crichton</span> sorry for the late reply! the best way to push things forward nowadays is labeling them as I-nominated. then it'll appear on the agenda for the next weekly meeting. i've added the label to the issue</p>",
        "id": 253261403,
        "sender_full_name": "Mara",
        "timestamp": 1631629970
    },
    {
        "content": "<p>oh no worries, and thanks!</p>",
        "id": 253261441,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1631629988
    }
]