[
    {
        "content": "<p>A new proposal has been announced: <a href=\"https://github.com/rust-lang/lang-team/issues/100\">Discontinue meeting recordings #100</a>. It will be announced at the next meeting to try and draw attention to it, but usually MCPs are not discussed during triage meetings. If you think this would benefit from discussion amongst the team, consider proposing a design meeting.</p>",
        "id": 243843830,
        "sender_full_name": "triagebot",
        "timestamp": 1624567446
    },
    {
        "content": "<p>This would be very unfortunate</p>",
        "id": 243844202,
        "sender_full_name": "Lokathor",
        "timestamp": 1624567646
    },
    {
        "content": "<p>Tbh, I didn't know they were recorded. However, I would really like to be able to browse through text minutes even if they only record something like \"x was decided for reasons y with the caveat of z\". That kind of thing is useful for understanding old issues and what the thinking was at the time.</p>",
        "id": 243850567,
        "sender_full_name": "Chris Denton",
        "timestamp": 1624571002
    },
    {
        "content": "<p>Text minutes are always available already</p>",
        "id": 243850735,
        "sender_full_name": "simulacrum",
        "timestamp": 1624571081
    },
    {
        "content": "<p>They're not a transcript, to be clear, though.</p>",
        "id": 243850762,
        "sender_full_name": "simulacrum",
        "timestamp": 1624571099
    },
    {
        "content": "<p>minutes are in the lang-team repo eg <a href=\"https://github.com/rust-lang/lang-team/tree/master/minutes\">https://github.com/rust-lang/lang-team/tree/master/minutes</a></p>",
        "id": 243850789,
        "sender_full_name": "lqd",
        "timestamp": 1624571111
    },
    {
        "content": "<p><span class=\"user-group-mention\" data-user-group-id=\"1977\">@T-lang</span>: Proposal <a href=\"https://github.com/rust-lang/lang-team/issues/100#issuecomment-868106014\">#100</a> has been seconded, and will be approved in 10 days if no objections are raised.</p>",
        "id": 243865507,
        "sender_full_name": "triagebot",
        "timestamp": 1624582933
    },
    {
        "content": "<p>I've seconded this, but i'd like to hear from folks who find the recordings valuable. I started the recordings and in the past I've been a big advocate: I want lang team discussions to be transparent. On the other hand, I also want them to have access to all the right people, and I've definitely heard from more than one person a preference against recording. In particular I've heard of people reporting bad experiences with 'bullying' (not sure the best word) on the internet as a result of past recordings, and I wouldn't want to be a part of that.</p>\n<p>There have definitely been times when the recording has felt like a hindrance. Lang-team discussions sometimes get emotional. Sometimes individuals (both members of the team and not) act in frustrating ways and it's harder to talk about that when everything is recorded. Like it or not, people tend to calibrate what they say based on who is in the room, and it's a bit unfair to then expose those comments to the internet for posterity.</p>",
        "id": 243890756,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1624611571
    },
    {
        "content": "<p>Overall I think we've been doing a better job of recording our conclusions and other notes. For me, that's the most useful output from the meetings.</p>",
        "id": 243890836,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1624611613
    },
    {
        "content": "<p>I guess I would say, secondarily, that I'd like us to be shifting our procedures to be a bit less meetings focused, but I guess that's a discussion for another time. =)</p>",
        "id": 243890858,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1624611640
    },
    {
        "content": "<p>I'm in favor of either recordings or zulip-recorded meetings. I do a lot of lurking but I read and watch a lot of the meetings, and I think that transparency of the process is important. I have a preference for zulip meetings because it is easier to index and is generally higher density than an hour long youtube video, but I'm sure that some people still prefer voice meetings and in that case I would rather have it recorded than not, at least if it's being used to make binding decisions (PMs are whatever).</p>",
        "id": 243891704,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1624612220
    },
    {
        "content": "<p>FWIW just as someone who regularly watches the VODs, I pretty much exclusively watch the design meetings, not the planning or triage meetings, so if those recordings went away I wouldn’t miss them, but I think there’s a lot of value in the design meetings. In fact the VODs are one of the main ways I find out about new features.</p>",
        "id": 243895234,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1624614722
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"219696\">@XAMPPRocky</span> <span class=\"user-mention\" data-user-id=\"271719\">@Mario Carneiro</span>  have you tried looking at the notes after a recording? I personally think investing in improving those is going to give us a broader audience that can consume things and at least in theory (and I think mostly in practice) we get pretty close to covering everything in the notes</p>",
        "id": 243903092,
        "sender_full_name": "simulacrum",
        "timestamp": 1624620520
    },
    {
        "content": "<p>Well it’s more for me that I’m not actively seeking out the meetings, but I’m on YouTube for other things and sometimes I see a new video on YouTube about Generators for example and decide to watch it.</p>",
        "id": 243903340,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1624620714
    },
    {
        "content": "<p>On the point of publishing difficulty, I personally have my setup for videos carefully pre-set so that getting a video onto YouTube once it's recorded is two clicks, then typing in a title, and then the \"confirm\" click. If actually doing the upload and publish is a great deal of time taken maybe that process can be streamlined to reduce the burden there.</p>",
        "id": 243927404,
        "sender_full_name": "Lokathor",
        "timestamp": 1624633201
    },
    {
        "content": "<p>Also, all of this zulip, as well as the github issues, as well as the discourse forums, are exposed to the internet for posterity. They're actually more searchable and thus more exposed.</p>",
        "id": 243928028,
        "sender_full_name": "Lokathor",
        "timestamp": 1624633454
    },
    {
        "content": "<p>I don't want anyone bullied, but if searching through the past as a way to take someone down is a tactic then it's not the videos that seem like the only problem point.</p>",
        "id": 243928189,
        "sender_full_name": "Lokathor",
        "timestamp": 1624633532
    },
    {
        "content": "<p>Just to throw my two cents: I personally listen/watch most of the recorded lang team meetings, and it helps me keep up to date on lang things. The minutes can also be helpful for this, I suppose (but I haven't actually looked at the minutes, as <span class=\"user-mention silent\" data-user-id=\"219696\">XAMPPRocky</span> said, when I watch these, it's usually more incidental than me searching for them). Looking at the views on the triage meeting videos, there's consistently anywhere from &gt;100 to several hundred views. It's hard to say how many are \"unique\" versus repeat viewers, as well as how many people would go read the minutes from those. Nonetheless, there's definitely an argument to be made that having these recordings available provides not necessarily more transparency for the project (since, yes, the minutes are available), but really more platforms for people interested in Rust to be exposed to.</p>\n<p>That being said, some of the recordings for design meetings and such have a couple thousand views. Again, minutes are available, but there's a certain degree of conversation that really just doesn't get captured. If there's a \"compromise\" here, I think keeping recordings of design meetings should be prioritized.</p>\n<p>Finally though, I agree with <span class=\"user-mention silent\" data-user-id=\"116009\">nikomatsakis</span> that if recording the meetings means that voices that <em>should</em> be heard <em>aren't</em>, then that's not ideal at all, and maybe sticking to only minutes is the best option.</p>",
        "id": 243986371,
        "sender_full_name": "Jack Huey",
        "timestamp": 1624669351
    },
    {
        "content": "<p>Perhaps select meetings could be held without a video recording upon request?</p>\n<p>If that alone could out people, a regular schedule of 1/month being not recorded and people who need to avoid being recorded can use those time slots?</p>",
        "id": 243989168,
        "sender_full_name": "Lokathor",
        "timestamp": 1624673244
    },
    {
        "content": "<blockquote>\n<p>Perhaps select meetings could be held without a video recording upon request?</p>\n</blockquote>\n<p>That already happens today on request, when we have sensitive topics. But that still requires people to make that request. And such topics can come up dynamically, as well. We have an agenda, and it'd be problematic to make people request deferring a topic until a later meeting so that it isn't recorded.</p>",
        "id": 243992585,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1624678866
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"219696\">XAMPPRocky</span> <a href=\"#narrow/stream/243200-t-lang.2Fmajor-changes/topic/Discontinue.20meeting.20recordings.20lang-team.23100/near/243895234\">said</a>:</p>\n<blockquote>\n<p>I pretty much exclusively watch the design meetings, not the planning or triage meetings</p>\n</blockquote>\n<p>That's an interesting point.  The extra detail of recordings does seems like it should be more useful for non-triage things -- we should generally not being getting into things in the triage meeting so deeply that the notes can't cover it.</p>",
        "id": 244000033,
        "sender_full_name": "scottmcm",
        "timestamp": 1624692045
    },
    {
        "content": "<p>fwiw: in the lang meetings i always have my webcam off and i usually try to avoid saying anything unless i feel like i have to add something important, or if i forget the recording is on. i like how public and transparent rust is, but having every single review, comment, chat, and any other interaction be public (and potentially get quoted on reddit/hacker news/etc.) is already intense enough. having audiovisual recordings of every meeting i'm in is definitely crossing a bit of a line for me. it makes me feel like i'm trying to work in a glass box with people staring at me.</p>",
        "id": 244313139,
        "sender_full_name": "Mara",
        "timestamp": 1624985895
    },
    {
        "content": "<blockquote>\n<p>I don't want anyone bullied, but if searching through the past as a way to take someone down is a tactic then it's not the videos that seem like the only problem point.</p>\n</blockquote>\n<p>If you haven't experienced things like this yourself, maybe make space for the voices of those who have, instead of makinig assumptions like that.</p>",
        "id": 244313367,
        "sender_full_name": "Mara",
        "timestamp": 1624985998
    },
    {
        "content": "<p>I think a lot of the points being made here are valid, and that we should be making an effort to ensure that the lang meetings are as transparent and widely distributed as possible. However, I feel strongly that we should prioritize people's ability to participate in lang meetings over people's ability to observe them. We can still work to maintain or even increase the transparency without necessarily recording the meetings. Off of the top of my head I can imagine recording summary videos after the meetings, or otherwise advertising the minutes better.</p>",
        "id": 244314823,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1624986567
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"220273\">Jane Lusby</span> <a href=\"#narrow/stream/243200-t-lang.2Fmajor-changes/topic/Discontinue.20meeting.20recordings.20lang-team.23100/near/244314823\">said</a>:</p>\n<blockquote>\n<p>I think a lot of the points being made here are valid, and that we should be making an effort to ensure that the lang meetings are as transparent and widely distributed as possible. However, I feel strongly that we should prioritize people's ability to participate in lang meetings over people's ability to observe them. We can still work to maintain or even increase the transparency without necessarily recording the meetings. Off of the top of my head I can imagine recording summary videos after the meetings, or otherwise advertising the minutes better.</p>\n</blockquote>\n<p>I don't feel it is fair to generalize the audience of these videos solely as observers when there's plenty of participants (myself included) who can only ever particpate asynchronously,  particularly those outside the US, and this change will have a negative effect for those contributors.</p>\n<p>I don't think summary videos or advertising minutes are real alternatives here, not that those aren't great ideas, in fact the opposite, I think those are great, but summary videos would be more work than raw recordings, and in my experience it just won't happen in practice if it means putting in more work than the status quo. Advertising minutes better doesn't help either, because I can't read minutes and write code at the same time, but I can listen to a video, which makes the suggestion in the meeting minutes of a podcast format interesting, because I personally am mainly interested in the audio.</p>\n<p>Also, maybe it's just me, and I realise times are different now, but I've been around long enough to remember when these meetings weren't recorded, and I don't think that's a time we should be going back to. While I'm sure the lang-team will try their best to keep \"no new rationale\" and other values,  fundamentally humans will make mistakes and take shortcuts, and  I can't help but feel this is a slippery slope in terms of being a less open community.</p>",
        "id": 244557054,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1625142337
    },
    {
        "content": "<p>So, one thing I just thought of that might be a decent compromise: Currently all the videos are uploaded to youtube and set to public. This means they are quite visible, shareable, etc. Instead, the videos could be uploaded elsewhere. Or uploaded to youtube and set to private. And the link to the videos could be found in the lang-team repo.</p>\n<p>Basically, for those that intentionally look for the videos, they are available. But it won't randomly show up on someone's youtube front page.</p>",
        "id": 244572530,
        "sender_full_name": "Jack Huey",
        "timestamp": 1625148779
    },
    {
        "content": "<p>If they're still publicly accessible, that doesn't address the original concerns. And some people still found recording stifling even if the videos were (intended to be) private.</p>",
        "id": 244584781,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1625153282
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"219696\">@XAMPPRocky</span> Regarding your first point, it sounds like the idea of lang folks doing podcasts more often would be appealling?</p>",
        "id": 244585006,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1625153369
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span> Of the proposed solutions, that is the one that work best for me, as fits in the same space as the videos. Though I don’t know if I’m representative of others watching the videos. I’m the kind of person who regularly listens to multiple 2-3 hour podcasts in a day during the week, and has like 12 hours of podcasts on their phone at all times 😅 So podcasts would definitely work for me.</p>",
        "id": 244586264,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1625153853
    },
    {
        "content": "<p>I also want to be clear that \"observe\" was in the context of lang team meetings, and we recognize that people observing lang team meetings may be active participants in many other ways. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 244588006,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1625154597
    },
    {
        "content": "<p>We're also aware that the calls are not perfectly time-zone friendly. That's something we need to improve when we have people who want to participate but can't due to time zones.</p>",
        "id": 244588212,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1625154676
    },
    {
        "content": "<p>I would continue to attend most of the time but it's moved to a day that is incompatible with my work schedule.</p>",
        "id": 244590270,
        "sender_full_name": "Lokathor",
        "timestamp": 1625155550
    },
    {
        "content": "<p>I'm unclear on what \"a podcast format\" would mean but i agree that the audio is what's of value. the video is just a screen recording of the notes we see at the end anyway.</p>",
        "id": 244590458,
        "sender_full_name": "Lokathor",
        "timestamp": 1625155621
    },
    {
        "content": "<p>But yeah, my daily podcast intake is about 4-8 hours so an audio-only format would be fine.</p>\n<p>I also agree with XAMPPRocky that summaries at the end don't seem like they're less workload.</p>",
        "id": 244591035,
        "sender_full_name": "Lokathor",
        "timestamp": 1625155848
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"224471\">Lokathor</span> <a href=\"#narrow/stream/243200-t-lang.2Fmajor-changes/topic/Discontinue.20meeting.20recordings.20lang-team.23100/near/244590458\">said</a>:</p>\n<blockquote>\n<p>I'm unclear on what \"a podcast format\" would mean but i agree that the audio is what's of value. the video is just a screen recording of the notes we see at the end anyway.</p>\n</blockquote>\n<p>\"podcast format\" as in \"arrange more frequently for lang team members to go onto established Rust podcasts and talk about developments in the Rust language, including things done in meetings\".</p>",
        "id": 244614617,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1625167351
    },
    {
        "content": "<p>Oh well, I don’t think I would be as interested in that, I only saw the minutes and assumed podcast meant, like audio minutes. I’m not looking for a condensed or edited version, like the value in the recordings is the ability to catch up on a meeting while doing something else, that’s the key thing for me.</p>",
        "id": 244617812,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1625169113
    },
    {
        "content": "<p>i think i would say a similar thing, that accurately capturing the mood of the room is the big value.</p>",
        "id": 244619611,
        "sender_full_name": "Lokathor",
        "timestamp": 1625169893
    },
    {
        "content": "<p>i mean yall should also go on podcasts too, but that feels like a separate thing.</p>",
        "id": 244619641,
        "sender_full_name": "Lokathor",
        "timestamp": 1625169910
    },
    {
        "content": "<blockquote>\n<p>accurately capturing the mood of the room is the big value.</p>\n</blockquote>\n<p>i think recording that goes too far. see my comment before in this thread</p>",
        "id": 244620318,
        "sender_full_name": "Mara",
        "timestamp": 1625170300
    },
    {
        "content": "<p>Yeah. <span class=\"user-mention\" data-user-id=\"219696\">@XAMPPRocky</span> I absolutely appreciate that recording the actual meeting makes it possible to listen to when doing other things, but recording the actual meeting is exactly what we're trying to avoid doing here.</p>",
        "id": 244624937,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1625172596
    },
    {
        "content": "<p>As a datapoint, I found it very useful to have the recording of the 9th feb meeting when trying to get up to speed on the deref patterns work. There is a level of detail and sentiment captured in the recordings which was missing from the various notes and docs. </p>\n<p>Could the recordings be paused at the end of each topic discussion to allow a time for those who don't want to be recorded to discuss without having to request it? Any kind of solution which involves summarisation (podcasts, minutes, etc) loses the major value of the recordings, IMO.</p>",
        "id": 244883457,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1625443189
    },
    {
        "content": "<blockquote>\n<p>I absolutely appreciate that recording the actual meeting makes it possible to listen to when doing other things</p>\n</blockquote>\n<p>I think the value of recordings is not to be able to do other things at the same time, but to enable a greater level of participation asynchronously (for those who can't attend due to timezones, or for historical meetings).</p>\n<blockquote>\n<p>but recording the actual meeting is exactly what we're trying to avoid doing here.</p>\n</blockquote>\n<p>This is focussing on the (potential) solution, not the problem. What we're trying to avoid should be the potential avenue for harassment, and the chilling effect that has on participation. Not recording the meeting is a solution to that problem, but possibly not the only one.</p>",
        "id": 244883680,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1625443501
    },
    {
        "content": "<p>(btw, apologies for posting to the GH issue at first, I didn't see that MCPs should be primarily discussed on Zulip until after submitting)</p>",
        "id": 244883747,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1625443565
    },
    {
        "content": "<p>It's good to read more back and forth here</p>",
        "id": 245024412,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1625570484
    },
    {
        "content": "<p>I am also wondering about the split between \"Design meetings\" (which go in depth on a particular topic) and triage</p>",
        "id": 245024423,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1625570495
    },
    {
        "content": "<p>I have thoughts about how we run triage regardless (I'd like to make some changes)</p>",
        "id": 245024439,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1625570507
    },
    {
        "content": "<p>Another thought:</p>",
        "id": 245024450,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1625570515
    },
    {
        "content": "<p>Instead of having \"people have to have a link\" to see the lang-team recordings</p>",
        "id": 245024498,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1625570529
    },
    {
        "content": "<p>one option would be to have them published but for a private, lang-team approved group</p>",
        "id": 245024515,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1625570541
    },
    {
        "content": "<p>e.g. rust team members, to start, but we could have a set of \"advisors\" or \"stakeholders\", with some minimum bar to entry of familiarity and decency</p>",
        "id": 245024568,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1625570573
    },
    {
        "content": "<p>I do think the concerns raised are important and we should prioritize the ability for people to participate in meetings, but I am also interested in finding whatever ways we can to make async participation more viable</p>",
        "id": 245024613,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1625570606
    },
    {
        "content": "<p>(both are, in a sense, a question of enabling participation by people whose opinions we value)</p>",
        "id": 245024748,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1625570678
    },
    {
        "content": "<p>Some thoughts I had recently:</p>",
        "id": 246036175,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1626306494
    },
    {
        "content": "<ul>\n<li>I could imagine making recordings available but only to members of some Rust team</li>\n</ul>",
        "id": 246036191,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1626306509
    },
    {
        "content": "<ul>\n<li>Perhaps only of design meetings</li>\n</ul>",
        "id": 246036197,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1626306514
    },
    {
        "content": "<ul>\n<li>Another idea that I was kicking around was \"expiring\" recordings after some time (e.g., a month)</li>\n</ul>",
        "id": 246036211,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1626306530
    },
    {
        "content": "<p>That said, I have to admit that not having to download/upload recordings is a big relief for me :)</p>",
        "id": 246036240,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1626306557
    },
    {
        "content": "<p>I would actually think that \"expiring\" recordings is actually not a great idea</p>",
        "id": 246036505,
        "sender_full_name": "Jack Huey",
        "timestamp": 1626306765
    },
    {
        "content": "<p>In some sense I guess</p>",
        "id": 246036525,
        "sender_full_name": "Jack Huey",
        "timestamp": 1626306780
    },
    {
        "content": "<p>In my mind, sometimes the recording can be a big bonus if someone ever has to go back and figure out \"why was this decision made\"</p>",
        "id": 246036552,
        "sender_full_name": "Jack Huey",
        "timestamp": 1626306814
    },
    {
        "content": "<p>or things along that line</p>",
        "id": 246036564,
        "sender_full_name": "Jack Huey",
        "timestamp": 1626306826
    },
    {
        "content": "<p>I guess a side note is that I would like to make changes that make meetings less of a central part of our process</p>",
        "id": 246036626,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1626306866
    },
    {
        "content": "<p>but that's another story :)</p>",
        "id": 246036628,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1626306869
    },
    {
        "content": "<p>While not a part of language team meetings i do dislike being recorded (am i shy?). Recording for the purposes of making these videos available to team members instead of a broad internet wouldn't make any difference to how I'd feel about being recorded. Limiting their access may enable some people to feel comfortable but it wouldnt be me.</p>",
        "id": 246062302,
        "sender_full_name": "nagisa",
        "timestamp": 1626335688
    },
    {
        "content": "<p>The only kind of recording i personally would be comfortable with are those that are made available to participants or intended participants of that particular meeting</p>",
        "id": 246062417,
        "sender_full_name": "nagisa",
        "timestamp": 1626335766
    }
]