[
    {
        "content": "<p>A new proposal has been announced: <a href=\"https://github.com/rust-lang/lang-team/issues/59\">MCP: pub(macro) #59</a>. It will be announced at the next meeting to try and draw attention to it, but usually MCPs are not discussed during triage meetings. If you think this would benefit from discussion amongst the team, consider proposing a design meeting.</p>",
        "id": 212581672,
        "sender_full_name": "triagebot",
        "timestamp": 1602086907
    },
    {
        "content": "<p>This seems great to me.</p>",
        "id": 212584366,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1602088115
    },
    {
        "content": "<p>In the other discussion thread, I wondered if long-term it'd make sense for hygienic macros to be able to access any crate-internal functions that would be available at the site of the macro definition. But thinking about it more, I <em>do</em> think it might make sense to mark such functions explicitly.</p>",
        "id": 212586117,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1602088998
    },
    {
        "content": "<p>So I'm entirely in favor of this, if it can be implemented.</p>",
        "id": 212586130,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1602089008
    },
    {
        "content": "<p>I'm pretty skeptical about this.</p>\n<ul>\n<li>This looks like an ad hoc addition that is going to be a technical debt.</li>\n<li>The syntax looks out of place, <code>pub(macro)</code> is not a visibility as it exists in the language now, it's some property that exists additionally to regular visibility.</li>\n<li>I suspect that the implementation will involve implementing the same hygiene 2.0 logic as the rest of unstable macros, so it's not going to be stabilized soon enough.</li>\n<li>Even with hygiene 2.0 it's an open question whether the items produced by cross-crate macros should be able to be private, because we need to keep at least some publicity indication to avoid marking all symbols as visible at link time. (Here something like <code>pub(macro)</code> can help actually, but it needs to work as a feature additional to regular visibility.)</li>\n<li>I'm not sure how this is supposed to work exactly and what are the precise rules should be, need to think about this.</li>\n</ul>",
        "id": 212625840,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1602108865
    },
    {
        "content": "<p>I'm guessing <code>pub(macro)</code> would essentially imply <code>pub(crate)</code>?</p>",
        "id": 212640005,
        "sender_full_name": "tmandry",
        "timestamp": 1602121611
    },
    {
        "content": "<blockquote>\n<p>functions marked pub(macro) would become public to macros defined in the same crate</p>\n</blockquote>\n<p>.. so yeah, seems like it</p>",
        "id": 212640098,
        "sender_full_name": "tmandry",
        "timestamp": 1602121748
    }
]