[
    {
        "content": "<p>Hi,</p>\n<p>I was one of the main contributors of the <code>arrow</code> crate. 8 months ago or so I identified a series of soundness issues on the crate to the point where it became clear to me that it is unsalvageable due to a major design issue. I started something from scratch (<a href=\"https://github.com/jorgecarleitao/arrow2\">https://github.com/jorgecarleitao/arrow2</a>), and stopped maintaining the original crate.</p>\n<p>Since them, I have been fielding the hypothesis that we (at Apache Arrow) should not continue to release new versions of the crate (specially major versions) until the issues are resolved, as imo they break many of the hypothesis of using Rust. However, many of my concerns are perceived as not sufficiently relevant. Since almost all issues are still present past 8 months, I feel compelled to raise some awareness.</p>\n<p>However, doing so puts me in an awkward position as there a clear conflict (as I am the creator of arrow2). OTOH, I do think that there should be at least some third party auditing to clarify whether my concerns are valid.</p>\n<p>I created some issues on the tracker, <a href=\"https://github.com/apache/arrow-rs/issues?q=is%3Aopen+is%3Aissue+label%3Asecurity\">https://github.com/apache/arrow-rs/issues?q=is%3Aopen+is%3Aissue+label%3Asecurity</a> just giving a glimpse of what is going on, but the problem is a bit deeper (see <a href=\"https://github.com/jorgecarleitao/arrow2#faq\">https://github.com/jorgecarleitao/arrow2#faq</a> for deeper explanation).</p>",
        "id": 253238591,
        "sender_full_name": "Jorge Leitao",
        "timestamp": 1631621133
    },
    {
        "content": "<p>I only skimmed the issues, but FWIW I think they'd be easier to follow if they contained executable code that failed under ASAN/miri. It's much easier to understand with that context.</p>",
        "id": 253239992,
        "sender_full_name": "Alex Gaynor",
        "timestamp": 1631621794
    },
    {
        "content": "<p>Based on what I see here (and I haven't attempted to reproduce!) I think many if not all of these would qualify for a RUSTSEC advisory though.</p>",
        "id": 253240126,
        "sender_full_name": "Alex Gaynor",
        "timestamp": 1631621864
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"130046\">Alex Gaynor</span> <a href=\"#narrow/stream/146229-wg-secure-code/topic/arrow.20crate/near/253239992\">said</a>:</p>\n<blockquote>\n<p>I only skimmed the issues, but FWIW I think they'd be easier to follow if they contained executable code that failed under ASAN/miri. It's much easier to understand with that context.</p>\n</blockquote>\n<p>That is a good point. I will do that to make it a bit easier to follow.</p>",
        "id": 253241411,
        "sender_full_name": "Jorge Leitao",
        "timestamp": 1631622501
    },
    {
        "content": "<p>The approach of starting with sound APIs in the first place seems reasonable but, I think. The critique of <code>arrow</code> as being architecturally flawed seems also correct, at least judging by the design the last time I had given it a look. There was a sincere lack of 'proof mindset' in exposing <code>unsafe</code> operations. However, I also find some of the particular arguments used in the critique to be inaccurate or wrong. </p>\n<p>For example, take this highly opinionated stance rejecting use of <code>transmute</code> or pointer casting outright:</p>\n<blockquote>\n<p>Still within this example, if we were to use ArrayData's datatype, Int64, to transmute the buffer, we would be creating &amp;[i64] out of a buffer created out of i32.</p>\n</blockquote>\n<p>That's not inherently incorrect behavior at all. Rust's memory model is untyped so this is only forbidden if it were to conflict with the invariants of the involved types (references, and slices). Buti n fact, we can build a safe (but fallible) function performing precisely this. For example using the well-reviewed <code>bytemuck</code> crate, combining <code>cast_slice</code> and <code>try_cast_slice</code>. </p>\n<p>I would go a step further and say that an API that is _always_ strictly typed—even when handling only primitive data types that are surely free of padding and thus can be described with byte slices—is unergonomic. This is not just a random opinion, as a maintainer I would say that this is the primary failure of <code>image</code>. I can confidently say that, in the long run, this leads to horribly large enum, bloated code gen from monomorphization and very bad ossification. Introducing new _types_ of data becomes increasingly difficult because every such change necessarily affects type checking—in all downstream consumers.</p>\n<blockquote>\n<p>As I said once, pure functional programming is an ingenious trick to show you can code without mutation, but Rust is an even cleverer trick to show you can just have mutation. –– <a href=\"http://without.boats\">without.boats</a></p>\n</blockquote>\n<p>I sincerely believe we can say the similar things about typed memory as about mutation.</p>",
        "id": 253243001,
        "sender_full_name": "HeroicKatora",
        "timestamp": 1631623242
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"130046\">Alex Gaynor</span> <a href=\"#narrow/stream/146229-wg-secure-code/topic/arrow.20crate/near/253239992\">said</a>:</p>\n<blockquote>\n<p>I only skimmed the issues, but FWIW I think they'd be easier to follow if they contained executable code that failed under ASAN/miri. It's much easier to understand with that context.</p>\n</blockquote>\n<p>I have updated the issues with concrete examples.</p>",
        "id": 253265533,
        "sender_full_name": "Jorge Leitao",
        "timestamp": 1631631369
    },
    {
        "content": "<p>ASAN or MIRI errors for the provided examples would also be helpful</p>",
        "id": 253267619,
        "sender_full_name": "Shnatsel",
        "timestamp": 1631632056
    },
    {
        "content": "<p>as proof that it is indeed triggering UB</p>",
        "id": 253267655,
        "sender_full_name": "Shnatsel",
        "timestamp": 1631632070
    },
    {
        "content": "<p>I've tried copy-pasting the code to <a href=\"http://play.rust-lang.org\">play.rust-lang.org</a>, but the <code>arrow</code> crate is not available on the playground</p>",
        "id": 253267767,
        "sender_full_name": "Shnatsel",
        "timestamp": 1631632098
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"229913\">HeroicKatora</span> <a href=\"#narrow/stream/146229-wg-secure-code/topic/arrow.20crate/near/253243001\">said</a>:</p>\n<blockquote>\n<p>However, I also find some of the particular arguments used in the critique to be inaccurate or wrong. </p>\n</blockquote>\n<p>I agree that the transmutes in the FAQ are not unsound. The example is unsound because we are requesting the 1st f64 element (so [8..16] bytes) from a buffer composed by 2 i32 items (i.e. [0..8] allocated). The issue with transmutes in this case is not the transmute itself, but the lengths that are not tracked anywhere safely. In particular, <code>ArrayData</code> in the example is claimed to have \"10\" elements of type \"i64\", and the whole crate will just assume that and read up the buffer to 10 i64 elements irrespectively of the allocated size.</p>",
        "id": 253268376,
        "sender_full_name": "Jorge Leitao",
        "timestamp": 1631632325
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"127617\">Shnatsel</span> <a href=\"#narrow/stream/146229-wg-secure-code/topic/arrow.20crate/near/253267619\">said</a>:</p>\n<blockquote>\n<p>ASAN or MIRI errors for the provided examples would also be helpful</p>\n</blockquote>\n<p>Added the result of miri to each case.</p>",
        "id": 253269632,
        "sender_full_name": "Jorge Leitao",
        "timestamp": 1631632796
    },
    {
        "content": "<p>Right, but the way the whole readme is worded this did not appear to be the main take away. At least it wasn't how I understood it, maybe there is just an overwhelming amount of anti-transmute with too little discussion of alternatives. A better, pointed conclusion could be: If one wants dynamically typed allocation then the state tracked otherwise by the type parameter needs to be stored dynamically as well. And this includes the full layout of the allocation, not only a count of elements. This leaves quite a lot of room unexplored between the incorrect design of <code>arrow</code> and the flight to std-like typed allocation with no dynamic element layout.</p>",
        "id": 253270100,
        "sender_full_name": "HeroicKatora",
        "timestamp": 1631632948
    },
    {
        "content": "<p>Now issues 772 through 777 clearly demonstrate UB through the public API, with no excuses like \"this code is really contrived\", and so are definitely eligible for a security advisory.</p>",
        "id": 253270421,
        "sender_full_name": "Shnatsel",
        "timestamp": 1631633063
    },
    {
        "content": "<p>Side note: If someone wants to explore that space then a similar experiment, image-canvas,  (<a href=\"https://github.com/image-rs/canvas\">https://github.com/image-rs/canvas</a>) could be a decent start. Ping me in a new thread, or on Discord or Matrix if you want to know details.</p>",
        "id": 253271651,
        "sender_full_name": "HeroicKatora",
        "timestamp": 1631633586
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"229913\">HeroicKatora</span> <a href=\"#narrow/stream/146229-wg-secure-code/topic/arrow.20crate/near/253270100\">said</a>:</p>\n<blockquote>\n<p>This leaves quite a lot of room unexplored between the incorrect design of <code>arrow</code> and the flight to std-like typed allocation with no dynamic element layout.</p>\n</blockquote>\n<p>I see. Sorry, I was not aware of any anti-transmute movement - it was not meant to be against transmutes in general (arrow2 uses them to e.g. read <code>i32</code> from a <code>R: std::io::Read</code>) - the critique is that the design makes it _very_ easy to code something that either results in UB or is semantically wrong. The example was trying to demonstrate how easy it is to do so (and not even in <code>unsafe</code> code).</p>",
        "id": 253272620,
        "sender_full_name": "Jorge Leitao",
        "timestamp": 1631633985
    },
    {
        "content": "<blockquote>\n<p>arrow2 uses them to e.g. read <code>i32</code> from a <code>R: std::io::Read</code></p>\n</blockquote>\n<p>You can usually replace such transmutes with <code>i32::from_ne_bytes</code> and get the same resulting assembly, but in safe Rust.</p>",
        "id": 253274601,
        "sender_full_name": "Shnatsel",
        "timestamp": 1631634770
    },
    {
        "content": "<p>(did you mean <code>from_le_bytes</code>?)</p>",
        "id": 253276808,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1631635520
    },
    {
        "content": "<p><code>be</code>, <code>le</code> or <code>ne</code> depending on what you're doing</p>",
        "id": 253278960,
        "sender_full_name": "Shnatsel",
        "timestamp": 1631636398
    },
    {
        "content": "<p>I also second the recommendation to use <code>bytemuck</code> instead of hand-rolling transmutes, even relatively trivial ones</p>",
        "id": 253305879,
        "sender_full_name": "Shnatsel",
        "timestamp": 1631646492
    },
    {
        "content": "<p>Thanks a lot for your comments and help. I will work towards using bytemuck asap, as you suggested.</p>",
        "id": 253595933,
        "sender_full_name": "Jorge Leitao",
        "timestamp": 1631804416
    },
    {
        "content": "<p>So, me writing and merging those advisories is causing a bit of a stir. Or at least the maintainers have become very aware of them all of a sudden.<br>\n<a href=\"https://github.com/rustsec/advisory-db/pull/1057\">https://github.com/rustsec/advisory-db/pull/1057</a></p>",
        "id": 255457472,
        "sender_full_name": "Shnatsel",
        "timestamp": 1632942942
    },
    {
        "content": "<p>Given my past history I would appreciate involvement from other RustSec maintainers, to make it appear as less of a unilateral move in my behalf. <span class=\"user-mention\" data-user-id=\"132721\">@Tony Arcieri</span> <span class=\"user-mention\" data-user-id=\"130046\">@Alex Gaynor</span></p>",
        "id": 255457572,
        "sender_full_name": "Shnatsel",
        "timestamp": 1632942967
    }
]