[
    {
        "content": "<p>I was curious and rand <code>cargo audit</code> on the top 100 crates on <a href=\"http://crates.io\">crates.io</a> and had a low of warnings and also a vulnerability (already filed an issue). I was wondering if it would make sense to integrate an automatic check into the <a href=\"http://crates.io\">crates.io</a> environment for automatically checking the top (all updated?) crates in the repository on a regular basis.</p>\n<p>This would greatly increase the visibility of the advisory database which should in turn contribute to the amount of reported issues and bring the whole Rust ecosystem another step closer to be a secure one.</p>\n<p>What are your thoughts on this? Are there any plans or decisions yet?</p>\n<p>I would also gladly run an own server which checks the top 10,000 crates on a regular basis if an integration into <a href=\"http://crates.io\">crates.io</a> is not wanted for any reason.</p>",
        "id": 218107764,
        "sender_full_name": "FlyingRatBull",
        "timestamp": 1606493624
    },
    {
        "content": "<p>Almost forgot the most important part: (Semi-) automatically filing GitHub issues for the found vulnerabilities and the affected projects</p>",
        "id": 218108370,
        "sender_full_name": "FlyingRatBull",
        "timestamp": 1606494005
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"367841\">FlyingRatBull</span> <a href=\"#narrow/stream/146229-wg-secure-code/topic/Integration.20into.20crates.2Eio/near/218108370\">said</a>:</p>\n<blockquote>\n<p>Almost forgot the most important part: (Semi-) automatically filing GitHub issues for the found vulnerabilities and the affected projects</p>\n</blockquote>\n<p>There is <a href=\"https://github.com/actions-rs/audit-check\">https://github.com/actions-rs/audit-check</a> which runs <code>cargo audit</code> either on PR's or using a specified schedule. In the first case, it simply shows a failed status. In the second case it will open a new issue when a vulnerable dependency is detected.</p>",
        "id": 218111031,
        "sender_full_name": "bjorn3",
        "timestamp": 1606495726
    },
    {
        "content": "<p>I'm not too familiar with GitHub actions, but it seems that they can only be configured for specific repositories (correct me if I'm wrong) which would require every Rust project to know about and integrate <code>cargo audit</code> on their own.</p>\n<p>My goal would be to analyze projects (which I do not own, e.g. top 1000 crates on <a href=\"http://crates.io\">crates.io</a>) in bulk and ideally submit issues accordingly. One could even hint about GitHub actions for auditing in the issue.<br>\nThis way the Rust ecosystem profits a lot more and the advisory database becomes a more integral part of it.</p>",
        "id": 218154278,
        "sender_full_name": "FlyingRatBull",
        "timestamp": 1606551788
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"367841\">@FlyingRatBull</span> Sorry about the late reply, work was hectic lately. Yes, this sounds like a good idea! We even have much of the code written - <a href=\"https://gitlab.com/zachreizner/crates-audit/\">https://gitlab.com/zachreizner/crates-audit/</a> resolves dependencies for all of <a href=\"http://crates.io\">crates.io</a> and lists all the packages that have advisories and have no semver-compatible fixed version available. <br>\nHowever, I'd say that mass issue creation for every advisory has to be reviewed separately since it's usually easier to get the package with the vuln to issue a semver-compatible point release than to get all downstream dependencies to upgrade.</p>",
        "id": 218485179,
        "sender_full_name": "Shnatsel",
        "timestamp": 1606858580
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"367841\">@FlyingRatBull</span> issues in Cargo.lock are usually not a concern because installation from <a href=\"http://crates.io\">crates.io</a> always fetches latest versions ignoring Cargo.lock. There's also the issue of binary packages e.g. in github releases, but that's not covered until <a href=\"https://github.com/Shnatsel/rust-audit\">https://github.com/Shnatsel/rust-audit</a> is uplifted into Cargo (help on this is very welcome btw, since I'm majorly distracted from this work)</p>",
        "id": 218485427,
        "sender_full_name": "Shnatsel",
        "timestamp": 1606858685
    }
]