[
    {
        "content": "<p>It seems like a lot of the other WGs have regular scheduled meetings (frequently on chat). I know there was a lot of discussion about that when the WG started and a lot of mixed feelings, but from what I can tell these seem to work pretty well for the other WGs and also help increase overall WG participation, at least from what I've seen</p>",
        "id": 171338732,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1563649545
    },
    {
        "content": "<p>should we do one? perhaps monthly?</p>",
        "id": 171338734,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1563649553
    },
    {
        "content": "<p>I'm up, but I'll be afk for the next few weeks. Don't see much point in meetings on chat though because we're already on chat. What would the structure of the meeting look like? What do you expect to discuss?</p>",
        "id": 171338911,
        "sender_full_name": "Shnatsel",
        "timestamp": 1563649903
    },
    {
        "content": "<p>there are a handful of us on chat but I'd view this as a way to get some more participation in the WG. we could put together an itinerary, tweet it out, and if there are people who are interested in items on the itinerary it might attract them to come talk about them, even for just a single meeting</p>",
        "id": 171338984,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1563649991
    },
    {
        "content": "<p>Well, the WG is still very obscure because it has received approximately zero promotion. I reckon making a blog and linking the articles to reddit, plus promoting initiatives like safety-dance would be the way to go. I don't see \"hey we have a meeting with this agenda\" as a great attractor, and people without context in real-time meetings tend to drag them on</p>",
        "id": 171339120,
        "sender_full_name": "Shnatsel",
        "timestamp": 1563650236
    },
    {
        "content": "<p>the nice thing about chat is it's only semi-realtime <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 171339186,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1563650400
    },
    {
        "content": "<p>and also easier to review than a recording</p>",
        "id": 171339230,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1563650412
    },
    {
        "content": "<p>I'm mainly looking at things like the Embedded WG here as a success story for this sort of thing</p>",
        "id": 171339235,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1563650437
    },
    {
        "content": "<p>Is it a chat meeting or video meeting? What do they discuss?</p>",
        "id": 171339565,
        "sender_full_name": "Shnatsel",
        "timestamp": 1563651041
    },
    {
        "content": "<p>Anyway, as I'll be away for a few weeks, I don't really have a say in the matter. You can experiment in my absence and see if it works.</p>",
        "id": 171339766,
        "sender_full_name": "Shnatsel",
        "timestamp": 1563651379
    },
    {
        "content": "<p>they presently do meetings on IRC but they're moving to Matrix. They open a GitHub issue for each one with an agenda of items to discuss. here's one of the more productive ones <a href=\"https://github.com/rust-embedded/wg/issues/331\" target=\"_blank\" title=\"https://github.com/rust-embedded/wg/issues/331\">https://github.com/rust-embedded/wg/issues/331</a></p>",
        "id": 171342647,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1563656815
    },
    {
        "content": "<p>they also keep a log of the discussion and meeting notes in their <code>wg</code> repository: <a href=\"https://github.com/rust-embedded/wg/pull/360/files\" target=\"_blank\" title=\"https://github.com/rust-embedded/wg/pull/360/files\">https://github.com/rust-embedded/wg/pull/360/files</a></p>",
        "id": 171342659,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1563656869
    },
    {
        "content": "<p>as an example of where this might help, it'd be a good place to loop in the Community Team to make a final decision on the Unsafety Purge / Safety Dance / whatever name <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 171342703,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1563656917
    }
]