[
    {
        "content": "<p>With some compiler changes (that are being backed out to give broken code some more time to get fixed), ancient crossbeam::queue <a href=\"https://github.com/amethyst/amethyst/issues/1808\" target=\"_blank\" title=\"https://github.com/amethyst/amethyst/issues/1808\">SIGILLs</a> because it causes UB by calling mem::zeroed or mem::uninitialized the wrong way. A fixed version is out for 7 months but some projects are <a href=\"https://github.com/ishitatsuyuki/amethyst/commit/bf578203e3fc13f23e62515911e83de8366e9240\" target=\"_blank\" title=\"https://github.com/ishitatsuyuki/amethyst/commit/bf578203e3fc13f23e62515911e83de8366e9240\">updating only now that they have to</a>. Is it appropriate to file an advisory to make people upgrade, or is that not how advisories are supposed to be used? We have no information on exploitability or severity, all we know is \"there is UB\" (and I am not really interested in spending lots of time to figure out how bad the UB is).<br>\nThe crossbeam 0.4 versions are broken, and crossbeam-queue 0.1 seems fixed. Which version of crossbeam itself is the first to be fixed I don't know (<span class=\"user-mention\" data-user-id=\"128448\">@stjepang</span> ?)</p>",
        "id": 172659782,
        "sender_full_name": "RalfJ",
        "timestamp": 1565167120
    },
    {
        "content": "<p>(There was another bug fixed by crossbeam 0.4.1, but that does not seem to be the same one -- crates using 0.4.1 still saw SIGILLs.)</p>",
        "id": 172659920,
        "sender_full_name": "RalfJ",
        "timestamp": 1565167228
    },
    {
        "content": "<p>Personally, I don't think it's right to file an advisory unless we think it's actually a security issu</p>",
        "id": 172668504,
        "sender_full_name": "Alex Gaynor",
        "timestamp": 1565176656
    },
    {
        "content": "<p>fair. but I will also note that once I found that some code is UB or is unsound (lets safe code trigger UB), I see my \"job\" done. whether that is exploitable in any way -- basically coming up with an exploit -- is not even a formally well-defined question, it is a very practical question concerned with what exactly the compiler happens to (not) do. it is not an interesting question to me. I have little expertise in that area and I think I have  better ways to spend my time.<br>\nI am not saying you should change your policy, I am just informing you that there is a gap here and that this will mean I am unlikely to file many advisories even if I find lots of UB and some of it is actually security-relevant.</p>",
        "id": 172747328,
        "sender_full_name": "RalfJ",
        "timestamp": 1565252705
    },
    {
        "content": "<p>maybe there are people interested in closing that gap? I'd be happy to leave a note <em>somewhere</em> any time I find UB, and I'd be happy to explain the what and why and where, so should someone be interested they can see if this justifies an advisory or not.</p>",
        "id": 172747453,
        "sender_full_name": "RalfJ",
        "timestamp": 1565252866
    },
    {
        "content": "<p>did these versions of crossbeam_queue pull in the memoffset that had a notice recently? i feel like they did but could be wrong. if they do then anybody who follows the notices already will have updated, i think</p>",
        "id": 172782187,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1565283337
    },
    {
        "content": "<p>hm, good question</p>",
        "id": 172833330,
        "sender_full_name": "RalfJ",
        "timestamp": 1565338367
    },
    {
        "content": "<p>yes, seems like they did. crossbeam 0.4 -&gt; crossbeam-epoch 0.5 -&gt; memoffset 0.2</p>",
        "id": 172833365,
        "sender_full_name": "RalfJ",
        "timestamp": 1565338423
    },
    {
        "content": "<p>so people following advisories are already warned. good :)</p>",
        "id": 172833415,
        "sender_full_name": "RalfJ",
        "timestamp": 1565338467
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120791\">@RalfJ</span> unless it's a security issue, I'd imagine yanking would be better, but if the memoffset stuff did it vicariously, great</p>",
        "id": 173032770,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1565623322
    }
]