[
    {
        "content": "<p>I just saw the RustSec \"unmaintained\" advisory for stdweb. Too bad...</p>\n<p>I don't know if there are certain formal rules already, but I wonder if there should be a process for dealing with unmaintained crates. For example by marking stdweb as unmaintained, a lot of people will probably try to move away from it. However, after determining that the crate is indeed unmaintained (e.g. by posting a formal \"request for clarification of maintenance status\" with a waiting time of 1-2 months) maybe there should be a \"call for new maintainers\" first? For some crates, a new team of maintainers might form, that could fork and pick up maintenance from there.</p>\n<p>Of course, if the original maintainer is not reachable, there would still need to be a transition of the old crate to the forked one. However, then the advisory could actually point to the fork, instead of just saying \"this crate is unmaintained, sucks to be you\".</p>",
        "id": 269131438,
        "sender_full_name": "Danilo",
        "timestamp": 1643041865
    },
    {
        "content": "<p>That process could also include some recommendations for developers of popular crates that are close to their limits, or that need additional help in order to keep maintaining a certain crate. Recommendations could include \"publish a 'call for maintainers' issue with the following content and link to it from your README\".</p>",
        "id": 269131714,
        "sender_full_name": "Danilo",
        "timestamp": 1643041959
    },
    {
        "content": "<p>If there's such a \"looking for maintainers\" issue, the maintainer could also opt-in to a \"low bus factor\" warning distributed through cargo audit. That would be less \"strongly worded\" than a \"crate is unmaintained\"-warning.</p>",
        "id": 269131869,
        "sender_full_name": "Danilo",
        "timestamp": 1643042031
    },
    {
        "content": "<p>we've had several people request some sort of formal policy for unmaintained crates, but so far no one has tried to actually contribute such a policy</p>",
        "id": 269152708,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1643050544
    },
    {
        "content": "<p>I have started drawing up the beginnings of that, but I'm not sure if I've actually written that down</p>",
        "id": 269155439,
        "sender_full_name": "Shnatsel",
        "timestamp": 1643051617
    },
    {
        "content": "<p>I don't have strong feelings towards any particular process, but I think requiring direct contact to the maintainer(s) should be required. For stdweb this was me emailing the maintainer and receiving no response.</p>",
        "id": 269197576,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1643074911
    },
    {
        "content": "<p>yeah that's definitely been part of our informal process</p>",
        "id": 269197881,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1643074983
    },
    {
        "content": "<p>So the topics I already covered are:</p>\n<ul>\n<li>Monotonic fields on the \"vulnerability\" and \"advisory\" GraphQL entities, so that clients could process new advisories since they last synced, and implement efficient sync</li>\n<li>Frequency of GHSA's import from RustSec database - last time I checked there was a large delay before new RustSec data shows up in GHSA</li>\n<li>Support for converting ^ and ~ version selectors that RustSec allows to GHSA (historically there were issues with that)</li>\n</ul>\n<p>Didn't get a chance to cover yet:</p>\n<ul>\n<li>Authoritative data for a given GHSA ID - curated vs original advisory, only original showing up in Google search results</li>\n<li>CC-BY-SA licensing and exact attribution requirements</li>\n<li>Better repository integration for end users affected by an advisory (dependabot?)</li>\n</ul>",
        "id": 269820233,
        "sender_full_name": "Shnatsel",
        "timestamp": 1643414068
    },
    {
        "content": "<p>FYI, tried to do a writeup for a policy/process here: <a href=\"https://github.com/rustsec/advisory-db/pull/1192\">https://github.com/rustsec/advisory-db/pull/1192</a></p>",
        "id": 271696200,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1644682820
    }
]