[
    {
        "content": "<p>Hello, I've been recently working on common undefined behavior bug detection for Rust crates. It is still preliminary, but the initial run on <a href=\"http://crates.io\">crates.io</a> seems promising. There are a lot of bugs that are similar to <a href=\"https://github.com/RustSec/advisory-db/pull/360\">#360</a> and <a href=\"https://github.com/RustSec/advisory-db/pull/362\">#362</a> in the backlog, and I would like to hear maintainers' feedback before spamming the advisory DB :)</p>\n<p>Specifically,</p>\n<ol>\n<li>Do you want any additional information to be included in the report? If there is anything that may reduce the burden and the time to confirm the bug on maintainers' side, please let me know.</li>\n<li>Do you have any guide to distinguish an informational unsound advisory and a full security advisory? I'm filing a security advisory for bugs if I think the bug can be triggered during the natural usage of the library. I'm concerned that \"natural usage\" might be too subjective.</li>\n</ol>",
        "id": 208027502,
        "sender_full_name": "Yechan Bae",
        "timestamp": 1598391562
    },
    {
        "content": "<p>I don't really have an opinion on either of your questions -- I just wanted to say it's awesome that you're working on automatic UB detection! Is it static or dynamic analysis?</p>",
        "id": 208027761,
        "sender_full_name": "Alex Gaynor",
        "timestamp": 1598391688
    },
    {
        "content": "<p>Thanks! Our tool uses a static analysis, and we are focusing on adding more UB models and reducing the false positive rates.</p>",
        "id": 208031197,
        "sender_full_name": "Yechan Bae",
        "timestamp": 1598393770
    },
    {
        "content": "<p>that sounds really interesting, I am curious to read more about it :)</p>",
        "id": 208062626,
        "sender_full_name": "RalfJ",
        "timestamp": 1598428754
    },
    {
        "content": "<p>On 1: I think your reports on the upstream issues are very detailed and presented very well as it is, and that's what I usually read before merging the advisory. So I think the existing info is more than sufficient.</p>",
        "id": 208272768,
        "sender_full_name": "Shnatsel",
        "timestamp": 1598560636
    },
    {
        "content": "<p>On 2: I remember your call for defining the distinction more formally, and I think it's an important to do. But AFAIK this is an unsolved problem in general (with CWE designed to provide a formal framework for that sort of thing, but usually falling short) and I'm not familiar with anything at all that would be applicable to Rust and its encapsulation guarantees. So pending some novel research I'm afraid we'll have to go with subjective evaluation of natural usage for now.</p>",
        "id": 208273052,
        "sender_full_name": "Shnatsel",
        "timestamp": 1598560764
    },
    {
        "content": "<p>Regarding static analysis, this might also be of interest - the authors have built some ad-hoc static analysis tools and found a bunch of bugs: <a href=\"https://cseweb.ucsd.edu/~yiying/RustStudy-PLDI20.pdf\">https://cseweb.ucsd.edu/~yiying/RustStudy-PLDI20.pdf</a></p>",
        "id": 208273258,
        "sender_full_name": "Shnatsel",
        "timestamp": 1598560867
    },
    {
        "content": "<p>Update on the common UB detection project: Our research group found about a hundred of thread safety issues in published crates with a new bug pattern. Before start filing them, we would like to ask a few questions to make both the reporting and the reviewing more efficient.</p>\n<h1>1. Is the comment in <a href=\"https://github.com/RustSec/advisory-db/pull/328\">#328</a> still valid (considering the number of advisories that we are about to submit)?</h1>\n<blockquote>\n<p>We don't generally limit advisories based on crate popularity -- if no one is using the crate, then no one will be bothered by it :-)</p>\n</blockquote>\n<p>With an example: A bug from one of the least popular crates that we found was <a href=\"https://github.com/hyyking/rustracts/pull/6\">rustracts#6</a>. The crate has been <a href=\"https://crates.io/crates/parc\">downloaded 279 times to date</a>. With that number of downloads, probably the bug does not seriously impact anyone. We know that other security advisories consider \"impact of the bug\" when filing advisories, so we would like to be confirmed about RUSTSEC's policy.</p>\n<h1>2. The bugs allow sending non-Send types across threads or allowing parallel access to non-Sync type. Should we file an advisory with <code>informatinoal=\"unsound\"</code> or not? I asked a similar question before in general context, but this time with the context of this specific bug type.</h1>\n<p>Bug examples: <a href=\"https://github.com/rust-lang/futures-rs/issues/2239\">futures-rs#2239</a>, <a href=\"https://github.com/Amanieu/parking_lot/issues/258\">parking_lot#258</a>, <a href=\"https://github.com/Amanieu/parking_lot/issues/259\">parking_lot#259</a>, <a href=\"https://github.com/bodil/im-rs/issues/157\">im-rs#157</a></p>",
        "id": 217068326,
        "sender_full_name": "Yechan Bae",
        "timestamp": 1605650031
    },
    {
        "content": "<p>For an incorrect <code>Sync</code> or <code>Send</code> bounds we've previously had <code>informational=unsound</code> and regular vulnerablity report used. I'd go with a regular vulnerability report unless proven otherwise. Basically, if we can think of ways to cause memory unsafety with this on the current compiler, it should be a vulnerability; \"unsound\" is more for theoretical issues that we don't see any real-world impact from.</p>",
        "id": 217344005,
        "sender_full_name": "Shnatsel",
        "timestamp": 1605827894
    },
    {
        "content": "<p>I remember you called for a more strictly defined boundaries for vulnerabilities, and I agree that it'd be terrific to figure them out, but it's also a lot of work and I didn't have much capacity to work on that this year (ugh, what a year!)</p>",
        "id": 217344068,
        "sender_full_name": "Shnatsel",
        "timestamp": 1605827970
    },
    {
        "content": "<p>Thank you, how about question 1? There's gonna be a hundred or so bugs and we don't want to overwhelm you all with advisories. Should we continue to report bugs in these small (~&lt;1,000 downloads, no dependencies) crates or just the main ones?</p>",
        "id": 217505908,
        "sender_full_name": "Ammar Askar",
        "timestamp": 1605972339
    },
    {
        "content": "<p>perhaps you can triage the important ones and we can go from there</p>",
        "id": 217917375,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1606326328
    },
    {
        "content": "<p>if we get overwhelmed by too many advisories we'll let you know, however much of the process is automated now so it should be fine</p>",
        "id": 217917398,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1606326350
    }
]