[
    {
        "content": "<p>I wanted to keep yall up to date on something I've been working on.  Partially inspired by the buidltime sandboxing thread I started playing with a run time sandbox env for HTTP handlers.  The main idea is to explicitly allow the framework to build in RASP like functionality without some of the sketchy runtime instrumentation and byte code injection most RASPs out there use.  Figure it might be of interest to this group eventually but I've got <em>a lot</em> more work to do on it</p>",
        "id": 182384602,
        "sender_full_name": "Stuart Small",
        "timestamp": 1575317583
    },
    {
        "content": "<p>I'm building it on top of wasm but getting interface types to play well with hostfuncs is requiring a lot of research and education.  I think once it makes sense it should be more straightforward.</p>",
        "id": 182384797,
        "sender_full_name": "Stuart Small",
        "timestamp": 1575317729
    },
    {
        "content": "<p>nice. are you using <code>wasmtime</code> or what?</p>",
        "id": 182400231,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1575328901
    },
    {
        "content": "<p>Yup.  Wasmtime.  It's really well put together project</p>",
        "id": 182400314,
        "sender_full_name": "Stuart Small",
        "timestamp": 1575328971
    },
    {
        "content": "<p>It looks like it supports everything I need but this project is like diving straight into the deepest end I could find of wasm</p>",
        "id": 182400351,
        "sender_full_name": "Stuart Small",
        "timestamp": 1575329035
    },
    {
        "content": "<p>nice, I've been meaning to play with it</p>",
        "id": 182400352,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1575329036
    },
    {
        "content": "<p>They are extremely helpful on gitter and sunfishcode has a lot of great general wasm documentation</p>",
        "id": 182400417,
        "sender_full_name": "Stuart Small",
        "timestamp": 1575329062
    },
    {
        "content": "<p>It's better than the spec itself</p>",
        "id": 182400422,
        "sender_full_name": "Stuart Small",
        "timestamp": 1575329068
    },
    {
        "content": "<p>haha</p>",
        "id": 182400435,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1575329087
    }
]