[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"132721\">@Tony Arcieri</span> I'm working on the implementation of the <a href=\"https://github.com/rust-lang/rfcs/pull/2801\">Cargo version embedding RFC</a> as a <a href=\"https://github.com/Shnatsel/rust-audit\">crate</a>. Among other things I need to load Cargo.lock, strip out source information and convert it to JSON, then load that JSON into the same structure. I was going to use the <code>cargo-lock</code> crate. Any tips on the cleanest way to implement that?</p>",
        "id": 205452289,
        "sender_full_name": "Shnatsel",
        "timestamp": 1596096975
    },
    {
        "content": "<p>Interop with the cargo-lock crate data structures is highly desirable, since I want this to be simply another source of data for cargo-audit</p>",
        "id": 205543439,
        "sender_full_name": "Shnatsel",
        "timestamp": 1596150947
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"127617\">@Shnatsel</span> if you'd like to add an optional <code>serde_json</code> dependency to <code>cargo-lock</code>, I'd be fine with that</p>",
        "id": 205614546,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1596214605
    },
    {
        "content": "<p>it uses internal <code>serde</code> encoding types ala <code>cargo</code> itself so I think you'd need some minimal integration inside <code>cargo-lock</code></p>",
        "id": 205614613,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1596214651
    },
    {
        "content": "<p>Yeah that's what I was thinking. Any tips on how to deal with the source info not being present? Right now all data structures assume it's there. Should I make it an empty string, or refactor into an Option, or something else entirely?</p>",
        "id": 205615936,
        "sender_full_name": "Shnatsel",
        "timestamp": 1596215364
    },
    {
        "content": "<p>we could make it an <code>Option</code> I guess. also I see I actually implemented everything in terms of serde traits, so if you did make it an empty string it should just work with <code>serde_json</code> out-of-the-box</p>",
        "id": 205616105,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1596215464
    },
    {
        "content": "<p>Let me see if there a quick-and-easy way to skip a certain field when encoding/decoding JSON only, not TOML</p>",
        "id": 205616493,
        "sender_full_name": "Shnatsel",
        "timestamp": 1596215661
    }
]