[
    {
        "content": "<p>We have a bunch of outstanding PRs for advisories that do not have a fixed version. I want to figure out a way to communicate the presence of the advisory to the upstream maintainers. This should not cause additional frustration, not be too long to read, and ideally should also prompt them to fix the issue.  This is the best I've got so far:</p>\n<blockquote>\n<p>Heads up: this issue has been submitted to the <a href=\"https://github.com/RustSec/advisory-db\">RustSec advisory database</a>. It will be surfaced by tools such as <a href=\"https://github.com/RustSec/cargo-audit\">cargo-audit</a> or <a href=\"https://github.com/EmbarkStudios/cargo-deny\">cargo-deny</a> from now on.</p>\n</blockquote>\n<p>Thoughts?</p>",
        "id": 223762306,
        "sender_full_name": "Shnatsel",
        "timestamp": 1611425513
    },
    {
        "content": "<p>This can be expanded to cover other situations, I've drafted this in <a href=\"https://hackmd.io/_4CmY8AAQ1Ks8D7KIDTXmg\">https://hackmd.io/_4CmY8AAQ1Ks8D7KIDTXmg</a></p>",
        "id": 223762309,
        "sender_full_name": "Shnatsel",
        "timestamp": 1611425519
    },
    {
        "content": "<p>Perhaps we should make this a (policy) requirement that when submitting rustsec advisories for unfixed things, you need to notify the upstream maintainers of your PR?</p>",
        "id": 223762578,
        "sender_full_name": "Alex Gaynor",
        "timestamp": 1611425900
    },
    {
        "content": "<p>That seems reasonable.<br>\nHowever, I want to avoid putting this on the submitter, since they already have a long template to fill, and requiring even more of them will increase the entry barrier, resulting in fewer advisories filed.<br>\nBut it is easy enough for advisory DB maintainer to copy-paste from the template to the upstream issue to notify them. Hence why I'm writing the templates.</p>",
        "id": 223762741,
        "sender_full_name": "Shnatsel",
        "timestamp": 1611426197
    },
    {
        "content": "<p>The more interesting question is, should we provide some kind of grace period for maintainers before we go ahead and file an advisory?</p>",
        "id": 223767330,
        "sender_full_name": "Shnatsel",
        "timestamp": 1611429214
    },
    {
        "content": "<p>Does the crates download count/popularity play into the proposed grace period, IE since there's a higher chance someone could be at risk, or is a flat policy closer to what's desired?</p>",
        "id": 223787750,
        "sender_full_name": "BlackHoleFox",
        "timestamp": 1611449940
    },
    {
        "content": "<p>I guess we can be more lax towards crates with few users, not to discourage maintainers of budding crates? But I don't have a strong opinion on that.</p>",
        "id": 223839335,
        "sender_full_name": "Shnatsel",
        "timestamp": 1611527072
    },
    {
        "content": "<p>waiting to get a patched version, particularly of widely used crates, is pretty important IMO. otherwise the advisories aren't actionable</p>",
        "id": 223915757,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1611589820
    },
    {
        "content": "<p>When we request RustSec advisories,  we are prioritizing bugs which (1) are fixed or (2) we didn't get any response about from the author. We postpone reporting the bugs to RustSec (3) if the author acknowledged the bug but the fix is not implemented yet.</p>\n<p>I think having a notification from RustSec helps in all three situations. For fixed bugs, we can encourage the author to comment on the the advisory content, who is likely to have more domain knowledge about the crate. For bugs without fixes or that are being delayed, notification about the grace period from RustSec would be much better way to give a heads up than a bug reporter to say \"hey, if this is not fixed in X days, I will report it to RustSec.\"</p>",
        "id": 223953629,
        "sender_full_name": "Yechan Bae",
        "timestamp": 1611605619
    },
    {
        "content": "<p>That makes a lot of sense. Thanks!</p>",
        "id": 223957064,
        "sender_full_name": "Shnatsel",
        "timestamp": 1611607364
    },
    {
        "content": "<p>We have ~30 PRs outstanding for advisories without a patched version and with unresponsive upstream maintainers. I want to start merging them, but I could use some help in polishing up the comms for the maintainers. This is a draft of what I'm going to post on the upstream issue:</p>\n<blockquote>\n<p>Heads up: this issue has been included in the <a href=\"https://github.com/RustSec/advisory-db\">RustSec advisory database</a>. It will be surfaced by tools such as <a href=\"https://github.com/RustSec/cargo-audit\">cargo-audit</a> or <a href=\"https://github.com/EmbarkStudios/cargo-deny\">cargo-deny</a> from now on.<br>\nOnce a fix is released to <a href=\"http://crates.io\">crates.io</a>, please let us know and we'll include the fixed version in the advisory.</p>\n</blockquote>\n<p>Thoughts?</p>",
        "id": 224216294,
        "sender_full_name": "Shnatsel",
        "timestamp": 1611768529
    },
    {
        "content": "<p>I'd specifically mention that they can let us know by sending a PR to update the advisory with the patched version.</p>",
        "id": 224216401,
        "sender_full_name": "Alex Gaynor",
        "timestamp": 1611768569
    },
    {
        "content": "<p>Given that the upstream is already unresponsive, I'm not sure I want to create more work for them. Any tips on how to word that without making it feel like fixing the issue would now take even more work than before?</p>",
        "id": 224217021,
        "sender_full_name": "Shnatsel",
        "timestamp": 1611768794
    },
    {
        "content": "<p>Maybe something like, \"please ping us with a comment on the linked RustSec issue above or send us a pull request to update the advisory with the patched version\"</p>",
        "id": 224217267,
        "sender_full_name": "Ammar Askar",
        "timestamp": 1611768890
    },
    {
        "content": "<p>Since just making a comment is pretty low-friction and they can still send a full pull request if they want.</p>",
        "id": 224217316,
        "sender_full_name": "Ammar Askar",
        "timestamp": 1611768911
    },
    {
        "content": "<blockquote>\n<p>Heads up: this issue has been included in the <a href=\"https://github.com/RustSec/advisory-db\">RustSec advisory database</a>. It will be surfaced by tools such as <a href=\"https://github.com/RustSec/cargo-audit\">cargo-audit</a> or <a href=\"https://github.com/EmbarkStudios/cargo-deny\">cargo-deny</a> from now on.<br>\nOnce a fix is released to <a href=\"http://crates.io\">crates.io</a>, please comment on the advisory thread linked above, or open a pull request to update the advisory with the patched version.</p>\n</blockquote>\n<p>Is this better?</p>",
        "id": 224218129,
        "sender_full_name": "Shnatsel",
        "timestamp": 1611769211
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"130046\">@Alex Gaynor</span> <span class=\"user-mention\" data-user-id=\"329529\">@Yechan Bae</span> I'd like to get your opinion on the text above before I go posting it to 30 github issues</p>",
        "id": 224227207,
        "sender_full_name": "Shnatsel",
        "timestamp": 1611772623
    },
    {
        "content": "<p>I don't love the suggestion to leave a comment, I think it's going to end with comments on closed PRs that no one notices, which will be sad for everyone.</p>\n<p>I assume the message will include a link to the PR with the advisory.</p>",
        "id": 224227330,
        "sender_full_name": "Alex Gaynor",
        "timestamp": 1611772677
    },
    {
        "content": "<p>The comment gets mailed out to whoever filed the advisory plus whichever rustsec member triaged it, do you think it'll still be missed?</p>",
        "id": 224227545,
        "sender_full_name": "Ammar Askar",
        "timestamp": 1611772762
    },
    {
        "content": "<p>With 30 of them, even if there's a 95% chance any individual one is notice and acted on, that's an 80% chance we'll miss at least one. I'm a big believer in making sure things are visible -- comments on closed issues are easily missed, a fresh issue or PR will not be.</p>",
        "id": 224227818,
        "sender_full_name": "Alex Gaynor",
        "timestamp": 1611772891
    },
    {
        "content": "<blockquote>\n<p>Heads up: this issue has been included in the <a href=\"https://github.com/RustSec/advisory-db\">RustSec advisory database</a>. It will be surfaced by tools such as <a href=\"https://github.com/RustSec/cargo-audit\">cargo-audit</a> or <a href=\"https://github.com/EmbarkStudios/cargo-deny\">cargo-deny</a> from now on.<br>\nOnce a fix is released to <a href=\"http://crates.io\">crates.io</a>, please open a pull request to update the advisory with the patched version, or file an issue on <a href=\"https://github.com/RustSec/advisory-db\">the advisory database repository</a>.</p>\n</blockquote>\n<p>Is that better?</p>",
        "id": 224228137,
        "sender_full_name": "Shnatsel",
        "timestamp": 1611773033
    },
    {
        "content": "<p>I was hoping to lean into the automatic linking that Github already does instead of manually copy-pasting the ID into every comment, because with 30 of them I'll surely get at least one wrong.</p>",
        "id": 224228246,
        "sender_full_name": "Shnatsel",
        "timestamp": 1611773070
    },
    {
        "content": "<p>Text looks good to me. Thanks!</p>",
        "id": 224228334,
        "sender_full_name": "Alex Gaynor",
        "timestamp": 1611773111
    },
    {
        "content": "<p>In long term, I think it would be good to have the official grace period in RustSec policy and mention that. Considering that we don't have a such concept yet, the text looks good to me.</p>",
        "id": 224264242,
        "sender_full_name": "Yechan Bae",
        "timestamp": 1611790207
    },
    {
        "content": "<p>Thanks for the effort!</p>",
        "id": 224264263,
        "sender_full_name": "Yechan Bae",
        "timestamp": 1611790222
    },
    {
        "content": "<p>feels a bit like a disclosure policy, except for things that are already public, just not automatically spammed</p>",
        "id": 224365975,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1611856386
    },
    {
        "content": "<p>Thanks for the input <span class=\"user-mention\" data-user-id=\"329529\">@Yechan Bae</span>! I'll try to handle the outstanding advisory PRs with this messaging on Saturday. Here's to hoping it goes better than last time <span aria-label=\"see no evil\" class=\"emoji emoji-1f648\" role=\"img\" title=\"see no evil\">:see_no_evil:</span></p>",
        "id": 224546411,
        "sender_full_name": "Shnatsel",
        "timestamp": 1611960459
    },
    {
        "content": "<p>(Last time: <a href=\"https://www.reddit.com/r/rustjerk/comments/l1habt/\">https://www.reddit.com/r/rustjerk/comments/l1habt/</a>)</p>",
        "id": 224546492,
        "sender_full_name": "Shnatsel",
        "timestamp": 1611960494
    },
    {
        "content": "<p>I've merged at around 15 outstanding advisory PRs; I'll start a thread about the remaining ones.</p>",
        "id": 224603523,
        "sender_full_name": "Shnatsel",
        "timestamp": 1612038555
    }
]