[
    {
        "content": "<p>Hi all! Not sure where to ask, so doing so here...</p>\n<p>At $dayjob we are scanning our code base with security \"linters\". Those include for example Bandit for Python (<a href=\"https://github.com/PyCQA/bandit\" target=\"_blank\" title=\"https://github.com/PyCQA/bandit\">https://github.com/PyCQA/bandit</a>) or gosec for go (<a href=\"https://github.com/securego/gosec\" target=\"_blank\" title=\"https://github.com/securego/gosec\">https://github.com/securego/gosec</a>).</p>\n<p>Those tools will go further than what clippy does. Instead of looking at \"code quality\" patterns they look for security issue. For example they contains lints for if your app listen on all interfaces, weak crypto usage or even committed credentials.</p>\n<p>Since those tools are used as part of a process, I am sure the question of whether such a tool exists for rust will arise.</p>\n<p>Does something like this already exists? I don't know the internals of clippy, but could a \"security\" lint category be possible?</p>",
        "id": 187142879,
        "sender_full_name": "Nicolas Bigaouette",
        "timestamp": 1580524293
    },
    {
        "content": "<p>Clippy has quite a few security lints, primarily focused around <code>unsafe</code> ATM.</p>",
        "id": 187142934,
        "sender_full_name": "Alex Gaynor",
        "timestamp": 1580524343
    },
    {
        "content": "<p>There is a bunch of Clippy lints, mostly in <code>correctness</code> category, that flag incorrect use of <code>unsafe</code>. Last I checked Clippy developers were open to making a security category too: <a href=\"https://github.com/rust-secure-code/wg/issues/27#issuecomment-454477101\" target=\"_blank\" title=\"https://github.com/rust-secure-code/wg/issues/27#issuecomment-454477101\">https://github.com/rust-secure-code/wg/issues/27#issuecomment-454477101</a><br>\nI don't think any checkers for committed credentials exist yet, but I expect Clippy is the easiest way to implement them.</p>",
        "id": 187206774,
        "sender_full_name": "Shnatsel",
        "timestamp": 1580652661
    },
    {
        "content": "<p>Great, thanks both! Having this kind of security lint directly in clippy would be awesome. I'll take a look at the issue tracker.</p>",
        "id": 187279526,
        "sender_full_name": "Nicolas Bigaouette",
        "timestamp": 1580748170
    }
]