[
    {
        "content": "<p>Hi all, I've wrote an xtask to formalize upgrading dependencies of a large project I'm involved in. </p>\n<p>As it stands, the script simply runs <code>upgrade</code> and <code>cargo outdated</code> for all project workspaces.</p>\n<p>What I ultimately what from this task is to make reviewing the changes to the upgraded packages as painless as possible. </p>\n<p>I would like some feedback on my plan to make a cargo plugin that allows the user to bulk review all package upgrades.</p>\n<p>My idea is to present each potential package upgrade interactively where I can see simple stats on the upgrade, see the change log entries added since my version and show me a diff of the code.</p>\n<p>This plugin is taking the attitude that you can't trust anyone else's code. But we'll make it as painless as possible to review the incoming code changes. </p>\n<p>I can imagine this being part of a broader social review system, but... that's getting ahead of myself.</p>\n<p>feedback is much appreciated.</p>",
        "id": 277540430,
        "sender_full_name": "Obscene Giraffe",
        "timestamp": 1648919212
    },
    {
        "content": "<p>That sounds like <a href=\"https://github.com/crev-dev/cargo-crev\">https://github.com/crev-dev/cargo-crev</a></p>",
        "id": 277540592,
        "sender_full_name": "Shnatsel",
        "timestamp": 1648919388
    },
    {
        "content": "<p>Yea the social part is similar, but my fundamental goal is to make the act of reviewing the upgrade as easy as possible</p>",
        "id": 277543729,
        "sender_full_name": "Obscene Giraffe",
        "timestamp": 1648923568
    },
    {
        "content": "<p>So go find the change log and present it</p>",
        "id": 277543741,
        "sender_full_name": "Obscene Giraffe",
        "timestamp": 1648923597
    },
    {
        "content": "<p>Make a diff using cargo-review-deps</p>",
        "id": 277543814,
        "sender_full_name": "Obscene Giraffe",
        "timestamp": 1648923674
    },
    {
        "content": "<p>Also allow me to skip certain package updates and take a small note why</p>",
        "id": 277543829,
        "sender_full_name": "Obscene Giraffe",
        "timestamp": 1648923707
    },
    {
        "content": "<p>Yea tbh, I could probably cobble together a few different cargo plugins to do what I need. Crev is something I saw before but never delved to deep into it. </p>\n<p>I'll give it a closer look today and see if it meets my needs</p>",
        "id": 277581558,
        "sender_full_name": "Obscene Giraffe",
        "timestamp": 1648966293
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"487722\">@Obscene Giraffe</span> FWIW I generally rely on Dependabot to perform those sorts of upgrades and it's great for aggregating context like changelogs and diffs into the PR</p>",
        "id": 277630713,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1648993603
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"132721\">@Tony Arcieri</span> Dependabot is great, but my project is stored on a self hosted Gitea. </p>\n<p>But I suppose I'm looking for a dependabot I can run locally <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 277631702,
        "sender_full_name": "Obscene Giraffe",
        "timestamp": 1648994139
    },
    {
        "content": "<p>Combining <code>cargo-edit upgrade</code> and <code>cargo-audit</code> would get me a fair bit down that road</p>",
        "id": 277631913,
        "sender_full_name": "Obscene Giraffe",
        "timestamp": 1648994246
    }
]