[
    {
        "content": "<p>Hey everyone, I was prompted in <a href=\"https://internals.rust-lang.org/t/about-release-dead-code-crates/16350/12?u=alilleybrinker\">an IRLO discussion</a> to see if this group was aware of <a href=\"https://slsa.dev/\">SLSA</a> (Supply-chain Levels for Software Artifacts) and <a href=\"https://datatracker.ietf.org/doc/html/draft-birkholz-scitt-architecture-00.html#section-1\">SCITT</a> . SLSA is a draft standard being developed by the Open Source Security Foundation which 1) defines a maturity model for the assured production of software artifacts, and 2) defines a schema for provenance attestations used as part of a verification / policy system for software artifacts. SCITT is a draft standard (previously called SCIM), initially out of Microsoft, now being developed as an IETF draft which defines a mechanism for distribution of software supply chain attestations, including both first- and third-party attestations, and the application of policies to those attestations. Neither of these are mature yet, but they may have bearing for future choices / designs in the world of Rust related to distribution of / trust in the crate ecosystem.</p>",
        "id": 277291152,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1648737439
    },
    {
        "content": "<p>I'm not in this working group, but I am on the cargo team, and I've been researching discussions about these topics.<br>\nThank you for bringing these two to my attention. There seems to be an endless list of partially independent groups working on this stuff. Sigsore, in-todo, Tuf, Crev...<br>\nEach one has a (usually implicit) trust and threat model.<br>\nThe number of times I have been told \"don't reinvent the wheel, just use TUF\" when talking about a problem entirely unrelated to what TUF solves...</p>",
        "id": 277294361,
        "sender_full_name": "Eh2406",
        "timestamp": 1648738767
    },
    {
        "content": "<p>In order to use an established project/standard you need to understand it well enough to know what it does and doesn't provide.</p>",
        "id": 277294868,
        "sender_full_name": "Eh2406",
        "timestamp": 1648738957
    },
    {
        "content": "<p>in-toto and TUF are some of the same people and solve separate (but complementary) problems</p>",
        "id": 277295079,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1648739042
    },
    {
        "content": "<p>You're absolutely right about the partially independent groups engaged in related work which may or may not be coordinating. In this case I do think some parts are beginning to coalesce, which is nice. SLSA's provenance attestations are a particular schema within the broader in-toto attestation framework, so any changes to in-toto's generic schema would require changes for consumers of SLSA attestations (where in-toto basically defines the envelope into which SLSA's schema fits). The SLSA and SCITT folks are also talking, and the two are complementary. SLSA defines _how_ to do provenance attestations, and SCITT defines how to distribute them.</p>",
        "id": 277295168,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1648739084
    },
    {
        "content": "<p>Both of these things are about attestations, not the artifacts themselves, so they exist alongside but distinct from something like TUF or Sigstore, which handles distribution of new artifacts or signing / verification of artifact integrity and authenticity, respectively.</p>",
        "id": 277295317,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1648739161
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"228245\">@Andrew Lilley Brinker</span> I've been in touch with various in-toto people over the years</p>",
        "id": 277295376,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1648739172
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"132721\">@Tony Arcieri</span> that's good! It seems like a good specification, though I wish their website and other materials made it clearer what in-toto is actually for. Right now a lot of things in this space make generic claims about \"securing the software supply chain,\" which leads to confusion about how these things interrelate.</p>",
        "id": 277295660,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1648739295
    },
    {
        "content": "<p>I don't think we need attestations that the registry trusted the upload of an artifact. The registry can always reject on upload, or retroactively delete material.<br>\nIt seems to me that the heart of the question the user cares about is \"why did my registry trust the upload of this artifact?\"</p>",
        "id": 277295754,
        "sender_full_name": "Eh2406",
        "timestamp": 1648739347
    },
    {
        "content": "<p>yeah, I'm a fan but actually deploying it in any capacity requires a lot of connecting the dots and it's somewhat unclear how to do so</p>",
        "id": 277295771,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1648739352
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"228245\">@Andrew Lilley Brinker</span> separately but somewhat related, awhile ago some of the folks behind Sigstore got in touch about trying to do something Rust-related</p>",
        "id": 277295861,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1648739401
    },
    {
        "content": "<p>Yes, I was one of the people Sigstore reached out to.</p>",
        "id": 277295967,
        "sender_full_name": "Eh2406",
        "timestamp": 1648739436
    },
    {
        "content": "<p>I joined their slack and read messages as it comes in.</p>",
        "id": 277296015,
        "sender_full_name": "Eh2406",
        "timestamp": 1648739461
    },
    {
        "content": "<p>On the attestation stuff, I agree that it's not there yet. SLSA's provenance format is still actively changing, and they only recently put out their first use case examples. It's early days, so I'm raising these things more for awareness than a particular request to do something right. Eventually I hope the standards gets to where it's much easier to 1) produce attestations about the software, 2) distribute those attestations, 3) apply policy to those attestations. That's all that SLSA and SCITT together are about.</p>",
        "id": 277296091,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1648739501
    },
    {
        "content": "<p>And I attend the OSSF securing_software_repos meetings. Where Sigstore regularly presents.</p>",
        "id": 277296191,
        "sender_full_name": "Eh2406",
        "timestamp": 1648739536
    },
    {
        "content": "<p>this was an interesting Sigstore-related proposal for Ruby: <a href=\"https://github.com/rubygems/rfcs/pull/37\">https://github.com/rubygems/rfcs/pull/37</a></p>",
        "id": 277296276,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1648739586
    },
    {
        "content": "<p>(I was surprised at how radically differently different communities use the same RFC template)</p>",
        "id": 277296360,
        "sender_full_name": "Eh2406",
        "timestamp": 1648739624
    },
    {
        "content": "<p>Ha thought the same thing re: RFC format when I clicked the link. Reading this now!</p>",
        "id": 277296523,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1648739672
    },
    {
        "content": "<p>Fundamentally Sigstore lets you use the machinery of file signing, to connect an upload to a ODIC account.</p>",
        "id": 277296726,
        "sender_full_name": "Eh2406",
        "timestamp": 1648739755
    },
    {
        "content": "<p>That is a huge step forward from some legacy systems where the machinery of code signing is not tied to anything.<br>\nYes this upload was signed by the key associated with public key 1234. But that public key is not associated with any other kind of identity.</p>",
        "id": 277296888,
        "sender_full_name": "Eh2406",
        "timestamp": 1648739822
    },
    {
        "content": "<p>yeah, IIUC they're deploying Key Transparency which uses a VRF to show mappings between keys and identities are unique (or visibly not unique) without revealing what the identities are, which is cool stuff</p>",
        "id": 277297138,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1648739922
    },
    {
        "content": "<p>But if I'm establishing a pattern of using code signing in a community that doesn't have one, and I am, then I don't know that that's the identity I want to tie it to.</p>",
        "id": 277297139,
        "sender_full_name": "Eh2406",
        "timestamp": 1648739925
    },
    {
        "content": "<blockquote>\n<p>without revealing what the identities are, which is cool stuff</p>\n</blockquote>\n<p>I thought the signatures included an email address.</p>",
        "id": 277297268,
        "sender_full_name": "Eh2406",
        "timestamp": 1648739971
    },
    {
        "content": "<p>Yeah the use of ephemeral signing keys and transparency logs is a lot better than expecting people to manage long-lived signing keys, or expecting users to engage in well-considered trust decisions.</p>",
        "id": 277297272,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1648739973
    },
    {
        "content": "<p>Does anyone understand the threat model for sigstore? Their website still says \"coming soon\".</p>",
        "id": 277297484,
        "sender_full_name": "Alex Gaynor",
        "timestamp": 1648740057
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120179\">@Eh2406</span> it's prior to signing. keys are enrolled in a KT service</p>",
        "id": 277297510,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1648740068
    },
    {
        "content": "<p>it's a transparency log for the keys themselves</p>",
        "id": 277297724,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1648740148
    },
    {
        "content": "<p>I'm not sure about Sigstore's threat model. I will say that SLSA has a <a href=\"https://slsa.dev/spec/v0.1/threats\">draft (unfinished) threat model</a> which they map to the requirements in their maturity model for assured production of software artifacts.</p>",
        "id": 277298122,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1648740301
    },
    {
        "content": "<p>What I would like to see is <a href=\"http://crates.io\">crates.io</a> having a public transparency log that includes:</p>\n<ul>\n<li>When a public key is registered a signature verifying that an appropriate Github Auth allowed it.</li>\n<li>When a crate is first published a signature verifying the Github Auth  that claimed it.</li>\n<li>When a user is added a signature verifying the account that was added and the account that authorized it, and that the authorization account was correctly logged in at the time.</li>\n<li>When a version is published a signature showing that the artifact (or its hash) was signed by a public key allowed by that user.</li>\n</ul>",
        "id": 277298296,
        "sender_full_name": "Eh2406",
        "timestamp": 1648740363
    },
    {
        "content": "<p>(And if we add other forms of identity they should also go on this list.)</p>",
        "id": 277298486,
        "sender_full_name": "Eh2406",
        "timestamp": 1648740447
    },
    {
        "content": "<p>I feel like that would help answer the question \"why was this trusted\".</p>\n<ul>\n<li>Because the hash I downloaded matched the hash in the transparency log.</li>\n<li>Because the signature on that hash matched a public key on file for some user.</li>\n<li>That public key was added by someone logged on as that user.</li>\n<li>That user was allowed to publish because they were added by some other user.</li>\n<li>That other user was allowed to publish because they grabbed the crate name.</li>\n</ul>",
        "id": 277298811,
        "sender_full_name": "Eh2406",
        "timestamp": 1648740596
    },
    {
        "content": "<p>That being said I am no expert. I continue to do my research hoping that as these projects mature they can explain to me how they fit with our needs.</p>",
        "id": 277314534,
        "sender_full_name": "Eh2406",
        "timestamp": 1648747752
    },
    {
        "content": "<p>I am one of those people working in isolation without awareness of other work <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span> <br>\nI made <a href=\"https://github.com/rust-secure-code/cargo-supply-chain\">https://github.com/rust-secure-code/cargo-supply-chain</a> and <a href=\"https://github.com/Shnatsel/rust-audit\">https://github.com/Shnatsel/rust-audit</a><br>\nThe latter has morphed into <code>cargo auditable</code> but it's not workable as a subcommand (e.g. won't work with workspaces or multiple targets) so I suppose I'll just have to fold it into Cargo proper.<br>\nI need to research all of these specs because the issue of the format used is a big one. I have a workable version now that sufficient for RustSec audit needs and doesn't reveal any info that's not revealed already, but I'm not sure what other formats are out there and how do we want to interop with them.</p>",
        "id": 277324515,
        "sender_full_name": "Shnatsel",
        "timestamp": 1648752757
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"127617\">@Shnatsel</span> some potentially relevant in-toto work <a href=\"https://github.com/adityasaky/in-toto-sbom-demo\">https://github.com/adityasaky/in-toto-sbom-demo</a></p>",
        "id": 277325644,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1648753219
    },
    {
        "content": "<p>Thanks, I'll take a look over the weekend</p>",
        "id": 277326875,
        "sender_full_name": "Shnatsel",
        "timestamp": 1648753840
    },
    {
        "content": "<p>Related to SBOMs, a couple things to know!</p>\n<ul>\n<li>Executive Order 14028 directed CISA to produce a document defining the minimum required elements for an SBOM, which they did: <a href=\"https://www.ntia.doc.gov/files/ntia/publications/sbom_minimum_elements_report.pdf\">https://www.ntia.doc.gov/files/ntia/publications/sbom_minimum_elements_report.pdf</a></li>\n<li>There are two major competing SBOM formats (SPDX and CycloneDX). SPDX is backed by the Open Source Security Foundation / Linux Foundation, CycloneDX is backed by OWASP. SPDX is _generally_ more popular, and currently supports 5 different actual representations, the two most popular of which are the flat file \"single tag-value pair per line\" format and JSON.</li>\n</ul>",
        "id": 277328340,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1648754613
    },
    {
        "content": "<p>ooh, this is interesting for Sigstore + TUF: <a href=\"https://blog.sigstore.dev/sigstore-bring-your-own-stuf-with-tuf-40febfd2badd\">https://blog.sigstore.dev/sigstore-bring-your-own-stuf-with-tuf-40febfd2badd</a></p>",
        "id": 277347351,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1648764979
    },
    {
        "content": "<p>ooh, \"Integrating Sigstore with Artifact Repositories\" <a href=\"https://docs.google.com/document/d/1mXrVAkUA9dd4M7fa_AJC8mQ55YnYJ-DKsGq30lh0FvA/edit#heading=h.jyrb6etgzah\">https://docs.google.com/document/d/1mXrVAkUA9dd4M7fa_AJC8mQ55YnYJ-DKsGq30lh0FvA/edit#heading=h.jyrb6etgzah</a></p>",
        "id": 277358674,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1648774349
    },
    {
        "content": "<p>Looks like they also have a draft set of expectations for future IDPs which may be accepted by Fulcio: <a href=\"https://github.com/sigstore/fulcio/issues/397\">https://github.com/sigstore/fulcio/issues/397</a></p>",
        "id": 277360576,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1648776338
    },
    {
        "content": "<p>The todo section includes the possibility of delegating the question of confirming publication rights for a user to a package with an ACME challenge, which means a dependency on DNS. DNS is inescapable, huh?</p>",
        "id": 277360819,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1648776576
    },
    {
        "content": "<p>oh joy, and the biggest impediment to progress, the \"I want to ensure my packages are trusted but I don't want to trust anybody\" crowd <a href=\"https://github.com/sigstore/fulcio/issues/444\">https://github.com/sigstore/fulcio/issues/444</a></p>",
        "id": 277361065,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1648776871
    },
    {
        "content": "<p>There was a relatively recent episode of the \"Security. Cryptography. Whatever.\" podcast where they interviewed two of the leads from Tailscale who emphasized how valuable it's been for them to delegate identity to third-party IDPs because 1) those IDPs have better data protection / identity validation / everything identity practices than Tailscale would have, 2) it takes a ton of technical burden off of Tailscale to implement and manage identity stuff. Users are absolutely better off just when the systems they use delegate this to one of the major companies that run these IDP systems.</p>",
        "id": 277361352,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1648777202
    },
    {
        "content": "<p>When systems ask users to carefully manage identity trust themselves (cough PGP cough) those users fail.</p>",
        "id": 277361434,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1648777282
    },
    {
        "content": "<p>Related, looks like there's a new WG within the OpenSSF brewing for package manager teams to coordinate about practices. <a href=\"https://github.com/ossf/tac/issues/79\">https://github.com/ossf/tac/issues/79</a></p>",
        "id": 277362671,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1648778637
    },
    {
        "content": "<blockquote>\n<p>ooh, \"Integrating Sigstore with Artifact Repositories\"</p>\n</blockquote>\n<p>This is still very a <em>draft</em>. That being said I am one of the people giving them feedback on it.</p>\n<blockquote>\n<p>Related, looks like there's a new WG within the OpenSSF brewing for package manager teams to coordinate about practices. <a href=\"https://github.com/ossf/tac/issues/79\">https://github.com/ossf/tac/issues/79</a></p>\n</blockquote>\n<p>I attend this most meetings!</p>",
        "id": 277364939,
        "sender_full_name": "Eh2406",
        "timestamp": 1648781350
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120179\">@Eh2406</span> that's awesome!</p>",
        "id": 277419400,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1648820492
    },
    {
        "content": "<blockquote>\n<p>The latter has morphed into cargo auditable but it's not workable as a subcommand (e.g. won't work with workspaces or multiple targets) so I suppose I'll just have to fold it into Cargo proper.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"127617\">@Shnatsel</span>: The main thing holding up cargo adopting your experiments in this area is that we have no background in it. We don't know what the options are. We don't know how they're used. We don't know when they're required. And so we don't have enough background to except on its face or guide an RFC.<br>\nIt sounds like <span class=\"user-mention\" data-user-id=\"228245\">@Andrew Lilley Brinker</span> has that background. I wonder if you two could work together to write an RFC thorough enough that we could accept it. I get that a thorough tutorial and background material is an unfairly large amount of work to require for an RFC, but it's the (lack of) expertise we happen to bring to bear. And it seems like SBOM are a hot topic these days, so there might be more resources you can link us to.</p>",
        "id": 277435169,
        "sender_full_name": "Eh2406",
        "timestamp": 1648826859
    },
    {
        "content": "<p>Writing an RFC may be more than I can take on right now (currently in grad school so my time outside of that and work is limited), but I am happy to consult and share my knowledge of existing concepts / technology / standards.</p>",
        "id": 277560084,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1648945189
    },
    {
        "content": "<p>somewhat relevant <a href=\"https://security.googleblog.com/2022/04/improving-software-supply-chain.html\">https://security.googleblog.com/2022/04/improving-software-supply-chain.html</a></p>",
        "id": 278308580,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1649426602
    },
    {
        "content": "<blockquote>\n<p>This blog post describes a new method of generating non-forgeable provenance using GitHub Actions workflows for isolation and Sigstore’s signing tools for authenticity. Using this approach, projects building on GitHub runners can achieve SLSA 3 (the third of four progressive SLSA “levels”), which affirms to consumers that your artifacts are authentic and trustworthy.</p>\n</blockquote>",
        "id": 278308620,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1649426624
    },
    {
        "content": "<p><a href=\"https://github.com/ossf/wg-securing-software-repos\">https://github.com/ossf/wg-securing-software-repos</a></p>",
        "id": 278495009,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1649632714
    },
    {
        "content": "<p>I take it this is the group <span class=\"user-mention\" data-user-id=\"120179\">@Eh2406</span> is part of. Looks like the repo is pretty new and the group charter is not yet defined. Nonetheless, happy to see this moving along!</p>",
        "id": 278623246,
        "sender_full_name": "Andrew Lilley Brinker",
        "timestamp": 1649714668
    },
    {
        "content": "<p>yeah</p>",
        "id": 278623366,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1649714752
    }
]