[
    {
        "content": "<p>I am pretty new here so there's a high chance I am missing out on some stuff (forgive me in that case!), but I just wanted to raise the question just in case people agree. When I read through all the topics and blog posts and linked repo's I feel like there is a lot of great work that is currently happening, but it feels like there is not a single place where all the knowledge (or at least references to it) come together.</p>\n<p>So I thought, maybe we could update the README of the rust-secure-code workgroup with security related projects/area's and work as well? We could also create a separate document for the repository if that would make it more clean. That way beginners / people that want to contribute something on the area of Rust security can get up to speed in a glance.</p>\n<p>I think we should also put a link to our Twitter channel for example! (Didn't even knew it existed till today haha :P)</p>",
        "id": 160873498,
        "sender_full_name": "DevQps",
        "timestamp": 1552656006
    },
    {
        "content": "<p>Since I am new I kind of feel like I might be stepping out of my book here though....</p>",
        "id": 160873521,
        "sender_full_name": "DevQps",
        "timestamp": 1552656026
    },
    {
        "content": "<p>Maybe it would also be good to close some old topics in our stream as well, or archive them somehow maybe?</p>",
        "id": 160873786,
        "sender_full_name": "DevQps",
        "timestamp": 1552656233
    },
    {
        "content": "<p>That sounds like a good idea, we do have a bit of a problem with discoverability of work items.</p>",
        "id": 160908701,
        "sender_full_name": "Shnatsel",
        "timestamp": 1552680051
    },
    {
        "content": "<p>Mmmm maybe we should start with creating a list of related projects and add those to the README with a description? If you want I can get started with that tomorrow as well!</p>",
        "id": 160921285,
        "sender_full_name": "DevQps",
        "timestamp": 1552691560
    },
    {
        "content": "<p>yep this is a good idea - I would like to spend some time on some work items but I'm really not sure where to start, or who's on point on the tasks, if there's a work tracker for a specific task, etc</p>",
        "id": 160923300,
        "sender_full_name": "Gerardo Di Giacomo",
        "timestamp": 1552694002
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"144034\">@Gerardo Di Giacomo</span> When I started somewhere this week, reading through all topics in this stream provided me with a lot of links! Most of the links themselves also often have links te interesting places :)</p>",
        "id": 160941921,
        "sender_full_name": "DevQps",
        "timestamp": 1552724878
    },
    {
        "content": "<p>I'll create an issue for it on the WG repo!</p>",
        "id": 160941965,
        "sender_full_name": "DevQps",
        "timestamp": 1552724896
    },
    {
        "content": "<p>I created an issue for this and I am currently working on collecting different projects that could aid in achieving our Roadmap goals. The issue can be seen here: <a href=\"https://github.com/rust-secure-code/wg/issues/30\" target=\"_blank\" title=\"https://github.com/rust-secure-code/wg/issues/30\">https://github.com/rust-secure-code/wg/issues/30</a></p>",
        "id": 160956070,
        "sender_full_name": "DevQps",
        "timestamp": 1552750868
    },
    {
        "content": "<p>If you guys all agree, I will leave it open for a week and then create a Pull Request merging the projects that people have mentioned in the issue. Any projects that should be added later then need their own PR.</p>",
        "id": 160956117,
        "sender_full_name": "DevQps",
        "timestamp": 1552750934
    },
    {
        "content": "<p>Work trackers for specific tasks are on the WG issue tracker. We should probably advertise that in the README</p>",
        "id": 160956258,
        "sender_full_name": "Shnatsel",
        "timestamp": 1552751206
    },
    {
        "content": "<p>I would rather keep the list problem-oriented than solution-oriented. I.e. I would rather list the issues we're trying to solve first, and potential solutions second. This leaves room for coming up with novel solutions and/or creating new projects</p>",
        "id": 160956332,
        "sender_full_name": "Shnatsel",
        "timestamp": 1552751344
    },
    {
        "content": "<p>I agree! If I understand you correctly, do you mean that you'd first want the README to list the potential problems that we are aiming to solve (For example under a \"Problems\" or \"Topic/Area\" heading) and then a list of potential projects that could solve these problems? Or aim to solve security issues in general?</p>",
        "id": 160956467,
        "sender_full_name": "DevQps",
        "timestamp": 1552751630
    },
    {
        "content": "<p>Or do I misunderstand?</p>",
        "id": 160956469,
        "sender_full_name": "DevQps",
        "timestamp": 1552751639
    },
    {
        "content": "<p>Actually, do we need another list if we have the bug tracker issues already listing the work items? I guess it would help with visibility if it were in the README</p>",
        "id": 160958800,
        "sender_full_name": "Shnatsel",
        "timestamp": 1552755591
    },
    {
        "content": "<p>I don't want to create too much duplication though. So perhaps list the problems we want to solve and link the relevant issues?</p>",
        "id": 160958857,
        "sender_full_name": "Shnatsel",
        "timestamp": 1552755620
    },
    {
        "content": "<p>I think that it is a good idea to list the work items in the README! So then the README would look something like:</p>\n<p>Introduction<br>\nMission<br>\nWork Items (+ Mentioned issues)<br>\nProjects (+ Working Group/Security related projects)<br>\nContact</p>\n<p>Or should we merge Projects and Work Items together? I personally would prefer having the Work Items / Goals in the README because as an issue they are not really \"solvable\". For example take \"Improve Clippy security lints\": When would this really be solved? I think the issue then more or less serves more as an chat/big conversation then an actual issue. Maybe we could move the discussion to Zulip topics and use Github issues for more concretely solvable things? But it might be just a matter of preference however!</p>\n<p>I just see now that Twitter was there in the contact section all along... My bad for that...</p>",
        "id": 160959308,
        "sender_full_name": "DevQps",
        "timestamp": 1552756370
    },
    {
        "content": "<p>EDIT: On a second hand, maybe a Github issue is actually a nice way to keep the discussion going. Maybe one of the challenges is to keep Zulip and Github in sync such that the more concrete topics emerging out of Zulip should get their own Github issue. But I am not sure what you guys think about this however.</p>",
        "id": 160959442,
        "sender_full_name": "DevQps",
        "timestamp": 1552756591
    },
    {
        "content": "<hr>\n<p>The list with security related projects I came up with is here: <a href=\"https://github.com/rust-secure-code/wg/issues/30\" target=\"_blank\" title=\"https://github.com/rust-secure-code/wg/issues/30\">https://github.com/rust-secure-code/wg/issues/30</a><br>\nI think maybe (in a shorter form, maybe a table per catagory) should be included to the README, such that security-oriented Rust programmers have a way to find all the tools they need which in turn hopefully improves the security ecosystem of Rust.</p>\n<p>What do you think of this list? Do you have any other projects to add? Or some which we should exclude?</p>",
        "id": 161011847,
        "sender_full_name": "DevQps",
        "timestamp": 1552851592
    },
    {
        "content": "<p>Or do you guys think this list should be placed somewhere else? I think keeping all the security related projects / posts together such that newcomers + interested people can get up to speed is fairly important.</p>",
        "id": 161011902,
        "sender_full_name": "DevQps",
        "timestamp": 1552851674
    },
    {
        "content": "<p>Hmm. I would rather organize the README around the issue tracker items. For example, I want to be able to detect reads from uninitialized memory; libdiffuzz kind of does that, but it's also kind of a hack, and getting proper support for Memory Sanitizer would be much more important.<br>\nOn the other hand, getting a list of all security-related Rust projects definitely would be helpful - AFAIK right now there is no such thing</p>",
        "id": 161012166,
        "sender_full_name": "Shnatsel",
        "timestamp": 1552852199
    },
    {
        "content": "<p>Mmm I can relate with your view. Do you have any idea's on what might be a good place to publish such a list?</p>",
        "id": 161012346,
        "sender_full_name": "DevQps",
        "timestamp": 1552852481
    },
    {
        "content": "<p>I can create a Pull Request with our work items if you want? Or would you like to do that yourself? EDIT: I get a permission denied when trying to push a branch? :)</p>",
        "id": 161012367,
        "sender_full_name": "DevQps",
        "timestamp": 1552852529
    },
    {
        "content": "<p>you need to fork your repo and push there, then create a pull request</p>",
        "id": 161014432,
        "sender_full_name": "Shnatsel",
        "timestamp": 1552856048
    },
    {
        "content": "<p>this is not <code>bzr</code> where the unit is a branch and you can do whatever you like with them. in <code>git</code> you need to make a copy of the entire repository with all the branches and only after that you can push changes. If you download the code you're also forced to download all branches.</p>",
        "id": 161014471,
        "sender_full_name": "Shnatsel",
        "timestamp": 1552856130
    },
    {
        "content": "<p>Ah thanks (Y)! I hope you don't mind me talking to much over here and Github though :) I feel motivated to push some work, but I hope you guys don't find it annoying. If you'd rather have me being silent and just working on some related project feel free :)</p>\n<p>I cloned the repo btw, but I will fork it now and then do the pull request! Should be there in a few minutes!</p>",
        "id": 161014524,
        "sender_full_name": "DevQps",
        "timestamp": 1552856183
    },
    {
        "content": "<p>I opened the pull here: <a href=\"https://github.com/rust-secure-code/wg/pull/31\" target=\"_blank\" title=\"https://github.com/rust-secure-code/wg/pull/31\">https://github.com/rust-secure-code/wg/pull/31</a><br>\nNot quite satisfied though, some feedback would be welcome :)</p>",
        "id": 161014719,
        "sender_full_name": "DevQps",
        "timestamp": 1552856522
    },
    {
        "content": "<p>Thanks, I'll try to take a look tomorrow.</p>",
        "id": 161014779,
        "sender_full_name": "Shnatsel",
        "timestamp": 1552856619
    },
    {
        "content": "<p>At a glance, it's probably a good idea to extend verification beyond std... there are commonly used crates such as <code>byteorder</code> that are also critical to the ecosystem, there's no reason not to cover them as well.</p>",
        "id": 161014849,
        "sender_full_name": "Shnatsel",
        "timestamp": 1552856701
    },
    {
        "content": "<p>I think that would be nice as well. I read something about Libz Blitz today, but that was a post from 2017, I wonder if they are actually still doing the assessments.</p>",
        "id": 161014931,
        "sender_full_name": "DevQps",
        "timestamp": 1552856816
    },
    {
        "content": "<p>No, but we could organize something like that</p>",
        "id": 161015505,
        "sender_full_name": "Shnatsel",
        "timestamp": 1552857670
    },
    {
        "content": "<p>All we're missing is a clearly defined workflow, some examples and a reddit post announcing it</p>",
        "id": 161015516,
        "sender_full_name": "Shnatsel",
        "timestamp": 1552857700
    },
    {
        "content": "<p>We could do something like that I guess. I think it would be nice to have at least 2 people that put their efforts into this. I feel like we either need to do this for the whole 100% and invest time and effort into getting people to join and to organize everything or not to pursue this at all at this moment. Otherwise we would end up like Libz Blitz (or I don't know why it ended, but I guess it was because of a lack of time/participants). We could create an issue for this on the WG repository however. Someone could always pick it up if he/she truly feels like it.</p>",
        "id": 161053525,
        "sender_full_name": "DevQps",
        "timestamp": 1552912827
    },
    {
        "content": "<p>I  think Libs Blitz ended because it has accomplished what it has set out to do</p>",
        "id": 161060528,
        "sender_full_name": "Shnatsel",
        "timestamp": 1552918495
    },
    {
        "content": "<p>I created a Pull Request for the list of projects. <a href=\"https://github.com/rust-secure-code/wg/pull/32\" target=\"_blank\" title=\"https://github.com/rust-secure-code/wg/pull/32\">https://github.com/rust-secure-code/wg/pull/32</a><br>\nI am wondering what you guys think.</p>",
        "id": 161658498,
        "sender_full_name": "DevQps",
        "timestamp": 1553530023
    },
    {
        "content": "<p><a href=\"https://github.com/japaric/rust-san\" target=\"_blank\" title=\"https://github.com/japaric/rust-san\">https://github.com/japaric/rust-san</a> deserves a mention</p>",
        "id": 161715963,
        "sender_full_name": "Shnatsel",
        "timestamp": 1553556971
    },
    {
        "content": "<p>TUF is not useful for crate developers, so I'd drop it</p>",
        "id": 161715975,
        "sender_full_name": "Shnatsel",
        "timestamp": 1553556997
    },
    {
        "content": "<p>I'd also add an encouragement for the readers to add their own projects there</p>",
        "id": 161715980,
        "sender_full_name": "Shnatsel",
        "timestamp": 1553557020
    },
    {
        "content": "<p>Angora currently doesn't work with Rust code, although we very much want that to change</p>",
        "id": 161716046,
        "sender_full_name": "Shnatsel",
        "timestamp": 1553557091
    },
    {
        "content": "<p>AFAIR the author of <code>untrusted</code> was moving away from that approach, so not sure if it's a good idea to promote it</p>",
        "id": 161716073,
        "sender_full_name": "Shnatsel",
        "timestamp": 1553557152
    },
    {
        "content": "<p>I'd categorize libdiffuzz as a dynamic analyzer, but that's debatable</p>",
        "id": 161716150,
        "sender_full_name": "Shnatsel",
        "timestamp": 1553557230
    },
    {
        "content": "<p>Otherwise looks solid to me</p>",
        "id": 161716152,
        "sender_full_name": "Shnatsel",
        "timestamp": 1553557237
    },
    {
        "content": "<p>Also sorry for the radio silence, I have a lot going on right now</p>",
        "id": 161716181,
        "sender_full_name": "Shnatsel",
        "timestamp": 1553557290
    },
    {
        "content": "<blockquote>\n<p>Shnatsel: AFAIR the author of untrusted was moving away from that approach, so not sure if it's a good idea to promote it</p>\n</blockquote>\n<p>We have been enhancing untrusted recently and there's no intent to drop it. I'm planning to remove it from the public interface of <em>ring</em>, but <em>ring</em> and most of my other projects that do (binary) parsing will continue to use it.</p>",
        "id": 161717746,
        "sender_full_name": "briansmith",
        "timestamp": 1553559129
    },
    {
        "content": "<p>I think that it might make sense to decide whether (binary) parsing in general is a category that should be included; if so then zerocopy, nom, combine, scroll, etc. would also be things to consider.</p>",
        "id": 161717859,
        "sender_full_name": "briansmith",
        "timestamp": 1553559308
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"127617\">@Shnatsel</span> I will change this things and report back! And no problem :)</p>\n<p><span class=\"user-mention\" data-user-id=\"133214\">@briansmith</span> I do consider sanitizing the input / reading inputs securely an important area, but I am not sure what the others think about that :)</p>",
        "id": 161734165,
        "sender_full_name": "DevQps",
        "timestamp": 1553579681
    },
    {
        "content": "<p>I updated the Pull Request with the suggestions! I processed all suggestions except for removing the untrusted entry.</p>",
        "id": 161746889,
        "sender_full_name": "DevQps",
        "timestamp": 1553594801
    },
    {
        "content": "<p>I'm not sure I understand the assertion that TUF isn't useful to crate authors? They'd be able to sign crates as the author...</p>",
        "id": 161814854,
        "sender_full_name": "Judson Lester",
        "timestamp": 1553644664
    },
    {
        "content": "<p>Personally I do not know too much about TUF, so I'll leave that discussion up to you guys :)</p>",
        "id": 161832555,
        "sender_full_name": "DevQps",
        "timestamp": 1553667508
    },
    {
        "content": "<p>I mean, TUF is intended as a supply-chain mitigation for services like <a href=\"http://crate.io\" target=\"_blank\" title=\"http://crate.io\">crate.io</a>. It's a parallel registry of artifact signatures. Library owners are one of the stakeholders and participants, since they sign their artifacts (crates) on submission and decide whether to accept unsigned crates.<br>\nBut it does require a parallel service and maintenance thereof (i.e. someone needs to hold and protect root keys for a TUF registry.) So it's not something that a developer can use on their own.</p>",
        "id": 161889330,
        "sender_full_name": "Judson Lester",
        "timestamp": 1553712675
    },
    {
        "content": "<p>For what it's worth I made (or rather, modified) a proposal to use TUF to secure the <a href=\"http://crates.io\" target=\"_blank\" title=\"http://crates.io\">crates.io</a> index: <a href=\"https://github.com/withoutboats/rfcs/pull/7\" target=\"_blank\" title=\"https://github.com/withoutboats/rfcs/pull/7\">https://github.com/withoutboats/rfcs/pull/7</a></p>",
        "id": 162126054,
        "sender_full_name": "Tony Arcieri",
        "timestamp": 1553960592
    }
]