[
    {
        "content": "<p>I've updated most of the provide-any proposal, but I'm feeling pretty unclear on the concurrent versions. I think we just need impls for dyn Tagged with Send/Sync just because of limitations on trait object impls and thus they're there mostly for completeness. But we've also discussed having Send/Sync versions of Requisition. That only seems useful if we have a version of Provider::provide with those bounds. But that seems unnecessary</p>",
        "id": 268028158,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1642173992
    },
    {
        "content": "<p>Because</p>",
        "id": 268028165,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1642173995
    },
    {
        "content": "<p>AIUI the concurrent use case is essentially that provide is implemented by getting a value from another thread via a channel or something, and for that to work, we wouldn't pass the requisition object to another thread, just pass the statically typed value, and pass it in to the requisition object on the 'getting' thread</p>",
        "id": 268028426,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1642174104
    },
    {
        "content": "<p>Is there some other use case where the Requisition itself has to move threads?</p>",
        "id": 268028476,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1642174135
    },
    {
        "content": "<p>And is there any reason for the Tagged trait objects to have Send/Sync variant impls? (Other than completeness in case somebody uses Tagged outside of the provider API, which is not an unreasonable thing to do)</p>",
        "id": 268028637,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1642174201
    },
    {
        "content": "<p>Not that I can think of. Are there any forwards compatibility issues for the Send Sync stuff? As in, can we just add it later if a usecase comes up?</p>",
        "id": 268028735,
        "sender_full_name": "Jane Lusby [she/her]",
        "timestamp": 1642174225
    },
    {
        "content": "<p>I feel like, barring concrete usecases we should just outline how to add the support in the future but not actually do so.</p>",
        "id": 268028861,
        "sender_full_name": "Jane Lusby [she/her]",
        "timestamp": 1642174270
    },
    {
        "content": "<p>I believe they can be added later, it was done for Any at some point</p>",
        "id": 268029842,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1642174704
    }
]