[
    {
        "content": "<blockquote>\n<p>but it's a bit abstract as far as this group's relation to the rest of the Rust project</p>\n</blockquote>\n<p>Is it? I expected that to be a large part of the group.</p>",
        "id": 210927344,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1600806673
    },
    {
        "content": "<p>Otherwise the group is easy: all errors should be handled via <code>unwrap()</code>. No philosophy needed, no confusing choices for users, no crates to clutter things up.</p>",
        "id": 210927474,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1600806728
    },
    {
        "content": "<p>I'm not saying that this group isn't the right place to have such discussions, or that they're not important for the choices the group makes. I mean that they're \"abstract\" in the sense that a discussion about philosophy-of-errors isn't necessarily indicative of what actions this group will take that affect the project at large, such as opening RFCs or publishing \"The Book of Error\".</p>",
        "id": 210929775,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1600807953
    },
    {
        "content": "<p>Isn't the <a href=\"https://github.com/rust-lang/project-error-handling/blob/master/CHARTER.md\">charter</a> what the group is \"doing\"?</p>",
        "id": 210930473,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1600808355
    },
    {
        "content": "<p>Perhaps you could restate what it is you want that isn't (presumably) this thread?</p>",
        "id": 210930584,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1600808404
    },
    {
        "content": "<p>FWIW, I aggressively split and rename Zulip topics in my own areas, so I agree with the idea of let 1000 topics bloom.</p>",
        "id": 210930824,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1600808557
    },
    {
        "content": "<p>But this isn’t my group so I’m not doing that here.</p>",
        "id": 210930863,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1600808584
    },
    {
        "content": "<p>splits aren't permanent or irreversible right?</p>",
        "id": 210931551,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1600809004
    },
    {
        "content": "<p>as in I don't see any reason for this to be something reserved for the project shepherds and I'd like if everyone feels comfortable splitting up topics as they feel is best</p>",
        "id": 210931610,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1600809040
    },
    {
        "content": "<p>just make sure we're communicating with each other about the intention to split up topics</p>",
        "id": 210931635,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1600809057
    },
    {
        "content": "<p>the ui has me thinking its only possible to edit msgs for 1 hour after posting them so it may not be possible to change splits well after they've happened, but either way I don't think there's any real risk here</p>",
        "id": 210931860,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1600809151
    },
    {
        "content": "<p>I guess I was thinking in terms of group visibility, or the ease with which someone not directly involved (and not following the entire stream) could determine what's \"on the radar\" for the group. But now that I've made that explicit, it's clear that \"make sure Zulip topics are clearly delimited/categorized\" is not actually a good solution for that1</p>",
        "id": 210932889,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1600809728
    },
    {
        "content": "<p>I think we might be able to get away with using the issue tracker as a top level overview of work in progress and using zulip for ephemeral discussions</p>",
        "id": 210932972,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1600809790
    },
    {
        "content": "<p>But I do think that it would be good for topics that aren't initially about philosophy of error handling to generally stay away from that general umbrella of topics, and such \"philosophy\" tangents can be directed to new or existing topics.</p>",
        "id": 210932989,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1600809806
    },
    {
        "content": "<p>Zulip is absolutely best treated as ephemeral, I think. It's nice that individual comments are perma-linkable, and for a while I tried to maintain a running \"Zulip summary\" in the FFI-unwind group with copious links to the original discussions, but it really wasn't tractable.</p>",
        "id": 210933116,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1600809875
    },
    {
        "content": "<p>Issue tracker/GitHub projects</p>",
        "id": 210933548,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1600810152
    },
    {
        "content": "<p>And remember that there’s only like two or three people actually on the team so I wouldn’t expect huge amounts of work to get completed at a great rate.</p>",
        "id": 210934945,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1600810927
    },
    {
        "content": "<p>definitely hoping a lot more ppl get involved, there has been a fair bit of interest already</p>",
        "id": 210935060,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1600811004
    },
    {
        "content": "<p>I have at least 1 other mentee from awesome-rust-mentors who is interested in helping</p>",
        "id": 210935092,
        "sender_full_name": "Jane Lusby",
        "timestamp": 1600811026
    },
    {
        "content": "<p>Speaking 100% for myself, pontificating in Zulip is way easier than actually doing any real work￼.</p>",
        "id": 210935170,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1600811058
    }
]