[
    {
        "content": "<p>I noticed that one of the PRs assigned to me (<a href=\"https://github.com/rust-lang/rust/pull/75645\">https://github.com/rust-lang/rust/pull/75645</a>) was converted to draft by triage team.</p>\n<p>Why was it done?<br>\nDraft status is redundant when we already have waiting-on labels, and is not useful neither to reviewer nor to author.<br>\nIt also confuses automation (or at least it did in the past).</p>",
        "id": 209276513,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1599471922
    },
    {
        "content": "<p>Large portion of PRs actually arrive in draft status and need significant rework, without being marked as draft.<br>\nThis is a usual matter of communication between the author and reviewer, and switching between waiting-on-author and waiting-on-review is enough to facilitate it.</p>",
        "id": 209276692,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1599472056
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"123856\">@Vadim Petrochenkov</span> Not related to your specific PR, but it’s worth noting that GitHub is planning on making the draft state of PRs more meaningful with pull request revisions. <a href=\"https://github.com/github/roadmap/issues/54\">https://github.com/github/roadmap/issues/54</a></p>",
        "id": 209283264,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1599476670
    },
    {
        "content": "<p>not sure why this one was marked as draft (it doesn't have to) but normally it's done for experiments or to signify that it is work in progress (waiting-on-author would suffice but it's also used for other things such as when there are changes requested or conflicts, so draft is a more specific case)</p>",
        "id": 209306334,
        "sender_full_name": "DPC",
        "timestamp": 1599491765
    },
    {
        "content": "<p>I did the conversion, because it seems the PR is not quite ready for review(needs investigation and maybe large portions of changes)? Since the PR authored by rust-lang member, we cannot ping that member, instead we'll need to bump the labels again and again if it's in S-waiting-for-author state but not as a draft PR (if it's in draft PR state we as triagers can just skip it).</p>",
        "id": 209341298,
        "sender_full_name": "Charles Lew",
        "timestamp": 1599533380
    }
]