[
    {
        "content": "<p>Should we standardize (or partially standardize) our triage report format? Each person has chosen a personal style, but I'm not sure if there is some information that I don't include that I should, or information that I <em>do</em> include that isn't necessary and adds noise.</p>\n<p><span class=\"user-mention\" data-user-id=\"120823\">@DPC</span> What information is helpful to see for each PR?</p>",
        "id": 224430688,
        "sender_full_name": "Noah Lev",
        "timestamp": 1611895747
    },
    {
        "content": "<p>i'll discuss this at the meeting on wednesday because otherwise there's nothing much to discuss</p>",
        "id": 224463645,
        "sender_full_name": "DPC",
        "timestamp": 1611923505
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120823\">@DPC</span> Btw, when you get a change could you also take a look at <a href=\"https://github.com/rust-lang/rust-forge/issues/501\">forge#501</a>?</p>",
        "id": 224524020,
        "sender_full_name": "Noah Lev",
        "timestamp": 1611949718
    },
    {
        "content": "<p>doing it right now</p>",
        "id": 224543218,
        "sender_full_name": "DPC",
        "timestamp": 1611958567
    },
    {
        "content": "<p>Not sure who the target audience is for these reports, but I often look in this channel for these reports to see if any (small) PRs need attention when I have some time left. For me personally, it'd be super useful to see if they are libs related or not. (Now I just guess based on the assignee, which works okay too.) Having both the author and assignee there is also really nice.</p>",
        "id": 224584638,
        "sender_full_name": "Mara",
        "timestamp": 1612012475
    },
    {
        "content": "<p>I thought <span class=\"user-mention silent\" data-user-id=\"120823\">DPC</span> (the wg-triage lead) was the target audience; glad to hear it's useful to others too!</p>",
        "id": 224599534,
        "sender_full_name": "Noah Lev",
        "timestamp": 1612033243
    },
    {
        "content": "<p>generally the reports are targetted to me, but are kept simple so others can use them and any reviewer can pick up stuff or their own prs by looking at the reports. Generally, i go through them and decide whether it should be reassigned / author or reviewer should be pinged or messaged about it / closed  ... etc</p>",
        "id": 224610901,
        "sender_full_name": "DPC",
        "timestamp": 1612048436
    }
]