[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"279832\">@Luca Barbieri</span> Could you elaborate on what the goal with <a href=\"https://github.com/rust-lang/rust/pull/70745\" title=\"https://github.com/rust-lang/rust/pull/70745\">https://github.com/rust-lang/rust/pull/70745</a> is?</p>",
        "id": 192872770,
        "sender_full_name": "centril",
        "timestamp": 1585953950
    },
    {
        "content": "<p>I don't think we discussed replacing <code>rustc_parse</code> (which there is nothing wrong with, and which has been reviewed and refactored in-depth by now) with a whole other crate in the design meeting, only making tweaks to the existing parser to fit RA better.</p>",
        "id": 192872872,
        "sender_full_name": "centril",
        "timestamp": 1585954024
    },
    {
        "content": "<p>it was mostly a fun project, although it can be used to test the rust-analyzer parser against the rustc one by comparing the output of -Z ast-json-noexpand with and without the -Z parse-with-rust-analyzer flag. It could also be used in principle to delete the rustc parser from the repository and use the RA parser in stable rustc, but that would require major effort on the RA parser; or it could be used to change the rustc parser to output the rust-analyzer parsing events, use the code in the pull request to create the rustc data structures and delete the RA parser, not sure about the effort required for that.</p>",
        "id": 192903192,
        "sender_full_name": "Luca Barbieri",
        "timestamp": 1585999482
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"279832\">@Luca Barbieri</span>  I see -- I think we shouldn't be entertaining replacing <code>rustc_parse</code> with a new one, as that is a high risk project, and the current parser is already a good one</p>",
        "id": 192909477,
        "sender_full_name": "centril",
        "timestamp": 1586009608
    },
    {
        "content": "<p>For testing, I'd suggest using the UI tests for the parser instead like <code>syn</code> does</p>",
        "id": 192909486,
        "sender_full_name": "centril",
        "timestamp": 1586009629
    },
    {
        "content": "<p>Yeah, I don't think you should perform such a replacement any time soon</p>",
        "id": 192909536,
        "sender_full_name": "Luca Barbieri",
        "timestamp": 1586009666
    },
    {
        "content": "<p>To accommodate RA; I think it would be best to tweak <code>rustc_parse</code> to emit some generically chosen (as in associated types) AST nodes, which for RA would be \"parsing events\" and for rustc would be <code>rustc_ast</code></p>",
        "id": 192909713,
        "sender_full_name": "centril",
        "timestamp": 1586009950
    },
    {
        "content": "<p>Yes, some variation of that seems like it could be a good plan</p>",
        "id": 192910922,
        "sender_full_name": "Luca Barbieri",
        "timestamp": 1586011540
    }
]