[
    {
        "content": "<p>Hello! I'm trying to add a new target to rustc, however it requires a specific linker script to be used with lld. I already have a target JSON working with a local linker script and <code>pre_link_args</code>, however I would like to open a PR to merge it upstream as a built in target, along with this mandatory linker script. Is this possible at the moment?</p>",
        "id": 196952090,
        "sender_full_name": "Marko Mijalkovic",
        "timestamp": 1588972873
    },
    {
        "content": "<p>What does the linker script do?</p>",
        "id": 196952579,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1588973218
    },
    {
        "content": "<p>It has specific sections that look like .rodata.xxx which* can’t be merged into .rodata as the platform needs to read them separately</p>",
        "id": 196952694,
        "sender_full_name": "Marko Mijalkovic",
        "timestamp": 1588973314
    },
    {
        "content": "<p>So the script just ensures they are output correctly</p>",
        "id": 196952742,
        "sender_full_name": "Marko Mijalkovic",
        "timestamp": 1588973362
    },
    {
        "content": "<p>Interesting. Is there a rule for what goes in each <code>.rodata.xxx</code> section?</p>",
        "id": 196953394,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1588973801
    },
    {
        "content": "<p>And does the program's own read-only data go in <code>.rodata</code> or in one of those sections?</p>",
        "id": 196953415,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1588973820
    },
    {
        "content": "<p>The regular read only data goes into .rodata, but there is special meta information about the output ELF that needs to be stored in these .rodata.xxx sections (such as a pointer to the entry function or name of your module)</p>",
        "id": 196953544,
        "sender_full_name": "Marko Mijalkovic",
        "timestamp": 1588973903
    },
    {
        "content": "<p>The platform also uses these sections for linking, so you declare your imports in one of these libraries. Similarly there is a special .text section for stubs though IIRC that gets passed through correctly with the default LLD script</p>",
        "id": 196953602,
        "sender_full_name": "Marko Mijalkovic",
        "timestamp": 1588973955
    },
    {
        "content": "<p>Makes sense.</p>",
        "id": 196953980,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1588974206
    },
    {
        "content": "<p>Is it possible to teach LLVM about this as part of the target's linker defaults? It seems like you'd need this for C and C++, too.</p>",
        "id": 196954041,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1588974243
    },
    {
        "content": "<p>It is probably possible, but I'm not sure there is any demand for that. For context this is a homebrew game system target from 2005 that has a fairly decent unofficial GCC-based toolchain (Sony PSP). There doesn't seem to be any demand for enabling LLVM C/C++ support. If it's the only way, I'll end up giving that a shot, but keeping it only in rust with a single linker script would be much easier</p>",
        "id": 196954553,
        "sender_full_name": "Marko Mijalkovic",
        "timestamp": 1588974627
    },
    {
        "content": "<p>Ah, I see.</p>",
        "id": 196954590,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1588974650
    },
    {
        "content": "<p>It's certainly not the <em>only</em> way; it's more that it's likely the <em>easiest</em> way, from a technical perspective. Of course, policies may vary.</p>",
        "id": 196954628,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1588974682
    },
    {
        "content": "<p>Has someone tried getting the target and linker script into LLVM and gotten rejected?</p>",
        "id": 196954656,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1588974707
    },
    {
        "content": "<p>I do think, in general, Rust has much more inclination to add tier-3 targets if at least some folks care about those targets.</p>",
        "id": 196954711,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1588974729
    },
    {
        "content": "<p>I feel like LLVM ought to have the same kind of \"tiering\" policy, since there is interest in uncommon targets, and developers just don't want to guarantee that they'll remain working.</p>",
        "id": 196954760,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1588974779
    },
    {
        "content": "<p>I am not aware that anybody has attempted to do this with LLVM. There was at one point a CPU target, though it was discovered to be basically identical to MIPS2 later down the line and they removed it (cpu = \"mips2\" works perfectly with rust atm).</p>",
        "id": 196954769,
        "sender_full_name": "Marko Mijalkovic",
        "timestamp": 1588974787
    },
    {
        "content": "<p>For some context I've found the targets here: <a href=\"https://github.com/rust-lang/rust/tree/master/src/librustc_target/spec\" title=\"https://github.com/rust-lang/rust/tree/master/src/librustc_target/spec\">https://github.com/rust-lang/rust/tree/master/src/librustc_target/spec</a><br>\nThough none of them use a custom linker script, so I'm not sure how to go about adding one.</p>",
        "id": 196955284,
        "sender_full_name": "Marko Mijalkovic",
        "timestamp": 1588975134
    },
    {
        "content": "<p>If it's not <em>too</em> much trouble, and the target really just needs a linker script and is otherwise identical to some existing target, you might consider submitting the patch to LLVM. If they decline to support it, then I imagine it could be added as a tier-3 target in Rust anyway.</p>",
        "id": 196955289,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1588975140
    },
    {
        "content": "<p>(As for how to add a target-specific linker script to a Rust target, I don't know, but it absolutely <em>ought</em> to be possible.)</p>",
        "id": 196955348,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1588975179
    },
    {
        "content": "<p>The target is basically identical to a bare metal <code>mipsel</code>target, but I've never submitted a patch to LLVM, so I'm not sure where I would even begin. Do you know anybody who would know how to add such a linker script to a rust built in target? Or perhaps where I could ask for help? If the LLVM patch method is strongly preferred, I'll have to go down that route.</p>\n<p>As it stands, I think it's much more likely I'd succeed in adding it to rustc than LLVM, if that is acceptable. (The homebrew community does not seem to care about LLVM support currently, so it's very low priority)</p>",
        "id": 196955889,
        "sender_full_name": "Marko Mijalkovic",
        "timestamp": 1588975532
    },
    {
        "content": "<p>You're likely in the right place, and you might also try filing an issue and asking for help, with the linker script attached.</p>",
        "id": 196955961,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1588975571
    },
    {
        "content": "<p>To be clear, there's nothing <em>wrong</em> with just having support in Rust; it just means that that target may have issues working with C and C++.</p>",
        "id": 196955982,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1588975596
    },
    {
        "content": "<p>Ok. Thank you for the tips! I'll watch this thread for a bit to see if anybody can help. Otherwise I'll go ahead and file an issue.</p>",
        "id": 196956321,
        "sender_full_name": "Marko Mijalkovic",
        "timestamp": 1588975876
    }
]