[
    {
        "content": "<p>Hi, first time in a long while to try to use zulip, appologies if I'm posting this wrong.</p>\n<p>Something I keep noticing when inspecting assembly is that certain symbols/labels end up with pretty generic or annonymous names. For example in this: <a href=\"https://godbolt.org/z/drYxdG\">https://godbolt.org/z/drYxdG</a> All instances of the generic impl are named <code>&lt;T as ...</code> instead of <code>&lt;u8 as...</code> and <code>&lt;u16 as ...&gt;</code>. Similarily, all the generated vtables get annonymous names like <code>.L__unnamed_2</code> instead of for example <code>&lt;u8 as Trait&gt;::$vtable</code> or so.</p>\n<p>I was wondering if this is something that can be improved on, or wether there are backwards compability or technological reasons why it can't.</p>",
        "id": 224169947,
        "sender_full_name": "Kimundi",
        "timestamp": 1611748181
    },
    {
        "content": "<p>Have you tried -Zsymbol-mangling-version=v0? That intends to preserve generics and such much more precisely.</p>",
        "id": 224173407,
        "sender_full_name": "simulacrum",
        "timestamp": 1611750458
    },
    {
        "content": "<p>For vtables the names are the way names are generated by LLVM for anonymous constants. The <code>.L</code> prefix ensures that the symbols get removed when linking.</p>",
        "id": 224173612,
        "sender_full_name": "bjorn3",
        "timestamp": 1611750595
    },
    {
        "content": "<p><code>-Zsymbol-mangling-version=v0</code> improves the situation for the impls, yeah. I'm not at the top of things development-wise - is that the old legacy naming, or a new unstable one?</p>",
        "id": 224174077,
        "sender_full_name": "Kimundi",
        "timestamp": 1611750881
    },
    {
        "content": "<p>So, for technically reasons the vtables can not be named differently? Or would, hypothetically, something like <code>.L&lt;X as Y&gt;::vtable</code> be doable?</p>",
        "id": 224174214,
        "sender_full_name": "Kimundi",
        "timestamp": 1611750963
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"125789\">Kimundi</span> <a href=\"#narrow/stream/131828-t-compiler/topic/better.20symbol.20names/near/224174077\">said</a>:</p>\n<blockquote>\n<p><code>-Zsymbol-mangling-version=v0</code> improves the situation for the impls, yeah. I'm not at the top of things development-wise - is that the old legacy naming, or a new unstable one?</p>\n</blockquote>\n<p><code>v0</code> is the new unstable scheme</p>",
        "id": 224174394,
        "sender_full_name": "davidtwco",
        "timestamp": 1611751098
    },
    {
        "content": "<p>Alright, was not sure if the v0 implies that its the original one</p>",
        "id": 224174496,
        "sender_full_name": "Kimundi",
        "timestamp": 1611751164
    },
    {
        "content": "<p>Longer symbol names result in longer link times. In addition you have to be very careful to ensure that the vtable name is unique. In cg_clif I accidentally didn't guarantee this. It resulted in a crash for a certain program that took me a long time to debug. As it turns out that program was spawning threads in two locations and the vtable of the two closures just so happened to get the same name, so spawning a thread at one location used the closure of the second spawn location.</p>",
        "id": 224174523,
        "sender_full_name": "bjorn3",
        "timestamp": 1611751196
    },
    {
        "content": "<p>Ah right, symbol names have compilation performance impact like that... (Though to this day I still don't understand how it can be significant, but I'll believe that it is).<br>\nAnd sure, an collision-resistant naming scheme prevents bugs, though if that where the only reasons then a naming scheme that just combines the existing counter scheme with a helpful name would be equally safe.</p>",
        "id": 224174867,
        "sender_full_name": "Kimundi",
        "timestamp": 1611751423
    }
]