[
    {
        "content": "<p>(First time using zulip, I was directed here by <span class=\"user-mention\" data-user-id=\"123586\">@nagisa</span>  from #rustc IRC, so lmk if I've done something wrong. )</p>\n<p>How do I instruct rustc to not emit code that uses GOT-based relocations? </p>\n<p>I have a large OS project that was previously using rustc 1.27.0, and by using the <code>code-model=large</code>, I was able to get it to never emit GOT-based relocations, and there wasn't even a <code>.got</code> or <code>.got.plt</code> section. I don't want the object file to contain any relocation entries like <code>R_X86_64_GOTPC64</code>, <code>R_X86_64_GOT64</code>, <code>R_X86_64_GOTOFF64</code>. <br>\nI just upgraded to rustc 1.32.0 and it now uses the <code>.got</code> no matter what I do.  Disabling pic, pie, or plt don't seem to be doing the trick. Any tips? </p>\n<p>Thanks!</p>",
        "id": 148659364,
        "sender_full_name": "Kevin Boos",
        "timestamp": 1543344838
    },
    {
        "content": "<p>Do you know what symbols <em>do</em> emit these relocations?</p>",
        "id": 148659878,
        "sender_full_name": "nagisa",
        "timestamp": 1543345321
    },
    {
        "content": "<p>Also are you specifying <code>-Crelocation-model=static</code>?</p>",
        "id": 148659949,
        "sender_full_name": "nagisa",
        "timestamp": 1543345352
    },
    {
        "content": "<p>looking at the output of <code>readelf</code>, it appears that <em>every</em> symbol is now using a GOT-based relocation type</p>",
        "id": 148660218,
        "sender_full_name": "Kevin Boos",
        "timestamp": 1543345671
    },
    {
        "content": "<p>i wasn't using a static relocation model, no.</p>",
        "id": 148660271,
        "sender_full_name": "Kevin Boos",
        "timestamp": 1543345700
    },
    {
        "content": "<p>… does it work with static relocation model?</p>",
        "id": 148660794,
        "sender_full_name": "nagisa",
        "timestamp": 1543346251
    },
    {
        "content": "<p>Just tried the static relocation model -- it does indeed remove the .got section, but then it also causes other symbols to be absent from other crates' object files. <br>\nThe issue here is that I'm dynamically loading &amp; linking many object files (one obj file per crate in my project), and the static relocation model seems to cause some symbols to no longer be present in those object files. I'm looking into it now.</p>",
        "id": 148660858,
        "sender_full_name": "Kevin Boos",
        "timestamp": 1543346297
    },
    {
        "content": "<p>is there somewhere i can read more about the static relocation model? I didn't need to specify that before, when using rustc 1.27.0</p>",
        "id": 148660874,
        "sender_full_name": "Kevin Boos",
        "timestamp": 1543346319
    },
    {
        "content": "<p>static relocation model is exactly what it says on the tin: it generates code without any relocations (what GOT is). The default model is not <code>static</code>, so it seems more like an accident/lucky coincidence that it did what you expected before</p>",
        "id": 148660970,
        "sender_full_name": "nagisa",
        "timestamp": 1543346412
    },
    {
        "content": "<p>i see, thanks. Yeah, it may have been a lucky coincidence before.</p>",
        "id": 148661046,
        "sender_full_name": "Kevin Boos",
        "timestamp": 1543346510
    },
    {
        "content": "<p>Does the static relocation model <em>only</em> allow global/absolute address relocation types, or does it still allow PC-relative relocation types to be used? My previous object files on 1.27.0 contained PC-relative relo types, but I don't seen any now.</p>",
        "id": 148661142,
        "sender_full_name": "Kevin Boos",
        "timestamp": 1543346599
    },
    {
        "content": "<p>honestly, not sure <span class=\"emoji emoji-1f642\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 148661281,
        "sender_full_name": "nagisa",
        "timestamp": 1543346715
    },
    {
        "content": "<p>you might want to try other options from <code>-Crelocation-model=help</code> as well to see if the stuff starts working with any of them</p>",
        "id": 148661325,
        "sender_full_name": "nagisa",
        "timestamp": 1543346757
    },
    {
        "content": "<p>ok, np. I did try a variety of relocation models yesterday, but they didn't seem to work. I'll go back and review them further. <br>\nThanks a lot in any case!</p>",
        "id": 148661410,
        "sender_full_name": "Kevin Boos",
        "timestamp": 1543346811
    },
    {
        "content": "<p>I wonder if some LLVM change caused the large code model option to no longer take precedence over the  PIC relocation model option. From the docs, I would expect that if the large code model  option was given, then LLVM would be forced to use absolute relo types because it can't assume that relo sources are nearby the target PC....</p>",
        "id": 148662091,
        "sender_full_name": "Kevin Boos",
        "timestamp": 1543347421
    },
    {
        "content": "<p>code model and relocation model are two independent options</p>",
        "id": 148663006,
        "sender_full_name": "nagisa",
        "timestamp": 1543348274
    },
    {
        "content": "<p>ah, ok, in that case it's probably down to what you suggested before, a lucky coincidence in which specifying only the large code model resulted in no GOT-based relo entries.</p>",
        "id": 148663255,
        "sender_full_name": "Kevin Boos",
        "timestamp": 1543348503
    }
]