[
    {
        "content": "<p>I have been looking into <a href=\"https://github.com/rust-lang/rust/pull/82734#issuecomment-790102203\">https://github.com/rust-lang/rust/pull/82734#issuecomment-790102203</a><br>\nI would like to find symbols which are needed by the LLVM Plugin Enzyme and currently are not available in the default LLVM build, in order to enable them.<br>\nWhile a shared lib llvm build does solve this problem for now it seems undesirable to require a special build process for this plugin.<br>\nSince these symbols are already exposed in some configurations I don't expect real drawbacks from exposing this specific set of needed symbols, but I am also new to this area, so please correct me if I miss something. It might also be easier to argue about it once I have a complete list.</p>",
        "id": 243831777,
        "sender_full_name": "Manuel Drehwald",
        "timestamp": 1624561392
    },
    {
        "content": "<p>With respect to the example given in the thread (_ZN4llvm2cl18GenericOptionValue6anchorEv), I did find  the GenericOptionValue in llvm-project/llvm/include/llvm/Support/CommandLine.h.<br>\nJust looking at this single example, what would be the preferred step to make it available? I've been scrolling through the rustc dev guide, but I'm not sure about the right place for this.</p>",
        "id": 243832454,
        "sender_full_name": "Manuel Drehwald",
        "timestamp": 1624561711
    },
    {
        "content": "<p>Shared lib LLVM is incompatible with LTO of rustc+LLVM (and I think also LLVM alone) afaik, which makes rustc slower.</p>",
        "id": 243834291,
        "sender_full_name": "bjorn3",
        "timestamp": 1624562644
    },
    {
        "content": "<p>Well this sounds like just another reason for the work I intend to do, or did I get you wrong?</p>",
        "id": 243834449,
        "sender_full_name": "Manuel Drehwald",
        "timestamp": 1624562751
    },
    {
        "content": "<p>If LTO is used, as little symbols as possible should be exported to ensure that the compiler has maximal freedom in optimizing.</p>",
        "id": 243835114,
        "sender_full_name": "bjorn3",
        "timestamp": 1624563074
    },
    {
        "content": "<p>Where would I export the named symbol?</p>",
        "id": 243835693,
        "sender_full_name": "Manuel Drehwald",
        "timestamp": 1624563344
    },
    {
        "content": "<p>A check (either at compiler or application build time) might make sense later before creating a PR, <br>\nbut first I would like to find out how many symbols are affected and what needs to be changed for that in the first place.</p>",
        "id": 243837531,
        "sender_full_name": "Manuel Drehwald",
        "timestamp": 1624564267
    },
    {
        "content": "<p>I have no idea how to export it.</p>",
        "id": 243837964,
        "sender_full_name": "bjorn3",
        "timestamp": 1624564474
    },
    {
        "content": "<p>Ok, then I will keep searching. But thanks for the heads-up regarding the performance.</p>",
        "id": 243838085,
        "sender_full_name": "Manuel Drehwald",
        "timestamp": 1624564548
    },
    {
        "content": "<p>Would it be valid to add dummy function calls from rustc, to indicate that this symbols might be needed and aren't automatically dropped?<br>\nI got a hint from an llvm dev who mentioned that this is occasionally used as a simple solution for such issues.</p>",
        "id": 244024919,
        "sender_full_name": "Manuel Drehwald",
        "timestamp": 1624727905
    },
    {
        "content": "<p>You will want shared system llvm build version to use plugins no matter what so I don't see much of a point.</p>",
        "id": 244028519,
        "sender_full_name": "nagisa",
        "timestamp": 1624732856
    },
    {
        "content": "<p>Why would it still require the shared system llvm, once the symbols issue is fixed?<br>\nI think that clang is able to expose llvm's plugin interface without this requirement.<br>\nIs there a technical reason on the rust side?</p>",
        "id": 244038458,
        "sender_full_name": "Manuel Drehwald",
        "timestamp": 1624748293
    },
    {
        "content": "<p>We don't really want to allow LLVM we ship to be used or interacted with by the end users directly. For multiple reasons, but it gives us freedom to optimize our distribution as we wish, primarily.</p>",
        "id": 244040407,
        "sender_full_name": "nagisa",
        "timestamp": 1624751161
    },
    {
        "content": "<p>we don't ship the llvm-config binary for a similar reason.</p>",
        "id": 244040582,
        "sender_full_name": "nagisa",
        "timestamp": 1624751420
    },
    {
        "content": "<p>now if you build rustc with an external LLVM, the story is a little different – we do actively support this use-case; and since LLVM is coming from an external source, its up to external source to ensure compatibility and what other things.</p>",
        "id": 244040600,
        "sender_full_name": "nagisa",
        "timestamp": 1624751478
    },
    {
        "content": "<p>Regarding your last message: This is indeed helpful for me to debug, but I guess it's hard to tell all Rust-AD folks to just build their own rustc version.</p>",
        "id": 244041384,
        "sender_full_name": "Manuel Drehwald",
        "timestamp": 1624752673
    },
    {
        "content": "<p>One solution I could imagine is having something like cargo-enzyme, which builds an Enzyme compatible rustc version (+Enzyme) to create the gradient functions. This way I could hide all this from end-users. <br>\nWe could then bundle all generated gradients into a lib which can even be linked in again from a normal cargo/rustc usage.<br>\nHowever I'm not really convinced due to people updating their primary function without calling cargo-enzyme might link in a gradient function based on an older primary function, leading to hard to find bugs. Also, the compile times would become quite nasty.</p>",
        "id": 244041397,
        "sender_full_name": "Manuel Drehwald",
        "timestamp": 1624752713
    },
    {
        "content": "<p>We don't have rerun-if-changed on a function level (is there another feature available to track such changes?), so I don't really now how to avoid such issues. Using data stored for incremental builds from extern sounds like having multiple pitfalls. Do you have some simpler solution in mind which might help here?</p>",
        "id": 244041457,
        "sender_full_name": "Manuel Drehwald",
        "timestamp": 1624752810
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"123586\">@nagisa</span> I can understand not wanting to support the plugin interface or similar things that change with LLVM version. But I would love to ship our built LLVM, as well as its copy of clang, so that people can do cross-language LTO and similar with it.</p>",
        "id": 244070893,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1624806570
    },
    {
        "content": "<p>I feel like that's way more likely to happen by the way of our not needing to ship LLVM at all, rather than us shipping more stuff.</p>",
        "id": 244071816,
        "sender_full_name": "nagisa",
        "timestamp": 1624807908
    },
    {
        "content": "<p>Not needing to ship LLVM at all, as in exclusively targeting stable LLVM releases? That sounds great, but I don't think there's ever been a point in Rust's history where it hasn't had either some custom LLVM patch or hasn't been pinned to some arbitrary LLVM trunk commit. Shipping clang via rustup at least seems within the realm of Rust's control</p>",
        "id": 244072536,
        "sender_full_name": "bstrie",
        "timestamp": 1624809100
    },
    {
        "content": "<p>LLVM 11 release was pretty good in terms of patches; the only long-standing patch we have that never makes it upstream is the one that teaches LLVM about Rust's allocation symbols.</p>",
        "id": 244072917,
        "sender_full_name": "nagisa",
        "timestamp": 1624809654
    },
    {
        "content": "<p>Which I think we would like to resolve regardless.</p>",
        "id": 244072930,
        "sender_full_name": "nagisa",
        "timestamp": 1624809678
    },
    {
        "content": "<p>There's also ongoing work to CI LLVM+Rust on the LLVM side, which should make the regressions (and therefore backports for them) significantly less common too.</p>",
        "id": 244072983,
        "sender_full_name": "nagisa",
        "timestamp": 1624809734
    },
    {
        "content": "<p>To be clear, I didn't mean this would be a very short term approach ^^</p>",
        "id": 244072987,
        "sender_full_name": "nagisa",
        "timestamp": 1624809753
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"348574\">Manuel Drehwald</span> <a href=\"#narrow/stream/131828-t-compiler/topic/Expose.20LLVM.20Symbols/near/244041384\">said</a>:</p>\n<blockquote>\n<p>Regarding your last message: This is indeed helpful for me to debug, but I guess it's hard to tell all Rust-AD folks to just build their own rustc version.</p>\n</blockquote>\n<p>Note that this is not necessarily a question of building their own rustc – it may be a one of using a different source to obtain rustc (e.g. distribution packages) than rustup.</p>",
        "id": 244073267,
        "sender_full_name": "nagisa",
        "timestamp": 1624810105
    },
    {
        "content": "<p>So, even if we don't in practice need to build our own LLVM, I still think there'd be value in the official distributions shipping the LLVM they use.</p>",
        "id": 244073883,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1624811047
    },
    {
        "content": "<p>And the clang built from that LLVM.</p>",
        "id": 244073886,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1624811061
    },
    {
        "content": "<p>Well, we already ship a bunch of llvm tools in the llvm-tools-preview component...</p>",
        "id": 244074793,
        "sender_full_name": "nagisa",
        "timestamp": 1624812480
    },
    {
        "content": "<p>But I do really think we should stay away from becoming a generic package manager and maintainers of all the packages therein. And perhaps figure out the line which we shouldn't cross (as we don't have one currently)</p>",
        "id": 244074846,
        "sender_full_name": "nagisa",
        "timestamp": 1624812533
    },
    {
        "content": "<p>And/or give people the ability to provide custom rustup components and whatnot.</p>",
        "id": 244074858,
        "sender_full_name": "nagisa",
        "timestamp": 1624812565
    },
    {
        "content": "<p>I'm definitely not looking for rustup to distribute arbitrary tools. There's a specific benefit to us distributing LLVM-based tools, so that people can use a unified Rust/C toolchain for LTO; otherwise, they won't have any means of doing so via the official rustup-distributed tools, and will <em>have</em> to rebuild Rust or use someone else's build of Rust.</p>",
        "id": 244080781,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1624821561
    },
    {
        "content": "<p>Popping up a level, <span class=\"user-mention\" data-user-id=\"123586\">@nagisa</span> / others, what do you think the best mechanism for having Enzyme analyze rust code would be? Having people build rust from source, or download a custom rustc is a user experience issue that means setup may be too annoying for folks to use</p>",
        "id": 244081127,
        "sender_full_name": "William Moses",
        "timestamp": 1624822111
    },
    {
        "content": "<p>Practically speaking, its able to build against LLVM 7-main, so most commits/custom forks should be fine?</p>",
        "id": 244081310,
        "sender_full_name": "William Moses",
        "timestamp": 1624822426
    },
    {
        "content": "<p>Yeah, probably. I don't know what the best way forward is wrt missing symbols.</p>",
        "id": 244083043,
        "sender_full_name": "nagisa",
        "timestamp": 1624825284
    },
    {
        "content": "<p>The enzyme shared library could provide those, perhaps <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span></p>",
        "id": 244083053,
        "sender_full_name": "nagisa",
        "timestamp": 1624825299
    },
    {
        "content": "<p>So my concern there with having a plugin provide them is that if some symbols involve the use of a shared datastructure (e.g. in llvm), then there might be a copy of said datastructure which could be bad.</p>\n<p>When you say you already ship some llvm tools (say opt?), how does that work and could Enzyme extend the use of that for example?</p>\n<p>Also does killing off those symbols really make such a big difference, even in the case of LTO? You could still enable LTO and get all the cross operator optimizations and keep the symbols. The only issue with keeping them around is potentially a larger binary?</p>",
        "id": 244097944,
        "sender_full_name": "William Moses",
        "timestamp": 1624849453
    },
    {
        "content": "<p>It also prevents removing or changing function arguments when an argument is known to be unused or constant.</p>",
        "id": 244106770,
        "sender_full_name": "bjorn3",
        "timestamp": 1624862567
    }
]