[
    {
        "content": "<p>When forcing queries, how do we ensure that the query would run at the same time for a clean build? Or if we manage to make queries order independent, how do we ensure that the query would run at all?</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"124287\">@mw</span></p>",
        "id": 158727752,
        "sender_full_name": "Zoxc",
        "timestamp": 1550379801
    },
    {
        "content": "<p>I'm not sure I follow</p>",
        "id": 158871238,
        "sender_full_name": "mw",
        "timestamp": 1550572797
    },
    {
        "content": "<p>try-mark-green will mark and re-execute things in the order they were recorded during the previous session</p>",
        "id": 158871292,
        "sender_full_name": "mw",
        "timestamp": 1550572848
    },
    {
        "content": "<p>is that what you mean?</p>",
        "id": 158871299,
        "sender_full_name": "mw",
        "timestamp": 1550572862
    },
    {
        "content": "<p>Dependencies of the current session may be different from the dependencies from the previous one. We may execute queries we wouldn't otherwise do</p>",
        "id": 158871564,
        "sender_full_name": "Zoxc",
        "timestamp": 1550573212
    },
    {
        "content": "<p>Maybe executing queries in order and stopping at the first red one takes care of this? Because we'd need to execute a query in order to gain information we can branch on.</p>",
        "id": 158872374,
        "sender_full_name": "Zoxc",
        "timestamp": 1550574088
    },
    {
        "content": "<p>So we can't execute queries after the first red one. The information from the red query could be used to change which later queries we would execute.</p>",
        "id": 158873489,
        "sender_full_name": "Zoxc",
        "timestamp": 1550575290
    },
    {
        "content": "<p>Yes, we <em>have</em> to stop a the first red dependency - otherwise we'd run into trouble</p>",
        "id": 158877274,
        "sender_full_name": "mw",
        "timestamp": 1550579282
    },
    {
        "content": "<p>an early implementation of incr. comp. didn't observe this kind of order (we had hash sets of dependencies) but it ran into problems immediately</p>",
        "id": 158877307,
        "sender_full_name": "mw",
        "timestamp": 1550579330
    },
    {
        "content": "<p>I though we did that only because our queries can't currently run in an arbitrary order</p>",
        "id": 158877347,
        "sender_full_name": "Zoxc",
        "timestamp": 1550579397
    },
    {
        "content": "<p>I think they can pretty much run in any order, only red-green marking has to take care not to invoke queries that don't make any sense anymore in the new session</p>",
        "id": 158877542,
        "sender_full_name": "mw",
        "timestamp": 1550579559
    },
    {
        "content": "<p>well, at least in theory they should be able to run in any order <code>:)</code></p>",
        "id": 158877592,
        "sender_full_name": "mw",
        "timestamp": 1550579612
    }
]