[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"123856\">@Vadim Petrochenkov</span> I saw you threatening to use inference variables and unification for name resolution in Rust, so I thought I'd mention that, in rust-analyzer, we are organizationally at the point where we could put some work into experimenting with name resolution :-)</p>\n<p>As in, we've mostly completed work for eval period of  \"transition from rls to rust-analyzer as the offical IDE\" RFC, and we haven't yet started library-ifing the parser. The parser is the next planned big thing, but we also could tackle \"experimentation\" phase of name resolution instead. That is, extracting the shared library is out of the question for now, but we have some manpower to implement proper \"resolve imports in parallel\" approach and whatever other crazy ideas in rust-analyzer, just to check if they fly at all.</p>\n<p>Do you think it would be especially useful to do such experimentation now?</p>\n<p>Also, a general periodic reminder for anyone in T-compiler that \"extracting name resolution\" is an open and mostly independent task, so, if anyone wants to tackle a huge researchy problem, you are welcome :D</p>",
        "id": 204653890,
        "sender_full_name": "matklad",
        "timestamp": 1595417239
    },
    {
        "content": "<p>To clarify, I'll probably never get to this myself, unless I get fired from my job, because it's not a regression or any other kind of high-priority issue.</p>",
        "id": 204655144,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1595418372
    },
    {
        "content": "<p>The \"unification\" idea applies to import resolution specifically, i.e. to \"symlink\" items that create names referring to other names.</p>",
        "id": 204655202,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1595418478
    },
    {
        "content": "<p>Right now to resolve an import <code>use foo;</code> we resolve it in environment including anything else, but excluding this import itself.<br>\nSo that imports cannot refer to names introduced by themselves breaking causality.</p>",
        "id": 204655310,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1595418588
    },
    {
        "content": "<p>The \"unification\" idea is to set the resolution of <code>use foo;</code> to a fresh \"inference variable\" <code>$1</code>.<br>\nThe obligations on this variable will be <code>$1 == $1</code> (the trivial one, because <code>use foo;</code> is the first <code>foo</code> in scope when resolving <code>use foo;</code>) and <code>$1 == foo from extern prelude</code> because that's the first <code>foo</code> in scope with resolution not containing inference variables.</p>",
        "id": 204656266,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1595419266
    },
    {
        "content": "<p>As a result we won't resolve different imports in different environment causing potentially confusing cases like <a href=\"https://github.com/rust-lang/rust/issues/74556\">https://github.com/rust-lang/rust/issues/74556</a>, and avoid the name exclusion which always felt a bit like a hack to me.</p>",
        "id": 204656787,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1595419646
    },
    {
        "content": "<p>I didn't think through this idea in detail or try implementing it, because that would probably mean a ~week of full time == months of sparsely allocated time, but I work slower than other people in general, so someone else could try it faster.</p>",
        "id": 204657136,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1595419886
    }
]