[
    {
        "content": "<p>I am trying to make progress on Span handling for incremental compilation.<br>\nThe point of this thread is to gauge interest, and to find the least painful way.</p>\n<p>In the current state, spans are copied and replicated in AST, HIR and MIR. This leads to invalidation when the spans change.<br>\n<span class=\"user-mention\" data-user-id=\"124287\">@mw</span> outlined two paths forward:</p>\n<blockquote>\n<p>These goals can be achieved by:</p>\n<ul>\n<li>Splitting out span information during HIR lowering and storing it separately. I imagine having one table per HirId::owner that then corresponds to one DepNode, making spans be tracked at the same granularity as HIR items.</li>\n<li>Replacing Span fields with abstract spans in HIR, MIR, etc. This will mean quite a bit of refactoring everywhere these spans are used (as opposed to just being copied around)</li>\n</ul>\n<p>Alternatively, this could also be achieved by:</p>\n<ul>\n<li>Making the CodeMap inaccessible from queries and generating a map from Span value to DepNode during HIR lowering, thus effectively making the existing Span type abstract.</li>\n<li>Providing a query that allows to decode a Span to its contents.</li>\n<li>Making sure that none of the error reporting APIs take Spans directly.</li>\n</ul>\n</blockquote>\n<p>Is there still interest for this?<br>\nWhat would be the preferred solution?</p>",
        "id": 196115074,
        "sender_full_name": "cjgillot",
        "timestamp": 1588529052
    },
    {
        "content": "<p>I think this is probably an important thing to work on -- I'm not sure the best design though</p>",
        "id": 196296772,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1588679296
    },
    {
        "content": "<p>it'd be good to bring <span class=\"user-mention\" data-user-id=\"133169\">@matklad</span> into the conversation a bit, I think</p>",
        "id": 196296781,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1588679304
    },
    {
        "content": "<p>Yup, we are solving the same problem in rust-analyzer. I belive <span class=\"user-mention silent\" data-user-id=\"282393\">Coenen Benjamin</span> is familiar with our general infra. </p>\n<p>I wonder if I should spend some time writing up a markdown document documenting our various solutions to the problem of bidirectional mapping between source code and various lowered representations</p>",
        "id": 196297484,
        "sender_full_name": "matklad",
        "timestamp": 1588679765
    },
    {
        "content": "<p>This seems like a case where it'd be nice to be trying to migrate the two codebases closer</p>",
        "id": 196299455,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1588681086
    },
    {
        "content": "<p>And also the case where even the basic vocabulary is different. Like, we don't have anything resembling span in rust-analyzer :)</p>",
        "id": 196304762,
        "sender_full_name": "matklad",
        "timestamp": 1588684107
    },
    {
        "content": "<p>I have two exploratory branches. </p>\n<p>The first one makes the error handling system take an abstract span <code>SpanId</code>. There are some diagnostics that just pass around a span without manipulating it. The idea is to make an <code>enum SpanId { Span(Span), DefSpan(DefId) };</code>. The calls to <code>tcx.def_span(did)</code> would just return <code>SpanId::DefSpan(did)</code>. Diagnostic tracking would register emitted diagnostics using this abstract representation, and translate it to concrete spans. </p>\n<p>The second one attempts at removing the Spans from the HIR. The spans are collected during lowering into a <code>HirId -&gt; Span</code> mapping. HIR consumers would need to query this map in order to formulate diagnostics.</p>\n<p>Both approaches are invasive, and touch a <em>lot</em> of code. All I have is very WIP. This maybe requires a review of uses of Spans in the compiler. Especially, when those spans end up not being used for diagnostic emission.</p>",
        "id": 196339072,
        "sender_full_name": "cjgillot",
        "timestamp": 1588699470
    },
    {
        "content": "<p>I posted <a href=\"https://github.com/rust-lang/rust/issues/72015\" title=\"https://github.com/rust-lang/rust/issues/72015\">#72015</a> which aims at removing the Spans from the HIR. The point is to reduce HIR invalidation by span modification as much as possible. For now, only nodes that have <code>HirId</code>s have been migrated, and its already a mess.</p>",
        "id": 196988946,
        "sender_full_name": "cjgillot",
        "timestamp": 1589026462
    },
    {
        "content": "<p>I'm going through the commits now, what do you mean by \"it's already a mess\"?</p>",
        "id": 196989712,
        "sender_full_name": "oli",
        "timestamp": 1589027702
    },
    {
        "content": "<p>Well, the diff is horribly large (+3000/-2700), and touches pretty much all HIR consumers. At some point, I did it mechanically, and stopped caring for redundant accesses to the <code>HirId -&gt; Span</code> map.</p>",
        "id": 196992352,
        "sender_full_name": "cjgillot",
        "timestamp": 1589031939
    },
    {
        "content": "<p>so you're worried about perf losses due to the redundant accesses?</p>",
        "id": 197123496,
        "sender_full_name": "oli",
        "timestamp": 1589191466
    },
    {
        "content": "<p>I'd expect the diff for the full McCoy to be large, but as you've shown, this can be done incrementally, so maybe we should run perf on your change and see if it's ok, and if so, merge a small version and then the rest of the changes can be merged step by step. I think we'll also need to figure out how to handle spans in MIR at some point.</p>",
        "id": 197123640,
        "sender_full_name": "oli",
        "timestamp": 1589191581
    },
    {
        "content": "<p>The point is to get better perf in incremental, so we shouldn't be careless in the accesses. Also, there are still a lot of spans in HIR, for nodes without <code>HirId</code>s. As I am not fully aware of the semantics of HirIds, I did not try to introduce more. Is there a blocker to adding HirIds everywhere?</p>",
        "id": 197156566,
        "sender_full_name": "cjgillot",
        "timestamp": 1589208780
    },
    {
        "content": "<p>I think not, there was the \"great hirification\": <a href=\"https://github.com/rust-lang/rust/issues?q=hiridification+is%3Aclosed+\">https://github.com/rust-lang/rust/issues?q=hiridification+is%3Aclosed+</a> so... Let's ask the @ljedrz (they aren't on zulip it seems <span aria-label=\"confused\" class=\"emoji emoji-1f615\" role=\"img\" title=\"confused\">:confused:</span>)</p>",
        "id": 197175904,
        "sender_full_name": "oli",
        "timestamp": 1589216914
    },
    {
        "content": "<p>maybe open an issue about it and/or ping them on the PR?</p>",
        "id": 197175977,
        "sender_full_name": "oli",
        "timestamp": 1589216954
    },
    {
        "content": "<p>I think one blocker was <a href=\"https://github.com/rust-lang/rust/issues/71104\">#71104</a>, but it's actively being worked on. Thanks <span class=\"user-mention\" data-user-id=\"281572\">@marmeladema</span>!!!</p>",
        "id": 197178911,
        "sender_full_name": "Dylan MacKenzie (ecstatic-morse)",
        "timestamp": 1589218382
    },
    {
        "content": "<p>Yes i am trying to make progress! But as I am a new contributor, i takes me a bit of time to understand this complex machinery :)</p>",
        "id": 197179503,
        "sender_full_name": "marmeladema",
        "timestamp": 1589218658
    },
    {
        "content": "<p>You're doing a great job so far IMO. I really appreciate your work on <a href=\"https://github.com/rust-lang/rust/issues/70853\">#70853</a></p>",
        "id": 197180137,
        "sender_full_name": "Dylan MacKenzie (ecstatic-morse)",
        "timestamp": 1589218927
    }
]