[
    {
        "content": "<p>I just got a following ICE when building rustc: <a href=\"https://paste.rs/90o\">https://paste.rs/90o</a></p>\n<p>I had just successfully managed to run the <code>ui</code> test suite and later changed capitalization of some strings before rebuilding. No changes to metadata reading code or anything, but I am working with target code.</p>\n<p>Not running incremental AFAICT. Is there anything I could preserve or look into? This is yesterday's master (4e20754629c)</p>",
        "id": 241691559,
        "sender_full_name": "nagisa",
        "timestamp": 1622985553
    },
    {
        "content": "<p>That seems to be corrupted metadata.</p>",
        "id": 241691692,
        "sender_full_name": "bjorn3",
        "timestamp": 1622985748
    },
    {
        "content": "<p>Yeah, but is there anything useful I can investigate to figure out why the corruption occurred? My filesystem is checksummed, and I believe my memory is stable(-ish) too, and I haven't been making any changes to the code that could cause invalid metadata to be written out either...</p>",
        "id": 241693111,
        "sender_full_name": "nagisa",
        "timestamp": 1622987800
    },
    {
        "content": "<p>/me does <code>mv build build_ice</code> and resigns to a LLVM rebuild.</p>",
        "id": 241693156,
        "sender_full_name": "nagisa",
        "timestamp": 1622987881
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"123586\">@nagisa</span> are you changing llvm? If not you can set download-ci-llvm</p>",
        "id": 241694664,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1622989989
    },
    {
        "content": "<p>Not this time around, but I tend to get very little use from that option as I do tend to fiddle in LLVM often ^^</p>",
        "id": 241695487,
        "sender_full_name": "nagisa",
        "timestamp": 1622991343
    },
    {
        "content": "<p>and I don't particularly love changing config.toml</p>",
        "id": 241695535,
        "sender_full_name": "nagisa",
        "timestamp": 1622991372
    },
    {
        "content": "<p>Hmm, I wonder if it would be helpful to add an if-unchanged option like there is for download-rustc, then you wouldn't have to change it even if you starting modifying llvm</p>",
        "id": 241697112,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1622993843
    }
]