[
    {
        "content": "<p>It's looks useful to track different branch in MIR. But it's not public to other crates. Also, if switch_int_edge is more effective to track edge, should we add similar things to apply_call_return_effect or apply_call_unwind_effect to track different edge from call?</p>",
        "id": 221264673,
        "sender_full_name": "Youren Shen",
        "timestamp": 1609382636
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"309012\">@Youren Shen</span> I designed that interface but I don't understand what you're asking. <code>SwitchInt</code> edge effects are currently used in the compiler to propagate the initialized-ness of enum variants, so they're \"ready\" in that sense.</p>",
        "id": 221313331,
        "sender_full_name": "Dylan MacKenzie (ecstatic-morse)",
        "timestamp": 1609445375
    },
    {
        "content": "<p>The reason to have a separate interface for \"call return\" effects is because we can be more efficient when running dataflow if we know that only one outgoing edge has an effect. That's why there's no <code>apply_call_unwind_effect</code>.</p>",
        "id": 221313500,
        "sender_full_name": "Dylan MacKenzie (ecstatic-morse)",
        "timestamp": 1609445541
    },
    {
        "content": "<p>Sorry for the unclear about my question. <br>\nI was trying to use  apply_switch_int_edge_effects in my analysis crate. But the trait SwitchIntEdgeEffects and the struct SwitchIntTarget is private.  It seems I can't define my own apply_switch_int_edge_effects in my crate without import them.</p>\n<p>Perhaps I'm wrong about how to use it. :D There is no example about how to use this function in the compiler.</p>",
        "id": 221332458,
        "sender_full_name": "Youren Shen",
        "timestamp": 1609470723
    },
    {
        "content": "<p>In my case, I want to track every branch, take the effect whether they goto yes or no. SwithInt is a great function to track different edge from the SwithInt terminator. I also want to apply the similar analysis to call/unwind or any other BasicBlock that have different out edges.</p>",
        "id": 221332588,
        "sender_full_name": "Youren Shen",
        "timestamp": 1609471021
    },
    {
        "content": "<p>Ah, yes it's fine to use it outside <code>rustc_mir</code>. I'm surprised if it's not crate-public, but IIRC there's some re-exports that I forgot to remove that might be accidentally subverting the \"private type in public interface\" warning.</p>",
        "id": 221334218,
        "sender_full_name": "Dylan MacKenzie (ecstatic-morse)",
        "timestamp": 1609474428
    }
]