[
    {
        "content": "<p>I read the <a href=\"https://rustc-dev-guide.rust-lang.org/backend/updating-llvm.html\">\"Upgrading LLVM\"</a> page on the rustc dev guide but it wasn't clear to me how well supported older versions (like currently LLVM 9 and LLVM 10) are? For example, do all features need to be supported on all versions or just stable features? </p>\n<p>This is related to <a href=\"https://github.com/rust-lang/rust/issues/79365\">#79365</a> by <span class=\"user-mention\" data-user-id=\"296355\">@Rich Kadel</span>  which upgrades our LLVM code coverage feature to use V4 map files. V4 map files are not supported in LLVM 9 or LLVM 10 only LLVM 11. Currently we're using V3 which is supported by all those LLVM versions. </p>\n<p>Is it acceptable to land that PR essentially restricting the feature to LLVM11+ or do we need to implement some sort of fallback logic to V3 for LLVM 9 and 10? </p>\n<p>In my opinion, since this feature is backend specific anyway, it's fine for this to require a certain level of support from the linked backend especially since this is currently an unstable flag. I'm very curious to hear from others though!</p>",
        "id": 217754974,
        "sender_full_name": "Wesley Wiser",
        "timestamp": 1606225497
    },
    {
        "content": "<p>I believe the primary expectation is that generally things work -- the PR runner is using llvm 9 right now, so the test suite should pass (though min-llvm-version may exist in some cases).</p>\n<p>I don't think it is absolutely necessary to support older LLVMs for coverage, but it would be good to detect them and either issue an error on use or otherwise signal that it's not supported rather than silently not working, I think.</p>",
        "id": 217755744,
        "sender_full_name": "simulacrum",
        "timestamp": 1606225859
    },
    {
        "content": "<blockquote>\n<p>I don't think it is absolutely necessary to support older LLVMs for coverage, but it would be good to detect them and either issue an error on use or otherwise signal that it's not supported rather than silently not working, I think.</p>\n</blockquote>\n<p>Yes, I strongly agree with this!</p>",
        "id": 217755902,
        "sender_full_name": "Wesley Wiser",
        "timestamp": 1606225938
    },
    {
        "content": "<p>Perfect. I agree with that expectation too. Thanks!</p>",
        "id": 217778907,
        "sender_full_name": "Rich Kadel",
        "timestamp": 1606235721
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"125250\">@Wesley Wiser</span> The modified PR now passes the initial CI. PTAL!</p>",
        "id": 217812818,
        "sender_full_name": "Rich Kadel",
        "timestamp": 1606251673
    },
    {
        "content": "<p>As for as code coverage format is concerned, I suggest that at least until the feature is stabilized, it should only be required to work with the newest stable version of clang and the newest format that that version of clang supports. This way, we avoid accumulating technical debt when the feature isn't even stable, and we minimize future maintenance on the stable channel by using the newest format at the time the feature becomes stable.</p>",
        "id": 217819028,
        "sender_full_name": "briansmith",
        "timestamp": 1606254968
    },
    {
        "content": "<p>More investigation into this: <a href=\"https://reviews.llvm.org/D84467\">https://reviews.llvm.org/D84467</a> will add support for branch coverage measurement. It requires bumping the file format version. Branch coverage measurement is really valuable. So, at least as far as code coverage is concerned, it looks like more evidence for optimizing for newer (future, even) versions of LLVM. Also, it would be very nice if there were a way to get a clang that is the same LLVM version (same code coverage file format version, in particular) as whatever LLVM that rustc is using. That way, a mixed Rust/C project could do code coverage measurement in a way that would be ~guaranteed to work.</p>",
        "id": 217957929,
        "sender_full_name": "briansmith",
        "timestamp": 1606354587
    },
    {
        "content": "<p>That's something I've been interested in as well, for different reasons.</p>",
        "id": 218042327,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1606429441
    },
    {
        "content": "<p>Wouldn't be particularly hard to compile clang along with llvm, and provide that as an additional rustup component.</p>",
        "id": 218042378,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1606429473
    },
    {
        "content": "<p>Also useful for cross language LTO.</p>",
        "id": 218042385,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1606429481
    },
    {
        "content": "<p>Another issue I ran across: Currently in GitHub Actions and Ubuntu in general, it is much easier to get, say, Clang/LLVM 10 than Clang/LLVM 11 or 12. The newer versions aren't in the default repositories so you have to add a new one or install using a mechanism other than apt-get.</p>",
        "id": 218253206,
        "sender_full_name": "briansmith",
        "timestamp": 1606718641
    },
    {
        "content": "<p>FWIW, as of today I am already running into \"Failed to load coverage: Unsupported coverage format version\" from llvm-cov-10.</p>",
        "id": 218253253,
        "sender_full_name": "briansmith",
        "timestamp": 1606718675
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"133214\">@briansmith</span> the llvm-tools-preview component should have a llvm-cov binary in it which you can use</p>",
        "id": 218290244,
        "sender_full_name": "simulacrum",
        "timestamp": 1606745296
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> Thanks. I collect code coverage for C code as well so I need to have a compatible clang anyway.</p>",
        "id": 218324429,
        "sender_full_name": "briansmith",
        "timestamp": 1606760348
    },
    {
        "content": "<p>Yeah, we don't yet ship a clang binary though it's definitely been something we've considered. Useful data point! :)</p>",
        "id": 218324484,
        "sender_full_name": "simulacrum",
        "timestamp": 1606760375
    },
    {
        "content": "<p>I do wonder how diligent we'd be in maintaining the clang we distribute. Would we release out-of-band updates to Rust to address Clang-only issues, for example? Would the shipped clang use Rust's patched LLVM, and would we then maintain Clang patches to use it?</p>",
        "id": 218364640,
        "sender_full_name": "briansmith",
        "timestamp": 1606781377
    },
    {
        "content": "<p>Maybe it would be easier to just have a mechanism to query the Rust toolchain to ask what major version of LLVM Rust is using, if it is using LLVM at all, so a build system can either keep the clang version in sync itself or break the build if it detects they get out of sync.</p>",
        "id": 218364793,
        "sender_full_name": "briansmith",
        "timestamp": 1606781450
    },
    {
        "content": "<p>if we ship clang at all, it should certainly come from the monorepo in <code>src/llvm-project</code></p>",
        "id": 218368321,
        "sender_full_name": "cuviper",
        "timestamp": 1606784138
    },
    {
        "content": "<p>The LLVM version is reported, but I wouldn't necessarily rely on it.</p>\n<div class=\"codehilite\"><pre><span></span><code>$ rustc +stable -vV\nrustc 1.48.0 (7eac88abb 2020-11-16)\nbinary: rustc\ncommit-hash: 7eac88abb2e57e752f3302f02be5f3ce3d7adfb4\ncommit-date: 2020-11-16\nhost: x86_64-unknown-linux-gnu\nrelease: 1.48.0\nLLVM version: 11.0\n</code></pre></div>",
        "id": 218374850,
        "sender_full_name": "simulacrum",
        "timestamp": 1606790827
    },
    {
        "content": "<p>Thanks. That's helpful. I wonder if it is ever a pre-release version, i.e. one where I wouldn't find an official release from <a href=\"http://apt.llvm.org\">apt.llvm.org</a> or a release tarball from them.</p>",
        "id": 218376718,
        "sender_full_name": "briansmith",
        "timestamp": 1606793090
    },
    {
        "content": "<p>Yes, sometimes, though we sort of try to limit that on stable it's not currently a strong commitment - I think 1.47 shipped LLVM 11 while it was in prerelease.</p>",
        "id": 218378742,
        "sender_full_name": "simulacrum",
        "timestamp": 1606795503
    },
    {
        "content": "<p>long ago, we sometimes even had arbitrary snapshots of LLVM trunk, but more recently we've at least waited until there's a release candidate</p>",
        "id": 218460673,
        "sender_full_name": "cuviper",
        "timestamp": 1606846566
    },
    {
        "content": "<p>that's _probably_ good enough for matching data formats, but it's still possible for things to change from rc to release</p>",
        "id": 218460728,
        "sender_full_name": "cuviper",
        "timestamp": 1606846593
    },
    {
        "content": "<p>I think users will want to use a final release of clang + a final release of Rust and get the code coverage to work.</p>",
        "id": 218474495,
        "sender_full_name": "briansmith",
        "timestamp": 1606853420
    },
    {
        "content": "<p>Especially, in a mixed-language project, very unlikely C and C++ programmers will trust a Rust-provided version of Clang. I hope we can find a way to get Rust's changes to LLVM upstreamed quickly on a regular basis so that production releases of both Clang and Rust can interoperate, not just for code coverage, but for profiling and LTO.</p>",
        "id": 218475921,
        "sender_full_name": "briansmith",
        "timestamp": 1606854063
    }
]