[
    {
        "content": "<p>So the author of the llvm-dwp tool had <a href=\"https://reviews.llvm.org/D96678#2566422\">this</a> to say about llvm-dwp. We currently ship rust-llvm-dwp as a tool that we use when <code>-Csplit-debuginfo=packed</code> is supplied by the user. I think given this we should switch away? cc <span class=\"user-mention\" data-user-id=\"116015\">@Alex Crichton</span> <span class=\"user-mention\" data-user-id=\"116107\">@davidtwco</span> thoughts?</p>",
        "id": 226567575,
        "sender_full_name": "nagisa",
        "timestamp": 1613505506
    },
    {
        "content": "<p>I don't know much about dwp (I did the macos stuff mostly, not the split-dwarf stuff), but I would agree that if the author of dwp says we shouldn't use it then we shouldn't use it</p>",
        "id": 226567925,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1613505652
    },
    {
        "content": "<p>I used it because binutils dwp didn’t support DWARF 5. As I understand it, LLVM might output DWARF 5 for some targets so that seemed like something we needed. I’m certainly open to alternatives but I don’t know what else would be suitable at the moment.</p>",
        "id": 226568417,
        "sender_full_name": "davidtwco",
        "timestamp": 1613505822
    },
    {
        "content": "<p>The author of that comment mentions that they have patches for DWARF 5 and other dwp implementations so that might be an option in future.</p>",
        "id": 226568584,
        "sender_full_name": "davidtwco",
        "timestamp": 1613505886
    },
    {
        "content": "<p>I wonder how hard would something like this be to implement in terms of gimli.</p>",
        "id": 226577997,
        "sender_full_name": "nagisa",
        "timestamp": 1613510340
    },
    {
        "content": "<p>I would love a gimli implementation. That would mean one less LLVM tool coupled with rustc outside of cg_llvm. Thereby making it easier to not use LLVM at all.</p>",
        "id": 226619596,
        "sender_full_name": "bjorn3",
        "timestamp": 1613544615
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"133247\">@bjorn3</span> do you know what versions of Dwarf gimli supports? I havent found any specification on the repo.</p>",
        "id": 226650830,
        "sender_full_name": "Darley Barreto",
        "timestamp": 1613566061
    },
    {
        "content": "<p>As far as I know it mostly supports DWARFv5. There may be some things missing though.</p>",
        "id": 226651025,
        "sender_full_name": "bjorn3",
        "timestamp": 1613566179
    }
]