[
    {
        "content": "<p>So I was talking a bit to <span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span> but I want to bring this conversation broader: I wasn't able to attend the sprint planning meeting, but I have a thought on how we organize it. I don't think we should advertise this event as \"come one, come all!\". I think instead we should encourage folks to submit goals and projects before the sprint starts, including some that they would like to mentor, and then we should encourage folks to apply and be assigned to projects. </p>\n<p>Bascally what I want to avoid is a bunch of people and awkwardness around who volunteers for what. I think it'd be great if we can come into the sprint with a set of people who are committed to participate and kind of clear ideas about what they're going to do.</p>\n<p>I'm struggling a bit because a lot of the ideas of things I have that I would like to mentor are not on theme. =) but maybe that's ok, I don't have to mentor. </p>\n<p>One other challenge I guess is that there's a bit of 'exploration' that might be fun/productive to use sprint time to do. But it's ok if the mentorship opportunities are relatively few -- I tend to think a sprint is a good way to deepen specific people's engagement with the compiler, and not so much a mass recruiting event.</p>",
        "id": 224500077,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1611938852
    },
    {
        "content": "<p>I also actually agree with this</p>",
        "id": 224501258,
        "sender_full_name": "simulacrum",
        "timestamp": 1611939293
    },
    {
        "content": "<p>same, having some tasks and plans prepared ahead of time was very very useful in our prior sprints</p>",
        "id": 224501818,
        "sender_full_name": "lqd",
        "timestamp": 1611939517
    },
    {
        "content": "<p>Would it make sense for us to submit proposals that we ourselves won't be able to work on or mentor?</p>",
        "id": 224502176,
        "sender_full_name": "nagisa",
        "timestamp": 1611939660
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"123586\">nagisa</span> <a href=\"#narrow/stream/131828-t-compiler/topic/on.20sprint.20organization/near/224502176\">said</a>:</p>\n<blockquote>\n<p>Would it make sense for us to submit proposals that we ourselves won't be able to work on or mentor?</p>\n</blockquote>\n<p>I think so... some ppl may have time but no ideas for proposals that can fit into a week</p>",
        "id": 224502618,
        "sender_full_name": "oli",
        "timestamp": 1611939836
    },
    {
        "content": "<p>I agree, that makes sense!</p>",
        "id": 224515663,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1611945550
    }
]