[
    {
        "content": "<p><a href=\"/user_uploads/4715/v8tpIj6bP0te7uXwpaCo48Xv/image.DNXJY0.png\">image.DNXJY0.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/4715/v8tpIj6bP0te7uXwpaCo48Xv/image.DNXJY0.png\" title=\"image.DNXJY0.png\"><img src=\"/user_uploads/4715/v8tpIj6bP0te7uXwpaCo48Xv/image.DNXJY0.png\"></a></div><p>I've made a diagram of the big compiler stages based on the data flow. My plan is to add this to the <a href=\"https://rustc-dev-guide.rust-lang.org/overview.html\">overview chapter</a> in the dev guide.</p>\n<p>I'd like some feedback: Have I missed something? Are the terms correct? <br>\nThe things on the right are examples of what is done in a stage, and is not meant to be complete. Do you know other important ones?</p>\n<p>Also, do you know a good tool to draw this digitally? Ideally a website, where one can edit it later and produce a PNG or SVG file.</p>",
        "id": 226249266,
        "sender_full_name": "Julian-Wollersberger",
        "timestamp": 1613229116
    },
    {
        "content": "<p>It is roughly correct. I don't think you have mixed any IR. The biggest thing that is different in reality is that several stages have more of a cyclic dependency. For example macro expansion can cause additional files to be lexed and parsed. MIR generation of a function requires typechecking of said function, which can itself require the MIR of different functions for const eval. In addition just like lexing and parsing are happening interleaved, generation of THIR happens on the fly while lowering to MIR. At no point in time does the whole THIR of a function exist. A HIR body is lazily lowered to THIR as necessary for MIR lowering. This doesn't become clear from the diagram, though admittedly it may not be very relevant. The final remark I have is that everything after AST-&gt;HIR lowering heavily uses the query system. Not just HIR-&gt;THIR.</p>",
        "id": 226249732,
        "sender_full_name": "bjorn3",
        "timestamp": 1613229612
    },
    {
        "content": "<p>I'll remove the remark about the query system then. <br>\nThe cyclic dependencies are hard to draw. I'll add an arrow from SyntaxTree to lexing, and one from MIR to HIR.<br>\nMaybe drawing the THIR box with a dotted border will help.</p>",
        "id": 226250053,
        "sender_full_name": "Julian-Wollersberger",
        "timestamp": 1613230105
    },
    {
        "content": "<blockquote>\n<p>Also, do you know a good tool to draw this digitally? Ideally a website, where one can edit it later and produce a PNG or SVG file.</p>\n</blockquote>\n<p>Not a free tool, but Adobe Illustrator might work.</p>",
        "id": 226285284,
        "sender_full_name": "Noah Lev",
        "timestamp": 1613277232
    },
    {
        "content": "<p>I haven't used it much, but GIMP—which is free and open-source—may also work. (It's more like Photoshop and less like Illustrator IIUC though.)</p>",
        "id": 226285322,
        "sender_full_name": "Noah Lev",
        "timestamp": 1613277251
    },
    {
        "content": "<p>Inkscape is an open source vector editor.</p>",
        "id": 226293519,
        "sender_full_name": "bjorn3",
        "timestamp": 1613292132
    }
]