[
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"116466\">@Zoxc</span> --</p>\n<p>So <span class=\"user-mention\" data-user-id=\"124287\">@mw</span> and I were talking about the meeting tomorrow  (on end-to-end queries) and trying to plan what we ought to be talking about. We were thinking that probably the first question we should be asking is:</p>\n<blockquote>\n<p>Do we expect to land these PRs in rebased form at some point in the near future (or ever)?</p>\n</blockquote>",
        "id": 182675571,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1575562854
    },
    {
        "content": "<p>I'm sorry to say it, but right now, mw and I were leaning towards \"no\". This is a combination of a few things:</p>\n<ul>\n<li>We have a lot of things in flight right now (rust-analyzer, parallelization, maybe refactoring the dep-graph)</li>\n<li>The rust-analyzer effort in particular has a lot of overlap, since it is \"end-to-end\" from the get go; we want to be careful with modifying rustc in ways that might make the two efforts harder to reconcile</li>\n<li>The \"end design\" that these PRs are working towards is not very clear, and seems to be rather complicated</li>\n</ul>\n<p>The last point seems particularly important.</p>",
        "id": 182675592,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1575562867
    },
    {
        "content": "<p>So we figured we'd start the meeting on that question, probably. We were then thinking, presuming the answer does wind up being \"no\", what else we might discuss. Two thoughts:</p>\n<ul>\n<li>First, it would still be good to move the \"incremental barrier\" further back. We could talk about immediate steps, such as improving how the HIR map is integrated with queries and incrementalizing HIR lowering. (But we should also consider if we have the bandwidth to really pursue that.)</li>\n<li>Second, we might talk about the larger architecture -- what lessons can we learn from these PRs? Where was the query system a poor fit, requiring workarounds or changes? I have some examples that came up around MIR transformations and chalk, and maybe <span class=\"user-mention\" data-user-id=\"133169\">@matklad</span> has some thoughts on things from rust-analyzer</li>\n</ul>\n<p>OK, that's it. I wanted to give you a heads up and get your reaction, and/or any thoughts on good things to discuss specifically tomorrow.</p>",
        "id": 182675599,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1575562871
    },
    {
        "content": "<p>(also cc <span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span> <span aria-label=\"point up\" class=\"emoji emoji-1f446\" role=\"img\" title=\"point up\">:point_up:</span> )</p>",
        "id": 182675623,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1575562898
    },
    {
        "content": "<p>These PRs basically does the minimal thing required to move the \"incremental barrier\" further back without regressing performance. They constrain the \"end design\" to use a single query / incremental system without much constraints on how that query system is used. An approach in another direction from these PRs would be to use multiple query systems where the later system have some invariant (no parsing errors for example) that has to hold.</p>\n<p>Does <code>rust-analyzer</code> use Salsa end-to-end? If so and assuming Salsa is pretty much equivalent to the query system in rustc, that should be very compatible with these PRs.</p>",
        "id": 182677664,
        "sender_full_name": "Zoxc",
        "timestamp": 1575564042
    },
    {
        "content": "<p>I'll also suggest <a href=\"https://internals.rust-lang.org/t/migrating-rustc-interface-queries-to-proper-librustc-queries/10433\" target=\"_blank\" title=\"https://internals.rust-lang.org/t/migrating-rustc-interface-queries-to-proper-librustc-queries/10433\">https://internals.rust-lang.org/t/migrating-rustc-interface-queries-to-proper-librustc-queries/10433</a> as reading material ;)</p>",
        "id": 182677791,
        "sender_full_name": "Zoxc",
        "timestamp": 1575564109
    },
    {
        "content": "<p>The summary section highlights the problematic parts of the PRs.</p>",
        "id": 182678845,
        "sender_full_name": "Zoxc",
        "timestamp": 1575564687
    },
    {
        "content": "<p>The first PR which moves the \"incremental barrier\" back to (but not including) HIR lowering doesn't suffer from the problematic parts though. Landing that would allow us to replace the HIR map structure with its (probably broken in some way) custom incremental dependency tracking with proper queries. I do expect that moving to queries will come with a performance cost though.</p>",
        "id": 182679413,
        "sender_full_name": "Zoxc",
        "timestamp": 1575564980
    },
    {
        "content": "<p>I certainly read the internals thread :)</p>",
        "id": 182765653,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1575642877
    },
    {
        "content": "<p>Anyway, it seems like it would be a good use of time then to cover the \"big picture\"</p>",
        "id": 182765666,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1575642891
    },
    {
        "content": "<p>I was just discussing with <span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span> a bit</p>",
        "id": 182766277,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1575643255
    },
    {
        "content": "<p>Despite how the message above might read, I want to emphasize that I don't want the meeting to have a foregone conclusion, but I did want to warn you where I personally lean beforehand</p>",
        "id": 182766321,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1575643292
    },
    {
        "content": "<blockquote>\n<p>These PRs basically does the minimal thing required to move the \"incremental barrier\" further back without regressing performance. </p>\n</blockquote>\n<p>I guess we should discuss this part -- I think the most fruitful thing would be to talk about what high-level strategy we take</p>",
        "id": 182766355,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1575643319
    },
    {
        "content": "<p>I'm trying to think how to frame the agenda, in other words</p>",
        "id": 182766456,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1575643346
    }
]