[
    {
        "content": "<p>So <span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span> or others, I was thinking that maybe we should create some defined channels for \"production users\" to highlight issues that they are having around rustc etc. I had in mind a few possibilities:</p>\n<ul>\n<li>a dedicated Zulip stream <code>t-compiler/production user</code> or something like that</li>\n<li>maybe a label to mark this as a \"bug blocking a production user\" (for some def'n)</li>\n<li>maybe some way to talk to prioritization folks to get things on agenda (but maybe the label serves that role)</li>\n<li>a forge page we can point people at that explains things</li>\n</ul>",
        "id": 200276066,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591729805
    },
    {
        "content": "<p>I feel like we do relatively little active outreach of this kind but it'd be useful</p>",
        "id": 200276095,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591729822
    },
    {
        "content": "<p>I'm not 100% sure what constitutes a production user mind you :)</p>",
        "id": 200276106,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591729827
    },
    {
        "content": "<p>but I also know it's not only bugs, but sometimes feature requests (e.g., <span class=\"user-mention\" data-user-id=\"224872\">@Ryan Levick</span> has sometimes approached me with things that would be useful for encouraging Rust adoption at Microsoft,  which is fine, but it'd be nice to have a channel for raising that sort of request)</p>",
        "id": 200276179,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591729880
    },
    {
        "content": "<p>I'd be glad to have more focus dedicated to production users, given that I am a \"production user\" and it would give me more leverage to push the issues that matter to me.</p>",
        "id": 200287415,
        "sender_full_name": "Peter Rabbit",
        "timestamp": 1591735352
    },
    {
        "content": "<p>I wonder, being a production user myself, I have long resigned to not expecting anything unless a) I do it myself; b) its a critical issue.</p>",
        "id": 200304306,
        "sender_full_name": "nagisa",
        "timestamp": 1591745534
    },
    {
        "content": "<p>I don’t see how having a channel will change that dynamic.</p>",
        "id": 200304340,
        "sender_full_name": "nagisa",
        "timestamp": 1591745578
    },
    {
        "content": "<p>At the last in-person Rust Summit, I remember there was a working group specifically about talking to production users. What became of that?</p>",
        "id": 200381591,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1591769639
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"239881\">Josh Triplett</span> <a href=\"#narrow/stream/131828-t-compiler/topic/production.20users/near/200381591\">said</a>:</p>\n<blockquote>\n<p>At the last in-person Rust Summit, I remember there was a working group specifically about talking to production users. What became of that?</p>\n</blockquote>\n<p>It existed but I believe there were membership changes, and the group continuity wasn't really preserved so it kind of stopped. I thinking reaching out to production users is a great idea, though I think maybe the group would be more useful as a project wide resource. I know some production users are going to have more to say about dev tools than the compiler for example.</p>\n<p>I'd be willing to spend the time doing outreach and working in this group.</p>",
        "id": 200386058,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1591774658
    },
    {
        "content": "<p>around CTFE I do prioritize things that are requested by users even though I have much prettier <span aria-label=\"unicorn\" class=\"emoji emoji-1f984\" role=\"img\" title=\"unicorn\">:unicorn:</span> s to work at. But everywhere else I totally see <span class=\"user-mention\" data-user-id=\"123586\">@nagisa</span> 's mentioned behaviour in myself. I don't really feel any pressure to work on non-critical issues</p>",
        "id": 200386240,
        "sender_full_name": "oli",
        "timestamp": 1591774855
    },
    {
        "content": "<p>So, I don't necessarily expect a lot of changes in this way,</p>",
        "id": 200483351,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591826698
    },
    {
        "content": "<p>but I think it would at least be a way to prioritize prod users seeking help, =)</p>",
        "id": 200483368,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591826709
    },
    {
        "content": "<p>and perhaps it might inform what we consider critical</p>",
        "id": 200483377,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591826716
    },
    {
        "content": "<p>I guess I do feel like we need more channels of communication, but at the same time I do think that it's not like we have \"resources\" to \"deploy\"</p>",
        "id": 200483423,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591826747
    },
    {
        "content": "<p>Still, in cases like there being options that folks would like to stabilize or whatever, I've usually found people are more than willing to do the work, but they might not know if it's appropriate to ask, or just <em>where</em> to ask. This is of course not specific to production users.</p>",
        "id": 200483544,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591826795
    },
    {
        "content": "<p>Perhaps some sort of system where a company could sponsor work towards a specific feature and a developer would be found to work on that feature? Many companies don't have developers to spare to work on things themselves, and hiring is a slow complicated process, but being able to just throw a bit of money at the problem would be nice.</p>",
        "id": 200496974,
        "sender_full_name": "Peter Rabbit",
        "timestamp": 1591837535
    },
    {
        "content": "<p>This sounds a lot like the rust foundation. Whatever came out of that?</p>",
        "id": 200497659,
        "sender_full_name": "nagisa",
        "timestamp": 1591838407
    },
    {
        "content": "<p><a href=\"https://smallcultfollowing.com/babysteps/blog/2020/01/09/towards-a-rust-foundation/\">https://smallcultfollowing.com/babysteps/blog/2020/01/09/towards-a-rust-foundation/</a></p>",
        "id": 200501467,
        "sender_full_name": "Peter Rabbit",
        "timestamp": 1591844189
    },
    {
        "content": "<p>This would not be a job for a rust foundation.</p>",
        "id": 200576611,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591896057
    },
    {
        "content": "<p>(In my opinion)</p>",
        "id": 200576623,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591896061
    },
    {
        "content": "<p>but I think it's a reasonable idea to have companies of folks who would do things like that</p>",
        "id": 200576657,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591896075
    },
    {
        "content": "<p>(and the answer is that things are \"under investigation\" but I can't really say more than that right now)</p>",
        "id": 200576777,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591896121
    },
    {
        "content": "<p>Ah, yeah, I remember us leaning towards not making the foundation into a money redistribution and hiring entity</p>",
        "id": 200589267,
        "sender_full_name": "nagisa",
        "timestamp": 1591901564
    }
]