[
    {
        "content": "<p>Hey! <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> We've been trying to wrangle our stabilization process a bit over in <span class=\"user-group-mention\" data-user-group-id=\"2645\">@T-libs</span> and wanted to try move all stabilization FCPs to the tracking issue rather than PRs (so they don't rot and need constant rebasing, version updates, split discussion etc).</p>\n<p>I was thinking about pull request templates with one for stabilizations. We don't currently have any so I wanted to test the waters here first because I think this group probably submits the majority of PRs. Would you find suddenly needing to run through GitHub's template selection form for PRs a nuisance? Should we try introduce a few at the same time? Or would a better approach be attempting to detect stabilization in the diff and having a bot leave a comment to look at the tracking issue?</p>",
        "id": 220543040,
        "sender_full_name": "Ashley Mannix",
        "timestamp": 1608507706
    },
    {
        "content": "<p>as someone who submits a lot of PRs <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span> I think the templates are a great idea :) as long as there's an easy button for 'not stabilization' I don't mind one more click at all, I usually spend more time writing up the description anyway</p>",
        "id": 220543470,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1608508334
    },
    {
        "content": "<blockquote>\n<p>Or would a better approach be attempting to detect stabilization in the diff and having a bot leave a comment to look at the tracking issue?</p>\n</blockquote>\n<p>this seems prone to failure, I think a template is a better approach personally</p>",
        "id": 220543477,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1608508368
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"204346\">Ashley Mannix</span> <a href=\"#narrow/stream/131828-t-compiler/topic/Pull.20Request.20Templates/near/220543040\">said</a>:</p>\n<blockquote>\n<p>Hey! <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> We've been trying to wrangle our stabilization process a bit over in <span class=\"user-group-mention\" data-user-group-id=\"2645\">@T-libs</span> and wanted to try move all stabilization FCPs to the tracking issue rather than PRs (so they don't rot and need constant rebasing, version updates, split discussion etc).</p>\n</blockquote>\n<p>Note that rustbot can't do multiple fcps in the same issue, which is part of why stabilization started moving to PRs for things -- if it was going to stabilize only a subset, that means the next one wouldn't be doable in the issue since there already would have been an fcp in that item.</p>\n<p>Of course that's solvable by always splitting up the tracking issues, but I don't know how common that is.  FWIW, my last stabilization PR (<a href=\"https://github.com/rust-lang/rust/pull/76234\">https://github.com/rust-lang/rust/pull/76234</a>) was for only one of the two feature gates in the tracking issue.</p>",
        "id": 220560775,
        "sender_full_name": "scottmcm",
        "timestamp": 1608537905
    },
    {
        "content": "<p>Ah that's an interesting point <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span> It doesn't seem worth creating a new tracking issue just to stabilize a subset of a feature but it's also unfortunate to have no choice but to split conversation one way or another</p>",
        "id": 220562376,
        "sender_full_name": "Ashley Mannix",
        "timestamp": 1608539569
    },
    {
        "content": "<p>I think a big part of making PRs to propose stabilization, though, was that it was the most reliable way to get attention on something.  If there's a different way to get something \"in the queue\", that would be fine by me.  But part of having the PR that's nice is that it avoids bystander effect for actually making that PR -- someone has essentially volunteered to do the change.</p>",
        "id": 220566113,
        "sender_full_name": "scottmcm",
        "timestamp": 1608542647
    }
]