[
    {
        "content": "<p>Was there ever an effort made to quantify the impact of <code>mutable-noalias</code> on code outside of the compiler? I know that of course the compiler's huge benchmark suite was run every time it was toggled, but that's not necessarily representative, so I'm wondering if anyone ran a bunch of community crate benchmark suites to back up changing the default for compilation of community crates.</p>",
        "id": 278632087,
        "sender_full_name": "Ben Kimock (Saethlin)",
        "timestamp": 1649721362
    },
    {
        "content": "<p>We don't currently have a runtime performance benchmark set for anything but the compiler.</p>\n<p>(Which is definitely unfortunate, because as a result we have no way to make \"that's slower to compile but makes programs faster\" tradeoffs, and thus such things get marked as perf regressions.)</p>",
        "id": 278633998,
        "sender_full_name": "scottmcm",
        "timestamp": 1649723019
    },
    {
        "content": "<p>Yeah I tried a handful of crates I know and the effect is so massive and chaotic that I don't really know what to do with it <span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span> <br>\nI have improvements as high as 54% (that I believe are legitimate aliasing optimizations) and regressions as high as 138% (which confuse me).</p>",
        "id": 278635469,
        "sender_full_name": "Ben Kimock (Saethlin)",
        "timestamp": 1649724612
    },
    {
        "content": "<p>Though these are microbenchmarks (as in, small enough that every instruction worth a darn gets inlined into the benchmark loop), not real programs. I'm very interested if anyone has a Real Program which has its performance/throughput well-characterized.</p>",
        "id": 278635594,
        "sender_full_name": "Ben Kimock (Saethlin)",
        "timestamp": 1649724736
    },
    {
        "content": "<p>You might even check the size of the binaries (since that's really easy compared to comparing perf) since here's a fun demo that mutable-noalias can actually make the code <em>shorter</em>: <a href=\"https://rust.godbolt.org/z/zaj43brnj\">https://rust.godbolt.org/z/zaj43brnj</a>  (inspired by <a href=\"https://github.com/rust-lang/rust/issues/90821\">#90821</a>)</p>",
        "id": 278637399,
        "sender_full_name": "scottmcm",
        "timestamp": 1649726620
    }
]