[
    {
        "content": "<p>I was wondering if maybe we should querify the process of registering tools/attrs? that way a codegen can internally register its own attribute without requiring the user to explicitly declare it in their own library, which is clunky and weird. This would make the boilerplate for using rust-cuda and rust-gpu a bit less. cc <span class=\"user-mention\" data-user-id=\"119009\">@eddyb</span> </p>\n<p>Or otherwise provide some way for a codegen to register an attribute, or make it possible for attributes to be registered cross-crate, i.e. spirv-std and cuda-std would define it for the user.</p>",
        "id": 263963655,
        "sender_full_name": "Riccardo D'Ambrosio",
        "timestamp": 1638858604
    },
    {
        "content": "<p>I believe the reason that it is registered in the source code is because it allows the attribute to be used even if the tool isn't currently used. I think the best way would be if there was a way to re-export a registered tool attribute from a crate.</p>",
        "id": 263965142,
        "sender_full_name": "bjorn3",
        "timestamp": 1638860314
    },
    {
        "content": "<p>Yeah, although im not sure how that could be done, it would probably need to be added to rlib metadata, right?</p>",
        "id": 263965320,
        "sender_full_name": "Riccardo D'Ambrosio",
        "timestamp": 1638860469
    },
    {
        "content": "<p>Hmm yeah that makes sense, it would error if not using the codegen, bringing us back to step one <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 263965337,
        "sender_full_name": "Riccardo D'Ambrosio",
        "timestamp": 1638860508
    },
    {
        "content": "<p>Although no attributes are actually emitted if not using the codegen, since the crates cfg them for the specific targets</p>",
        "id": 263965386,
        "sender_full_name": "Riccardo D'Ambrosio",
        "timestamp": 1638860536
    },
    {
        "content": "<p>Yeah that would not actually be a problem since crates already cfg-gate away all the no_std and register_attr stuff</p>",
        "id": 263965534,
        "sender_full_name": "Riccardo D'Ambrosio",
        "timestamp": 1638860687
    }
]