[
    {
        "content": "<p>As python2 is <a href=\"https://www.python.org/doc/sunset-python-2/\">no longer supported</a> and we are approaching python4, I think that we should move towards python3. Python2 is no longer maintained and could bring bugs to rustc if used. Even though Rust is about compatibility, the Python team highly recommends deprecating python2 since it's no longer maintained and security/general bug reports will not be looked at. Additionally, if rustc wanted to use python3 only features/python3 only packages, this would break when using python2.</p>\n<p>From the Python <a href=\"https://www.python.org/doc/sunset-python-2/\">\"Sunset Python 2\"</a> blog post:</p>\n<blockquote>\n<p><strong>What will happen if I did not upgrade by January 1st, 2020?</strong></p>\n<p>If people find catastrophic security problems in Python 2, or in software written in Python 2, then most volunteers will not help fix them. If you need help with Python 2 software, then many volunteers will not help you, and over time fewer and fewer volunteers will be able to help you. You will lose chances to use good tools because they will only run on Python 3, and you will slow down people who depend on you and work with you.<br>\nSome of these problems started on January 1. Other problems will grow over time.</p>\n</blockquote>\n<p>Should we depreciate the use of Python2 to build rustc and enforce the use of Python3?</p>\n<p>Related: <a href=\"https://github.com/rust-lang/rust/issues/71818\">#71818</a><br>\nContext: <a href=\"https://github.com/rust-lang/rust/issues/82433\">#82433</a></p>",
        "id": 227380654,
        "sender_full_name": "Henry Boisdequin",
        "timestamp": 1614054022
    },
    {
        "content": "<blockquote>\n<p>we are approaching python4</p>\n</blockquote>\n<p>We are? I haven't heard anything about python4.</p>\n<blockquote>\n<p>if rustc wanted to use python3 only features/python3 only packages, this would break when using python2.</p>\n</blockquote>\n<p>bootstrap.py doesn't use any dependencies that aren't in the standard library (and personally I would want to move anything that complicated into rustbuild before having it in bootstrap.py). I agree it would be nice not to have to make things work with python2 though.</p>\n<blockquote>\n<p>could bring bugs to rustc if used</p>\n</blockquote>\n<p>I don't really understand why that requires <em>forcing</em> people not to use python2, though. If people care, they can change the default <code>python</code> on their machine to python3.</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span>, this is a follow-up to <a href=\"https://github.com/rust-lang/rust/issues/71818#issuecomment-623107875\">https://github.com/rust-lang/rust/issues/71818#issuecomment-623107875</a></p>",
        "id": 227382977,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1614056496
    },
    {
        "content": "<p>It was attempted in <a href=\"https://github.com/rust-lang/rust/pull/81451\">https://github.com/rust-lang/rust/pull/81451</a></p>",
        "id": 227410851,
        "sender_full_name": "nagisa",
        "timestamp": 1614077276
    },
    {
        "content": "<p>Yeah I personally still think it's too early, pain of supporting both doesn't seem too high to me personally</p>",
        "id": 227413692,
        "sender_full_name": "simulacrum",
        "timestamp": 1614078718
    },
    {
        "content": "<p>IIRC LLVM's reliance on python is only in the test suite, at least according to <a href=\"https://llvm.org/docs/GettingStarted.html#software\">https://llvm.org/docs/GettingStarted.html#software</a></p>",
        "id": 227609440,
        "sender_full_name": "est31",
        "timestamp": 1614178212
    }
]