[
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"116107\">@davidtwco</span> </p>\n<p>Now that rustc supports split DWARF, what would it take to use that for compiling the std that we ship for each target? That would make it easier to build binaries without debug symbols, and not end up with all the symbols from std anyway.</p>",
        "id": 220616844,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1608576853
    },
    {
        "content": "<p>I'll let David answer for split DWARF specifically but <span class=\"user-mention\" data-user-id=\"116015\">@Alex Crichton</span> has proposed stabilizing a <code>-Csplit-debuginfo</code> flag in <a href=\"https://github.com/rust-lang/rust/issues/79570\">#79570</a>. So there's probably a lot of overlap with that.</p>",
        "id": 220622108,
        "sender_full_name": "Wesley Wiser",
        "timestamp": 1608579741
    },
    {
        "content": "<p>I was intending to look into something like this once beta rustc had Split DWARF in it - adding support for bootstrap to compile rustc itself in Split DWARF. </p>\n<p>My background of how we distribute std is fuzzy, but: if we ship std as an rlib, then if final compiler invocation (which produces the shared library or binary) is invoked with Split DWARF then std's debuginfo would be split in the output of that. If that understanding is correct, then I don't know that it \"shipping std with Split DWARF\" is meaningful.</p>",
        "id": 220734999,
        "sender_full_name": "davidtwco",
        "timestamp": 1608671727
    },
    {
        "content": "<p>I think we ship an rlib for generic functions and an .so for non-generic ones</p>",
        "id": 220735572,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1608672169
    },
    {
        "content": "<p>(or generic functions that are unreachable from the root - I'm sure you know more about that than I do)</p>",
        "id": 220735598,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1608672188
    },
    {
        "content": "<p>The .so version of libstd is used when you either use -Cprefer-dynamic or any crate in the crate graph is only available as dylib. Eg <a href=\"http://librustc_driver.so\">librustc_driver.so</a>.</p>",
        "id": 220737772,
        "sender_full_name": "bjorn3",
        "timestamp": 1608673838
    }
]