[
    {
        "content": "<p>Since macros 2.0 are starting to get used more in the stdlib, I've been thinking about dogfooding them in the compiler itself. AIUI one of the biggest open questions regarding macros 2.0 is how control over hygiene ought to be exposed to users, and I think using them in the compiler will give us a lot of data about how typical macros in the wild react to the stricter-by-default hygiene of macros 2.0. Would anyone with reviewer privileges be interested in aiding in this effort? My plan is to convert only a few crates at a time to make things easier to review and less likely to rot. I have a PR open at <a href=\"https://github.com/rust-lang/rust/pull/85690\">https://github.com/rust-lang/rust/pull/85690</a> that converts the macros in rustc_arena; we can see that two of its macros are fine with stricter hygiene, and one needs looser hygiene.</p>",
        "id": 247082371,
        "sender_full_name": "bstrie",
        "timestamp": 1627143318
    },
    {
        "content": "<p>Won't that make the docs worse, because private macros won't be documented?</p>",
        "id": 247083586,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1627145357
    },
    {
        "content": "<p>isn't it expected that private items wouldn't be rendered in the docs? (note that all of the macros in the linked PR are public, and none have docs anyway)</p>",
        "id": 247083678,
        "sender_full_name": "bstrie",
        "timestamp": 1627145522
    },
    {
        "content": "<p><a href=\"https://github.com/rust-lang/rust/issues/73754\">https://github.com/rust-lang/rust/issues/73754</a></p>",
        "id": 247083707,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1627145525
    },
    {
        "content": "<p>Rustc uses --document-private-items, so this would be a regression compared to macro rules</p>",
        "id": 247083725,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1627145552
    },
    {
        "content": "<p>Ah ok, if it doesn't actually affect anything it's probably fine. But I don't think we should convert any private macros until the bugs in rustdoc are fixed.</p>",
        "id": 247083745,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1627145585
    },
    {
        "content": "<p>sure, I'm open to only migrating public macros for now. this is exactly the sort of thing that this effort is intended to bring to light :)</p>",
        "id": 247083797,
        "sender_full_name": "bstrie",
        "timestamp": 1627145657
    },
    {
        "content": "<p>(FWIW I don't think this is bringing anything to light we haven't discussed already - this has the same root cause as the <code>pub use</code> problem you found)</p>",
        "id": 247083840,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1627145752
    }
]