[
    {
        "content": "<p>I notice that all the \"map\" data structures in the HIR use <code>BTreeMap&lt;ID, ...&gt;</code>. Why not a hash map instead? I usually use hash maps for this kind of thing but maybe there's a performance pitfall in here somewhere</p>",
        "id": 222972028,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1610790202
    },
    {
        "content": "<p>A small id is relatively expensive to hash compared to ordered. That may be part of the reason.</p>",
        "id": 222972101,
        "sender_full_name": "bjorn3",
        "timestamp": 1610790281
    },
    {
        "content": "<p>Hash maps can make compilations not reproducible, as iterating them will give us random orders of things. So if you need to iterate a map, then you can't use a <code>HashMap</code> in the compiler</p>",
        "id": 222981418,
        "sender_full_name": "oli",
        "timestamp": 1610803947
    },
    {
        "content": "<p>To elaborate on what Oli said, iterating over hashmaps gives you items in random order so you would otherwise have to sort it all the time and you may forget, causing sneaky non-reproducible builds.</p>",
        "id": 223003051,
        "sender_full_name": "Noah Lev",
        "timestamp": 1610827774
    },
    {
        "content": "<p>The compiler does use indexmap in cases where insertion order is sufficient</p>",
        "id": 223004066,
        "sender_full_name": "cuviper",
        "timestamp": 1610828452
    },
    {
        "content": "<p>There's also <code>IndexVec</code> for things like <code>Body::basic_blocks</code> (where you basically have custom index types).</p>",
        "id": 223058943,
        "sender_full_name": "Noah Lev",
        "timestamp": 1610911904
    },
    {
        "content": "<p>Should entities within TypechkResults use BTrees instead of IndexMap/HashMap?</p>",
        "id": 223070444,
        "sender_full_name": "Aman Arora",
        "timestamp": 1610927867
    },
    {
        "content": "<p>Not if they are never iterated in a way where the order matters. In that case HashMap is faster.</p>",
        "id": 223097309,
        "sender_full_name": "bjorn3",
        "timestamp": 1610962401
    }
]