[
    {
        "content": "<p>So, I'm about to borrow the submodule wrangling strategy that x.py/bootstrap uses for another project, since it's the most pleasant I've ever seen working with submodules get.</p>\n<p>That said, it seems kind of... dangerous to do so eagerly. So I'm wondering if anybody has horror stories (<span class=\"user-mention\" data-user-id=\"232545\">@Joshua Nelson</span>  mentioned that <span class=\"user-mention\" data-user-id=\"123586\">@nagisa</span> or <span class=\"user-mention\" data-user-id=\"138448\">@cuviper</span> might, since they've been known to do local changes to LLVM) caused by this behavior?</p>\n<p>I'm interested in failure modes, caveats, whether or not anybody's had to disable it, even just stuff like \"yeah i lost a bunch of local changes once but dont really remember why\", as well as general opinions on the behavior (personally it seems brilliant to me, but perhaps people who work closer to it like it less?)</p>\n<p>Also, cases where its current behavior is insufficient to serve its purpose — has it ever failed to sync them for you (i know it doesnt quite work for \"tracked branch\"-style submodules, but these are janky anyway — mostly interested in this assuming the pattern of usage is similar to rustc).</p>\n<p>(Also interested in the opposite, if you work with the submodules a lot and x.py's behavior never caused problems thats even better!)</p>",
        "id": 233222309,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1617653186
    },
    {
        "content": "<p>the horror stories with submodules that I remember predate x.py and other tooling we have in place (e.g. highfive)</p>",
        "id": 233222433,
        "sender_full_name": "nagisa",
        "timestamp": 1617653259
    },
    {
        "content": "<p>I think it helps that most folks <em>don't</em> want to do anything with the submodules, so it's a detail we can mostly just hide.</p>",
        "id": 233222669,
        "sender_full_name": "cuviper",
        "timestamp": 1617653355
    },
    {
        "content": "<p>For clarity, the algorithm that x.py uses is basically, IIUC:</p>\n<ol>\n<li>for submodule_path in submodules</li>\n<li>run <code>git ls-tree HEAD $submodule_path</code> and parse out the hash. compare it to the output of <code>git rev-parse HEAD</code> from within the path.</li>\n<li>if they're the same, skip this submodule</li>\n<li>otherwise, run something along the lines of</li>\n</ol>\n<div class=\"codehilite\" data-code-language=\"Bash\"><pre><span></span><code>git submodule -q sync <span class=\"nv\">$submodule_path</span>\ngit submodule update --init --recursive --progress\n\n<span class=\"nb\">pushd</span> <span class=\"nv\">$submodule_path</span>\ngit submodule update --init --recursive --progress\ngit reset -q --hard\ngit clean -qdfx\n<span class=\"nb\">popd</span>\n</code></pre></div>\n<p>(although it has some logic to handle old git versions without <code>--progress</code> support)</p>",
        "id": 233223200,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1617653664
    },
    {
        "content": "<p>and yeah the case where you update the submodules would be rare for me too</p>",
        "id": 233223228,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1617653685
    },
    {
        "content": "<p>i figure if this caused real problems for the case where you are updating or mucking around in them, it probably wouldn't be <em>quite</em> as automatic though, or at least there would be options to disable it</p>",
        "id": 233223305,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1617653727
    },
    {
        "content": "<p>i'm not really sure why the second <code>submodule update</code> is needed if the first was recursive though, tbh, but i also am only sort of sure its actually there — its possible that's a mistake i introduced when reading over the logic</p>",
        "id": 233223594,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1617653908
    },
    {
        "content": "<p>So, for my own clarity, you havent found a need to be cautious around x.py when updating the submodules, or making local changes to them?</p>",
        "id": 233224042,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1617654183
    },
    {
        "content": "<p>I had it sync away my changes once or twice, but I learned to be careful of that</p>",
        "id": 233231089,
        "sender_full_name": "cuviper",
        "timestamp": 1617657106
    },
    {
        "content": "<p>and we do have an option, <code>build.submodules = false</code></p>",
        "id": 233231116,
        "sender_full_name": "cuviper",
        "timestamp": 1617657115
    },
    {
        "content": "<p>i see</p>",
        "id": 233247337,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1617666971
    },
    {
        "content": "<blockquote>\n<p>I learned to be careful of that</p>\n</blockquote>\n<p>Can you elaborate on what you're careful of avoiding?</p>",
        "id": 233247358,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1617666990
    },
    {
        "content": "<p>So if you make a change to the llvm submodule, for testing or hacking something and fail to commit it, the next invocation of x.py may delete your changes.</p>",
        "id": 233266164,
        "sender_full_name": "nagisa",
        "timestamp": 1617684392
    },
    {
        "content": "<p>My solution to this problem was to just use a proper llvm checkout for the purpose.</p>",
        "id": 233266201,
        "sender_full_name": "nagisa",
        "timestamp": 1617684434
    },
    {
        "content": "<p>I also hit this a couple of times but it never was major problem I feel.</p>",
        "id": 233266275,
        "sender_full_name": "nagisa",
        "timestamp": 1617684504
    }
]