[
    {
        "content": "<p>Hey all. I've gotten some feedback from folks that the RFC as written mixes problem description with proposed solution a bit too closely. People were having a hard time understanding the problem space outside of the context of the proposed solution which was making it hard to judge whether the proposed solution was ideal for addressing the problem.</p>\n<p>The problem space is big and complicated. I took the time to trim the RFC of the proposed solution and just present the problem space along with how prior art failed to address this problem space adequately. Perhaps if we can get people on the same page about the shape the problem, we'll have an easier time convincing everyone of the proper solution. Let me know if you think this is helpful: <a href=\"https://gist.github.com/rylev/6dbf91dfa93b1276f39fdc3d32bddbb7\">https://gist.github.com/rylev/6dbf91dfa93b1276f39fdc3d32bddbb7</a></p>",
        "id": 214287580,
        "sender_full_name": "rylev",
        "timestamp": 1603443043
    },
    {
        "content": "<p>In particular I think it's important to note the three mechanisms that we view as necessary: </p>\n<ul>\n<li>Codifying in-memory type representation guarantees</li>\n<li>Expressing in-memory type representation requirements</li>\n<li>Expressing in-memory type representation stability guarantees</li>\n</ul>",
        "id": 214287652,
        "sender_full_name": "rylev",
        "timestamp": 1603443106
    },
    {
        "content": "<p>One potential missing part of this, is a section that follows the discussion of well-defined and safe transmutation. A third category should be discussed, \"stable\" transmutation. Transmutes are \"stable\" if only minor semver changes can be performed without changing the set of possible safe transmute operations that can be performed on a type.</p>",
        "id": 214288093,
        "sender_full_name": "rylev",
        "timestamp": 1603443383
    },
    {
        "content": "<p>None of this is _new_, but I hope that if we present the information in this form, we can first get everyone to a proper understanding of the problem space before we decide on the solution to address this problem space.</p>",
        "id": 214288161,
        "sender_full_name": "rylev",
        "timestamp": 1603443436
    }
]