[
    {
        "content": "<p>Did it come up in the lang meeting or did I miss the discussion proposing it? It looks kinda neat, including the sealed <code>: UnsafeTransmuteOptions</code> bound. I'd like to know more if there has been anything covering it.</p>",
        "id": 202615282,
        "sender_full_name": "HeroicKatora",
        "timestamp": 1593632655
    },
    {
        "content": "<p>This document provides an overview: <a href=\"https://hackmd.io/@jswrenn/HydSGVHS8\">https://hackmd.io/@jswrenn/HydSGVHS8</a></p>\n<p>In short: while knowing statically that a transmutation is perfectly sound and safe is really nice, sometimes it's desirable to be able to relax certain static checks. For instance, this implementation of bytemuck's <code>try_cast_ref</code> turns off the static alignment check, and the person writing that function takes it on themselves to do a dynamic check instead: <a href=\"https://docs.rs/typic/0.3.0/src/typic/lib.rs.html#275-286\">https://docs.rs/typic/0.3.0/src/typic/lib.rs.html#275-286</a></p>",
        "id": 202619288,
        "sender_full_name": "Jack Wrenn",
        "timestamp": 1593634785
    },
    {
        "content": "<p>Ah, so it comes from Typic's options/relax system. The name <code>Options</code> doesn't really imply that it can turn _off_ checks for me. Is there any more information the intended semantics of the embodiment as a const-fn specifically? Further, any particular reason why Options is not a simple opaque struct as an arguments to the const-fn or just similarity of design? Talking about this from the other hackmd</p>\n<blockquote>\n<p><code>const fn can_transmute&lt;Src, Dst, Options&gt; -&gt; bool</code></p>\n</blockquote>",
        "id": 202662751,
        "sender_full_name": "HeroicKatora",
        "timestamp": 1593679130
    },
    {
        "content": "<p>I had advocated simplifying the compiler builtin transmute checks by taking them out of the type system and into a const-fn before, so I'm quite happy some of that got in the draft :)</p>",
        "id": 202662904,
        "sender_full_name": "HeroicKatora",
        "timestamp": 1593679262
    },
    {
        "content": "<blockquote>\n<p>Is there any more information the intended semantics of the embodiment as a const-fn specifically?</p>\n</blockquote>\n<p>Not yet, but you should think of it as embodying typic's <code>UnsafeTransmuteFrom</code> trait. Typic's documentation on safety and soundness applies, just mentally replace \"produces a compile error\" in the docs with \"returns false\" when thinking about <code>can_transmute</code>.</p>\n<p>Once const generics advances a bit, libcore can implement typic-style <code>TransmuteFrom</code> traits just based on whether or not that predicate is satisfied.</p>",
        "id": 202695155,
        "sender_full_name": "Jack Wrenn",
        "timestamp": 1593699851
    },
    {
        "content": "<blockquote>\n<p>Further, any particular reason why Options is not a simple opaque struct as an arguments to the const-fn or just similarity of design?</p>\n</blockquote>\n<p>It's for consistency with the transmutation marker traits: those take a type parameter <code>Options</code>. In theory, const generics could be used here. There's a few major points in favor of using a type parameter for this instead of const generics:</p>\n<ul>\n<li>stabilizing the various transmutation marker trait definitions isn't blocked on stabilizing const generics</li>\n<li>rust supports default type parameters. In the common case, you probably don't want to neglect any guarantees.</li>\n</ul>",
        "id": 202695572,
        "sender_full_name": "Jack Wrenn",
        "timestamp": 1593700073
    },
    {
        "content": "<p>What about stability guarantees in comparison to the traits? How are they defined? For example, <code>neglect::Stability</code> as an option kind and bounding some public transmute impl always seemed contradictory for the standard library. Either the set of impl is stable anyways, or it is not in which case it violates the stability guarantees. The bool return of course doesn't necessarily need to adhere to such strict guarantees.</p>\n<blockquote>\n<p>In theory, const generics could be used here. </p>\n</blockquote>\n<p>I see. Having a type parameter even allows both options to be used in the future when const generics stabilize, by <br>\ncreating some newtype with a const generic parameter supplying the 'computed' value.</p>",
        "id": 202697396,
        "sender_full_name": "HeroicKatora",
        "timestamp": 1593700856
    },
    {
        "content": "<p>Without the dependency on const generics it even seem <em>far</em> easier to establish the intrinsic than the marker traits. Almost no dependencies except implementation of layout comparison in the compiler, and without any impl stability risk.</p>",
        "id": 202697677,
        "sender_full_name": "HeroicKatora",
        "timestamp": 1593700978
    },
    {
        "content": "<blockquote>\n<p>What about stability guarantees in comparison to the traits?</p>\n</blockquote>\n<p>I'm not sure I understand your question exactly, but I think what you're getting at is that in zerocopy, for instance,  if a type implements<code>FromBytes</code>, it's a statement that it's safe, sound <em>and</em> stable to instantiate a value of that type from arbitrary initialized bytes. </p>\n<p>In Typic, if a type implements <code>FromBytes&lt;()&gt;</code>, it's <em>also</em> a statement that it's safe, sound <em>and</em> stable to instantiate a value of that type from arbitrary initialized bytes. </p>\n<p>However, Typic also lets you finely &amp; explicitly opt-out down stability, safety and (some) soundness guarantees. The reason it has all this flexibility is because it aims for a future where if you ever find yourself needing to resort to <code>mem::transmute</code>, it means you're doing something that cannot possibly be sound.</p>\n<p>You define the stability properties of your types by implementing one or both of <a href=\"https://docs.rs/typic/0.3.0/typic/stability/index.html\">two traits</a>: <code>TransmutableFrom</code> and <code>TransmutableInto</code>.</p>",
        "id": 202703120,
        "sender_full_name": "Jack Wrenn",
        "timestamp": 1593703430
    },
    {
        "content": "<p>What I'm getting at is: If in one version of Rust the intrinsic retruns <code>true</code>, will it do so in any future as well? That's the promise that trait impls deliver, removing an impl is a breaking change. This seems sightly problematic from two perspectives: There is no equivalent of the <code>#[unstable]</code> attribute for the return value so it's hard to experiment with new attributes or more guarantees in nightly. And secondly the <code>neglect::Stability</code> runs counter to that very promise that is foundational to <code>std</code>, I think this should be much more explicit than simply choosing another type.<br>\nProblem one might be solved by not returning a bool but an enum with one <code>Unstable</code> variant, where that unstable variant is only return on an unstable compiler with an active feature gate.<br>\nProblem two seems harder.</p>",
        "id": 202708552,
        "sender_full_name": "HeroicKatora",
        "timestamp": 1593705789
    },
    {
        "content": "<blockquote>\n<p>What I'm getting at is: If in one version of Rust the intrinsic retruns true, will it do so in any future as well?<br>\nNotwithstanding soundness bugs (which should be fixed): yes. That's the promise. This intrinsic must never return <code>true</code> incorrectly.</p>\n</blockquote>",
        "id": 202708786,
        "sender_full_name": "Jack Wrenn",
        "timestamp": 1593705904
    },
    {
        "content": "<blockquote>\n<p>And secondly the neglect::Stability runs counter to that very promise that is foundational to std, I think this should be much more explicit than simply choosing another type.</p>\n</blockquote>\n<p>I don't follow. I think we might not be on the same page. The design of typic (and this RFC) is compatible with the standard library's API stability guarantees. <code>neglect::Stability</code> doesn't affect the standard library's API stability guarantees.</p>",
        "id": 202709165,
        "sender_full_name": "Jack Wrenn",
        "timestamp": 1593706114
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>What I'm getting at is: If in one version of Rust the intrinsic retruns true, will it do so in any future as well?</p>\n</blockquote>\n<p>Yes</p>\n</blockquote>\n<p>But if I query with <code>neglect::Stability</code> then the answer is No, that's the whole point. I might incidentally get a <code>true</code> when trying to transmute <code>enum { Yes, No }</code> to <code>bool</code>, and at a later point when the compiler chooses different discriminants I get <code>false</code>. This seems to me as if  <code>neglect::Stability</code> is not the same as the others.</p>",
        "id": 202709432,
        "sender_full_name": "HeroicKatora",
        "timestamp": 1593706246
    },
    {
        "content": "<p>Ah, no, that's not the case. <code>neglect::Stability</code> is <em>strictly</em> limited to whether the <code>TransmutableFrom</code> and <code>TransmutableInto</code> bounds are enforced. Typic will forbid an<code>enum { Yes, No } to bool</code> <em>even if you neglect <strong>all</strong> static checks</em> because that enum's layout is totally undefined.</p>",
        "id": 202709821,
        "sender_full_name": "Jack Wrenn",
        "timestamp": 1593706446
    },
    {
        "content": "<p>Ohhh, that's fancy. I think I see the difference now.</p>",
        "id": 202710527,
        "sender_full_name": "HeroicKatora",
        "timestamp": 1593706792
    },
    {
        "content": "<p>I'm still not convinced it's ever really a good idea to use as a library author but at least it's coherent</p>",
        "id": 202710777,
        "sender_full_name": "HeroicKatora",
        "timestamp": 1593706911
    },
    {
        "content": "<p>In other words: <code>neglect::Stability</code> isn't really about stability across rust versions, it's about stability across library versions.</p>",
        "id": 202710790,
        "sender_full_name": "Jack Wrenn",
        "timestamp": 1593706919
    },
    {
        "content": "<p>Yeah, library authors should almost never use <code>neglect::Stability</code>, except for one case:</p>",
        "id": 202710862,
        "sender_full_name": "Jack Wrenn",
        "timestamp": 1593706938
    },
    {
        "content": "<p>Rust currently does not give library authors a way to declare their public layout stability guarantees across versions. If a library author currently wants to convey that their type will <em>always</em> be transmutable into an array of 32 bytes, they'll mark their type as <code>#[repr(C)]</code> and then write a rustdoc comment stating their promise. In the future envisioned by this RFC, stating that API promise will be as simple as implementing <code>TransmutableFrom</code> for their type.</p>\n<p>There's going to be a transition period where library consumers should be encouraged to move away from using <code>mem::transmute</code> (which is wildly unsafe and unsound), but are going to be still relying on crate versions that predate <code>TransmutableFrom</code> and <code>TransmutableInto</code>. The <code>neglect::Stability</code> option lets them make this transition without throwing <em>all</em> safety and soundness guarantees out the window.</p>",
        "id": 202712381,
        "sender_full_name": "Jack Wrenn",
        "timestamp": 1593707697
    },
    {
        "content": "<p>So it's 'private definition is part of SemVer', isn't it? That seems very coarse, being able to declare size and align stable independently of each other comes to mind as a potentially interesting intermediate. But I guess it's a start and better than relying on documentation alone.</p>",
        "id": 202712834,
        "sender_full_name": "HeroicKatora",
        "timestamp": 1593707903
    },
    {
        "content": "<p>Surprisingly, <code>TransmutableFrom</code> and <code>TransmutableInto</code> are ridiculously powerful for expressing that sort of stuff!</p>\n<p>For instance, let's say I always want to guarantee that a type <code>Foo</code> is at least 10 bytes, but absolutely <em>nothing</em> else about it.</p>\n<div class=\"codehilite\"><pre><span></span><code><span class=\"cp\">#[repr(C)]</span><span class=\"w\"> </span><span class=\"k\">struct</span> <span class=\"nc\">TenBytes</span><span class=\"p\">([</span><span class=\"n\">MaybeUninit</span><span class=\"o\">&lt;</span><span class=\"kt\">u8</span><span class=\"o\">&gt;</span><span class=\"p\">;</span><span class=\"w\"> </span><span class=\"mi\">10</span><span class=\"p\">]);</span><span class=\"w\"></span>\n\n<span class=\"k\">unsafe</span><span class=\"w\"> </span><span class=\"k\">impl</span><span class=\"w\"> </span><span class=\"n\">TransmutableInto</span><span class=\"w\"> </span><span class=\"k\">for</span><span class=\"w\"> </span><span class=\"n\">Foo</span><span class=\"w\"> </span><span class=\"p\">{</span><span class=\"w\"></span>\n<span class=\"w\">    </span><span class=\"k\">type</span> <span class=\"nc\">Type</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"n\">TenBytes</span><span class=\"p\">;</span><span class=\"w\"></span>\n<span class=\"p\">}</span><span class=\"w\"></span>\n</code></pre></div>",
        "id": 202713542,
        "sender_full_name": "Jack Wrenn",
        "timestamp": 1593708271
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"219211\">@Jack Wrenn</span> All that is superinteresting (public layout guarantees for reprC and others, interim guarantees, etc), and I think it should appear someway in the RFC (or whatever doc that is proposed). It may even pave a way to some form of intermediate ABI IIUC. Great work!</p>",
        "id": 202723840,
        "sender_full_name": "pachi",
        "timestamp": 1593712980
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"125416\">@pachi</span> I anticipate striking a balance of what to include will be a challenge of writing this RFC. :-) For understanding stability and options, the big-picture view of a <code>TransmuteFrom</code> trait seems really helpful!</p>\n<p>One approach might be presenting this big-picture view but including a prominent 'Roadmap' section that plainly lays out the order of operations:</p>\n<ul>\n<li>first and foremost landing the transmutation marker traits, the stability traits and the intrinsic.</li>\n<li>then <em>eventually</em> landing the <code>(Unsafe?)Transmute{From,Into}</code> traits using that intrinsic, and using those to blanket-impl the marker traits</li>\n</ul>\n<p>...and provides a rationale (landing the marker traits first meets immediate demand and can be done without closing the door on sound+complete general transmutation).</p>",
        "id": 202733706,
        "sender_full_name": "Jack Wrenn",
        "timestamp": 1593717642
    },
    {
        "content": "<p>Part of the rationale for this particular two-step approach is that I'm <em>assuming</em> that the only way to implement a type depending on whether a <code>const</code> predicate is satisfied depends on const generics: <a href=\"https://github.com/rust-lang/rust/pull/70107#issuecomment-652584108\">https://github.com/rust-lang/rust/pull/70107#issuecomment-652584108</a></p>\n<p>But, if there's a quick-and-dirty <em>extra-linguistic</em> mechanism in rustc for this (i.e., where the compiler itself temporarily has special knowledge of <code>TransmuteFrom</code> and can impl it based on the outcome of <code>can_transmute</code>), then there's no need for the RFC to talk about the general transmutation traits like they're glimpses into the far-flung future.</p>\n<p>I don't know how the compiler knows when to implement <code>Sized</code>, <code>Send</code> and <code>Sync</code>, but maybe that same mechanism could make a <code>TransmuteFrom&lt;Src&gt;</code> trait work  <em>before</em> const generics progresses substantially? <span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span>?</p>",
        "id": 202735775,
        "sender_full_name": "Jack Wrenn",
        "timestamp": 1593718703
    },
    {
        "content": "<p>Oooo, there's the <code>Freeze</code> trait, too, which is implemented extra-linguistically: <a href=\"https://doc.rust-lang.org/nightly/nightly-rustc/rustc_middle/ty/struct.TyS.html#method.is_freeze\">https://doc.rust-lang.org/nightly/nightly-rustc/rustc_middle/ty/struct.TyS.html#method.is_freeze</a></p>\n<p>In the case of <code>TransmuteFrom</code> and company, the extra-linguistic nature of the <code>impl</code> would be temporary.</p>",
        "id": 202736467,
        "sender_full_name": "Jack Wrenn",
        "timestamp": 1593719038
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"219211\">@Jack Wrenn</span> so -- Send and Sync are implemented using <em>auto traits</em></p>",
        "id": 203042622,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594070729
    },
    {
        "content": "<p>basically, an <code>auto trait Foo</code> is \"automatically implemented\" for a type <code>T</code> if all data embedded in <code>T</code> implements the trait</p>",
        "id": 203042645,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594070743
    },
    {
        "content": "<p>you can opt out with <code>!Foo</code> impls</p>",
        "id": 203042652,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594070748
    },
    {
        "content": "<p>this mechanism is not currently stable</p>",
        "id": 203042658,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594070754
    },
    {
        "content": "<p><code>Sized</code> is different and is hard-coded into rustc</p>",
        "id": 203042714,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594070768
    },
    {
        "content": "<p>in both cases, we are conservative around generic types like <code>T</code>, and you just have to have a where clause in scope that <code>T: Send</code> or <code>T: Sized</code>, etc</p>",
        "id": 203042736,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1594070786
    },
    {
        "content": "<p>For the reference-level explanation, I'm trying to gauge what's involved in going from having a <code>can_transmute</code> intrinsic, to having a trait that represents the same thing. Const-generics provides a long-term in-language answer, but since that's (relatively) far into the future, I'm curious what in-compiler mechanisms there are for this. The implementation of the <code>Freeze</code> trait seems similar, at a glance.</p>",
        "id": 203043120,
        "sender_full_name": "Jack Wrenn",
        "timestamp": 1594071051
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 203105890,
        "sender_full_name": "Jack Wrenn",
        "timestamp": 1594130385
    }
]