[
    {
        "content": "<p>So I was starting to do a kind of <a href=\"https://paper.dropbox.com/doc/Chalk-The-High-level-Design-Plan--AWqnTYZfXC0kz4moamYpPM69Ag-jLJCz6gwy2J7kmbp9Znxr\" target=\"_blank\" title=\"https://paper.dropbox.com/doc/Chalk-The-High-level-Design-Plan--AWqnTYZfXC0kz4moamYpPM69Ag-jLJCz6gwy2J7kmbp9Znxr\">\"High-level Design Plan\" background doc for the Chalk Integration meeting</a>... except that I know I am repeating material from the rustc-guide. (I didn't get <em>super</em> far yet, was mostly \"playing around\" to try and decide what I want to include)</p>\n<p>Maybe it's better to just point folks at the rustc-guide, except that at least <em>some</em> of the plans that <span class=\"user-mention\" data-user-id=\"131694\">@scalexm</span> and I were discussing are ever-so-slightly different than what is there. But then again I feel like it's useful to have a kind of \"outline\" for what we would discuss in the meeting.</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"116883\">@tmandry</span>, who was writing high-level docs as I recall.</p>",
        "id": 157226509,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1548885423
    },
    {
        "content": "<p>I'll probably poke at it a bit more later and try to at least get the \"outline\" more in place</p>",
        "id": 157226534,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1548885442
    },
    {
        "content": "<p>I think it could be healthy to continue iterating on how we talk about this stuff at a high level :)</p>",
        "id": 157227023,
        "sender_full_name": "tmandry",
        "timestamp": 1548885725
    },
    {
        "content": "<p>in particular, knowing what \"level\" to write the rustc guide at has been somewhat of a challenge in the past, I'd say</p>",
        "id": 157227123,
        "sender_full_name": "tmandry",
        "timestamp": 1548885804
    },
    {
        "content": "<p>and iterating within the existing structure is harder</p>",
        "id": 157227129,
        "sender_full_name": "tmandry",
        "timestamp": 1548885811
    },
    {
        "content": "<p>that said, you could send people to the guide. my main worry would be that the traits chapter is just <em>long</em></p>",
        "id": 157227305,
        "sender_full_name": "tmandry",
        "timestamp": 1548885957
    },
    {
        "content": "<p>but I'm sure that cherry-picking the right sections would alleviate that</p>",
        "id": 157227443,
        "sender_full_name": "tmandry",
        "timestamp": 1548886052
    },
    {
        "content": "<p>also, the content you have in the paper doc looks nice, it would be good to incorporate into the guide somehow</p>",
        "id": 157227541,
        "sender_full_name": "tmandry",
        "timestamp": 1548886119
    }
]