[
    {
        "content": "<p>I am trying to get rid of vacant entries in vtable to reduce vtable size. Currently PR <a href=\"https://github.com/rust-lang/rust/issues/88552\">#88552</a> is filed to remove non-object-safe methods from vtable.</p>\n<p>During the implementation I noticed about the only other piece of code that creates a vacant entry via <code>impossible_predicates</code>. The comment points me to <a href=\"https://github.com/rust-lang/rust/issues/23435\">#23435</a>, and trying the code now gives a <code>where_clauses_object_safety</code> warning (<a href=\"https://github.com/rust-lang/rust/issues/51443\">#51443</a>). Would this code path ever be exercised after if <a href=\"https://github.com/rust-lang/rust/issues/51443\">#51443</a> is made a hard error?</p>\n<p>Also, I am wondering whether it'll be worthwhile to separate the vtable creation into two passes. Instead of going through each <code>PolyTraitRef</code> and create a vtable structure, we should probably first go through determine a fixed vtable shape for each <code>PolyExistentialTraitRef</code> and then instantiate that vtable for each concrete self ty. In that sense we don't need to do ad hoc computation of vtable entry index and count, etc, and the vtable shape of each <code>PolyExistentialTraitRef</code> would be the ground truth that everything else can base on.</p>",
        "id": 251589052,
        "sender_full_name": "Gary Guo",
        "timestamp": 1630513905
    },
    {
        "content": "<p>I've updated <a href=\"https://github.com/rust-lang/rust/issues/88552\">#88552</a> to have a <code>own_existential_vtable_entries</code> query that returns the shape of vtable based on <code>PolyExistentialTraitRef</code>, and make it the single source of truth for own vtable entries. Currently I just specify it to return <code>[DefId]</code> because own vtable entries can only be methods. I wonder if I would be better to introduce a new type similar to <code>VtblEntry</code> (I am not sure about what the name would be for such a new type though)? Further more, would it make sense to have <code>existential_vtable_entries</code> query and have <code>vtable_entries</code> call into it and just instantiate all entries?</p>\n<p><span class=\"user-mention\" data-user-id=\"116458\">@Charles Lew</span> since you work a lot on these code bases for trait upcasting I am curious about your opinion.</p>",
        "id": 251900860,
        "sender_full_name": "Gary Guo",
        "timestamp": 1630683960
    },
    {
        "content": "<p>I think reducing or even completely removing <code>Vacant</code> entry usages is a good thing. </p>\n<p>About adding new types and queries to describe the vtable entries though, i wonder if it's possible to replace the current queries instead of adding new ones?</p>",
        "id": 251908050,
        "sender_full_name": "Charles Lew",
        "timestamp": 1630686856
    },
    {
        "content": "<p>I'll have a look.</p>",
        "id": 251910076,
        "sender_full_name": "Gary Guo",
        "timestamp": 1630687812
    },
    {
        "content": "<p>But we might not yet be ready to repalce current query, since we still need to decide if it an entry is vacant or not based on concrete type, due to <a href=\"https://github.com/rust-lang/rust/issues/51443\">#51443</a>.</p>",
        "id": 251910355,
        "sender_full_name": "Gary Guo",
        "timestamp": 1630687930
    },
    {
        "content": "<p>So it seems eliminating vacant entries in vtables is fundamentally impossible(since the concrete type is still participating at the moment), and the plan here would be simply reducing the amount of vacant entries? From user's point of view, this is harder to predict the behavior than before. So maybe instead of inferring from type system, maybe user annotation is actually better? Something like <code>#[rustc_exclude_from_vtable]</code> on trait associated functions.</p>",
        "id": 251978331,
        "sender_full_name": "Charles Lew",
        "timestamp": 1630737524
    },
    {
        "content": "<p>No, I don't user should do any annotation. A non-object-safe method should never be included in the vtable. The fact we cannot eliminate vacant entries is just a hint of current state of unsoundness.</p>",
        "id": 252011642,
        "sender_full_name": "Gary Guo",
        "timestamp": 1630773207
    },
    {
        "content": "<p>Well, i'm less sure about this aspect. To me vtable is just a piece of metadata designated for trait object values. There's really nothing preventing it from storing data for all associated consts, types, and functions, other than current language rules. I'd imagine rules changing quite soon for async traits etc.</p>",
        "id": 252140352,
        "sender_full_name": "Charles Lew",
        "timestamp": 1630915341
    }
]