[
    {
        "content": "<p>I need some guidance on chalk's stance on extralogical reasoning. For example, reasoning about struct fields is extralogical in the current implementation (WF program clauses do not consider fields, only WfSolver does). Where does the boundary lie?</p>",
        "id": 193279253,
        "sender_full_name": "Areredify",
        "timestamp": 1586326925
    },
    {
        "content": "<p>The reason Im interested is the Drop trait implementation: my current solution is to prohibit downstream implementations because from the Drop constraints we know that you can only implement Drop for your own structs. But I would really like inability to implement Drop in downstream crates to be deducted, not given.</p>",
        "id": 193452381,
        "sender_full_name": "Areredify",
        "timestamp": 1586440166
    },
    {
        "content": "<p>So, I don't have a ton of time to answer here just now, will try to elaborate more, but...</p>\n<p>The way I see it, chalk has three 'main parts':</p>\n<ul>\n<li>The lower level logical engine, which interprets the clauses and goals it is given. </li>\n<li>The translation from Rust syntax to those predicates. This layer, in effect, gives the \"semantics\" for the Rust trait system.</li>\n<li>The definition of well-formedness rules for Rust items in terms of predicates.</li>\n</ul>\n<p>I think that it is the job of the \"translation\" and \"well-formedness\" layers to be \"self-consistent\", in some sense. Just expressing things in logical predicate form doesn't <em>by itself</em> mean that those predicates make any particular sense. </p>\n<p>But it's totally valid to have some translation rules that only make sense because we know that the wf predicates will have to be proven. (Implied bounds totally rely on this concept, for example.)</p>",
        "id": 193618989,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1586553637
    },
    {
        "content": "<p>So I think what I'm saying is \"yes that sort of extralogical reasoning is fine\"</p>",
        "id": 193619029,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1586553658
    }
]