[
    {
        "content": "<p>Hey <span class=\"user-group-mention\" data-user-group-id=\"692\">@WG-traits</span> -- I don't think I can do the meeting this week or next week. This week i'm kind of swamped with stuff and trying to dig my way out, and next week I'll be traveling. I'm going to delete the \"video calls\", at least. But if folks want to leave async updates in this topic, that sounds good, and I'll try to respond.</p>",
        "id": 165546392,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1557766343
    },
    {
        "content": "<p>I have no updates this week <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 165551668,
        "sender_full_name": "centril",
        "timestamp": 1557770017
    },
    {
        "content": "<p>I've been working on reorganizing crates (<a href=\"https://github.com/rust-lang/chalk/pull/225\" target=\"_blank\" title=\"https://github.com/rust-lang/chalk/pull/225\">this PR</a>); making chalk-solve the main crate and splitting out crates for tests and Chalki.</p>\n<p>In the process, there were some problems with circular dependencies, but after moving some files from the tests and chalk-solve to a new chalk-integration crate (used by tests and Chalki), it feels like things are in place a bit more.</p>\n<p>For this week I'm planning to look at the test organization. Not sure yet how to tackle that exactly, but I'll figure something out.</p>",
        "id": 165553648,
        "sender_full_name": "detrumi",
        "timestamp": 1557771207
    },
    {
        "content": "<p>At first I thought moving all those crates around would break stuff, but rust-analyzer won't need any changes after my PR, so that's a good sign</p>",
        "id": 165553888,
        "sender_full_name": "detrumi",
        "timestamp": 1557771351
    },
    {
        "content": "<p>Figures... the one week I can make hehe. Anyway, been working on the trait aliases PR some more and also tinkering around with upcasting, but not going too quickly, mainly due to illness.</p>",
        "id": 165556647,
        "sender_full_name": "Alexander Regueiro",
        "timestamp": 1557772946
    }
]