[
    {
        "content": "<p>Hey <span class=\"user-group-mention\" data-user-group-id=\"692\">@WG-traits</span> -- it's a holiday here in the US so I won't be around today again. Sorry about that. The good news is that I expect to be more responsive starting tomorrow. Feel free to have the meeting today or not, I'll try to catch up.</p>\n<p>For my part, I do have one thing to announce: on the plane ride coming home from <a href=\"https://pliss2019.github.io/\" target=\"_blank\" title=\"https://pliss2019.github.io/\">PLISS</a> I spent some time thinking about the \"non-enumerable\" problem. I didn't like my previous solution for various reasons -- I'm not sure how much I had enumerated (no pun intended) the problems I was seeing there, but suffice to say I didn't think it was going to work. The good news is that I came up with another approach for dynamically reordering things. I implemented it on the plane and it seems to be working well. I'm going to try to write-up the idea -- it seems so simple that surely somebody else has already done it somewhere -- but the TL;DR is that the callback for returning the program clauses to solve a goal (e.g., <code>?T: Sized</code>) now returns an <code>Option&lt;Vec&lt;...&gt;&gt;</code> instead of just a <code>Vec&lt;..&gt;</code>. If you return <code>None</code>, it is called \"floundering\" and it means that we cannot (or choose not...) generate the full set of rules, more type information is needed (a sort of ambiguous result). This propagates back up the query as far as needed.</p>",
        "id": 166632860,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1558960188
    },
    {
        "content": "<p>If you're curious, the work is on <a href=\"https://github.com/nikomatsakis/chalk-ndm/tree/flounder\" target=\"_blank\" title=\"https://github.com/nikomatsakis/chalk-ndm/tree/flounder\">the \"flounder\" branch in my fork</a></p>",
        "id": 166632928,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1558960230
    },
    {
        "content": "<p>The term \"floundering\" comes from the fact that if the SLG solver is forced to solve a negative goal that contains unbound variables, like <code>not { ?T: Debug }</code>, it is said to have \"floundered\" -- in general, the idea is to wait to solve such goals until <code>?T</code> is known. This is basically what my branch does for things like <code>?T: Sized</code> -- it defers solving them until later, when <code>?T</code> would be known. If <code>?T</code> never becomes known, then the whole table \"flounders\" and pushes the problem further up.</p>",
        "id": 166633134,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1558960418
    },
    {
        "content": "<p>Awesome! We definitely have non-enumerable things in spades in rust-analyzer :)</p>",
        "id": 166633278,
        "sender_full_name": "matklad",
        "timestamp": 1558960554
    },
    {
        "content": "<p>yeah, sorry I've not been responding to the \"fuel\" conversation, I'll try to get on that</p>",
        "id": 166636163,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1558962934
    }
]