[
    {
        "content": "<p>Hey <span class=\"user-group-mention\" data-user-group-id=\"692\">@WG-traits</span> -- I can't make the meeting today -- or, rather, <em>maybe</em> I can, I have an urgent personal errand to do and I'm not sure how long it's going to take. My main update is that I plan to do some reviews of various PRs, and get back to <span class=\"user-mention\" data-user-id=\"124069\">@Alexander Regueiro</span> regarding the trait upcasting PR. <span class=\"user-mention\" data-user-id=\"117350\">@Sunjay Varma</span> and I had a good conversation about specialization, as well.</p>\n<p>Actually, next week I'm going to be on vacation until mid-August, so I'm inclined to say that \"WG-Traits\" should go \"on hiatus\" until the fall (i.e., no standing meeting). I do plan to be doing some experiments and thinking because if we're going to start back up again I want to come back with a more complete plan this time.</p>\n<p>(In any case, even if there are no standing meetings I'd like to make some progress on smaller things.)</p>\n<p>Thoughts?</p>",
        "id": 169876873,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1562598032
    },
    {
        "content": "<p>Sounds good! Enjoy your vacation! You deserve a break <span aria-label=\"smile\" class=\"emoji emoji-263a\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 169876935,
        "sender_full_name": "Sunjay Varma",
        "timestamp": 1562598089
    },
    {
        "content": "<p>Makes sense; enjoy the vaction <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 169876953,
        "sender_full_name": "centril",
        "timestamp": 1562598102
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> Sounds good to me, thanks. I won't be able to make it anyway (as usual), but I look forward to the review and maybe more thoughts on the trait upcasting PR.</p>",
        "id": 169883773,
        "sender_full_name": "Alexander Regueiro",
        "timestamp": 1562603457
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> Just a reminder that  I still need some guidance for implementing  the check for <code>impl Trait</code> and  <code>dyn Trait</code> on the chalk solver</p>",
        "id": 169894195,
        "sender_full_name": "Keith Yeung",
        "timestamp": 1562611426
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> Also, maybe you can work impl-trait-in-bindings into your ponderings? I kind of feel it makes most sense to leave this to you in your own time to implement, since there would be a lot of wasted effort bringing me up to speed on everything and collating your notes, probably.</p>",
        "id": 170409985,
        "sender_full_name": "Alexander Regueiro",
        "timestamp": 1562627543
    }
]