[
    {
        "content": "<p>As a warning <span class=\"user-group-mention\" data-user-group-id=\"692\">@WG-traits</span> -- I may have to cancel the design meetings over the next two weeks. </p>\n<p>This coming Monday I am planning to spend some time focused on Polonius. This <em>may</em> make it an ideal week to talk about how we handle regions and lifetimes in chalk, but it may also be too busy, since there are other things to stay on top of.</p>\n<p>The week after that, I'll be on vacation in Iceland. <span aria-label=\"airplane\" class=\"emoji emoji-2708\" role=\"img\" title=\"airplane\">:airplane:</span></p>",
        "id": 180906653,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1573899771
    },
    {
        "content": "<p>I also want to discuss our bigger plans a bit. I've been slowly drawing up notes in the background on what a good action plan is for the newer style of chalk-rustc integration I'm envisoning and so forth. I think it's pretty important to come to a roadmap for this group. I'm also wondering about \"co-leadership\" (particularly after our discussion in compiler team design meeting yesterday (eep, reminder to self to publish the notes)).</p>",
        "id": 180906669,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1573899826
    },
    {
        "content": "<p>I guess I don't want to jump to talking of co-leads, really, though if there are people who think they might enjoy trying to help keep things organized and on track, let's talk -- but mainly I am thinking about the roadmap and how to get that planning more active. Perhaps this is the best topic to discuss in the next few design meetings, trying to work on a shared roadmap document of some kind. Anyway, happy to get hear thoughts :) I gotta run for now anyway.</p>",
        "id": 180906772,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1573899974
    },
    {
        "content": "<p>(I think the resolution of this is going to be: today's meeting will start a bit early, and discuss rustc-chalk integration, <a href=\"#narrow/stream/144729-wg-traits/topic/rustc-chalk.20integration.2C.20take.202\" title=\"#narrow/stream/144729-wg-traits/topic/rustc-chalk.20integration.2C.20take.202\">over in this topic</a>).</p>",
        "id": 181043305,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1574102495
    }
]