[
    {
        "content": "<p>I’m just starting to learn rust, and almost immediately wanted some proposed features (like implied trait bounds) that are blocked on switching to chalk.  I have experience with type systems and logics, so I thought it would be interesting to try out a development version if there is one, and maybe help out with the development once I have some more rust experience.  I’ve started reading the chalk book and the developers guide, but it’s unclear to me whether there is a prototype or how to use it.  Any advice?</p>",
        "id": 237072731,
        "sender_full_name": "Michael George",
        "timestamp": 1619981170
    },
    {
        "content": "<p>So, you can play with the experimental chalk integration in rustc using the <code>-Z chalk</code> flag. But I have to warn you: you will probably run into more things that <em>don't</em> work than do</p>",
        "id": 237073723,
        "sender_full_name": "Jack Huey",
        "timestamp": 1619982140
    },
    {
        "content": "<p>If you interested more in the Chalk side of things, there are integration tests and a REPL in the chalk <a href=\"https://github.com/rust-lang/chalk\">repo</a> itself that you can play with</p>",
        "id": 237073812,
        "sender_full_name": "Jack Huey",
        "timestamp": 1619982225
    },
    {
        "content": "<p>Thanks!  Is the -Z flag aiming to reproduce the current rust behavior, or to extend it with features that aren’t supported yet?</p>",
        "id": 237082372,
        "sender_full_name": "Michael George",
        "timestamp": 1619989234
    },
    {
        "content": "<p>Currently just trying to reproduce current behavior</p>",
        "id": 237084064,
        "sender_full_name": "Jack Huey",
        "timestamp": 1619989742
    },
    {
        "content": "<p>It would be hard to experiment with new features, since there are so many things that <em>don't</em> work</p>",
        "id": 237084163,
        "sender_full_name": "Jack Huey",
        "timestamp": 1619989781
    }
]