[
    {
        "content": "<p>So I created <a href=\"https://github.com/rust-lang/wg-traits/projects/2\" target=\"_blank\" title=\"https://github.com/rust-lang/wg-traits/projects/2\">this github project</a> for \"rustc integration based on chalk-solve\" and started populating it with cards.</p>",
        "id": 184960861,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1578347721
    },
    {
        "content": "<p>Later on I'll try to go over the chalk issues and either close them, or link to cards, or maybe create new ones</p>",
        "id": 184960883,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1578347747
    },
    {
        "content": "<p>But if folks are interested in pushing on this, it might be worth skimming over</p>",
        "id": 184960991,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1578347821
    },
    {
        "content": "<p>One interesting question that I am pondering: my hope is that we'll develop a nice, ergonomic type library that is eventually just \"the library\" that we use for rust types, with the role of the <code>TypeInterner</code> trait being really <em>just</em> to define what kind of memory management strategy we want (and maybe to help us in code management, by letting us differentiate between \"input\" and \"output\" types and things).</p>",
        "id": 184961103,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1578347889
    },
    {
        "content": "<p>That suggests that some details -- like the set of <code>TypeName</code> values, and perhaps ABIs for fn types -- really ought to be defined in chalk-ty and not \"customizable\"</p>",
        "id": 184961120,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1578347909
    },
    {
        "content": "<blockquote>\n<p>But if folks are interested in pushing on this, it might be worth skimming over</p>\n</blockquote>\n<p>For sure, I can imagine it being a useful starting point for weekly syncs</p>",
        "id": 185144021,
        "sender_full_name": "detrumi",
        "timestamp": 1578509460
    },
    {
        "content": "<p>I think I'll just start with the Alias rename, since that's a pretty straightforward change</p>",
        "id": 185144080,
        "sender_full_name": "detrumi",
        "timestamp": 1578509494
    }
]