[
    {
        "content": "<p>Hi all, I'm a student currently working on a project related to the trait system. I am relatively new to Rust in general but will need to be able to use something like chalk to perform queries on input code. I have read through much of the chalk book, but most of the examples contained therein rely on using the repl to demonstrate. Is there a way to use the premade implementations in  chalk_integration/ or import them into my project without having to copy the files over wholesale? Or will I need to write my own interners, databases and the like in order to do my tests? Apologies if this is the wrong place to ask!</p>",
        "id": 270230511,
        "sender_full_name": "JosephBond",
        "timestamp": 1643729739
    },
    {
        "content": "<p>Copying the files or adding a <code>git</code> dependency wouldn't be that bad. But do you want to run queries against real Rust code?</p>",
        "id": 270232155,
        "sender_full_name": "Laurențiu",
        "timestamp": 1643730228
    },
    {
        "content": "<p>If needs must, then yeah I can copy those files over yes. The intention is to run queries on small portions of real code, but I wanted to prototype things using chalk to demonstrate to my teammates how we might want things to look</p>",
        "id": 270234365,
        "sender_full_name": "JosephBond",
        "timestamp": 1643730939
    },
    {
        "content": "<p>So, Chalk's builtin \"testing infra\" doesn't actually parse \"real\" Rust code - it's a close approximation</p>",
        "id": 270248452,
        "sender_full_name": "Jack Huey",
        "timestamp": 1643735592
    },
    {
        "content": "<p>You would either have to look at rust-analyzer's code and dump a chalk program (I dont remember how this is done, but I think it mostly works). Or that functionality would have to be implemented into rustc</p>",
        "id": 270248716,
        "sender_full_name": "Jack Huey",
        "timestamp": 1643735673
    },
    {
        "content": "<p>If you don't mind using the pseudo-Rust code, then I would look at the test/mod.rs file for an example of how to parse/solve that</p>",
        "id": 270248874,
        "sender_full_name": "Jack Huey",
        "timestamp": 1643735738
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"232957\">Jack Huey</span> <a href=\"#narrow/stream/144729-wg-traits/topic/Using.20Chalk.20as.20a.20library/near/270248716\">said</a>:</p>\n<blockquote>\n<p>You would either have to look at rust-analyzer's code and dump a chalk program (I dont remember how this is done, but I think it mostly works). Or that functionality would have to be implemented into rustc</p>\n</blockquote>\n<p><code>CHALK_DEBUG</code>, I think, but I've never used it.</p>",
        "id": 270266899,
        "sender_full_name": "Laurențiu",
        "timestamp": 1643742307
    }
]