[
    {
        "content": "<p>It's pretty clear from the survey that people still find Rust difficult to learn. However, there are a few things that are not so clear:</p>\n<ul>\n<li><em>Who</em> finds it difficult to learn? Is there a gap between C/C++ devs and others? </li>\n<li><em>What</em> exactly is difficult to learn? Is it ownership? Async? etc.</li>\n<li><em>How</em> difficult is it? Is the learning curve steep but quick or a long slog?</li>\n</ul>",
        "id": 216585011,
        "sender_full_name": "rylev",
        "timestamp": 1605259617
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224872\">@Ryan Levick</span> do you feel like that data is in the survey (and we should do more cross-indexing to try and unearth it), or have we done enough and it's not clear</p>",
        "id": 216624032,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1605280208
    },
    {
        "content": "<p>I'm not sure if the data we've collected can give us a really good view on this, but I do think we can get a better picture than we have no with more analysis. I'll come up with the questions we should ask of the data</p>",
        "id": 216624631,
        "sender_full_name": "rylev",
        "timestamp": 1605280527
    },
    {
        "content": "<p>I think it's a really good idea btw to write out questions we might want to explore in follow-up surveys or next year</p>",
        "id": 216626279,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1605281241
    },
    {
        "content": "<p>We need a survey team :)</p>",
        "id": 216626300,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1605281252
    },
    {
        "content": "<p>Part of the problem is that Rust not only has an extremely high skill ceiling (which many languages have), but also that you <em>immediately</em> notice the high skill ceiling. C and Java and Python do get super complex in practice, as you build large projects and juggle a lot of things, but Rust can get super complex in like a single line of code.</p>",
        "id": 216710384,
        "sender_full_name": "Lokathor",
        "timestamp": 1605335003
    },
    {
        "content": "<p>Most of the questions I field about Rust aren't questions that fit neatly under a chapter title in a book about Rust. Because Ownership (or whatever) is obvious enough, but it's the fine details when two \"parts\" of Rust interact where all the questions usually arise.</p>",
        "id": 216710451,
        "sender_full_name": "Lokathor",
        "timestamp": 1605335105
    },
    {
        "content": "<p>As to the third bullet point: I'd say that almost every question I see asked gets answered fairly quickly, up until you start pushing into the realm of libs based question (eg: i'm using tokio, how do i X?) or the bleeding edge of the language (eg: what happens with my unsafe code when I X?). People are usually not left confused about a particular issue for extended periods of time. Working with Rust is mostly well enough compartmentalized that you can discover problems and solve problems in a little portions at a time, which i <em>think</em> means that the learning curve is best thought of as being a fairly shallow slope overall.</p>",
        "id": 216710726,
        "sender_full_name": "Lokathor",
        "timestamp": 1605335588
    },
    {
        "content": "<p>I think one issue is that people have a certain definition of learnability that is unfavorable to Rust. In many languages you can become \"productive\" in terms of writing a lot of code, which might be very, very buggy, but you're at least doing something. Rust tends to put the breaks on you and force you to understand why your code might be incorrect before even letting you compile it.</p>",
        "id": 216864497,
        "sender_full_name": "rylev",
        "timestamp": 1605529950
    },
    {
        "content": "<p>Ryan, your theory makes sense to me. Most people I know that have had significant difficulty feeling productive in Rust have been banging their heads trying to write code very similar to what they have done before, without realizing or wanting to deal with the fact that what they wrote was incorrect.</p>",
        "id": 216879175,
        "sender_full_name": "Erich Gubler",
        "timestamp": 1605537550
    },
    {
        "content": "<p>They'll often get bogged down questioning the usefulness of blocking the compilation of code  they've always been able to write.</p>",
        "id": 216879244,
        "sender_full_name": "Erich Gubler",
        "timestamp": 1605537585
    },
    {
        "content": "<p>I say this with experience running a local Rust meetup here in Utah, USA, and mentoring several people online.</p>",
        "id": 216879346,
        "sender_full_name": "Erich Gubler",
        "timestamp": 1605537623
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"224872\">Ryan Levick</span> <a href=\"#narrow/stream/249854-t-community.2Frust-survey-2020/topic/Learnability/near/216864497\">said</a>:</p>\n<blockquote>\n<p>In many languages you can become \"productive\" in terms of writing a lot of code, which might be very, very buggy, but you're at least doing something.</p>\n</blockquote>\n<p>This is very insightful. People are used to jot down a prototype and then iterate to refine and improve until the budget allows, that's not unheard in our field. Another aspect that perhaps was not explicited by the \"learnability\" answers is that many find difficult to prototype half-baked stuff, not out of \"laziness\" but because they need to. Case in point: in two days I have a demo of an MVP. Customer asks me to rush an API for the demo. It will be fun doing that in Rust.</p>",
        "id": 217110044,
        "sender_full_name": "apiraino",
        "timestamp": 1605690333
    }
]