[
    {
        "content": "<p>So <span class=\"user-mention\" data-user-id=\"120791\">@RalfJ</span> (or others) I was thinking over our conversation from yesterday. I went looking to read up on what the rules for noalias -- vague or ill-specified as they may be -- are. I didn't find much. From <a href=\"http://llvm.org/docs/LangRef.html\" target=\"_blank\" title=\"http://llvm.org/docs/LangRef.html\">the language reference manual</a> I see:</p>\n<blockquote>\n<p>This indicates that objects accessed via pointer values based on the argument or return value are not also accessed, during the execution of the function, via pointer values not based on the argument or return value. The attribute on a return value also has additional semantics described below. The caller shares the responsibility with the callee for ensuring that these requirements are met. For further details, please see the discussion of the NoAlias response in alias analysis.</p>\n</blockquote>\n<p>Clicking through to the discussion of \"no-alias\" doesn't add a lot of detail.</p>\n<p><em>Ah</em>, writing this comment has helped clarify my confusion I think. What I was wondering about was: why aren't<code>*mut</code> values to the generator considered to conflict with a <code>&amp;mut</code> to some interior field <code>X</code> (from LLVM's POV)? And the answer, I think, is that the <code>*mut</code> isn't used to access that field <code>X</code> (i.e., the LLVM definition is based solely on the \"objects accessed\").</p>\n<p>I guess the next question is what LLVM means when it says <em>objects</em>. That is, what is the granularity of a conflict -- byte ranges? word ranges? etc. I naively interpret that pretty broadly (e.g., the entire struct), in which case it seems like there is still a problem, but I suspect that the language above may be overly broad. I guess the question would be in what situation LLVM might synthesize access to fields of memory that was not originally accessed?</p>",
        "id": 174539272,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1567168271
    },
    {
        "content": "<blockquote>\n<p>naively interpret that pretty broadly (e.g., the entire struct)</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span>  IIUC this interpretation is correct. E.g. when accessing e.g. <code>&amp;self.field</code> we tell LLVM that <code>Self</code> is some struct, that <code>&amp;self</code> is a pointer to <code>Self</code> that is <code>noalias</code>, <code>dereferenceable(sizeof(struct))</code>, etc. and that the <code>.field</code> access is <code>inbounds</code> of that struct. IIRC, the LLVM docs cover this in the <code>getelementptr</code> section, and its <code>inbounds</code> subsection.</p>",
        "id": 174549356,
        "sender_full_name": "gnzlbg",
        "timestamp": 1567175218
    },
    {
        "content": "<p>IIUC the problem is that we access some fields of the generator using such an approach, while simultaneoulsy using a pointer not derived from <code>&amp;self</code> to mutate the contents of the struct.</p>",
        "id": 174549510,
        "sender_full_name": "gnzlbg",
        "timestamp": 1567175319
    },
    {
        "content": "<p>\"derived from\" here means <a href=\"http://llvm.org/docs/LangRef.html#pointeraliasing\" target=\"_blank\" title=\"http://llvm.org/docs/LangRef.html#pointeraliasing\">\"based on\"</a>?</p>",
        "id": 174553216,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1567177755
    },
    {
        "content": "<p>I guess I have to go refresh my memory as to what the MIR etc looks like, but I'm (naively) assuming that resuming a generator is something like:</p>\n<ul>\n<li>load discriminant to find which await we are at</li>\n<li>branch to that place</li>\n<li>load the values of local variables from various fields</li>\n</ul>\n<p>I suppose what we could alternatively do is to rewrite local variables to directly access from <code>self</code>, so that we are not using the stack. </p>\n<p>Either way, if there is some local variable of type <code>&amp;mut</code> (which points elsewhere in the struct), then at some point we'll have something sort of like:</p>\n<div class=\"codehilite\"><pre><span></span><span class=\"n\">p</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"bp\">self</span><span class=\"p\">.</span><span class=\"n\">stored_value_of_p</span><span class=\"w\"></span>\n</pre></div>\n\n\n<p>and I guess that <code>p</code> is not considered \"based on\" <code>self</code> here? The LLVM definition made it sound specific to GEP -- i.e., I didn't see loads -- though I guess you could insert an <code>inttoptr</code> to kind of alter things.</p>",
        "id": 174553575,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1567177996
    },
    {
        "content": "<p>I guess I should go re-read the original comments more closely.</p>",
        "id": 174553581,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1567178003
    },
    {
        "content": "<p>(Separately and relatedly, I do wonder if \"alias sets\" or other bits of LLVM metadata give us a bit more expressive power)</p>",
        "id": 174553621,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1567178031
    },
    {
        "content": "<p>I think \"object\" can in particular also be a \"subobject\" here</p>",
        "id": 174556355,
        "sender_full_name": "RalfJ",
        "timestamp": 1567179904
    },
    {
        "content": "<p>so that effectively makes it byte-level</p>",
        "id": 174559626,
        "sender_full_name": "RalfJ",
        "timestamp": 1567182035
    },
    {
        "content": "<blockquote>\n<p>and I guess that p is not considered \"based on\" self here? The LLVM definition made it sound specific to GEP -- i.e., I didn't see loads -- though I guess you could insert an inttoptr to kind of alter things.</p>\n</blockquote>\n<p>it would be rather strange IMO when a pointer stored in memory would be \"based on\" the pointer used to load it</p>",
        "id": 174559627,
        "sender_full_name": "RalfJ",
        "timestamp": 1567182035
    },
    {
        "content": "<p>also we already assume that text is wrong: we assume it is also okay to have many accesses to the same object through different pointers that are all <code>noalias</code>, as long as all accesses are reads...</p>",
        "id": 174559628,
        "sender_full_name": "RalfJ",
        "timestamp": 1567182035
    },
    {
        "content": "<p>I think that also would be a fairly ill-behaved semantics</p>",
        "id": 174559629,
        "sender_full_name": "RalfJ",
        "timestamp": 1567182035
    },
    {
        "content": "<p>you want the round-trip of storing a ptr in memory and loading it again to leave that ptr unchanged, not make it acquire new provenance from the ptr used to store/load the ptr</p>",
        "id": 174578733,
        "sender_full_name": "RalfJ",
        "timestamp": 1567195887
    }
]