[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120791\">@RalfJ</span> I read your comment <a href=\"https://github.com/rust-lang/rfcs/pull/2582#discussion_r237383311\" target=\"_blank\" title=\"https://github.com/rust-lang/rfcs/pull/2582#discussion_r237383311\">https://github.com/rust-lang/rfcs/pull/2582#discussion_r237383311</a> but it is still not clear to me. </p>\n<p>The RFC adds a migration path for people using <code>repr(packed)</code> today, does the RFC also turns this warning into an error?</p>\n<p>I think that when the hole thing is over we should write a post-mortem about <code>repr(packed)</code> because what has happened is pretty much an example of how not to deal with an <code>I-Unsound</code> bug IMO.</p>",
        "id": 148773026,
        "sender_full_name": "gnzlbg",
        "timestamp": 1543480981
    },
    {
        "content": "<blockquote>\n<p>does the RFC also turns this warning into an error?</p>\n</blockquote>\n<p>No, I wanted to keep the RFC focused on the \"create raw ref\" operation. But if people think that makes more sense, I'd be happy to extend it to also finalize our story around errors/lints for references to packed fields.</p>",
        "id": 148773639,
        "sender_full_name": "RalfJ",
        "timestamp": 1543481867
    },
    {
        "content": "<p>So I agree with that. Turning those into errors is an orthogonal problems, one has to figure a time line, and none of that is relevant to the RFC.</p>",
        "id": 148774753,
        "sender_full_name": "gnzlbg",
        "timestamp": 1543483388
    },
    {
        "content": "<p>It was a bit unclear to me from the wording, because it appeared that the RFC does make this an error for <code>unsafe</code> code.</p>",
        "id": 148774807,
        "sender_full_name": "gnzlbg",
        "timestamp": 1543483445
    },
    {
        "content": "<p>You can resolve my comment, I don't need the text to be amended with any clarification: your word is enough, and I trust that you don't want to turn the RFC discussion into a discussion about how to phase these errors in.</p>",
        "id": 148774887,
        "sender_full_name": "gnzlbg",
        "timestamp": 1543483616
    }
]