[
    {
        "content": "<p>I am considering doing a nomicon docs push for the 2018 release, taking input on desired topics to add or reinforce. Also interested in any discussion of what should be in the nomicon vs the reference (originally the nomicon was written as a partial replacement for the reference, when it was a tire fire, but now the reference is coming together?)</p>",
        "id": 147318016,
        "sender_full_name": "Gankra",
        "timestamp": 1541700829
    },
    {
        "content": "<p>NLL and Futures and/or all of async seem like good candidates. Someone already has a PR up to try to introduce NLL stuff into the nomicon, haven't reviewed it yet.</p>",
        "id": 147318217,
        "sender_full_name": "Gankra",
        "timestamp": 1541701054
    },
    {
        "content": "<p>I am also tempted to add things like some \"safe\" superset of all the reference semantics y'all are considering</p>",
        "id": 147318232,
        "sender_full_name": "Gankra",
        "timestamp": 1541701079
    },
    {
        "content": "<p>like the nasty \"creating a reference asserts the memory is allocated\" issue we have in BTreeMap</p>",
        "id": 147318285,
        "sender_full_name": "Gankra",
        "timestamp": 1541701103
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"137587\">@Gankro</span> I'll write a blog post soon on the aliasing/reference model stuff</p>",
        "id": 147318299,
        "sender_full_name": "RalfJ",
        "timestamp": 1541701126
    },
    {
        "content": "<p>it's coming along real nice :)</p>",
        "id": 147318303,
        "sender_full_name": "RalfJ",
        "timestamp": 1541701133
    },
    {
        "content": "<p>but none of it is normative yet. not sure if it has relevance for the nomicon.</p>",
        "id": 147318324,
        "sender_full_name": "RalfJ",
        "timestamp": 1541701154
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120791\">@RalfJ</span> are the concepts far enough along that they would be a good idea to discuss in the nomicon?</p>",
        "id": 147318339,
        "sender_full_name": "Gankra",
        "timestamp": 1541701171
    },
    {
        "content": "<p>hrm</p>",
        "id": 147318344,
        "sender_full_name": "Gankra",
        "timestamp": 1541701177
    },
    {
        "content": "<p>well that depends on your scope. my plan was a \"call for help\" where I ask people to throw their stuff at miri and see what sticks</p>",
        "id": 147318352,
        "sender_full_name": "RalfJ",
        "timestamp": 1541701197
    },
    {
        "content": "<p>maybe that works better this time than last year because we have miri in the playground</p>",
        "id": 147318413,
        "sender_full_name": "RalfJ",
        "timestamp": 1541701224
    },
    {
        "content": "<p>I think the general concepts are a useful way to think about the rules for references. some of the details might change because we might need special exceptions for a thing or because we can factor away a special exception. but whether the concepts will be what we eventually make normative? no way to know^^</p>",
        "id": 147318441,
        "sender_full_name": "RalfJ",
        "timestamp": 1541701286
    }
]