[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"124289\">@rkruppe</span> can we answer the question about how big can Rust values be here ?</p>",
        "id": 160945777,
        "sender_full_name": "gnzlbg",
        "timestamp": 1552731888
    },
    {
        "content": "<p>the PR documents the bounds that <code>usize</code> sets because of its use on APIs (<code>size_of</code>/<code>size_of_val</code>, <code>[T; N]</code>, <code>ptr.add</code>, etc.) and then it documents the bounds of the current implementation<br>\nbut guaranteeing the size of Rust values feels RFC worthy</p>",
        "id": 160945837,
        "sender_full_name": "gnzlbg",
        "timestamp": 1552731966
    },
    {
        "content": "<p>for an MVP _implementation-defined_ isn't that bad IMO</p>",
        "id": 160945846,
        "sender_full_name": "gnzlbg",
        "timestamp": 1552732014
    },
    {
        "content": "<p>The \"bounds set because of APIs\" angle doesn't really get to the core of the matter because any one of those just means you can't use that API to work with larger data. But the limitations are more fundamental because they also affect e.g. our codegen for primitive operations such as field or array element projection</p>",
        "id": 160945964,
        "sender_full_name": "Hanna Kruppe",
        "timestamp": 1552732209
    },
    {
        "content": "<p>It's useful to document those for sure, but it seems we can't really say anything about the more fundamental limitation without an RFC. Even saying it's impl-defined just punts the issue to the part of the docs that describe rustc's choice of impl-defined parameters, and we can't write those without an RFC either.</p>",
        "id": 160945987,
        "sender_full_name": "Hanna Kruppe",
        "timestamp": 1552732296
    },
    {
        "content": "<p>Well, I suppose almost everything in the UCG is provisional without an RFC ratifying it but still</p>",
        "id": 160946031,
        "sender_full_name": "Hanna Kruppe",
        "timestamp": 1552732324
    },
    {
        "content": "<p>One thing we discussed in the next meeting is identifying things that would be RFC worthy, but not belong in the UCG RFC. I think this would be one of those. I'll just change this from \"implementation-defined\" to \"this is how it currently works\" but this has not been RFC'ed/</p>",
        "id": 160946101,
        "sender_full_name": "gnzlbg",
        "timestamp": 1552732479
    },
    {
        "content": "<p>done, I'll recycle the issue to track a separate RFC for this - we wanted to start triaging these things next week anyways</p>",
        "id": 160946192,
        "sender_full_name": "gnzlbg",
        "timestamp": 1552732670
    }
]