[
    {
        "content": "<p>Cg_clif currently uses a personal fork of rust-ar for writing archive files. This fork is necessary to allow generating the symbol table without using <code>ranlib</code>. This is currently broken on macOS though. In addition because of my fork not being published on <a href=\"http://crates.io\">crates.io</a> <code>./x.py check</code> on the rust repo doesn't work without network access even when vendoring. I would like to replace rust-ar with a rust rewrite of llvm's archive builder. Would it be ok wrt to llvm's license to included it as part of cg_clif's source or should I publish a separate crate on <a href=\"http://crates.io\">crates.io</a>? And if the later should the repo be moved to rust-lang with rust-lang-owner as owner of the crate?</p>",
        "id": 272592276,
        "sender_full_name": "bjorn3",
        "timestamp": 1645363578
    },
    {
        "content": "<p>From a licensing perspective, you could do either, as long as you preserve LLVM's license. I can see other reasons why Rust might prefer one path over the other, but not for licensing reasons.</p>",
        "id": 272601130,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1645373534
    },
    {
        "content": "<blockquote>\n<p>From a licensing perspective, you could do either, as long as you preserve LLVM's license.</p>\n</blockquote>\n<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>\n<blockquote>\n<p>I can see other reasons why Rust might prefer one path over the other</p>\n</blockquote>\n<p>Which option do you think is better?</p>",
        "id": 272601175,
        "sender_full_name": "bjorn3",
        "timestamp": 1645373616
    },
    {
        "content": "<p>I personally think a separate crate would be better.</p>",
        "id": 272601465,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1645373908
    },
    {
        "content": "<p>First, because then you don't have to reflect two different licenses in the crate metadata.</p>",
        "id": 272602218,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1645374725
    },
    {
        "content": "<p>And second, because that sounds like a logically separate module, and one that might end up being useful elsewhere as well.</p>",
        "id": 272602328,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1645374876
    },
    {
        "content": "<p>So to answer your <em>other</em> question, yes, if it's a separate crate I think it should go under rust-lang, and have rust-lang-owner as a backup maintainer.</p>",
        "id": 272602358,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1645374914
    },
    {
        "content": "<p>Thanks</p>",
        "id": 272603685,
        "sender_full_name": "bjorn3",
        "timestamp": 1645376296
    }
]