[
    {
        "content": "<p>We semi-regularly get questions from larger vendors if they can include a copyright attribution when submitting code, presumably to assign copyright to their employer over them personally.</p>\n<p>I personally see no issue in this, but we should come up with a unified form for this.</p>",
        "id": 202356609,
        "sender_full_name": "Florian Gilcher",
        "timestamp": 1593458584
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span> I'm not into the US version of the law, which probably applies: am I missing something?</p>",
        "id": 202356660,
        "sender_full_name": "Florian Gilcher",
        "timestamp": 1593458625
    },
    {
        "content": "<p>The last company in question proposed the commit message as the place of inclusion</p>",
        "id": 202356773,
        "sender_full_name": "Florian Gilcher",
        "timestamp": 1593458670
    },
    {
        "content": "<p>I would prefer that we not have a \"hat\" on files with copyright notices -- we currently mostly don't have that -- and based on past comments my understanding is that means you can copy rust-lang/rust source code into MIT licensed projects without any special care, whereas if you need to check and reproduce copyright notices that becomes somewhat more annoying</p>",
        "id": 202356980,
        "sender_full_name": "simulacrum",
        "timestamp": 1593458794
    },
    {
        "content": "<p>OTOH I don't care much</p>",
        "id": 202356993,
        "sender_full_name": "simulacrum",
        "timestamp": 1593458803
    },
    {
        "content": "<p>I would emphatically argue that we never start down this road.</p>",
        "id": 202358003,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1593459358
    },
    {
        "content": "<p>It results in endless arguments about whether a given piece of work should also have a change to the copyright notice.</p>",
        "id": 202358084,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1593459387
    },
    {
        "content": "<p>We made a point of <em>removing</em> the notices some time ago, and changing that would be a regression.</p>",
        "id": 202358114,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1593459405
    },
    {
        "content": "<p>And yes, adding such notices would mean that any project incorporating Rust (which would potentially include linking to libstd) would need to propagate copyright notices.</p>",
        "id": 202358159,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1593459439
    },
    {
        "content": "<p>The <em>only</em> time I think it makes sense is if we're copying some existing external work into Rust, in which case by necessity we need to preserve the copyright notices.</p>",
        "id": 202358201,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1593459472
    },
    {
        "content": "<p>Interestingly, a quick grep implies we do have some leftover copyright notices in std and the compiler:</p>\n<div class=\"codehilite\"><pre><span></span><code>$ rg &#39;Copyright&#39; -trust src/lib{core,std,rustc_serialize}\nsrc/libcore/slice/memchr.rs\n2:// Copyright 2015 Andrew Gallant, bluss and Nicolas Koch\n\nsrc/libstd/memchr.rs\n2:// Copyright 2015 Andrew Gallant, bluss and Nicolas Koch\n\nsrc/libstd/sys/unix/memchr.rs\n2:// Copyright 2015 Andrew Gallant, bluss and Nicolas Koch\n\nsrc/libstd/sys/cloudabi/abi/cloudabi.rs\n1:// Copyright (c) 2016-2017 Nuxi &lt;https://nuxi.nl/&gt; and contributors.\n\nsrc/libstd/sys/cloudabi/abi/bitflags.rs\n1:// Copyright (c) 2018 Nuxi (https://nuxi.nl/) and contributors.\n\nsrc/libstd/sys/windows/memchr.rs\n2:// Copyright 2015 Andrew Gallant, bluss and Nicolas Koch\n\nsrc/libstd/sys/vxworks/memchr.rs\n2:// Copyright 2015 Andrew Gallant, bluss and Nicolas Koch\n\nsrc/librustc_serialize/json.rs\n2:// Copyright (c) 2011 Google Inc.\n</code></pre></div>",
        "id": 202360275,
        "sender_full_name": "simulacrum",
        "timestamp": 1593460591
    },
    {
        "content": "<p>would perhaps be good to try and drop those (I imagine we can contact the relevant folks)</p>",
        "id": 202360305,
        "sender_full_name": "simulacrum",
        "timestamp": 1593460617
    },
    {
        "content": "<p>though in some cases may not be entirely feasible</p>",
        "id": 202360338,
        "sender_full_name": "simulacrum",
        "timestamp": 1593460637
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span> As far as I understand, the suggested version was putting them in the commit message. From my point of view that would make things easier if we ever have to relicense code included through this patch (as we don't have to contact the author, but the company).</p>",
        "id": 202360873,
        "sender_full_name": "Florian Gilcher",
        "timestamp": 1593460897
    },
    {
        "content": "<p>I agree on anything that impacts the actual source files.</p>",
        "id": 202360894,
        "sender_full_name": "Florian Gilcher",
        "timestamp": 1593460910
    },
    {
        "content": "<p>If a copyright notice is supplied in the commit message that purports to apply to the committed code, it's not at all obvious to me, legally, that we are <em>allowed</em> to omit it from the code or somewhere else that preserves it in any copy we might make.</p>",
        "id": 202361015,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1593460964
    },
    {
        "content": "<p>Also worth noting: commit messages aren't practically editable, so if there were ever an issue, we couldn't fix it.</p>",
        "id": 202361318,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1593461114
    },
    {
        "content": "<p>it seems infeasible to relicense anyway, for most files.</p>\n<p>That said, it seems like the author could communicate that they do not hold the copyright (but rather XYZ does), without a copyright notice? Something like \"I grant XYZ Corp all rights to relicense the changes made in this comment\", though obviously would need to talk to legal about the exact message.</p>",
        "id": 202361375,
        "sender_full_name": "simulacrum",
        "timestamp": 1593461150
    },
    {
        "content": "<p>Yeah. I don't see any reason that someone can't include appropriate \"this commit was written for my employer\" language if their employer desperately wants them to do so.</p>",
        "id": 202361967,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1593461496
    },
    {
        "content": "<p>That said, I'd also love to talk to the people in these companies who believe this is necessary, to understand their concern and try to address it in a simpler way.</p>",
        "id": 202362027,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1593461523
    },
    {
        "content": "<p>But I would, in general, suggest that we have a policy against adding new copyright notices unless we've decided to accept a copy of existing code from some existing published project.</p>",
        "id": 202362251,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1593461677
    }
]