[
    {
        "content": "<p>We publish images to Docker's official image program, but they are currently not explicitly licensed. There's a PR to add in the standard Apache/MIT dual setup, but I'm a bit squeemish on just YOLO merging it: <a href=\"https://github.com/rust-lang/docker-rust/pull/74\">https://github.com/rust-lang/docker-rust/pull/74</a>. Does this seem like a thing we can just do? Do we have to track down all of the previous contributors (there are only 5 including me, so that shouldn't be too hard hopefully)?</p>",
        "id": 232519929,
        "sender_full_name": "Steven Fackler",
        "timestamp": 1617151728
    },
    {
        "content": "<p>It would certainly be appropriate to ping previous contributors and have them leave a comment, give them a minimum week or two to reply.</p>",
        "id": 232522162,
        "sender_full_name": "Lokathor",
        "timestamp": 1617153757
    },
    {
        "content": "<p>Sure, but I am more concerned with \"legally sufficient\" than \"a nice heads up\".</p>",
        "id": 232523317,
        "sender_full_name": "Steven Fackler",
        "timestamp": 1617154703
    },
    {
        "content": "<p>It'd also be good to confirm that MIT/Apache is the appropriate license choice, since Dockerfiles aren't really code in the traditional sense.</p>",
        "id": 232523401,
        "sender_full_name": "Steven Fackler",
        "timestamp": 1617154797
    },
    {
        "content": "<p>Well if there's only 5 of you and you all sign off on the license change then that's certainly sufficient. <br>\nThe only large-scale open source relicensing that I'm aware of having the process written down about is when Dolphin did it: <a href=\"https://dolphin-emu.org/blog/2015/05/25/relicensing-dolphin/\">https://dolphin-emu.org/blog/2015/05/25/relicensing-dolphin/</a></p>",
        "id": 232524300,
        "sender_full_name": "Lokathor",
        "timestamp": 1617155494
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"243558\">@Steven Fackler</span> That licensing is appropriate for the Dockerfile.</p>",
        "id": 232537345,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1617167217
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"243558\">@Steven Fackler</span> For the overall Docker image, you probably need to document that Rust is under MIT/Apache-2.0, dependencies of Rust are under various permissive licenses (with a pointer to <a href=\"https://github.com/rust-lang/rust/blob/master/COPYRIGHT\">https://github.com/rust-lang/rust/blob/master/COPYRIGHT</a> , as incomplete as it is), and the base image you use is under various licenses (with a pointer to whatever base distribution you're using).</p>",
        "id": 232537442,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1617167304
    }
]