[
    {
        "content": "<p>Cranelift may move to a new register allocator in the future[1]. This register allocator is a port of Spidermonkeys register allocator, which is licensed as MPL-2.0. For this reason it has to be MPL-2.0 licensed too. As I understand it, MPL is reciprocal, but not infectious due to only applying to individual files instead of the whole linked program like GPL. Is this an acceptable license for a dependency of cg_clif now that it will be distributed on nightly as rustup component in the near future?</p>\n<p>[1]: <a href=\"https://github.com/bytecodealliance/regalloc2/pull/1\">https://github.com/bytecodealliance/regalloc2/pull/1</a></p>",
        "id": 238024032,
        "sender_full_name": "bjorn3",
        "timestamp": 1620554017
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"327027\">@Chris Fallin</span></p>",
        "id": 238024108,
        "sender_full_name": "bjorn3",
        "timestamp": 1620554096
    },
    {
        "content": "<p>That would be a large change to Rust's licensing policy, as far as I know.</p>\n<p>(Also, please don't use \"infectious\" to describe strong copyleft.)</p>",
        "id": 238050454,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1620582849
    },
    {
        "content": "<p>Given that it isn't a dependency of std, it wouldn't necessarily be a practical problem, but it would nonetheless be a substantial change.</p>",
        "id": 238050482,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1620582904
    },
    {
        "content": "<blockquote>\n<p>(Also, please don't use \"infectious\" to describe strong copyleft.)</p>\n</blockquote>\n<p>I didn't mean it in a negative sense, but I get that it can be interpreted as such. I personally have nothing against GPL. In fact I have used it as license for several of my own projects.</p>",
        "id": 238054433,
        "sender_full_name": "bjorn3",
        "timestamp": 1620587080
    },
    {
        "content": "<p>Hmm, this is surprising to me, given that MPL code in (part of) the regalloc crate wouldn't impose any license requirements on any other code that uses it, but I will bring it up with some others. It's unfortunate that this didn't come up earlier, for sure! Thanks for raising the issue.</p>",
        "id": 238058750,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1620591448
    },
    {
        "content": "<p>It's not necessarily a dealbreaker, but it'd be a first, and it would need discussion and approval.</p>",
        "id": 238095231,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1620630025
    },
    {
        "content": "<p>Any non-permissive license in std/core/etc would be a complete non-starter. In something that would only be part of rustc, it would cause fewer logistical issues.</p>",
        "id": 238095439,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1620630128
    },
    {
        "content": "<p>regalloc2 has been relicensed to Apache-2.0 WITH LLVM-exception a couple of months ago: <a href=\"https://github.com/bytecodealliance/regalloc2/pull/15\">https://github.com/bytecodealliance/regalloc2/pull/15</a></p>",
        "id": 275421820,
        "sender_full_name": "bjorn3",
        "timestamp": 1647371469
    }
]