[
    {
        "content": "<p>continuing what people were mentioning during today's session ...</p>",
        "id": 263480976,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1638469810
    },
    {
        "content": "<p>I think that having the feeling of being overwhelmed and having people like <span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> also saying that he feels overwhelmed is totally the way to go</p>",
        "id": 263481126,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1638469881
    },
    {
        "content": "<p>that in contrast of what has said about trying to not overwhelm people that are new</p>",
        "id": 263481215,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1638469915
    },
    {
        "content": "<blockquote>\n<p>having people like @nikomatsakis also saying that he feels overwhelmed is totally the way to go</p>\n</blockquote>\n<p>It definitely helped me overcome my imposter syndrome <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 263481301,
        "sender_full_name": "Sean Chen (he/him)",
        "timestamp": 1638469933
    },
    {
        "content": "<p>because, this is often how everyone would feel when facing rustc code most of us every single time <span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span></p>",
        "id": 263481315,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1638469939
    },
    {
        "content": "<p>I guess it's a matter of what's each of us goal's but if your goal is to contribute, you will definitely feel overwhelmed most of the time, so why avoiding it? ;)</p>",
        "id": 263481770,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1638470144
    },
    {
        "content": "<p>I feel like I need to read more code and get better at \"reading\" code. As someone familiar with Rust for a couple of months and knowing nothing about compilers, this was overwhelming <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> . But I got something out of it. I planned to read the code and rustc-dev-guide beforehand but unfortunately didn't get enough time. I have some stuff I want to look into more before the next session.<br>\nLooking forward to the next one. Cheers!</p>",
        "id": 263481964,
        "sender_full_name": "selectiveduplicate",
        "timestamp": 1638470235
    },
    {
        "content": "<p>I couldn't make it to today's meeting unfortunately but I want to confirm that 90% of my time spent reading rustdoc code is either \"wtf does this code do\" or \"oh I remember writing this wow what a terrible hack\" lmao</p>",
        "id": 263483279,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1638470872
    },
    {
        "content": "<p>Someone had another nice comment during the session, asking for some context about what we were reading, looking at the bigger picture and where the resolver's place was in that picture. It could be interesting to share some of this information that some participants have, during the reading session. Making sure everyone has at least some idea. Although feeling lost and figuring stuff out bit by bit is definitely \"the rustc experience\" :) could be nice if we could shorten that period of time for others if at all possible</p>",
        "id": 263489932,
        "sender_full_name": "lqd",
        "timestamp": 1638473811
    },
    {
        "content": "<p>For sure! I think <a href=\"https://rustc-dev-guide.rust-lang.org/part-2-intro.html\">https://rustc-dev-guide.rust-lang.org/part-2-intro.html</a> is a good overview of that</p>",
        "id": 263499281,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1638478646
    }
]