[
    {
        "content": "<p>I thought it might be useful to say (as someone who does not know the rustc contributors) why I wanted to attend...</p>\n<p>The reason I joined was ironically not because I wanted to read code. I wanted to watch how other people read code, so I can see if there are strategies I don't use. I also wanted to get a feeling of the thought processes of those who regularly contribute to rustc, to see if/how I might be able to make meaningful contributions that are aligned with the goals of the project. I feel like you really need to see and hear people to get a sense for this (I think it can totally work remotely). I also think that familiarity with those seen as the \"main people\" in rustc development would give me more confidence to make contributions, whether that be code, or joining discussions, or some other non-code contribution.</p>\n<p>I hope this is interesting. I personally would be interested in hearing other people's motivation for wanting to attend.</p>",
        "id": 260304271,
        "sender_full_name": "Richard Dodd",
        "timestamp": 1636046129
    },
    {
        "content": "<p>I had just read of reading clubs in \"The Programmer's Brain\" book and saw the LinkedIn post. <br>\nI thought that group reading and discussing of the rust compiler internals was the goal.</p>",
        "id": 260305299,
        "sender_full_name": "Raphaël Duchaîne",
        "timestamp": 1636046562
    },
    {
        "content": "<p>Yeah I guess I am the same, but I thought that if I only read the code, I might not get the whole picture. Being able to ask questions and listen to other people's questions I thought might add something.</p>",
        "id": 260307065,
        "sender_full_name": "Richard Dodd",
        "timestamp": 1636047357
    },
    {
        "content": "<p>Which is why I was/am excited about it even though I could just go and read the code now.</p>",
        "id": 260307157,
        "sender_full_name": "Richard Dodd",
        "timestamp": 1636047388
    }
]