[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> , I started reviewing the code for the mir predecessors cache. The notes suggested refactoring over trying to fix the locks. Is there any documented potential ways to move forward, or would that be best figured out here?</p>",
        "id": 175666654,
        "sender_full_name": "Paul Faria",
        "timestamp": 1568411052
    },
    {
        "content": "<p>I also wasn't sure if the issues were created yet. I thought I remembered during the meeting (I'll have to rewatch it) that there would be a list of issues created so we could track who was doing what. I tried searching, but all I could find was <a href=\"https://github.com/rust-lang/rust/issues/63643\" target=\"_blank\" title=\"https://github.com/rust-lang/rust/issues/63643\">https://github.com/rust-lang/rust/issues/63643</a>.</p>",
        "id": 175666878,
        "sender_full_name": "Paul Faria",
        "timestamp": 1568411310
    },
    {
        "content": "<p>I'm not sure what issues were created, <span class=\"user-mention\" data-user-id=\"116114\">@Paul Faria</span>, good question. Anyway re: the predecessors cache, I'm not sure what I would do. The most minimal change would be to use an <code>Arc</code> so that we avoid returning a lock guard, though to my mind that is not ideal.</p>\n<p>I'm going to cc <span class=\"user-mention\" data-user-id=\"124288\">@oli</span> and <span class=\"user-mention\" data-user-id=\"119009\">@eddyb</span>, as they might have some ideas. Y'all, the context here is that we were looking at the MIR <code>predecessors</code> function, which currently stores the preds for a block in a kind of ref-cell (or, in parallel mode, a mutex) and returns it. The cache is cleared upon modification and rebuilt lazilly. It all seems kind of complicated and not great -- for example, it is sad to need a lock when MIR is accessed by only one thread at a time when mutating.</p>",
        "id": 175849976,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1568666057
    },
    {
        "content": "<p>This discussion probably belongs in <a class=\"stream\" data-stream-id=\"189540\" href=\"/#narrow/stream/189540-t-compiler.2Fwg-mir-opt\">#t-compiler/wg-mir-opt</a> as the only reason this requires locking at all is because optimizations may change the basic block structure.</p>",
        "id": 175886558,
        "sender_full_name": "oli",
        "timestamp": 1568709707
    },
    {
        "content": "<p>We could make everything without interior mutability by adding a MirPass that computes the cache. That pass would have to be added before any passes that need the cache and after the last pass</p>",
        "id": 175886640,
        "sender_full_name": "oli",
        "timestamp": 1568709768
    },
    {
        "content": "<p>everyone with immutable access will only ever see a filled cache (because the filling happens after the last pass) and the passes needing access to the cache, have mutable access anyway</p>",
        "id": 175886663,
        "sender_full_name": "oli",
        "timestamp": 1568709821
    },
    {
        "content": "<p>Ok, I'll move the conversation there and link important details back here for cross reference</p>",
        "id": 176003909,
        "sender_full_name": "Paul Faria",
        "timestamp": 1568812808
    },
    {
        "content": "<p>Just a small update for those not following the thread in <a class=\"stream\" data-stream-id=\"189540\" href=\"/#narrow/stream/189540-t-compiler.2Fwg-mir-opt\">#t-compiler/wg-mir-opt</a>  : It's very likely we can completely remove interior mutability in this case and not need to worry about any parallel issues :)</p>",
        "id": 176745812,
        "sender_full_name": "Paul Faria",
        "timestamp": 1569591282
    },
    {
        "content": "<p><span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>",
        "id": 176748727,
        "sender_full_name": "mw",
        "timestamp": 1569593205
    }
]