[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"316805\">@durin42</span> Are you waiting on anything in particular wrt <a href=\"https://reviews.llvm.org/D117921\">https://reviews.llvm.org/D117921</a>?</p>",
        "id": 273827021,
        "sender_full_name": "Nikita Popov",
        "timestamp": 1646236157
    },
    {
        "content": "<p>Mainly me having a chance to get back to it and figure out what parts of the stack I can land in isolation. It was perf season at work and a few personal things also had my head out of it, but I'm planning to get to it tomorrow.</p>",
        "id": 273840115,
        "sender_full_name": "durin42",
        "timestamp": 1646240604
    },
    {
        "content": "<p>Ah okay, no pressure :) I was just wondering, as you rebased the patch series a couple of times.</p>",
        "id": 273843014,
        "sender_full_name": "Nikita Popov",
        "timestamp": 1646241658
    },
    {
        "content": "<p>Yeah, I'm anxious to get the rest of the stack done and be able to write patches for Rust. We're getting close!</p>",
        "id": 273844472,
        "sender_full_name": "durin42",
        "timestamp": 1646242097
    },
    {
        "content": "<p>Squinting at this a bit while I have a moment, I think <a href=\"https://reviews.llvm.org/D119271\">https://reviews.llvm.org/D119271</a> is telling me I have test failures on that one? Is that right?</p>",
        "id": 273844786,
        "sender_full_name": "durin42",
        "timestamp": 1646242209
    },
    {
        "content": "<p>(yes, yes it is.)</p>",
        "id": 273849618,
        "sender_full_name": "durin42",
        "timestamp": 1646243903
    },
    {
        "content": "<p>Pre-merge checks have had particularly many false positive failures recently, so unless a failure looks obviously related to your change, it's fine to just ignore it.</p>",
        "id": 273855603,
        "sender_full_name": "Nikita Popov",
        "timestamp": 1646246187
    },
    {
        "content": "<p>A month later, and I've got things wired up and tests passing in all of LLVM, clang, and Rust. We'll see what speedbumps we pick up from the review process, but I'm feeling optimistic this time!</p>",
        "id": 277809090,
        "sender_full_name": "durin42",
        "timestamp": 1649115850
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"133224\">@Nikita Popov</span> would you like me to explicitly mark you as a reviewer of the rest of the stack? I'd been throwing jyknight under that bus because he volunteered, but you've been more responsive and catching things he may have missed since he talked me through some of the design.</p>",
        "id": 278201125,
        "sender_full_name": "durin42",
        "timestamp": 1649353538
    }
]