[
    {
        "content": "<p>For a while now I've been doing work to get Rust HEAD to work with LLVM HEAD, and I'm now close enough that it's time to sort out the last couple of issues, and try to prevent backsliding. I have a couple of questions:</p>\n<p>1) Should I be always specifying a reviewer (nagisa? nikic?) instead of letting highfive pick someone? Highfive seems to not have a great track record of getting me a review quickly, so I'm not sure if my patches just look scary, uninteresting, or if they're mis-targetted a bit.</p>\n<p>2) A couple of times we've had new compile breaks land while I've been waiting for bors to actually merge the PR. Is it possible for me to mark the changes as rollup-worthy (and do the work of making the roll-up) or otherwise prioritized so it's easier to spot regressions going forward?</p>\n<p>The motivating factor for all this work is so that we can have things like cross-language LTO and sanitizers reliably work with an LLVM built from HEAD, and I'm operating under a constraint that I mustn't delay C++ toolchain releases, so it's a bit of a risk to the work if it's a week-ish from when we notice a build break to when the fix is in-tree. I'm open to notions of how we can improve things beyond the above, as I have no idea what I'm doing and I'm still an outsider here. Thanks!</p>\n<p>/cc <span class=\"user-mention\" data-user-id=\"132040\">@Manish Goregaokar</span> who volunteered to do rollups for this</p>",
        "id": 250552056,
        "sender_full_name": "durin42",
        "timestamp": 1629840667
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"132040\">Manish Goregaokar</span> has marked this topic as resolved.</p>",
        "id": 250552131,
        "sender_full_name": "Notification Bot",
        "timestamp": 1629840707
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"132040\">Manish Goregaokar</span> has marked this topic as unresolved.</p>",
        "id": 250552133,
        "sender_full_name": "Notification Bot",
        "timestamp": 1629840709
    },
    {
        "content": "<p>Yeah, doing <code>r? @nagisa</code> or <code>r? @nikic</code> for these changes is a good idea. I don't think you can mark them for rollup yourself, but the reviewer would usually do that for these kinds of simple changes.</p>",
        "id": 250553492,
        "sender_full_name": "Nikita Popov",
        "timestamp": 1629841464
    },
    {
        "content": "<p>That said, it may be hard to guarantee that these changes land quickly enough to not block google's internal toolchain updates. It's probably a good idea to have the capacity to apply temporary patches in place in case something takes longer than expected to land.</p>",
        "id": 250553813,
        "sender_full_name": "Nikita Popov",
        "timestamp": 1629841630
    },
    {
        "content": "<p>Sure, and I'm going to map that out in parallel, but it also seemed like something we should start proactively coordinating, especially since it seems like some teams outside the monorepo want to chase our work. Thanks!</p>",
        "id": 250559188,
        "sender_full_name": "durin42",
        "timestamp": 1629844741
    },
    {
        "content": "<p>Is it bad behavior to specify multiple reviewers?</p>",
        "id": 250559200,
        "sender_full_name": "durin42",
        "timestamp": 1629844757
    },
    {
        "content": "<p>highfive basically only supports one at a time and it can be confusing if two people are tagged because each will expect the other. you can do r? @foo cc @bar</p>",
        "id": 250559356,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1629844856
    },
    {
        "content": "<p>github supports multiple reviewer requests, but also you want to avoid not having a DRI. the r?+cc option means that the r?d person can tag in a different reviewer if they don't have time, and the cc'd person can step up and perform reviews if they want to</p>",
        "id": 250559472,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1629844944
    },
    {
        "content": "<p>Okay, so I can notionally flip a coin and put one as the r? and cc the other. Thanks!</p>",
        "id": 250564299,
        "sender_full_name": "durin42",
        "timestamp": 1629848407
    }
]