[
    {
        "content": "<p>From LLVM14-enabled rustc build logs:</p>\n<div class=\"codehilite\"><pre><span></span><code>CMake Deprecation Warning at CMakeLists.txt:25 (message):\n  Using llvm-config to detect the LLVM installation is deprecated.  The\n  installed cmake files should be used instead.  CMake should be able to\n  detect your LLVM install automatically, but you can also use LLVM_DIR to\n</code></pre></div>\n<p>We should look into this and see if cmake files are appropriate for us, and if not, report to upstream that cmake is not a full replacement for our needs.</p>",
        "id": 271340195,
        "sender_full_name": "nagisa",
        "timestamp": 1644437347
    },
    {
        "content": "<p>I expect that switching to LLVM_DIR will be fine and may do away with some of the hacks we currently do. Though possibly we should start building lld as an llvm subproject rather than a standalone build.</p>",
        "id": 271399713,
        "sender_full_name": "Nikita Popov",
        "timestamp": 1644481619
    },
    {
        "content": "<p>At least we seem to be building other things like clang and polly that way, and it's not immediately clear why we don't do the same for lld.</p>",
        "id": 271399747,
        "sender_full_name": "Nikita Popov",
        "timestamp": 1644481650
    },
    {
        "content": "<p>There's some discussion of removing standalone builds entirely here, though I do hope that doesn't happen: <a href=\"https://discourse.llvm.org/t/standalone-build-for-clang-lld-fix-or-remove/59977\">https://discourse.llvm.org/t/standalone-build-for-clang-lld-fix-or-remove/59977</a></p>",
        "id": 271399785,
        "sender_full_name": "Nikita Popov",
        "timestamp": 1644481682
    },
    {
        "content": "<p>fedora and gentoo seem to agree that standalone builds should be kept.</p>",
        "id": 271416980,
        "sender_full_name": "bjorn3",
        "timestamp": 1644491759
    },
    {
        "content": "<p>Can't hurt for someone wearing a compiler team hat to post that we need them too. Just in case distros find a different solution and that's seen as the only opposition.</p>",
        "id": 271468274,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1644515569
    }
]