[
    {
        "content": "<p>At this point I think it has become fairly clear that wg-llvm as a workgroup isn’t really serving much purpose or achieving very much. The original intent of the workgroup was to deal with the upstream (mostly in representing Rust’s interests), which is something that happens to an extent, but more as a matter-of-fact and independent work rather than part of the workgroup’s activities.</p>\n<p>There hasn’t been much effort on my part to organize this work either, as I have only recently become more available, and the current state of matters reveal it. I feel it is useful to have <a class=\"stream\" data-stream-id=\"187780\" href=\"/#narrow/stream/187780-t-compiler.2Fwg-llvm\">#t-compiler/wg-llvm</a> as a way to organize some of the fairly rare but directed discussions, but perhaps not a full-blown workgroup.</p>\n<p><span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span> has suggested that we may perhaps benefit from a co-lead, but based on my observations I doubt assigning co-lead will change much. Instead for this WG to become meaningful unit it would be necessary for us all to organize our work more meticulously.</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> <span class=\"user-mention\" data-user-id=\"124289\">@rkruppe</span> <span class=\"user-mention\" data-user-id=\"133224\">@Nikita Popov</span></p>",
        "id": 182663538,
        "sender_full_name": "nagisa",
        "timestamp": 1575556031
    },
    {
        "content": "<p>(I agree that keeping a dedicated stream of some kind makes sense, regardless of whether we decide to keep this as a WG or not.)</p>",
        "id": 182663653,
        "sender_full_name": "pnkfelix",
        "timestamp": 1575556101
    },
    {
        "content": "<p>Is there some overhead you're worried about in having a \"full-blown workgroup\"?</p>",
        "id": 182679402,
        "sender_full_name": "cuviper",
        "timestamp": 1575564972
    },
    {
        "content": "<p>check-ins are one example of such overhead.</p>",
        "id": 182686664,
        "sender_full_name": "nagisa",
        "timestamp": 1575569637
    },
    {
        "content": "<p>it might be nice to just have \"dedicated streams\" for discussions of particular topics that are not a \"working group\"</p>",
        "id": 183208519,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1576102988
    },
    {
        "content": "<p>What if we just remove the working group and rename this stream to <code>#t-compiler/llvm</code>?</p>",
        "id": 183312272,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1576191758
    },
    {
        "content": "<p>one question might be whether it's useful to have some GH alias to ping \"llvm-folk\"; the ICE-breaker group is <em>sort of</em> that</p>",
        "id": 183312297,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1576191797
    },
    {
        "content": "<p>but different</p>",
        "id": 183312302,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1576191804
    }
]