[
    {
        "content": "<p>I'm trying to run miri-test-libstd over alloc. I've patched core/alloc enough to make it pass all the unit and integration tests, but miri becomes totally lost in the doctests:</p>\n<div class=\"codehilite\"><pre><span></span><code>test result: ok. 652 passed; 0 failed; 13 ignored; 0 measured; 0 filtered out\n\n   Doc-tests alloc_miri_test\nerror[E0514]: found crate `core` compiled by an incompatible version of rustc\n  |\n  = help: please recompile that crate using this compiler (rustc 1.59.0-nightly (7abab1efb 2021-12-17)) (consider running `carg\no clean` first)\n  = note: the following crate versions were found:\n          crate `core` compiled by rustc 1.59.0-nightly (c5ecc1570 2021-12-15): /home/ben/.cache/miri/HOST/lib/rustlib/x86_64-u\nnknown-linux-gnu/lib/libcore-0a931509a96b2f07.rmeta\n</code></pre></div>\n<p>I'm so confused... Is this a known problem?</p>",
        "id": 265454871,
        "sender_full_name": "(Saethlin) Ben Kimock",
        "timestamp": 1639878787
    },
    {
        "content": "<p>Maybe you need to update the rust-version file in your Miri checkout? (Or are you using Miri from rustup?)</p>",
        "id": 265455200,
        "sender_full_name": "Noah Lev",
        "timestamp": 1639879288
    },
    {
        "content": "<p>I just pulled the latest commits and ran the script then ran miri install. Perhaps there's something else awry with my environment.</p>\n<p>This isn't the first time I've seen miri be fine then fall over trying to run doctests :/</p>",
        "id": 265455853,
        "sender_full_name": "(Saethlin) Ben Kimock",
        "timestamp": 1639880436
    },
    {
        "content": "<p>Everything works if I rebuild my environment from scratch in a Docker container without ever running <code>./miri install</code>. Maybe I'll figure something out or just containerize my work</p>",
        "id": 265464387,
        "sender_full_name": "(Saethlin) Ben Kimock",
        "timestamp": 1639894625
    },
    {
        "content": "<p>The problem is that rustdoc directly invokes rustc and doesn't allow a rustc wrapper like miri. In addition it expects that rustc produces a working executable. Miri directly executes the program and doesn't leave any program to run.</p>",
        "id": 265479862,
        "sender_full_name": "bjorn3",
        "timestamp": 1639919842
    }
]