[
    {
        "content": "<p>Hello! I am the maintainer of a crate that uses simd instructions and i'd like to be able run tests with miri however I understand that it's not supported right now.<br>\nI stumbled upon <a href=\"https://github.com/rust-lang/miri/issues/662\">https://github.com/rust-lang/miri/issues/662</a> but it's not really clear what needs to be done or what is the status of things.<br>\nIf implementing support for SIMD instructions is possible somehow, I am willing to invest some of my free time to help  but I have <em>no idea</em> where to start.<br>\nWould all simd intrinsincs have to have \"faked\" using scalar based algorithm for each intrinsic? Additionally would that be somehow possible with std::simd <a href=\"https://github.com/rust-lang/stdsimd\">https://github.com/rust-lang/stdsimd</a> ?</p>",
        "id": 233947351,
        "sender_full_name": "marmeladema",
        "timestamp": 1618053399
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281572\">@marmeladema</span> your message comes at a great time. :)</p>",
        "id": 233948185,
        "sender_full_name": "RalfJ",
        "timestamp": 1618054343
    },
    {
        "content": "<p>I am currently attending the Rust Verification Workshop at ETAPS, and many people there working on analyzing Rust code are running into the problem of supporting SIMD intrinsics. So an effort is forming to provide a <em>pure Rust</em> implementation of (a subset of) those intrinsics.</p>",
        "id": 233948238,
        "sender_full_name": "RalfJ",
        "timestamp": 1618054409
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"336739\">@Alastair Reid</span> posted some first results at <a href=\"https://github.com/alastairreid/rust-verification-tools/blob/llvm_opt/runtime/src/x86intrinsics.rs\">https://github.com/alastairreid/rust-verification-tools/blob/llvm_opt/runtime/src/x86intrinsics.rs</a></p>",
        "id": 233948281,
        "sender_full_name": "RalfJ",
        "timestamp": 1618054444
    },
    {
        "content": "<p>so I think the way forward here is:</p>\n<ul>\n<li>probably move those intrinsics to a separate git repo so we can more easily share them between the various MIR-based tools</li>\n<li>figure out how to hook those Rust implementations into Miri... my current thinking is to do this \"inside\" the machine, i.e., to build a crate with all those intrinsic implementations as part of the sysroot and load their MIR whenever Miri needs to interpret an intrinsic. Other approaches might also be possible.</li>\n<li>implement more intrinsics. :D</li>\n</ul>",
        "id": 233948426,
        "sender_full_name": "RalfJ",
        "timestamp": 1618054585
    },
    {
        "content": "<p>Great! I am really looking forward to help! Not sure how much I can do but i'll definitely try!<br>\nFrom the link you shared it seems that for miri, the intrinsics need to be implemented using a scalar equivalent. I will check but I <em>think</em> the std::simd working group also needs to do that to support some operations not available on a specific architecture/platform. Maybe both working group need to work together to implement the scalar version of intrinsics? I understand that the main difference is that miri will want to handle target specific intrinsics and that std::simd is focused toward \"generic\" simd types/operations. But I feel like the scalar implementation of those will be the same or very close to each other</p>",
        "id": 233949548,
        "sender_full_name": "marmeladema",
        "timestamp": 1618055874
    },
    {
        "content": "<p>Yeah, we haven't reached out to the Rust SIMD people for this yet (or even checked who would be the right group to reach out to). This just started 2 days ago.^^</p>",
        "id": 233949804,
        "sender_full_name": "RalfJ",
        "timestamp": 1618056067
    },
    {
        "content": "<p>Oh right ok sorry^^ it's very new then :-D I am very enthusiastic about it</p>",
        "id": 233950148,
        "sender_full_name": "marmeladema",
        "timestamp": 1618056375
    },
    {
        "content": "<p>One related project that might be of interest is <a href=\"https://github.com/simd-everywhere/simde\">https://github.com/simd-everywhere/simde</a></p>",
        "id": 233950325,
        "sender_full_name": "marmeladema",
        "timestamp": 1618056521
    },
    {
        "content": "<p>yeah, such projects certainly already exist for C, but that is not very useful for MIR-based tools</p>",
        "id": 233950715,
        "sender_full_name": "RalfJ",
        "timestamp": 1618056944
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281572\">marmeladema</span> <a href=\"#narrow/stream/269128-miri/topic/simd.20support/near/233950148\">said</a>:</p>\n<blockquote>\n<p>Oh right ok sorry^^ it's very new then :-D I am very enthusiastic about it</p>\n</blockquote>\n<p>if you don't mind joining another Zulip, <a href=\"https://rust-verify.zulipchat.com/#narrow/stream/284566-general/topic/cfg.28miri.29.20and.20avoiding.20SIMD\">here is the thread</a> where discussion happened so far.</p>",
        "id": 233950785,
        "sender_full_name": "RalfJ",
        "timestamp": 1618056991
    },
    {
        "content": "<p>You seem to know more about std::simd so bringing together the right people there could also help :)</p>",
        "id": 233950805,
        "sender_full_name": "RalfJ",
        "timestamp": 1618057018
    },
    {
        "content": "<p>There's also an accepted compiler MCP about this for cranelift. Please keep <span class=\"user-mention\" data-user-id=\"133247\">@bjorn3</span> in the loop</p>",
        "id": 233957212,
        "sender_full_name": "oli",
        "timestamp": 1618063088
    },
    {
        "content": "<p>that would be <a href=\"https://github.com/rust-lang/compiler-team/issues/381\">https://github.com/rust-lang/compiler-team/issues/381</a> I guess -- thanks for pointing that out!</p>",
        "id": 233958826,
        "sender_full_name": "RalfJ",
        "timestamp": 1618064501
    },
    {
        "content": "<p>I participate in the simd group, its likely easy to add support for the intrinsics we need to miri, since there are only a few and they're pretty straightforward (just <a href=\"https://github.com/rust-lang/stdsimd/blob/master/crates/core_simd/src/intrinsics.rs#L10-L69\">https://github.com/rust-lang/stdsimd/blob/master/crates/core_simd/src/intrinsics.rs#L10-L69</a>). IDT we're confident the set we have now is the complete set, so if you added them now you'd potentially have to add more later.</p>",
        "id": 233975270,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1618078342
    },
    {
        "content": "<p>but if we added those we'd still not support programs using <code>std::arch</code> directly, right?<br>\nis the idea that long-term, those will all move to <code>std::simd</code>?<br>\nfor purposes of Miri or other verification tools, would it make sense to implement <code>std::arch</code> on top of these intrinsics, and how hard would that be?</p>",
        "id": 233978222,
        "sender_full_name": "RalfJ",
        "timestamp": 1618080898
    },
    {
        "content": "<p>in the long term std::arch and std::simd will <strong>very likely</strong> continue to be separate forever.</p>\n<p>the reason being basically that std::arch has overlap with <em>one monomorphization</em> of what you'd get from std::simd, however std::arch is also providing things that std::simd never will (usually because a given op is exclusive to a given arch) and also std::arch is already fairly filled out and moving it to be std::simd internally would be a lot of work for no gain.</p>",
        "id": 233979982,
        "sender_full_name": "Lokathor",
        "timestamp": 1618082435
    },
    {
        "content": "<p>Part of the functions implemented in std::arch use the same \"platform-intrinsic\"s used by std::simd. Those would trivially be supported. Others are implemented directly using llvm intrinsics. Those could be roughly devided into three groups: Those that can be trivially changed to use \"platform-intrinsic\"s or for example <code>core::intrinics::load_unaligned</code>. Those that should likely get new \"platform-intrinsics\"s and those that will likely need to keep using llvm intrinsics. The last group is mostly for float intrinsics where edge cases are handled differently between architectures.</p>",
        "id": 233985208,
        "sender_full_name": "bjorn3",
        "timestamp": 1618087276
    },
    {
        "content": "<p>For a list of llvm intrinsics cg_cluf needs to emulate to support the rand and regex crates see: <a href=\"https://github.com/bjorn3/rustc_codegen_cranelift/blob/53bfc6729ae4a53c8092473452de7a272224df5d/src/intrinsics/llvm.rs\">https://github.com/bjorn3/rustc_codegen_cranelift/blob/53bfc6729ae4a53c8092473452de7a272224df5d/src/intrinsics/llvm.rs</a></p>",
        "id": 233985231,
        "sender_full_name": "bjorn3",
        "timestamp": 1618087313
    },
    {
        "content": "<p>There could also be different milestone of simd support in miri. It seems that programs relying on std::simd could be supported by miri \"out-of-the-box\" by relying on the scalar version of the operations?</p>",
        "id": 233986322,
        "sender_full_name": "marmeladema",
        "timestamp": 1618088264
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281572\">@marmeladema</span> do you have a concrete crate/piece of code in mind that you want to get working with Miri?<br>\nFWIW, some of the portable simd intrinsics should <a href=\"https://github.com/rust-lang/rust/blob/ba6275b6a9fc05fd5d93220e9a67fe64d663cb62/compiler/rustc_mir/src/interpret/intrinsics.rs#L414\">already work</a> in Miri</p>",
        "id": 234035593,
        "sender_full_name": "RalfJ",
        "timestamp": 1618138361
    },
    {
        "content": "<p>The crate i'd like to run miri on is <a href=\"https://github.com/cloudflare/sliceslice-rs\">https://github.com/cloudflare/sliceslice-rs</a> and especially the code that relies on simd instructions is at <a href=\"https://github.com/cloudflare/sliceslice-rs/blob/master/src/x86.rs#L50-L127\">https://github.com/cloudflare/sliceslice-rs/blob/master/src/x86.rs#L50-L127</a><br>\nAll the operations are pretty common and I will investigate soon if/how we could use std::simd instead.</p>",
        "id": 234035758,
        "sender_full_name": "marmeladema",
        "timestamp": 1618138554
    },
    {
        "content": "<p>okay so this is using <code>std::arch</code>, I see</p>",
        "id": 234035851,
        "sender_full_name": "RalfJ",
        "timestamp": 1618138647
    },
    {
        "content": "<p>yeah hasbrown would also need that I think (currently it uses <code>cfg(miri)</code> and then takes the scalar fallback path)</p>",
        "id": 234035862,
        "sender_full_name": "RalfJ",
        "timestamp": 1618138679
    },
    {
        "content": "<p>It looks as if the only vector functions that actually use LLVM intrinsics in the cloudflare code are _mm256_movemask_epi8 and _mm256_cmpeq_epi8.<br>\nThe others either use the processor-neutral simd operations like simd_and (_mm_256_and), or non-vector operations (_mm256_loadu_si256).</p>\n<p>My SIMD operation emulation library implements enough of these that I am able to generate LLVM bitcode files that don't use x86-specific intrinsics.<br>\nI could then run the example from the sliceslice README file in the KLEE symbolic execution tool.<br>\n(More precisely, I have a tool that can replace calls to any x86 intrinsics with calls to functions from my emulation library.)<br>\nThe library is the same one that Ralf linked to at the top - but cleaned up, moved to a different branch, etc. <a href=\"https://github.com/alastairreid/rust-verification-tools/blob/simd/simd_intrinsics/src/lib.rs\">https://github.com/alastairreid/rust-verification-tools/blob/simd/simd_intrinsics/src/lib.rs</a></p>\n<p>To make this work with miri, I suspect that you would need:</p>\n<ul>\n<li>to have miri use functions from the simd emulation library when it finds simd intrinsics being used</li>\n<li>to have a suitable way of converting from the intrinsic names in MIR to the name of the emulation function<ul>\n<li>for the x86-specific intrinsics, this is easy: <a href=\"http://llvm.x86.sse2.foo\">llvm.x86.sse2.foo</a> is implemented by llvm_x86_sse2_foo (i.e., just replace the underscores)</li>\n<li>for the generic intrinsics like \"simd_and\", I suspect that you would need to use the vector length to produce a unique name (eg \"simd_and_128\")</li>\n</ul>\n</li>\n<li>for the generic intrinsics, implement the appropriate emulation function</li>\n</ul>\n<p>For simd_and_128, this would be something like</p>\n<div class=\"codehilite\"><pre><span></span><code>#[inline]\n#[no_mangle]\nextern &quot;C&quot; fn simd_and_128(a: simd16&lt;u8&gt;, b: simd16&lt;u8&gt;) -&gt; simd16&lt;u8&gt; {\n    lift16_vv_v(u8::and, a, b)\n}\n</code></pre></div>\n<p>and then add a wrapper that makes the types look like Intel official types</p>\n<div class=\"codehilite\"><pre><span></span><code>mod with_intel_official_types { // I was not feeling very imaginative about this module name :-)\n    ...\n    fn simd_and_128(a: __m128i, b: __m128i) -&gt; __m128i {\n        let a = unsafe { std::mem::transmute::&lt;__m128i, super::simd16&lt;u8&gt;&gt;(a) };\n        let b = unsafe { std::mem::transmute::&lt;__m128i, super::simd16&lt;u8&gt;&gt;(b) };\n        let r = super::simd_and_128(a, b);\n        unsafe { std::mem::transmute::&lt;super::simd16&lt;u8&gt;, __m128i&gt;(r) }\n    }\n    ...\n}\n</code></pre></div>\n<p>[Note: this 128 bit version is for SSE2 vectors. I haven't done much of AVX2 yet because most libraries can be built with AVX2 disabled so it is not as pressing for me as SSE2 which cannot be disabled without LLVM deciding to wake the x87 FPU from its slumber.<br>\nNote also that I randomly chose to treat the operation as being made of 16 8-bit and operations. I could also have used 8 16-bit ands, 4 32-bit ands or 2 64-bit ands.]</p>",
        "id": 234212488,
        "sender_full_name": "Alastair Reid",
        "timestamp": 1618254169
    },
    {
        "content": "<p>I typed way more like <del>3</del> <del>4</del> 5 (wtf...) times and zulip <a href=\"https://github.com/zulip/zulip/issues/18113\">ate it</a> each time, so I'll keep it short:</p>\n<ul>\n<li>\n<p>I think it would be good for miri to support up to SSE2 on intel. Code using this is often hairy, and would be nice to be able to test under miri. SSE2 is a good cutoff point since it's part of the x86_64 baseline, and not too complex — anything else could just say false to <code>std::is_x86_feature_detected</code>.</p>\n</li>\n<li>\n<p>Anything hard to support (nontemporal ops probably require another, separate, data race detector to detect UB for and are very rarely used) should probably just be unsupported.</p>\n</li>\n<li>\n<p>Ideally it would be from an external crate, and done in such a way so that supporting these doesn't increase miri's maintenance burden substantially.</p>\n</li>\n<li>\n<p>project-portable-simd will never replace all of these, it only handles cases well supported by all arches, or that would be strange if missing.</p>\n<p>We should expect that code will continue to use stdarch forever, for cases where the portable simd functionality isn't no_std (one example of several: sqrt likely will require libstd for the fallback — not all arches have an intrinsic for sqrt), and for cases where one arch has a useful intrinsic that nothing else has (I used _mm_madd_epi16 the other day — it's one of the very rare fast horizontal operations on any simd ISA)</p>\n</li>\n<li>\n<p>All that said, I'd completely understand not wanting to do this, and had always assumed it was out of scope for miri</p>\n</li>\n</ul>",
        "id": 234236325,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1618264132
    },
    {
        "content": "<p>Minor update on what I wrote above:</p>\n<ul>\n<li>I pushed a new version just now (same location: <a href=\"https://github.com/alastairreid/rust-verification-tools/blob/simd/simd_intrinsics/src/lib.rs\">https://github.com/alastairreid/rust-verification-tools/blob/simd/simd_intrinsics/src/lib.rs</a>)<ul>\n<li>It uses traits in a different way to capture the relationship between a type like \"u8\", a structured vector type like \"u8x16\" and an Intel type like __m128i. This resulted in a fairly complete rewrite of what was there before.</li>\n<li>It supports all the intrinsics I see in<ul>\n<li>the cloudflare sliceslice-rs  <a href=\"https://github.com/cloudflare/sliceslice-rs/blob/master/src/x86.rs#L50-L127\">https://github.com/cloudflare/sliceslice-rs/blob/master/src/x86.rs#L50-L127</a></li>\n<li>aho-corasick <a href=\"https://github.com/BurntSushi/aho-corasick/blob/master/src/packed/vector.rs\">https://github.com/BurntSushi/aho-corasick/blob/master/src/packed/vector.rs</a></li>\n</ul>\n</li>\n<li>It is currently missing a few intrinsics used in hashbrown - by the time some of you read this, this should be fixed :-)</li>\n</ul>\n</li>\n</ul>\n<p>This is sufficient that I can emulate all of the simd intrinsics that I find in coreutils and all the crates that it depends on.</p>\n<p>Notes:</p>\n<ul>\n<li>I have not tested any of the intrinsics and I don't understand the naming conventions so there are certain to be bugs.<ul>\n<li>There are tests in core_arch that is might be possible to run? <a href=\"https://github.com/rust-lang/stdarch/blob/master/crates/core_arch/src/x86/sse2.rs#L3083\">https://github.com/rust-lang/stdarch/blob/master/crates/core_arch/src/x86/sse2.rs#L3083</a></li>\n</ul>\n</li>\n<li>I have not tried to implement all the SSE2 intrinsics<ul>\n<li>It meets my current research purposes but I would love to work with others to make it complete, test it, etc. and turn it into a reliable thing that people (and, in particular, miri) can use</li>\n</ul>\n</li>\n<li>I have implemented some AVX2 intrinsics as well<ul>\n<li>In theory, you can use feature flags to disable AVX2 so we don't really need these.</li>\n<li>In practice, it may be easier if things just work without messing around with how things are built or requiring all code to have a generic fallback.</li>\n</ul>\n</li>\n<li>I have not implemented intrinsics for Arm Neon, SVE, etc. yet<ul>\n<li>I suspect that I will need this soon so the traits etc. used to implement intrinsics is written with that in mind</li>\n</ul>\n</li>\n<li>There is a lot of repetition involved in supporting vectors that can have 2, 4, 8, 16 or 32 lanes and in supporting operations that take two vectors and return a vector, that take a vector and scalar and return a vector, etc.<ul>\n<li>I would welcome suggestions on how to use macros to capture more of the structure here. (I am not a macros expert)</li>\n</ul>\n</li>\n<li>The 'for_miri' module is intended to match what Miri needs.<ul>\n<li>I am just guessing what it needs - let's change it as needed to make Miri happy.</li>\n</ul>\n</li>\n</ul>",
        "id": 234516924,
        "sender_full_name": "Alastair Reid",
        "timestamp": 1618413065
    },
    {
        "content": "<blockquote>\n<p>to have a suitable way of converting from the intrinsic names in MIR to the name of the emulation function</p>\n</blockquote>\n<p>for the generic <code>simd_*</code> intrinsics, there are few enough that it might be easier to implement them in the miri interpreter instead of dispatching to MIR... not sure.</p>",
        "id": 234518574,
        "sender_full_name": "RalfJ",
        "timestamp": 1618413530
    },
    {
        "content": "<blockquote>\n<p>for the generic intrinsics like \"simd_and\", I suspect that you would need to use the vector length to produce a unique name (eg \"simd_and_128\")</p>\n</blockquote>\n<p>why that? the best thing for Miri would be for the intrinsic implementation to be generic the same way the intrinsic is.</p>",
        "id": 234518671,
        "sender_full_name": "RalfJ",
        "timestamp": 1618413570
    },
    {
        "content": "<p>Probably we'd have to add trait bounds like <code>T: Add</code> to actually implement them, and risk ICEs if we call it for types that do not implement the trait, but ICEs for misused intrinsics are okay</p>",
        "id": 234518939,
        "sender_full_name": "RalfJ",
        "timestamp": 1618413657
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>// For LLVM purposes, we _must_ use the structured types.\n// For Miri purposes, we probably need to use the Intel types.\n</code></pre></div>\n<p>Interesting, I am curious why LLVM needs the structured types.<br>\nfor Miri, the types should be <em>exactly</em> like they are in the intrinsic imports, like <a href=\"https://github.com/rust-lang/stdarch/blob/6495bb0e33578443c21764655a4dd8b55399c008/crates/core_arch/src/x86/sse2.rs#L2855\">e.g. here</a></p>",
        "id": 234519605,
        "sender_full_name": "RalfJ",
        "timestamp": 1618413791
    },
    {
        "content": "<p>it looks like that is using the structured types, which would explain why for LLVM purposes you want that, and would mean Miri also wants structured types</p>",
        "id": 234519711,
        "sender_full_name": "RalfJ",
        "timestamp": 1618413828
    },
    {
        "content": "<p>Ah, as a data point of something that covers nearly all stable intrinsics (all the ones that can be made safe that is), check the <a href=\"https://github.com/Lokathor/safe_arch\">safe_arch</a> crate. The test suite is in the process of being rewritten from doc tests to integration tests, but everything should have at least one test, so using it as a \"coverage check\" for miri might be a reasonable thing to do.</p>",
        "id": 234528188,
        "sender_full_name": "Lokathor",
        "timestamp": 1618416747
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120791\">@RalfJ</span> The key thing with types is that every tool needs the SIMD emulation functions to have the same type as the intrinsic that it is replacing.</p>\n<p>For LLVM-based tools, I see functions with the LLVM type \"declare i32 @llvm.x86.sse2.pmovmskb.128(&lt;16 x i8&gt;)\" so I make sure that I am using a Rust type with that representation for that function.  I can check it by compiling with --emit-ir and searching the resulting .ll file for intrinsic names and emulation function names.</p>\n<p>For miri, I am assuming that this is a type like __m128i. [Although, as I type these words, I am increasingly doubtful that this could possibly be what miri needs...]<br>\nReally, I have just been guessing. If you tell me what you need (and ideally how to check what I am currently generating), I'm super-happy to change it.</p>",
        "id": 234529555,
        "sender_full_name": "Alastair Reid",
        "timestamp": 1618417255
    },
    {
        "content": "<blockquote>\n<p>For miri, I am assuming that this is a type like __m128i. [Although, as I type these words, I am increasingly doubtful that this could possibly be what miri needs...]<br>\nReally, I have just been guessing. If you tell me what you need (and ideally how to check what I am currently generating), I'm super-happy to change it.</p>\n</blockquote>\n<p>What Miri needs is for the type to match exactly the type used in the <code>extern</code> block that stdarch uses to import these intrinsics.</p>",
        "id": 234537048,
        "sender_full_name": "RalfJ",
        "timestamp": 1618420037
    },
    {
        "content": "<p><a href=\"https://github.com/rust-lang/stdarch/blob/6495bb0e33578443c21764655a4dd8b55399c008/crates/core_arch/src/x86/sse2.rs#L2855\">This seems to match</a> what you see in LLVM IR, though I am not sure how <code>i32x4</code> and friends as used in this file are defined.</p>",
        "id": 234537098,
        "sender_full_name": "RalfJ",
        "timestamp": 1618420060
    },
    {
        "content": "<p>I assume the type is being defined <a href=\"https://github.com/rust-lang/stdarch/blob/6495bb0e33578443c21764655a4dd8b55399c008/crates/core_arch/src/simd.rs#L243\">here</a></p>",
        "id": 234537616,
        "sender_full_name": "RalfJ",
        "timestamp": 1618420253
    },
    {
        "content": "<p>Ah, I had somehow gotten the idea that Miri needed something else.<br>\nSo, just to be absolutely clear, there are two things defined for most/all intrinsics in stdarch.</p>\n<p>First, there is an extern blocks that looks like this <a href=\"https://github.com/rust-lang/stdarch/blob/master/crates/core_arch/src/x86/sse2.rs#L2809\">https://github.com/rust-lang/stdarch/blob/master/crates/core_arch/src/x86/sse2.rs#L2809</a></p>\n<div class=\"codehilite\"><pre><span></span><code>#[allow(improper_ctypes)]\nextern &quot;C&quot; {\n    ...\n    #[link_name = &quot;llvm.x86.sse2.pavg.b&quot;]\n    fn pavgb(a: u8x16, b: u8x16) -&gt; u8x16;\n    ...\n}\n</code></pre></div>\n<p>The types are what I need to use with LLVM and also what you need for Mir</p>\n<p>There is also a wrapper that corresponds to the intrinsic names and types that Intel use in their C intrinsics header file</p>\n<div class=\"codehilite\"><pre><span></span><code>#[inline]\n#[target_feature(enable = &quot;sse2&quot;)]\n#[cfg_attr(test, assert_instr(pavgb))]\n#[stable(feature = &quot;simd_x86&quot;, since = &quot;1.27.0&quot;)]\npub unsafe fn _mm_avg_epu8(a: __m128i, b: __m128i) -&gt; __m128i {\n    transmute(pavgb(a.as_u8x16(), b.as_u8x16()))\n}\n</code></pre></div>\n<p>I think we are saying that neither of us need that and we can ignore it.</p>\n<p>I am trying to be explicit about this because I have been a bit confused about this up until now.<br>\nI look in source code and I see the wrappers being called with their types but I look in LLVM bitcode files and I see the intrinsics with their different types.</p>",
        "id": 234547357,
        "sender_full_name": "Alastair Reid",
        "timestamp": 1618423698
    },
    {
        "content": "<p>(I feel yet another rewrite of my emulation library coming on... using the type definitions you point at and using the extern block as my sole source of information about the type of each intrinsic.)</p>",
        "id": 234547503,
        "sender_full_name": "Alastair Reid",
        "timestamp": 1618423777
    },
    {
        "content": "<blockquote>\n<p>I think we are saying that neither of us need that and we can ignore it.</p>\n</blockquote>\n<p>Yes. That wrapper has a MIR body which Miri can just evaluate.  Then at some point the code will call a function from the <code>extern</code> block that does <em>not</em> have a MIR body, and this is where Miri gets stuck.</p>",
        "id": 234640764,
        "sender_full_name": "RalfJ",
        "timestamp": 1618477372
    },
    {
        "content": "<blockquote>\n<p>I look in source code and I see the wrappers being called with their types but I look in LLVM bitcode files and I see the intrinsics with their different types.</p>\n</blockquote>\n<p>I assume the wrappers have all been inlined?</p>",
        "id": 234640842,
        "sender_full_name": "RalfJ",
        "timestamp": 1618477404
    }
]