[
    {
        "content": "<h3>Summary</h3>\n<p>Merge the <code>tymethod</code> and <code>method</code> URL fragments into just <code>method</code>.</p>\n<h3>Why?</h3>\n<p>They add needless complexity to the intra-doc links code (e.g., whether an associated item is an impl vs a prototype has to be hardcoded in some circumstances) and elsewhere in rustdoc. I don't think there's any need to distinguish between these two kinds. For example, associated constant prototypes in traits vs definitions in traits, trait impls, and inherent impls both use <code>associatedconstant</code>.</p>\n<h3>Drawbacks</h3>\n<ul>\n<li>It could cause slightly more fragment conflicts. Those should be solved by \"semantic ID disambiguation\" (<a href=\"https://github.com/rust-lang/rust/issues/92052\">#92052</a>). I think it's unlikely that this merger would cause significantly more conflicts, though.</li>\n</ul>",
        "id": 267135249,
        "sender_full_name": "Noah Lev",
        "timestamp": 1641515088
    },
    {
        "content": "<p>This is a good idea. Thanks for proposing it.</p>",
        "id": 267202594,
        "sender_full_name": "jsha",
        "timestamp": 1641569655
    },
    {
        "content": "<p>Does anyone have concerns about this? Otherwise, I'd like to go ahead and implement it.</p>",
        "id": 267232284,
        "sender_full_name": "Noah Lev",
        "timestamp": 1641583888
    },
    {
        "content": "<p>I think it's fine. I came across it a few times so I'm happy to see I'm not the only one having an issue with it. It'll allow us to remove CSS, which is great.</p>",
        "id": 267237067,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1641586196
    },
    {
        "content": "<p>Ok, I'll start working on it :)</p>",
        "id": 267239263,
        "sender_full_name": "Noah Lev",
        "timestamp": 1641587448
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"307537\">@Noah Lev</span> I can't find where you mentioned it, but the links under (e.g.) \"Structs\" in your branch are not getting colors, because the CSS rule for colors is <code>.content a.struct</code>. Normally everything is a child of <code>&lt;section id=\"main-content\" class=\"content\"&gt;</code> but that seems to not be the case when I build your branch. I'm not aware of something on master that changed recently that would cause that to happen, but I'll take a quick look.</p>",
        "id": 267271866,
        "sender_full_name": "jsha",
        "timestamp": 1641612232
    },
    {
        "content": "<p>replied on PR - there are some small changes to when tags get closed that might produce the problem you noted</p>",
        "id": 267272959,
        "sender_full_name": "jsha",
        "timestamp": 1641613691
    }
]