[
    {
        "content": "<p>Hi rustdoc team! The 2021 annual survey is almost ready: <a href=\"https://github.com/rust-lang/surveys/blob/main/surveys/2021-annual-survey/questions.md\">https://github.com/rust-lang/surveys/blob/main/surveys/2021-annual-survey/questions.md</a> This year we have changed things a lot more from previous years than has been done in the past, so we'd really like people from the teams to give some feedback. Please take a look and either file issues or leave comments here. Further, if anyone from the rustdoc team could attend a video meeting with Ryan and I in the next week or so, that would be very useful. Please let me know if you're able to do that.</p>",
        "id": 257660767,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1634285214
    },
    {
        "content": "<p>It looks fine to me. I particularly appreciate that it's asking about how useful each tool is for them.</p>\n<p>As for a video meeting, no problem for me, just tell me when you want to do it. Let's maybe wait before scheduling it to see if anyone else from the team wants to attend.</p>",
        "id": 257662575,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1634286205
    },
    {
        "content": "<p>I won't have time for a video call any time soon unfortunately</p>",
        "id": 257965368,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1634521444
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256841\">@Nick Cameron</span> there are some questions for rustdoc that were suggested in <a href=\"#narrow/stream/131828-t-compiler/topic/Rust.20Annual.20Survey/near/246476913\">https://rust-lang.zulipchat.com/#narrow/stream/131828-t-compiler/topic/Rust.20Annual.20Survey/near/246476913</a> and <a href=\"#narrow/stream/294169-t-community.2Frust-survey-2021/topic/Designing.20the.20survey/near/246714176\">https://rust-lang.zulipchat.com/#narrow/stream/294169-t-community.2Frust-survey-2021/topic/Designing.20the.20survey/near/246714176</a></p>",
        "id": 258290272,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1634686865
    },
    {
        "content": "<p>(glad I found those links, I don't think I would have thought of those questions if I had to come up with them from scratch <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> )</p>",
        "id": 258290304,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1634686897
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256841\">@Nick Cameron</span> thanks for posting re: the survey. There's something I've been thinking about how best to ask. Something like this:</p>\n<p>Does your editor display inlay hints for type annotations (<a href=\"https://rust-analyzer.github.io/manual.html#inlay-hints\">https://rust-analyzer.github.io/manual.html#inlay-hints</a>)? [yes, no, it can but I turned it off]</p>\n<p>If yes, do they make you more productive? [strong disagree, weak disagree, neutral, weak agree, strong agree]</p>\n<p>My hypothesis is that seeing the type annotations for inferred types tremendously helps beginners feel more confident they understand what's going on; but talking to more experience Rustaceans, I sometimes hear they find type annotations distracting and unnecessary.</p>",
        "id": 259908778,
        "sender_full_name": "jsha",
        "timestamp": 1635794835
    },
    {
        "content": "<p>(fwiw, I use type inlays all the time and find them helpful)</p>",
        "id": 259911669,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1635796356
    },
    {
        "content": "<blockquote>\n<p>talking to more experience Rustaceans, I sometimes hear they find type annotations distracting and unnecessary.</p>\n</blockquote>\n<p>Speaking for myself: I'm mixed about them. I've been using rust-analyzer for ~1 month; I currently have them on, and overall I think they're helpful, but they do feel distracting sometimes.</p>",
        "id": 259918308,
        "sender_full_name": "Noah Lev",
        "timestamp": 1635799334
    },
    {
        "content": "<p>(Peanut gallery comment) At least in C# it often ends up doing things like \"look, this is a Task!\" (like a <code>Future</code> or promise) which isn't that helpful, but it's also very common in C# to name variables after their type, so things might be different in Rust.  I tend to care much more about the \"hover when I really need to see it\" functionality -- though really I wish there was more of a \"open the docs for whatever the type is\", since if I need to ask the IDE it tends to be because it's something weird like a <a href=\"https://docs.microsoft.com/en-us/dotnet/api/microsoft.aspnetcore.http.headerdictionary?view=aspnetcore-5.0\"><code>HeaderDictionary</code></a> where I can't really just guess at what I can do with it.</p>",
        "id": 259945331,
        "sender_full_name": "scottmcm",
        "timestamp": 1635818700
    },
    {
        "content": "<blockquote>\n<p>though really I wish there was more of a \"open the docs for whatever the type is\"</p>\n</blockquote>\n<p>Doesn't rust-analyzer have a way to do that? Or maybe it just opens the source code, not the docs.</p>",
        "id": 259945399,
        "sender_full_name": "Noah Lev",
        "timestamp": 1635818767
    },
    {
        "content": "<p>I wouldn't be surprised if it does.  The C# thing I was using doesn't, though -- probably in part because C# doesn't have a good convention of having a reliable documentation place for stuff.</p>",
        "id": 259949938,
        "sender_full_name": "scottmcm",
        "timestamp": 1635823988
    },
    {
        "content": "<p>The type annotation inlay hint thing is one of the only default rust-analyzer features I disable, but that's mostly because I dislike inlay hints of all kinds, they screw with my ability to navigate with the cursor when phantom text is around. I use the hover feature for types all the time</p>",
        "id": 259987030,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1635855429
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"271719\">Mario Carneiro</span> <a href=\"#narrow/stream/266220-rustdoc/topic/2021.20survey/near/259987030\">said</a>:</p>\n<blockquote>\n<p>The type annotation inlay hint thing is one of the only default rust-analyzer features I disable, but that's mostly because I dislike inlay hints of all kinds, they screw with my ability to navigate with the cursor when phantom text is around. I use the hover feature for types all the time</p>\n</blockquote>\n<p>Yeah, I've been considering disabling it for that exact reason.</p>",
        "id": 260025028,
        "sender_full_name": "Noah Lev",
        "timestamp": 1635872102
    },
    {
        "content": "<p>Perhaps if we have a question on the survey, it should be about type hints in general (inlay or on-hover).</p>",
        "id": 260025287,
        "sender_full_name": "Noah Lev",
        "timestamp": 1635872192
    },
    {
        "content": "<p>That's a great idea for something to ask about. I think it's a bit late for this year, but I filed an issue for next year's survey: <a href=\"https://github.com/rust-lang/surveys/issues/173\">https://github.com/rust-lang/surveys/issues/173</a></p>",
        "id": 260962403,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1636535603
    }
]