[
    {
        "content": "<p>I just thought about a solution that might fix the name conflicts and wouldn't require to change the URL pattern we're using:</p>\n<p>We could check for all the items we'll generate and when there is a conflict, still generate a file which would contain the headers and only a <code>&lt;script&gt;</code> tag which would load the correct file based on the URL in the current HTML directly.</p>\n<p>What do you think?</p>",
        "id": 231952929,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1616760352
    },
    {
        "content": "<p>Hmm I don't think that would actually help - the redirect file could overwrite the one with different casing or vice versa</p>",
        "id": 231964248,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1616765522
    },
    {
        "content": "<p>no I mean, before starting generating files, we check if some would conflict in case insensitive scenario. For those conflicts, we generate a html file which contains a <code>&lt;script&gt;</code> which will load the correct html depending on the URL</p>",
        "id": 232012545,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1616783591
    },
    {
        "content": "<p>Is it more clear?</p>",
        "id": 232012571,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1616783601
    },
    {
        "content": "<p>oh I see! I like that :)</p>",
        "id": 232014098,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1616784347
    },
    {
        "content": "<p>I think all the case-insensitive files are still case-preserving, you'd need to test it though</p>",
        "id": 232014159,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1616784370
    },
    {
        "content": "<p>At least on windows, it opens the same file, whatever the case. So we should be fine.</p>",
        "id": 232017970,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1616786125
    },
    {
        "content": "<p>This seems like a neat idea, but I wonder if there are some browsers that have case-insensitive URLs? Maybe we don't worry about that, but I thought it's worth bringing up just in case.</p>\n<p>Also, I'd rather avoid using more JS. But I guess this seems like the best solution so far :)</p>",
        "id": 232043571,
        "sender_full_name": "Noah Lev",
        "timestamp": 1616799956
    }
]