[
    {
        "content": "<p>I tried to write up how we currently distinguish headings from sections, to make it easier to stay consistent, and to give a framework for thinking about potential changes. Please take a read and let me know if it's accurate and matches your understanding. If we wind up in agreement, I'd like to send a PR to add it to <a href=\"https://rustc-dev-guide.rust-lang.org/rustdoc.html\">https://rustc-dev-guide.rust-lang.org/rustdoc.html</a></p>\n<p>A Google doc version with fun markup: <a href=\"https://docs.google.com/document/d/18_0e3hm3ibNUdIZyyUWRYpjdkpTAe-pkjgkWOtntqlk/edit?usp=sharing\">https://docs.google.com/document/d/18_0e3hm3ibNUdIZyyUWRYpjdkpTAe-pkjgkWOtntqlk/edit?usp=sharing</a></p>\n<p>Plain text for convenience:</p>\n<p>In Rustdoc we use a variety of styles to separate headings from their sections:</p>\n<ul>\n<li>Font family</li>\n<li>Font size</li>\n<li>Font weight</li>\n<li>Indenting the section</li>\n<li>Underlining the header</li>\n</ul>\n<p>Some basic guidelines:</p>\n<p>For a heading that contains identifiers, types, and/or Rust syntax (a Rusty heading), we use font-family: Source Code Pro and font-weight: 600. Most of the time these headings use font-size: 1em, though they may be bigger in a few cases.</p>\n<p>If a Rusty heading is subordinate to another Rusty heading, we usually use indentation to distinguish the hierarchy. In that case, we use an indent of 24px.</p>\n<p>For prose headings (generated from Markdown, or English words built into rustdoc itself), we use font-family: Fira Sans, font size, font weight: 500, and underlining. We don't use indentation. We only use underlining in the top-doc, where the prose is not subject to any outside hierarchy. Using underlining elsewhere makes the page look visually separated in a place where it's not meant to be.</p>\n<p>When picking a font size for prose headings, be consistent with other font sizes within rustdoc: specify the font size in em, and try to use a font size already in use for headers elsewhere in rustdoc: at the time of writing: 1em, 1.1em, 1.15em, 1.3em, 1.4em, or 1.5em (with 0.8em used for subcomponents of some Rusty headers).</p>\n<p>Avoid inverting the hierarchy: If an h3 is bold, its parent h2 should be too. A subordinate heading should not be bigger than its parents, though it may be the same size.</p>",
        "id": 258662890,
        "sender_full_name": "jsha",
        "timestamp": 1634878647
    },
    {
        "content": "<p>This is in particular related to these two PRs: <a href=\"https://github.com/rust-lang/rust/pull/90089\">https://github.com/rust-lang/rust/pull/90089</a> and <a href=\"https://github.com/rust-lang/rust/pull/90155\">https://github.com/rust-lang/rust/pull/90155</a>, and in general with improving readability.</p>",
        "id": 258663689,
        "sender_full_name": "jsha",
        "timestamp": 1634879395
    },
    {
        "content": "<p>Hard to \"see it\" without images but I think we need to improve rustdoc headings in any case <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 258679228,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1634891252
    },
    {
        "content": "<p>I agree we need to improve our handling of headings. What are your thoughts on what needs to be improved?</p>",
        "id": 258729284,
        "sender_full_name": "jsha",
        "timestamp": 1634917092
    },
    {
        "content": "<p>Given how much we're changing the heading styles right now, codifying the exact \"rules\" seems too soon to me. I think once the layout settles down a bit, it'd be a good idea though.</p>",
        "id": 258773892,
        "sender_full_name": "Noah Lev",
        "timestamp": 1634936414
    },
    {
        "content": "<p>My goal with this doc is to try and describe the current rules we implicitly seem to have, so I can understand if I'm moving things in the direction of more consistency or less consistency. And to understand, when we need to break the current implicit rules, if that suggests we should change other things too. Kind of a \"here's the status quo\" doc rather than \"these are the forever rules\"</p>",
        "id": 258777163,
        "sender_full_name": "jsha",
        "timestamp": 1634938004
    },
    {
        "content": "<p>Heading styles have settled down a bit. How do folks feel about writing down our implied rules about how they are styled?</p>",
        "id": 266964609,
        "sender_full_name": "jsha",
        "timestamp": 1641403788
    }
]