[
    {
        "content": "<p>I realized today that we have two types of code block in rustdoc, and they use significantly different visual languages:</p>\n<p>The top-doc code block only colors method and type names in traits:</p>\n<p><a href=\"/user_uploads/4715/wia-S8kNQMHTGxX53zywBXVv/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/4715/wia-S8kNQMHTGxX53zywBXVv/image.png\" title=\"image.png\"><img src=\"/user_uploads/4715/wia-S8kNQMHTGxX53zywBXVv/image.png\"></a></div><p>The example code blocks use full syntax highlighting, coloring keywords and constants:</p>\n<p><a href=\"/user_uploads/4715/jjWWyHvNkUh1-_QuXWEDav0F/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/4715/jjWWyHvNkUh1-_QuXWEDav0F/image.png\" title=\"image.png\"><img src=\"/user_uploads/4715/jjWWyHvNkUh1-_QuXWEDav0F/image.png\"></a></div><p>I'm not totally sure what to do about it, if anything. The links in the top-doc seem useful. But the inconsistency bugs me a little.</p>",
        "id": 270173717,
        "sender_full_name": "jsha",
        "timestamp": 1643706706
    },
    {
        "content": "<p>I've noticed this! The source pages use the example colouring, but it looks different again because the examples are usually just a function body, whereas the source code includes signatures, attributes, etc</p>",
        "id": 270190017,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1643713781
    },
    {
        "content": "<p>I'd also note that although the syntax highlighting of signatures is useful, because the signatures are also titles I think it significantly contributes to the 'chaotic' feeling of rustdoc's design</p>",
        "id": 270190133,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1643713833
    },
    {
        "content": "<p>Yeah, agreed- and this was one of the suggestions in <a href=\"https://github.com/rust-lang/rust/issues/59845\">https://github.com/rust-lang/rust/issues/59845</a>, to reduce the use of color somewhat. I think the colors of method signatures are probably too useful to get rid of, but I'd kind of like to get the code examples using a scheme that meaningfully relates to the scheme in use for the signature headings. For instance, the purple <code>let</code> above is close enough to the trait color that it might be confusing; there's also a blue for <code>mut</code> that is quite close to the link color.</p>",
        "id": 270200760,
        "sender_full_name": "jsha",
        "timestamp": 1643718745
    },
    {
        "content": "<p>The top-doc example basically uses the same color scheme as the method signatures, though it looks slightly different from them because (a) it's on a grey background and (b) it's not bolded.</p>",
        "id": 270200933,
        "sender_full_name": "jsha",
        "timestamp": 1643718850
    },
    {
        "content": "<p>Any improvement is very welcome! :D</p>",
        "id": 270233307,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1643730630
    },
    {
        "content": "<p>I've long been annoyed by the type-decl block not having full syntax highlighting. But it's somewhat tricky to \"solve\" because rustdoc wants to insert links etc. into it, so we can't just run the parser on it like with examples.</p>",
        "id": 270612261,
        "sender_full_name": "Noah Lev",
        "timestamp": 1643919955
    }
]