[
    {
        "content": "<p>I've been reading docs on my iPad Pro 9.7-inch 2018, and noticed the text seemed a little cramped. Here's a photo compared to my monitor.</p>\n<p><a href=\"/user_uploads/4715/bxXtX0xpHycIb0OqgBdhUKYv/PXL_20211209_040525710-1.jpg\">PXL_20211209_040525710-1.jpg</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/4715/bxXtX0xpHycIb0OqgBdhUKYv/PXL_20211209_040525710-1.jpg\" title=\"PXL_20211209_040525710-1.jpg\"><img src=\"/user_uploads/4715/bxXtX0xpHycIb0OqgBdhUKYv/PXL_20211209_040525710-1.jpg\"></a></div><p>On the monitor, I adjusted the browser width to _just_ the point that the sidebar disappears. Note that on the monitor, the sidebar disappears at a wider (physical) width than on the iPad. On the iPad, we still show the sidebar even though there's only room to display about 58 characters per line of text (a good goal is ~85).</p>\n<p>I suspect this is because we specify our different widths in terms of pixels, and the pixel density is different. AFAICT it's 163ppi on the monitor and 264ppi on the iPad. That's a little surprising though because I thought mobile devices wound up \"faking\" <code>px</code> measurements because so many websites weren't designed with high DPI in mind.</p>\n<p>Anyhow, just a little curiosity and thinking aloud. I kinda think the iPad (and devices of similar size / DPI) should hide the sidebar in vertical mode so there's more room for text. Will keep poking at the details.</p>",
        "id": 264255399,
        "sender_full_name": "jsha",
        "timestamp": 1639023800
    },
    {
        "content": "<p>Collapsing the sidebar earlier seems reasonable :) there's always the little button to open it again</p>",
        "id": 264255758,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1639024192
    },
    {
        "content": "<p>yeah, adjusting the px threshold higher would be a reasonable approach. But now I really want to figure out the \"right\" thing - like should this be specified in inches / cm? probably not, because even though the iPad is physically smaller you hold it closer to your face.</p>\n<p>Probably the right thing is to specify in units relative to the font size - like <code>em</code> or <code>ch</code>. I just tried that and it didn't seem to make a difference.</p>",
        "id": 264256422,
        "sender_full_name": "jsha",
        "timestamp": 1639024931
    },
    {
        "content": "<p>the relative size of px/em/in/ch seems exactly the same between monitor and iPad, testing <a href=\"https://rustdoc.crud.net/jsha/widths.html\">https://rustdoc.crud.net/jsha/widths.html</a>. Which makes sense - we're using a custom font, and we set the font size, so <code>em</code> (the size of an 'M') should be the same.</p>\n<p>So yeah, I'm thinking of this wrong. In particular I was looking at the monitor version (with sidebar collapsed) and wondering \"why does this display so many more characters?\" When the answer, of course was that the sidebar was already collapsed and I was comparing it with an iPad where the sidebar was _not_ collapsed. Had nothing to do with screen size or pixel density. :-)</p>",
        "id": 264257346,
        "sender_full_name": "jsha",
        "timestamp": 1639025990
    }
]