[
    {
        "content": "<p>Now that <code>doc_cfg</code> is in a relatively good state, how difficult would it be to add a setting where the enabled features/cfgs can be toggled? It would be pretty neat imo if I could say \"I have these features enabled\" and just see what I can use and nothing else. Would also be useful for OS-level differences.</p>",
        "id": 261339928,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1636779351
    },
    {
        "content": "<p>I have two comments:</p>\n<ol>\n<li>I think we should be focusing on stabilizing existing features, not adding new ones. Rustdoc has a <em>lot</em> of unstable features that have been in limbo for a very long time (see <a href=\"#narrow/stream/266220-rustdoc/topic/unstable.20features\">https://rust-lang.zulipchat.com/#narrow/stream/266220-rustdoc/topic/unstable.20features</a>). It also has quite a lot of technical debt that I've been trying to pay down for over a year now.</li>\n<li><code>doc_cfg</code> has not gone through RFC and people keep trying to add more features to it (or changing existing features). I would like to see an RFC for it before making any further changes.</li>\n</ol>",
        "id": 261341382,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1636781271
    },
    {
        "content": "<p>Also, anything that adds more buttons to the frontend is an especially tough sell because it's already quite crowded; <span class=\"user-mention silent\" data-user-id=\"315412\">jsha</span> has been spending quite a lot of time trying to make the UI easier to read and everything we add regresses that a bit even if it's a great feature in isolation.</p>",
        "id": 261341459,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1636781396
    },
    {
        "content": "<p>In short I agree this is a really cool feature to have but I don't think rustdoc is in a good place to add it right now.</p>",
        "id": 261341523,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1636781454
    },
    {
        "content": "<p>That said you can do this pretty easily at compile time by passing exactly the cfgs you want to show</p>",
        "id": 261341681,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1636781712
    },
    {
        "content": "<p>Yeah...paying down existing technical debt is probably best. Some day! <span aria-label=\"fingers crossed\" class=\"emoji emoji-1f91e\" role=\"img\" title=\"fingers crossed\">:fingers_crossed:</span></p>",
        "id": 261341772,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1636781820
    },
    {
        "content": "<p>(I feel kind of guilty about saying this when rustdoc just added -Zscrape-examples and the jump to definition thing, but also the more big features we have baking the more reluctant it makes me to add more)</p>",
        "id": 261341839,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1636781919
    },
    {
        "content": "<p>And FWIW I'm going to ask Guillaume to write an RFC for go to definition at some point</p>",
        "id": 261341859,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1636781954
    },
    {
        "content": "<p>Oh, don't worry about possibly hypocrisy haha. It was just a random thought I had that seemed interesting <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span> I fully understand that other things are and should be prioritized</p>",
        "id": 261343211,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1636783805
    }
]