[
    {
        "content": "<p>The main sidebar heading is a copy of the item name. Sometimes it wraps (this happened before the sidebar redesign too):</p>\n<p><a href=\"/user_uploads/4715/M5JYM7f_ayY6dDP_5tBHGRqF/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/4715/M5JYM7f_ayY6dDP_5tBHGRqF/image.png\" title=\"image.png\"><img src=\"/user_uploads/4715/M5JYM7f_ayY6dDP_5tBHGRqF/image.png\"></a></div>",
        "id": 269727675,
        "sender_full_name": "jsha",
        "timestamp": 1643372806
    },
    {
        "content": "<p>What do y'all think of making it ellipsize instead? That would lose information, but we already have the full item name at the top of the page. And as of recently, clicking that sidebar heading links you to the top of the page.</p>",
        "id": 269727722,
        "sender_full_name": "jsha",
        "timestamp": 1643372854
    },
    {
        "content": "<p>I would love to have a sticky top bar with the item name and search box, then you wouldn't need the title in the side bar at all and I could search without scrolling all the way back up</p>",
        "id": 269733583,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1643375789
    },
    {
        "content": "<p>(and can easily see which of the million rustdoc tabs I'm in)</p>",
        "id": 269733638,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1643375816
    },
    {
        "content": "<p>In the meantime, I think ellipses would be fine</p>",
        "id": 269733681,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1643375838
    },
    {
        "content": "<p>for mobile we now have such a sticky bar. No search, but clicking the item name in the topbar will (soon) take you back to the top of the page, where you can search.</p>\n<p>For desktop - have you tried the 'S' keyboard shortcut? It's great!</p>",
        "id": 269743789,
        "sender_full_name": "jsha",
        "timestamp": 1643380078
    },
    {
        "content": "<p>I haven't, it sounds great for me! But I think for new users having a sticky search box would be useful and discoverable and doesn't take up much screen space</p>",
        "id": 269744657,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1643380430
    },
    {
        "content": "<p>I'm kinda reluctant to add a sticky bar on desktop mainly because we already have one in <a href=\"http://docs.rs\">docs.rs</a>, and stacking up two is not great, particularly when their design is quite different. We stack em up on mobile because we need both. In particular rustdoc's sticky bar is needed so we have a place to hang the hamburger menu. Though I've proposed to merge the two, at least on mobile.</p>",
        "id": 269746521,
        "sender_full_name": "jsha",
        "timestamp": 1643381203
    },
    {
        "content": "<p>Fair. I think most of the <a href=\"http://docs.rs\">docs.rs</a> sticky would combine well with a rustdoc one with the item name, but having the two search boxes would be a bit weird</p>",
        "id": 269748449,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1643381980
    }
]