[
    {
        "content": "<p>I'm trying to migrate the compiler to 2021, and it looks like this lint attempts to tokenize input without passing in the edition of the code block (e.g., <code>edition2018</code>), which runs into errors. (It also seems like the lint is not actually parsing text, just getting a token stream, but that I'm less certain on -- just because async fn foo() {} gives no warnings in 2015).</p>",
        "id": 254084967,
        "sender_full_name": "simulacrum",
        "timestamp": 1632158198
    },
    {
        "content": "<p>I'm going to silence the lint for now, but wanted to ask if this was a known issue or if a bug report etc makes sense</p>",
        "id": 254085005,
        "sender_full_name": "simulacrum",
        "timestamp": 1632158219
    },
    {
        "content": "<p>That does seem like a bug. Could you file a bug report?</p>",
        "id": 254089191,
        "sender_full_name": "Noah Lev",
        "timestamp": 1632159870
    },
    {
        "content": "<p>Will put it on my list</p>",
        "id": 254089480,
        "sender_full_name": "simulacrum",
        "timestamp": 1632159971
    },
    {
        "content": "<p>I suspect the issue is that when we call <code>parse_stream_from_source_str</code>, we need to pass an overrided span that has the correct edition instead of <code>None</code>, which I think inherits the crate's edition.</p>",
        "id": 254089838,
        "sender_full_name": "Noah Lev",
        "timestamp": 1632160120
    },
    {
        "content": "<p>Yeah, that was my suspicion as well when trying to dig in</p>",
        "id": 254089954,
        "sender_full_name": "simulacrum",
        "timestamp": 1632160187
    },
    {
        "content": "<p>I'll look into it a bit more; it <em>might</em> be an easy fix.</p>",
        "id": 254090145,
        "sender_full_name": "Noah Lev",
        "timestamp": 1632160259
    },
    {
        "content": "<p>Ok, going to go ahead and file an issue. I think this may be something we need to backport, or move the lint to allow by default temporarily in 2021... this is hitting a <em>bunch</em> of code that was \"fine\" before because we're definitely just tokenizing</p>",
        "id": 254143874,
        "sender_full_name": "simulacrum",
        "timestamp": 1632188407
    },
    {
        "content": "<p>Yeah, I think the best bet is to move it to allow-by-default temporarily in 2021, and then we can properly fix it after. It is a bit surprising that it only tokenizes; I suspect the purpose of the lint is more to make sure syntax highlighting will work, but of course, it isn't really useful to syntax-highlight non-Rust code.</p>",
        "id": 254149560,
        "sender_full_name": "Noah Lev",
        "timestamp": 1632193607
    },
    {
        "content": "<p>I pinged the team on the issue for further discussion.</p>",
        "id": 254149638,
        "sender_full_name": "Noah Lev",
        "timestamp": 1632193692
    }
]