[
    {
        "content": "<p>JS has an odd thing called \"Automatic Semicolon Insertion\" (<a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Lexical_grammar#automatic_semicolon_insertion\">https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Lexical_grammar#automatic_semicolon_insertion</a>). Both of these are valid:</p>\n<div class=\"codehilite\"><pre><span></span><code>let foo = function() {}\nif (bar) {\n  console.log(&quot;hi&quot;)\n}\n</code></pre></div>\n<div class=\"codehilite\"><pre><span></span><code>let foo = function() {};\nif (bar) {\n  console.log(&quot;hi&quot;)\n}\n</code></pre></div>\n<p>(note the semicolon after <code>let foo</code>)</p>\n<p>Setting aside whether we should stylistically require the semicolons or not - our minifier messes up these cases. If you wrote the first one, it would work with unminified code, but when the \"real\" minified version gets built, it would break (because the <code>if</code> would be put right after the <code>let</code> without an intervening semicolon).</p>\n<p>This has bit me a few times and is a stumbling block when working on our JS. Unfortunately I'm not sure the best way to fix it. I think making our minifier aware of ASI would require actually parsing the JS.</p>",
        "id": 267900647,
        "sender_full_name": "jsha",
        "timestamp": 1642094149
    },
    {
        "content": "<p>It's a known issue. I still hope someone will write a JS minifier in Rust so I can remove mine but I guess it's not happening any time soon... :'(</p>",
        "id": 267912297,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1642099418
    },
    {
        "content": "<p>Wouldn't the easiest fix be to just require semicolons in our JS? IIRC, it's very common to require them in style guides for simplicity.</p>",
        "id": 267916125,
        "sender_full_name": "Noah Lev",
        "timestamp": 1642101117
    },
    {
        "content": "<p>Normally they're supposed to be required with eslint...</p>",
        "id": 267916665,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1642101354
    },
    {
        "content": "<p>I'm fine with requiring semicolons, but to do so requires a JS parser or ESLint. The issue occurs when you're iterating on an unminified file, and then do a full build and have a surprising error. So what I'd like is something that can catch the lint violation at the full build step, OR a minifier that does the right thing.</p>",
        "id": 267920421,
        "sender_full_name": "jsha",
        "timestamp": 1642103156
    },
    {
        "content": "<p>eslint is run in the CI so that should be fine normally.</p>",
        "id": 267921615,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1642103693
    },
    {
        "content": "<p>yeah - it's a dev-time annoyance more than anything else</p>",
        "id": 267924655,
        "sender_full_name": "jsha",
        "timestamp": 1642105168
    },
    {
        "content": "<p>Oh I see. Little advice: simply copy/paste your js file into the build dir</p>",
        "id": 267924758,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1642105204
    },
    {
        "content": "<p>that's how i do so I don't have to regen every time :3</p>",
        "id": 267924787,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1642105219
    },
    {
        "content": "<p>that's what runs me into the problem. actually what I do is: I have a script <code>link.sh</code> that symlinks all JS and CSS from a built docs to the version in source control. That lets me iterate really fast, without worrying about losing my files.</p>\n<p>The problem is I get something that works in symlinked mode, but stops working when I do an actual build. Same problem would happen with copying.</p>",
        "id": 267926437,
        "sender_full_name": "jsha",
        "timestamp": 1642106063
    },
    {
        "content": "<p>well, the copy seems \"safer\", but you need to run it at each build</p>",
        "id": 267928052,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1642106919
    }
]