[
    {
        "content": "<p>hey all -- while reviewing <a href=\"https://github.com/rust-lang/rust/pull/92800\">https://github.com/rust-lang/rust/pull/92800</a>, I was interested in seeing what kinds of differences between the docs we generate for different platforms are currently present. It looks like a common case is different sort order for the foreign impls for a given type (and presumably in general the vec in implementors) -- <a href=\"https://github.com/rust-lang/rust/blob/master/src/librustdoc/formats/cache.rs#L70\">https://github.com/rust-lang/rust/blob/master/src/librustdoc/formats/cache.rs#L70</a></p>\n<p>I have two related questions (1) does someone have a quick idea for what might cause that sort of non-determinism across platforms, and (2) would patches fixing it be welcome?</p>\n<p>In general, if we can get to a point where at least std's docs are equivalent independent of the host platform rendering them, it would let us generate only a single tarball of docs which would be quite convenient. Obviously, we aren't anywhere near there yet I suspect, but this bug makes it harder to determine which files are \"actually\" different or just have a slightly different ordering.</p>",
        "id": 268298234,
        "sender_full_name": "simulacrum",
        "timestamp": 1642441156
    },
    {
        "content": "<p>I suspect it's related to this: <a href=\"https://github.com/rust-lang/rust/issues/85418\">https://github.com/rust-lang/rust/issues/85418</a></p>\n<p>What you see under the \"Implementors\" section is actually pasted together by JS from two sources:</p>\n<ul>\n<li>The HTML, which was generated by the rustdoc run for the current crate, and</li>\n<li>Some JS containing a list of additional implementors, seen when documenting other crates into the same directory.</li>\n</ul>\n<p>The JS gets updated by each rustdoc run. So for instance for the <code>std</code> docs, that's five runs: <code>core</code>, <code>alloc</code>, <code>std</code>, <code>proc_macro</code>, <code>test</code>. Those are run concurrently, so the order in which the JS gets updated is nondeterministic.</p>\n<p>If the goal is determinism of display, we could put some sorting in the JS. It would still not be sorting relative to the other impls, but it would be more deterministic.</p>",
        "id": 268300559,
        "sender_full_name": "jsha",
        "timestamp": 1642442656
    },
    {
        "content": "<p>also see discussion here about a possible rearrangement of the \"Implementors\" sections - <a href=\"#narrow/stream/266220-rustdoc/topic/implementors.20in.20foreign.20crates\">https://rust-lang.zulipchat.com/#narrow/stream/266220-rustdoc/topic/implementors.20in.20foreign.20crates</a></p>",
        "id": 268300591,
        "sender_full_name": "jsha",
        "timestamp": 1642442690
    },
    {
        "content": "<p>I don't think this is related to the JS/HTML merging; I'm diff'ing the raw html files</p>",
        "id": 268304790,
        "sender_full_name": "simulacrum",
        "timestamp": 1642445716
    }
]