[
    {
        "content": "<p>Hi T-rustdoc leads (<span class=\"user-mention\" data-user-id=\"210316\">@GuillaumeGomez</span> <span class=\"user-mention\" data-user-id=\"232545\">@Joshua Nelson</span>)<br>\nand cc: all other team members</p>\n<p>I noticed that <code>T-rustdoc</code> has its own labelling on the rust-lang issue tracker but lacks an official \"dress\" on the website. After a bit of investigation, turns out that rustdoc is still a sub-team of devtools:<br>\n<a href=\"https://github.com/rust-lang/team/blob/c1562d18e2305663b830a1ea2ee4e620756fca00/teams/rustdoc.toml#L2\">https://github.com/rust-lang/team/blob/c1562d18e2305663b830a1ea2ee4e620756fca00/teams/rustdoc.toml#L2</a></p>\n<p>And this is why it doesn't appear on the website:<br>\n<a href=\"https://www.rust-lang.org/governance\">https://www.rust-lang.org/governance</a></p>",
        "id": 255742076,
        "sender_full_name": "apiraino",
        "timestamp": 1633094444
    },
    {
        "content": "<p>I am not the only one being confused, sometimes I receive questions about \"where can I find the rustdoc team\" :-)<br>\nI can imagine this is something stemming for the early days of Rust (when teams had more subprojects under the same umbrella).<br>\nI have the feeling that <code>T-rustdoc</code> should be more discoverable and reflect what in the end is the <em>de facto</em> status I see on the issue tracker.</p>\n<p>Opinions?</p>",
        "id": 255742136,
        "sender_full_name": "apiraino",
        "timestamp": 1633094468
    },
    {
        "content": "<p>I agree with you: it's been a bit confusing for users I interacted with when they had issues about rustdoc to report. Making rustdoc more visible (or even more a \"complete\" team) would likely improve things. <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 255742357,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1633094558
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"132040\">@Manish Goregaokar</span></p>",
        "id": 255742898,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1633094774
    },
    {
        "content": "<p>it seems better to fix the website than to reorganize the whole team structure just to make rustdoc pop up</p>",
        "id": 255757843,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1633100514
    },
    {
        "content": "<p>You'd be surprised. :)</p>",
        "id": 255759662,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1633101298
    },
    {
        "content": "<p>I don't think rustdoc should move out of the devtools team: the point of the devtools team is for the devtools to be able to work together and share expertise. If we  split out teams because they were healthy clippy would have been split out ages ago :)</p>\n<p>it's not that rustdoc is \"still a subteam of devtools\", it's _supposed to be_, it's not something that should change</p>\n<p>T-rustdoc exists mostly because rustdoc is a bit quirky and is maintained in the same repo, unlike all the other tools.</p>",
        "id": 255761212,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1633101919
    },
    {
        "content": "<p>I'm not sure why we should change the website either, really, that page is about the governance, and it accurately reflects the governance. Yes, the devtools sub-teams are autonomous, but that's still the governance structure.</p>",
        "id": 255761347,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1633101964
    },
    {
        "content": "<p>But if folks feel strongly about updating the website it could be done</p>",
        "id": 255761383,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1633101981
    },
    {
        "content": "<p>overall I think that this is a symptom of a larger set of problems about the discoverability of our governance</p>",
        "id": 255761438,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1633102009
    },
    {
        "content": "<p>and the website is just <em>a bad place</em> for governance to be discovered</p>",
        "id": 255761462,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1633102020
    },
    {
        "content": "<p><a href=\"https://github.com/rust-lang/governance\">https://github.com/rust-lang/governance</a> is where we're doing our chartering efforts and better documenting team governance : if y'all want to show up there (eventually that will be an mdbook and the source of truth for governance) you should reach out to Aidan and say you want to try chartering rustdoc</p>",
        "id": 255761653,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1633102094
    },
    {
        "content": "<p>we're in a bit of a lull period rn on chartering but hoping to get restarted soon</p>",
        "id": 255761674,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1633102105
    },
    {
        "content": "<p>basically: This is perhaps the smallest reason as to why the website governance page is bad. we've known about this for years and have a more holistic way to fix it, but it's a lot more effort</p>",
        "id": 255762909,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1633102591
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"132040\">@Manish Goregaokar</span> thanks for the context. Personally, I don't fully agree with all the points you exposed. I see this from a) the end user point of view, landing of <a href=\"http://rust-lang.org/governance\">rust-lang.org/governance</a> and not necessarily interested in all the intricacies :-) and b) my POV of  issue triager (I see a lot going on in the main repo for <code>T-rustdoc</code>, as you also point out).</p>",
        "id": 255771723,
        "sender_full_name": "apiraino",
        "timestamp": 1633106017
    },
    {
        "content": "<p>I don't see as a big deal moving T-rustdoc \"one level up\" <a href=\"https://github.com/rust-lang/team/blob/c1562d18e2305663b830a1ea2ee4e620756fca00/teams/rustdoc.toml#L2\">by patching this</a>.</p>",
        "id": 255771741,
        "sender_full_name": "apiraino",
        "timestamp": 1633106025
    },
    {
        "content": "<p>I also suspect this is a recurring topic. I'm embarassed to admit  I <em>still</em> would not correctly explain the difference between the <a href=\"http://docs.rs\">docs.rs</a> and rustdoc teams :-) If, as I think you're hinting, the governance chart needs some updates, we should probably start from somewhere.<br>\nLike, probably update <a href=\"https://www.rust-lang.org/governance/teams/dev-tools\">this page</a> ensuring all active devtools contributors+leads are there and who does what</p>",
        "id": 255771873,
        "sender_full_name": "apiraino",
        "timestamp": 1633106070
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"250987\">@apiraino</span> <a href=\"http://docs.rs\">docs.rs</a> is the website, rustdoc is the tool</p>",
        "id": 255771903,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1633106084
    },
    {
        "content": "<p>(... all imo ofc)</p>",
        "id": 255771947,
        "sender_full_name": "apiraino",
        "timestamp": 1633106106
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"250987\">@apiraino</span> that page is generated from rust-lang/team, it's never outdated</p>",
        "id": 255772314,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1633106292
    },
    {
        "content": "<p>(it's probably true that some of the team positions don't reflect who's still active in the project, but that seems like a separate and much thornier issue)</p>",
        "id": 255772391,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1633106327
    },
    {
        "content": "<p>also, given that this is closest the rust project gets to politics internally, it seems silly to make decisions based on \"it's hard to find on the website\", I don't understand why you think changing the team structure is the best fix for that</p>",
        "id": 255772486,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1633106378
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"250987\">@apiraino</span> I don't understand the issue as a triager.</p>",
        "id": 255784672,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1633111519
    },
    {
        "content": "<p>Like, a governance change is a _big_ lever and it sounds like you're talking about a small problem. I strongly disagree that it's not a big deal to move it \"one level up\"</p>",
        "id": 255784799,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1633111566
    },
    {
        "content": "<p>so, to reiterate very shortly my point: I see <code>T-rustdoc</code>on par with other <code>T-*</code> and I was wondering why it is not. You provided a better context, though some of the points find me in various shades of  (respectful) disagreement. Simple as that.<br>\nOne point I see clearly, though, is that this needs more a top-down agreement (rather than bottom-up) so I get this is not the right place for opening a discussion.</p>",
        "id": 255789579,
        "sender_full_name": "apiraino",
        "timestamp": 1633113712
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"250987\">@apiraino</span> I still don't understand: you see the label as on par, how is that a problem? It <em>is</em> on par, it is a team that makes decisions. Clippy could also have a label like that, as could rustfmt and rustup, they're just maintained in a separate repo so they don't need one. Similarly, there is absolutely a T-libs-api label for the libs-api subteam of libs. These labels have no bearing on the actual governance structure. T- labels are not solely for toplevel teams, it's just that toplevel teams are more likely to want them</p>",
        "id": 255850981,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1633160841
    },
    {
        "content": "<p>the existence of a T- label just means \"this team wants to make decisions on this topic on this repo\"</p>",
        "id": 255851079,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1633160952
    },
    {
        "content": "<p>We have toplevel teams that do not work on rust-lang/rust, and we have subteams that do, and we also have other subteams that don't. Where the team works (which influences who has a label, alongside whether they have their own decisionmaking) is not relevant to the governance structure</p>",
        "id": 255851198,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1633161101
    }
]