[
    {
        "content": "<p>Just like <a href=\"#narrow/stream/266220-rustdoc/topic/UI.20regression.3F\">https://rust-lang.zulipchat.com/#narrow/stream/266220-rustdoc/topic/UI.20regression.3F</a>, we got complains about the change of location of the paintbrush (mostly in <a href=\"https://github.com/rust-lang/rust/issues/93216\">https://github.com/rust-lang/rust/issues/93216</a>). Should we do something about it?</p>",
        "id": 272924698,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1645609413
    },
    {
        "content": "<p>I would be in favor of putting it back. Not necessarily at the same place, could be with the other button in the right.</p>",
        "id": 272927063,
        "sender_full_name": "Urgau",
        "timestamp": 1645610634
    },
    {
        "content": "<p>What do you think <span class=\"user-mention\" data-user-id=\"315412\">@jsha</span> ?</p>",
        "id": 272929670,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1645612132
    },
    {
        "content": "<p>I would like to remove the paintbrush entirely, but if that's not going to fly, putting it in the right-hand group is the next best thing. Switching themes does not deserve to be the single most prominent button in the entire application.</p>",
        "id": 272967190,
        "sender_full_name": "Michael notriddle Howell",
        "timestamp": 1645631441
    },
    {
        "content": "<p>I think we're getting some good ideas in the issue thread about how to make doing it in settings have a nicer UI. <span class=\"user-mention\" data-user-id=\"210053\">@Michael notriddle Howell</span> shared a very nice example of Pocket's UI for the equivalent task, which I like a lot. I also noticed that GMail's basic settings UI has a similar thing (though it does not offer color scheme options, presumably deferring to the OS).</p>\n<p>I think <a href=\"https://github.com/rust-lang/rust/pull/93097\">https://github.com/rust-lang/rust/pull/93097</a> is a precursor to such a change. <span class=\"user-mention\" data-user-id=\"210316\">@GuillaumeGomez</span>, want to bring that up to date with merge  conflicts and the latest radio-button UI style?</p>\n<p>Besides ease of access, one of the main themes of the thread is discoverability. For other features that we want to make sure people know about, we document them on the front page of the std docs: <a href=\"https://doc.rust-lang.org/nightly/std/\">https://doc.rust-lang.org/nightly/std/</a> (<code>[-]</code> and <code>source</code>). We could do the same for themes. It's worth noting that the existence of OS settings for dark and light mode is quite well known - Android, iOS, macOS, and Windows all support it, and have put a fair amount of effort into marketing it to users. It's mainly on Linux that dark/light theme support is lagging. That's still an important group of users, of course. Many many Rust developers, myself included, are full-time Linux users. But I suspect that it won't be long before Linux (and browsers running on Linux) have support for OS setting of dark and light mode on par with other OSes.</p>",
        "id": 273194073,
        "sender_full_name": "jsha",
        "timestamp": 1645771220
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"315412\">jsha</span> <a href=\"#narrow/stream/266220-rustdoc/topic/put.20back.20paintbrush.3F/near/273194073\">said</a>:</p>\n<blockquote>\n<p>I think <a href=\"https://github.com/rust-lang/rust/pull/93097\">https://github.com/rust-lang/rust/pull/93097</a> is a precursor to such a change. <span class=\"user-mention silent\" data-user-id=\"210316\">GuillaumeGomez</span>, want to bring that up to date with merge  conflicts and the latest radio-button UI style?</p>\n</blockquote>\n<p>I'm planning to once the search PR is merged (because they both change a lot of things in the JS and I'd prefer for the search PR to be merged first).</p>\n<p>I also really like the pocket approach. :)</p>",
        "id": 273205995,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1645781294
    },
    {
        "content": "<blockquote>\n<p>For other features that we want to make sure people know about, we document them on the front page of the std docs: <a href=\"https://doc.rust-lang.org/nightly/std/\">https://doc.rust-lang.org/nightly/std/</a> ([-] and source). We could do the same for themes.</p>\n</blockquote>\n<p>TBH, I personally have never read that explanation of the UI. I don't think we should assume that UI docs are going to be read by users.</p>",
        "id": 273291261,
        "sender_full_name": "Noah Lev",
        "timestamp": 1645826970
    },
    {
        "content": "<p>... I actually never read them myself. We're definitely not showing our users the right way XD</p>",
        "id": 273298120,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1645831033
    }
]