[
    {
        "content": "<p>I've been browsing the <a href=\"https://microsoft.github.io/windows-docs-rs/doc/bindings/Windows/index.html\">window-rs docs</a> lately which are a truly massive set of documentation, and searching is painfully slow and stuttery</p>\n<p><a href=\"/user_uploads/4715/k_kS_PTLFoRIL1Hmz-Imt3Pl/Video.mp4\">Clip</a></p>\n<p>It's worth noting that (just to spite me since I was reporting an issue) my previous \"real world\" performance was worse than the video depicted, when I was using it organically it was stuttering while I was typing, freezing, not taking inputs, etc.</p>",
        "id": 253647510,
        "sender_full_name": "Chase Wilson",
        "timestamp": 1631824916
    },
    {
        "content": "<p>damn that search-index.js is 46 MB</p>",
        "id": 253655923,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1631828719
    },
    {
        "content": "<p>Yep, I have some perf improvements on hold</p>",
        "id": 253659008,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1631830376
    },
    {
        "content": "<p>alongside a rework of the search engine itself</p>",
        "id": 253659028,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1631830388
    },
    {
        "content": "<p>needs <a href=\"https://github.com/rust-lang/rust/pull/88268\">https://github.com/rust-lang/rust/pull/88268</a> to be merged first</p>",
        "id": 253659083,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1631830422
    },
    {
        "content": "<p>Good news, I figured out that my recorder has keystroke stuff, so here's the <a href=\"/user_uploads/4715/FUSHaZfxlRLZxRqKmpHIfPih/Rustdoc.mp4\">video</a> with my keystrokes on top of it</p>",
        "id": 253667544,
        "sender_full_name": "Chase Wilson",
        "timestamp": 1631835652
    },
    {
        "content": "<p>As I understand it, searching is O(n) in the number of items in a set of documentation. So very large crates  will indeed have really bad performance.  A few possibilities:</p>\n<ul>\n<li>With the current code, we could add yield points (e.g. with setTimeout(currentFunction(), 0) ) to avoid stuttering problems.</li>\n<li>We can add better user feedback, so for instance before we dive into the expensive search code, we could make sure we update the page to say \"Searching for ...\"</li>\n<li>With new code, presumably what GuillaumeGomez has in mind, we could create an actual index of searchable terms, which could result in a big speedup.</li>\n<li>Right now, we automatically search if the user stops typing for 500ms. We could detect when the set of items to search is very large, and turn off the automatic search, instead presenting a prompt \"hit enter to search.\"</li>\n</ul>",
        "id": 255114066,
        "sender_full_name": "jsha",
        "timestamp": 1632774192
    }
]