[
    {
        "content": "<p>Issue <a href=\"https://github.com/rust-lang/rust/issues/91118\">#91118</a> is about the implementors section of trait pages' sidebars always being empty, and PR <a href=\"https://github.com/rust-lang/rust/issues/91277\">#91277</a> fixes this by filling the sidebar with the implementors.</p>\n<p>However, I kind of wonder if we should just remove the implementors (and implementations on foreign types) sidebar sections. They're not part of the trait's interface, and for many traits the list will be very long and fill up the sidebar.</p>\n<p>It may not even be a bug that the section is empty; perhaps it's intended just to be a link to the beginning of the implementors section in the main body of the page. (I agree that it looks confusing though as it currently stands.)</p>\n<p>This would simplify rustdoc's UI and its implementation, as <a href=\"https://github.com/rust-lang/rust/issues/91277\">#91277</a> is actually a fairly large and somewhat complex change.</p>\n<p>What do you think?</p>",
        "id": 262901586,
        "sender_full_name": "Noah Lev",
        "timestamp": 1638061054
    },
    {
        "content": "<p>Removing the section wouldn't be a good idea in my opinion. At least I use this link pretty often. I'm not sure adding items into the sidebar is a good idea either though... Just having the link seemed nice enough. But my opinion is biased on this, so might be interesting to try to take a look from user usability.</p>",
        "id": 262901754,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1638061239
    },
    {
        "content": "<p>I'm okay with keeping the section link, though we'll need to make it clear that it's not supposed to have items after it.</p>",
        "id": 262901838,
        "sender_full_name": "Noah Lev",
        "timestamp": 1638061442
    },
    {
        "content": "<p>(Side note: I think we should rename \"Implementors\" to \"Local Impls\".)</p>",
        "id": 262902031,
        "sender_full_name": "Noah Lev",
        "timestamp": 1638061775
    },
    {
        "content": "<p>Implementors also includes foreign ones :p</p>",
        "id": 262902086,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1638061846
    },
    {
        "content": "<p>Then why is there also \"Implementations on Foreign Types\"?</p>",
        "id": 262902825,
        "sender_full_name": "Noah Lev",
        "timestamp": 1638063184
    },
    {
        "content": "<p>I was/am also pretty confused about that. jyn514 explained it to me here: <a href=\"https://github.com/rust-lang/rust/issues/85418\">https://github.com/rust-lang/rust/issues/85418</a></p>",
        "id": 262908254,
        "sender_full_name": "jsha",
        "timestamp": 1638072654
    },
    {
        "content": "<p>Wow, I do not remember writing that comment <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span> glad it's helpful though!</p>",
        "id": 262908326,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1638072773
    },
    {
        "content": "<p>I proposed clarifying the situation by having three sections (these names are terrible but maybe get the idea across)</p>\n<blockquote>\n<p>Implementations in this Crate on Types in this Crate<br>\nImplementations in this Crate on Types in Other Crates<br>\nImplementations in Other Crates</p>\n</blockquote>",
        "id": 262908401,
        "sender_full_name": "jsha",
        "timestamp": 1638072868
    },
    {
        "content": "<p>Could also be something like:</p>\n<blockquote>\n<p>Local Implementors<br>\nLocal Implementations on Foreign Types<br>\nForeign Implementors</p>\n</blockquote>",
        "id": 262908415,
        "sender_full_name": "jsha",
        "timestamp": 1638072909
    },
    {
        "content": "<p>Back to the original topic: I also find it pretty inconsistent that the <code>Implementors</code> section in the sidebar is empty, much like it's inconsistent that the sidebar methods are sorted and the body methods are not. But it is a pretty useful way to jump to that section.</p>\n<p>(though, arguing against myself for a moment - maybe \"collapse all sections\" is good enough to get you there fast?)</p>",
        "id": 262908495,
        "sender_full_name": "jsha",
        "timestamp": 1638073046
    },
    {
        "content": "<p>Also one minor argument against listing all the implementors in the sidebar: many of the implementors aren't rendered in the HTML. We get them from a JS file that loads somewhat after the page is complete. Since they're usually offscreen that isn't very jarring, but if they were in the sidebar too, they could cause the sidebar to jump around during load.</p>",
        "id": 262908570,
        "sender_full_name": "jsha",
        "timestamp": 1638073167
    },
    {
        "content": "<p>Personaly I'm neutral as to wether we put each implementor in the sidebar, but if we dont, I think we must change the style of the Implementors header, to comunicate that it doesnt list thinks (although I'm not sure how to visualy comunicate this)</p>",
        "id": 263938893,
        "sender_full_name": "Nixon Enraght-Moony",
        "timestamp": 1638832775
    },
    {
        "content": "<p>Yes, I agree that we should change the styling of the header. I think I thought it was a bug too in the past.</p>",
        "id": 263949739,
        "sender_full_name": "Noah Lev",
        "timestamp": 1638841927
    },
    {
        "content": "<p>I think we all agree on that. Its style is different, but not different enough :)</p>",
        "id": 263977773,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1638870292
    }
]