[
    {
        "content": "<p>So we got some complaints about <a href=\"https://github.com/rust-lang/rust/pull/91480\">https://github.com/rust-lang/rust/pull/91480</a>. I'm not sure what's the best path to work on this. Is there a way to have a global feedback from users? Maybe you know more about this <span class=\"user-mention\" data-user-id=\"132040\">@Manish Goregaokar</span> ?</p>",
        "id": 271037200,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1644265574
    },
    {
        "content": "<p>open an internals thread and maybe post to twitter/reddit</p>",
        "id": 271037254,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1644265607
    },
    {
        "content": "<p>or an rfc</p>",
        "id": 271037271,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1644265613
    },
    {
        "content": "<p>but also i'd have some caution there</p>",
        "id": 271037304,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1644265630
    },
    {
        "content": "<p>one person stating that it is \"universally disliked\" doesn't mean much unless we have more data</p>",
        "id": 271037369,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1644265661
    },
    {
        "content": "<p>It's UI-related so it seems quite a hot topic, which is why I don't know how to handle this...</p>",
        "id": 271037373,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1644265662
    },
    {
        "content": "<p>usualyl when colors are changed people get annoyed, we should be careful but also this doesn't mean we change nothing</p>",
        "id": 271037401,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1644265679
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"132040\">Manish Goregaokar</span> <a href=\"#narrow/stream/266220-rustdoc/topic/UI.20regression.3F/near/271037369\">said</a>:</p>\n<blockquote>\n<p>one person stating that it is \"universally disliked\" doesn't mean much unless we have more data</p>\n</blockquote>\n<p>Ah my bad, I remembered a few others complaining but maybe I'm getting feedback mixed up with something else...</p>",
        "id": 271037517,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1644265725
    },
    {
        "content": "<p>yeah, <span class=\"user-mention\" data-user-id=\"132040\">@Manish Goregaokar</span> put it very well, advising caution. It's hard to manage good UI for open source projects because the people who dislike a change always speak up but the people who like it almost never do, so it can create a skewed perception like the one expressed in the thread.</p>",
        "id": 271037599,
        "sender_full_name": "jsha",
        "timestamp": 1644265778
    },
    {
        "content": "<p>i think there is a valdi point there that being able to distinguish enums and structs in methods is somewhat useful</p>",
        "id": 271037680,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1644265803
    },
    {
        "content": "<p>but i don't know if it's actually _that_ useful</p>",
        "id": 271037705,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1644265810
    },
    {
        "content": "<p>Maybe it's better to wait it hits stable and if we get negative feedback then we can always revert?</p>",
        "id": 271037717,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1644265816
    },
    {
        "content": "<p>Right, I think the important thing about this change is that it's trading off something more abstract - the ability of the reader to concentrate on differences that _matter_, vs showing every possible difference.</p>",
        "id": 271037794,
        "sender_full_name": "jsha",
        "timestamp": 1644265874
    },
    {
        "content": "<p>One thing that commenter mentioned is the difference between 867-5309 and 8675309. To me that sounds like it might be related to the fact that punctuation (slice brackets <code>[]</code> and tuple parents <code>()</code>) are now colored the same as the types they contain. I actually quite strongly believe it would be an improvement to color that punctuation black, and I think it would address one of the concerns brought up here, as well as some others I've seen.</p>",
        "id": 271038014,
        "sender_full_name": "jsha",
        "timestamp": 1644265984
    },
    {
        "content": "<p>I remember the discussion and I agreed with your arguments (and still do). It's fine to keep things as is for now I think and we'll see later on if we get a lot of complaints.</p>",
        "id": 271038020,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1644265985
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"315412\">jsha</span> <a href=\"#narrow/stream/266220-rustdoc/topic/UI.20regression.3F/near/271038014\">said</a>:</p>\n<blockquote>\n<p>One thing that commenter mentioned is the difference between 867-5309 and 8675309. To me that sounds like it might be related to the fact that punctuation (slice brackets <code>[]</code> and tuple parents <code>()</code>) are now colored the same as the types they contain. I actually quite strongly believe it would be an improvement to color that punctuation black, and I think it would address one of the concerns brought up here, as well as some others I've seen.</p>\n</blockquote>\n<p>Well, PR welcome ;)</p>",
        "id": 271038078,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1644266022
    },
    {
        "content": "<p>Not sure if it helps, but there's also a tooltip that says what kind it is. Mouse hover over it.</p>",
        "id": 271041702,
        "sender_full_name": "Michael notriddle Howell",
        "timestamp": 1644267945
    },
    {
        "content": "<p>+1 for being bold with UI changes and for the bias of people complaining - I (for example) like the change but would not have said anything if this thread didn't exist</p>",
        "id": 271099194,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1644311574
    },
    {
        "content": "<p>Also, I think UI changes are often jarring, but feel better once you're used to them. And this effect is not reflected in feedback very well</p>",
        "id": 271099285,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1644311631
    },
    {
        "content": "<p>IMO, the right way to get feedback is to have a design vision with lots of changes, get feedback on that by publicly advertising it (bearing in mind the bias against change) and then refer back to the plan on each PR as a way to ignore feedback on incremental change (which I think is very rarely useful)</p>",
        "id": 271099669,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1644311810
    },
    {
        "content": "<p>In response to the \"universally disliked\" comment: the PR had all downvotes.  I posted the complaint mostly due to feeling panicked about the way things are moving forward in rustdoc. As someone who has weird visual processing glitches, having items grouped by type and color coded greatly improves my ability to process things. For example, seeing the green text on an item in a function signature is a visual cue that the type of object is an enum. Having the enums and traits grouped separately also provides similar visual cues. </p>\n<p>I thought it was ironic that the motivation of these changes was to help people with aspersers or other accessibility challenges, but the changes seem to have the opposite effect. I strongly rely on syntax coloring, consistent formatting, patterns and grouping in order to process things in a meaningful way and these changes have a negative impact on my ability to be productive.</p>",
        "id": 272604524,
        "sender_full_name": "Aaron Loucks",
        "timestamp": 1645377196
    },
    {
        "content": "<p>Thanks for the additional context. And I'm really sorry the changes have made you feel panicked! In particular it's useful to know that your visual glitches are particularly helped by having a wider variety of colors. We can't necessarily design a UI that will work perfectly for everybody, but I think on balance the reduced number of colors winds up being the right call.</p>",
        "id": 272765262,
        "sender_full_name": "jsha",
        "timestamp": 1645511862
    },
    {
        "content": "<p>The decision feels arbitrary. Why would we use color and grouping for other distinctions but not here? We give items that are fundamentally different distinct colors and groups, but suddenly enums are now the same as structs? </p>\n<p>Many of the suggestions on issues <a href=\"https://github.com/rust-lang/rust/issues/59845\">59845</a> and <a href=\"https://github.com/rust-lang/rust/issues/59829\">59829</a> are steps backward. Removing visual cues is not the same as removing clutter. For example, the background on code blocks allows the user to scan the page and easily find code examples. The code blocks stand out. There was a statement about Go and Python docs being used as examples, but the current/previous rustdoc output is considerably nicer than both Go and Python docs. </p>\n<p>The design guidelines for autism spectrum recommend reducing contrast, they don't recommend reducing the number of colors. In fact it's the opposite. </p>\n<p>From:<br>\n<a href=\"https://www.fullfabric.com/articles/how-to-design-visual-learning-resources-for-neurodiverse-students\">https://www.fullfabric.com/articles/how-to-design-visual-learning-resources-for-neurodiverse-students</a></p>\n<p><em>The W3C Web Accessibility Initiative (WAI) reports that dyslexic individuals respond well to colour differences among background and text. The WAI also tests different text and background colour contrasts to decipher the most viable combinations.</em></p>\n<p><em>While visual supports form the basis of facilitating learning in autistic individuals, getting the right visuals involves a combination of artistry and strategy. Colour can add meaning, clarity and dimension to visual materials; it can bring order and truth to the visual learner.</em></p>\n<p><em>When it comes to colours, neurodivergent students tend to prefer muted and pastel hues and neutral tones. Sensory Differences: Online Training Module by J Rogers and J Short asserts that neurodivergent students particularly favour tranquil greens and blues.</em></p>\n<p>I applaud your effort to make rustdocs more accessible, and I believe that the changes are well intended,  but I feel strongly that some of the changes are moving in the wrong direction and are having a negative impact.</p>",
        "id": 272814639,
        "sender_full_name": "Aaron Loucks",
        "timestamp": 1645542155
    },
    {
        "content": "<p>I've left additional comments on the corresponding PR to collapse all of the sections:<br>\n<a href=\"https://github.com/rust-lang/rust/issues/92656\">https://github.com/rust-lang/rust/issues/92656</a></p>\n<p>I'd really like to see this addressed. As someone who has difficulties processing text, these and some of the other recent changes make it harder to read, not easier. The side bar no longer has any lines or color cues to distinguish the sections.</p>",
        "id": 275186294,
        "sender_full_name": "Aaron Loucks",
        "timestamp": 1647221995
    },
    {
        "content": "<p>Please read though the comments in <a href=\"https://github.com/rust-lang/rust/issues/92656\">https://github.com/rust-lang/rust/issues/92656</a> as they are closely related to this issue (and also in support of why I had earlier mentioned that it was universally disliked. </p>\n<p>This one in particular:<br>\n<a href=\"https://github.com/rust-lang/rust/issues/92656#issuecomment-1024824033\">https://github.com/rust-lang/rust/issues/92656#issuecomment-1024824033</a></p>",
        "id": 275186472,
        "sender_full_name": "Aaron Loucks",
        "timestamp": 1647222252
    },
    {
        "content": "<p>ping <span class=\"user-mention\" data-user-id=\"307537\">@Noah Lev</span> <span class=\"user-mention\" data-user-id=\"315412\">@jsha</span></p>",
        "id": 275210865,
        "sender_full_name": "GuillaumeGomez",
        "timestamp": 1647250048
    }
]