[
    {
        "content": "<p>Sent this in PM but i figured maybe i should put it here:</p>\n<p>The \"Where do you live\" question has a very long list of answers, sorted alphabetically in English. However after translation, it's no longer ordered from translated text's point of view. It's potentially a little hard for user to find what they want in the translated list...</p>",
        "id": 260495750,
        "sender_full_name": "Charles Lew",
        "timestamp": 1636179706
    },
    {
        "content": "<p>To be honest, I think it's close to meaningless to have all the options in this question for many translations. e.g. majority of people using Simplified Chinese live in just a handful of countries (China, Singapore, Malaysia, and a small portion of expats in Japan, US, Canada, Australia, etc.), similar for Traditional Chinese, Japanese and many other languages.<br>\nIt still makes sense for the original (English) version to list all, as English is the lingua franca where we should show inclusiveness. But it would have been better if translators can reorder and even hide irrelevant options for each language. That's probably some feedback we can give to the survey platform, though.</p>",
        "id": 260509006,
        "sender_full_name": "Xidorn Quan",
        "timestamp": 1636199627
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116458\">@Charles Lew</span>, so in the SurveyHero there's a list of countries instead of two groups (UN states and observers) and free form answer?</p>",
        "id": 260520825,
        "sender_full_name": "Yoh Deadfall",
        "timestamp": 1636213975
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"250949\">Xidorn Quan</span> <a href=\"#narrow/stream/294169-t-community.2Frust-survey-2021/topic/A.20potential.20small.20annoyance/near/260509006\">said</a>:</p>\n<blockquote>\n<p>To be honest, I think it's close to meaningless to have all the options in this question for many translations. e.g. majority of people using Simplified Chinese live in just a handful of countries (China, Singapore, Malaysia, and a small portion of expats in Japan, US, Canada, Australia, etc.), similar for Traditional Chinese, Japanese and many other languages.<br>\nIt still makes sense for the original (English) version to list all, as English is the lingua franca where we should show inclusiveness. But it would have been better if translators can reorder and even hide irrelevant options for each language. That's probably some feedback we can give to the survey platform, though.</p>\n</blockquote>\n<p>I think it's important to have consistency here. It <em>might</em> be the case that for some languages it's unlikely to get certain answers, but I'd also expect the translations here to remain consistent year after year, so they wouldn't need extra work to update each time.</p>",
        "id": 260538264,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1636235649
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span>  It probably doesn't need extra work for translators to update it (if the platform can automatically keep the translation in place for coming years, which I'm not sure). It does cost everyone filling the form to try to find the item they mean to choose from a ton of irrelevant items, though.</p>",
        "id": 260542995,
        "sender_full_name": "Xidorn Quan",
        "timestamp": 1636242474
    },
    {
        "content": "<p>From the answers last year, &gt;99% of people filling the S.Chinese version of the form live in China, and all of those people have to scroll down the list to find China at 36th out of 195 countries listed there. I believe Japanese version likely has a similar ratio, yet Japan is even further down at 86th. Worse, people filling T.Chinese version most likely live in Taiwan and H.K., and they may have to go through the whole list of 195 countries carefully only to find their places not listed in it at all, given many of them are unwilling to have China represent their places.</p>",
        "id": 260543941,
        "sender_full_name": "Xidorn Quan",
        "timestamp": 1636243841
    },
    {
        "content": "<p>Letting people find from a long list without a quick access to what they need may just deter them from answering it, and some of them may also simply fill in the blank rather than picking from the list even if an answer exists there, which will add burden to translators rather than reduce it.</p>",
        "id": 260544370,
        "sender_full_name": "Xidorn Quan",
        "timestamp": 1636244518
    },
    {
        "content": "<p>We've finished the translation here. I'm curious if it makes sense to sort the countries by population for example. Or bring a few different certain items to the top in each translated version.</p>",
        "id": 260566651,
        "sender_full_name": "Charles Lew",
        "timestamp": 1636281590
    },
    {
        "content": "<p>While I do think we should have all the same options available for each language, I think it'd be perfectly reasonable to sort the top three or five regions for each language to the top.</p>",
        "id": 260583558,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1636303243
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"239881\">Josh Triplett</span> <a href=\"#narrow/stream/294169-t-community.2Frust-survey-2021/topic/A.20potential.20small.20annoyance/near/260583558\">said</a>:</p>\n<blockquote>\n<p>While I do think we should have all the same options available for each language, I think it'd be perfectly reasonable to sort the top three or five regions for each language to the top.</p>\n</blockquote>\n<p>+1 for this - if we can change ordering in the translations we should</p>",
        "id": 260644644,
        "sender_full_name": "rylev",
        "timestamp": 1636370819
    },
    {
        "content": "<p>There doesn't seem to be anyway to reorder based on language selection, but I did set the list of options to sort itself ascending, so it should (?) at least have some order. (Will need eyes on that to double-check - link to preview here: <a href=\"https://www.surveyhero.com/preview/csdttaqy\">https://www.surveyhero.com/preview/csdttaqy</a>)</p>\n<p>Per <span class=\"user-mention\" data-user-id=\"116458\">@Charles Lew</span> : I took a look at the result after this change. Seems it's sorted by Unicode code point order now. The order is still unpredictable from user's pov, but good enough for practical use.</p>",
        "id": 260723007,
        "sender_full_name": "Jasun Carr",
        "timestamp": 1636407734
    }
]