[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span> I should have asked in your PR, but can you talk a bit about what actionable steps you expect to be able to take from your question <a href=\"https://github.com/rust-lang/surveys/pull/28\">here</a>: \"n the primary machine you compile Rust code on, how many logical CPU threads do you have?\"</p>",
        "id": 254504092,
        "sender_full_name": "rylev",
        "timestamp": 1632388028
    },
    {
        "content": "<p>A few different things. I'm expecting to use the answers to tune parallel rustc; when we encounter a scalability issue that kicks in around a certain number of CPUs, it'll be good to know what proportion of the Rust community that issue affects.</p>",
        "id": 254578706,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1632420364
    },
    {
        "content": "<p>It'll also help when tuning algorithms or build systems whose memory usage may depend on the number of CPUs present.</p>",
        "id": 254578761,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1632420387
    },
    {
        "content": "<p>It'll help answer prioritization questions around whether to make something go faster by throwing more CPUs at it or by optimizing on the same number of CPUs.</p>",
        "id": 254578877,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1632420441
    },
    {
        "content": "<p>And it'll help avoid assumptions that rust developers might otherwise make about how universal the caliber of hardware they have is. There's a natural tendency to assume, if you have a system with a certain number of CPUs and it isn't unusually powerful, that your own system is somewhere near average or a little above average. I'd like more concrete data to figure out what the average system actually has.</p>",
        "id": 254579274,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1632420576
    },
    {
        "content": "<p>I wonder if we should also quickly ask about RAM and diskspace as well...</p>",
        "id": 255007997,
        "sender_full_name": "rylev",
        "timestamp": 1632729295
    },
    {
        "content": "<p>I made an issue for this: <a href=\"https://github.com/rust-lang/surveys/issues/39\">https://github.com/rust-lang/surveys/issues/39</a></p>",
        "id": 255008889,
        "sender_full_name": "rylev",
        "timestamp": 1632729759
    },
    {
        "content": "<p>I also opened a PR adding this justification to the survey doc: <a href=\"https://github.com/rust-lang/surveys/pull/40\">https://github.com/rust-lang/surveys/pull/40</a></p>",
        "id": 255009721,
        "sender_full_name": "rylev",
        "timestamp": 1632730237
    },
    {
        "content": "<p>I personally think that number of CPUs is a good proxy for build system capability, and I don't want to end up with question fatigue. In particular, disk space rarely seems at issue.</p>",
        "id": 255023966,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1632737817
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span> disk space matters a lot for incremental</p>",
        "id": 255044684,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1632748152
    },
    {
        "content": "<p>And also debuginfo, lots of people can't set it to 2 at all because they simply run out of space</p>",
        "id": 255044722,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1632748171
    },
    {
        "content": "<p>But I don't think it's useful to ask about as a \"how much disk space\" question. Maybe \"is it ever a problem for you?\", but ultimately, I feel like there's not a useful proxy for how much we can \"afford\" here. My guess is everyone is - eventually - disk space constrained, regardless of whether they have 256 GB <em>total</em> (and, say, 30 GB for rust) or terabytes for Rust :)</p>",
        "id": 255046110,
        "sender_full_name": "simulacrum",
        "timestamp": 1632748752
    },
    {
        "content": "<p>Yeah, that's roughly my thought as well: asking \"amount\" isn't super useful, and if we want to ask anything at all it should be \"is this a problem\". So perhaps we could just add \"disk space usage of compiled code\" to the list of \"how relatively important are these various problems for you\".</p>",
        "id": 255091087,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1632765321
    },
    {
        "content": "<p>I think s/compiled code/target directory/ or something, but yes, that seems like a better route</p>",
        "id": 255092144,
        "sender_full_name": "simulacrum",
        "timestamp": 1632765676
    }
]