[
    {
        "content": "<p>Issue 54 (<a href=\"https://github.com/rust-lang/surveys/issues/54\">https://github.com/rust-lang/surveys/issues/54</a>)</p>",
        "id": 258167146,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1634636533
    },
    {
        "content": "<p>We would like to ensure that the set of answers is good, i.e., that it is relatively complete and that there is minimal potential for offence from the wording of the answers. Also we want to ensure that we can sufficiently differentiate between ways people are underrepresented or marginalised (i.e., some answers might be to vague or broad).</p>",
        "id": 258167392,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1634636681
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"250246\">@Jasun Carr</span> do you have opinions here? Or do you know people or resources which could help us?</p>",
        "id": 258167508,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1634636749
    },
    {
        "content": "<p>I'm taking a look now, and comparing the potential responses to the language/categories used in other publications (eg. NFS reports on Women, Minorities, and Persons with Disabilities in Science and Engineering)</p>\n<p>What I'm seeing is mostly ok from a language/terminology standpoint - though there are potential area where the category is broad. Based on past surveys and connecting the multiple choice question to some of the short answer responses, the political beliefs option, for example, will encompass an exceptionally wide range - including those whose political beliefs are excluded from polite society. But given the global nature of the survey, many of these have to be left broad - and then can be drilled down into based on responses to the open-ended question that follows.</p>",
        "id": 258210075,
        "sender_full_name": "Jasun Carr",
        "timestamp": 1634655619
    },
    {
        "content": "<p>What I'm just now seeing as a larger issue is the structure of the question. It should really be broken out into 2: One asking if they see themselves as  \"a member of a group which is underrepresented or marginalized in technology?\"; and one asking about the group itself.</p>\n<p>Do you consider yourself a member of a group which is underrepresented or marginalized in technology?</p>\n<p>Which of the following underrepresented of marginalized groups in technology do you consider yourself a part of?</p>",
        "id": 258210689,
        "sender_full_name": "Jasun Carr",
        "timestamp": 1634655832
    },
    {
        "content": "<p>If that makes sense, I'l make the changes to the questions.md</p>",
        "id": 258210810,
        "sender_full_name": "Jasun Carr",
        "timestamp": 1634655867
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 258218109,
        "sender_full_name": "Jane Lusby [she/her]",
        "timestamp": 1634658248
    },
    {
        "content": "<p>That change sounds good to me, thanks for the feedback!</p>",
        "id": 258335973,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1634721205
    }
]