[
    {
        "content": "<p>I took the survey myself. I tried to make it as realistic as possible.</p>",
        "id": 258870571,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1635069914
    },
    {
        "content": "<p>I will send a PR with some changes, but I also have some thoughts which I will dump here since there are possibly too many to make issues and they might be nothing</p>",
        "id": 258870578,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1635069947
    },
    {
        "content": "<p>First off we mention email address in the opening blurb. We don't have a question about email address, but maybe it is built-in to survey hero?</p>",
        "id": 258870628,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1635069996
    },
    {
        "content": "<p>It took me 19 minutes to fill out the survey, I think that is likely to be a minimum since I had nothing really to say in free form questions and didn't need to think too hard about anything</p>",
        "id": 258870656,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1635070054
    },
    {
        "content": "<p>OTOH, I did go through the Rust at work section, which is the longest, so anyone who doesn't use Rust at work is likely to be quicker.</p>",
        "id": 258870710,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1635070105
    },
    {
        "content": "<p>Not sure how to communicate that, but 10-15 minutes seems wrong. A realistic range might be 10-30, but that is not very helpful</p>",
        "id": 258870719,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1635070130
    },
    {
        "content": "<p>For the question \"Roughly how often do you contribute to the Rust project?\", daily seems very frequent for most of these activities, maybe something meaning 'more often than weekly' would be better?</p>",
        "id": 258870741,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1635070199
    },
    {
        "content": "<p>I felt like \"Which of the following activities do you find helpful or effective for learning Rust or improving your Rust skills?\" might be better as a matrix question (not helpful, somewhat helpful, ...) rather than a select all question</p>",
        "id": 258870797,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1635070259
    },
    {
        "content": "<p>And on the other hand, I thought that all the questions of the form 'do you agree with the following statements?' should be just agree/disagree rather than having five options</p>",
        "id": 258870817,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1635070307
    },
    {
        "content": "<p>It felt like busy work to complete them</p>",
        "id": 258870823,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1635070321
    },
    {
        "content": "<p>For the whole Rust at Work section, should we have an option in the first question for folk who don't use Rust at work, but work at a company that does? Most of the questions are about the company, not the person, so it would seem to make sense to want these folk's input. In which case we should direct even non-Rust users to this section</p>",
        "id": 258870900,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1635070410
    },
    {
        "content": "<p>I found \"What is/are your <strong>preferred</strong> language(s) for the following forms of technical communication?\" a bit of a weird question - it seems kind of too flexible - nobody is going to want to technical docs in Bengali, technical talks in Portuguese, and conversations in Vietnamese or whatever. We are trying to find out if people prefer English or their something else for each, right? But it also seems to be getting the wrong results. Like people might <em>prefer</em> to have a technical talk in their local dialect or language, but would rather have the talk in the national language than English, we would miss these opinions, even if there is a large desire for say Hindi rather than English, but there are relatively small responses for Marathi/Gujarati/Punjabi/etc</p>",
        "id": 258871361,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1635071152
    },
    {
        "content": "<p>Anyway, I don't have a better suggestion right now, but it was one of the few questions which felt 'off' to me</p>",
        "id": 258871405,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1635071193
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256841\">Nick Cameron</span> <a href=\"#narrow/stream/294169-t-community.2Frust-survey-2021/topic/Issues.20from.20taking.20the.20survey/near/258870628\">said</a>:</p>\n<blockquote>\n<p>First off we mention email address in the opening blurb. We don't have a question about email address, but maybe it is built-in to survey hero?</p>\n</blockquote>\n<p>We need to change the opening blurb anyway (as it's not been changed since last year's survey). We should create an issue for this</p>",
        "id": 258929343,
        "sender_full_name": "rylev",
        "timestamp": 1635150365
    }
]