[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"273349\">@Waffle Lapkin</span> found that processors in the Russian translation is unsound because there's another word for that, cores. While the question assumes logical processors, i.e. number of thread, it might be unobvious what is asked even if there are shell commands to get the right number.</p>",
        "id": 265406969,
        "sender_full_name": "Yoh Deadfall",
        "timestamp": 1639817753
    },
    {
        "content": "<p>Should it be changed to logical processors or threads instead? Cores isn't accurate too since there can be logical and physical as well as processors.</p>",
        "id": 265407047,
        "sender_full_name": "Yoh Deadfall",
        "timestamp": 1639817858
    },
    {
        "content": "<p>\"threads\" is the least accurate of all of them it seems, there may be an almost arbitrary number of threads on any modern desktop processor. </p>\n<p>Maybe using \"logical cores\" (as written later in the description) is the right way?</p>",
        "id": 265407316,
        "sender_full_name": "Waffle Lapkin",
        "timestamp": 1639818187
    },
    {
        "content": "<p>Agreed. Taking into account how the question was changed, it should be less technical after a 2mo commit.</p>",
        "id": 265409905,
        "sender_full_name": "Yoh Deadfall",
        "timestamp": 1639821841
    },
    {
        "content": "<p>The original version uses CPUs which is number of physical cores per chip and they can be multithreaded. And the only unambiguously term for that is logical processors/cores where processors is a shortening of processor unit.</p>",
        "id": 265410311,
        "sender_full_name": "Yoh Deadfall",
        "timestamp": 1639822441
    },
    {
        "content": "<p>\"logical processors\" seems fine.</p>",
        "id": 265437286,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1639855507
    },
    {
        "content": "<p>Anything involving \"cores\" seems likely to be ambiguous.</p>",
        "id": 265437304,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1639855558
    },
    {
        "content": "<p>This is a question where I imagine Russian responses won't be majorly different from others in the world. While it would be nice for these to be correct, I think if we end up taking the non-Russian responses, we'll likely still get an accurate picture.</p>",
        "id": 265539728,
        "sender_full_name": "rylev",
        "timestamp": 1639992992
    },
    {
        "content": "<p>For context: only the title is confusing, the description under the title is correct</p>",
        "id": 265540334,
        "sender_full_name": "Waffle Lapkin",
        "timestamp": 1639993350
    }
]