[
    {
        "content": "<p>I definitely think we should revisit the privacy and data access rules this year. As <span class=\"user-mention\" data-user-id=\"256841\">@Nick Cameron</span> noted, the \"summary blog posts\" don't contain much actionable data. Further, what they <em>do</em> have is encoded in <em>png</em> format, and not even available in CSV.</p>",
        "id": 245053033,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1625584426
    },
    {
        "content": "<p>We obviously want people to feel comfortable contributing but offering aggregate statistics, and perhaps the ability for folks to request cross-correlations, makes sense to me.</p>",
        "id": 245053107,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1625584448
    },
    {
        "content": "<p>I also imagine that community stakeholders (e.g., Rust teams like compiler/lang/dev-tools but also IntelliJ/rust-analyzer) might be interested in some of the questions around tooling and use it to help improve things, and I don't see a problem with that (as long as individual identities are respected).</p>",
        "id": 245053226,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1625584504
    },
    {
        "content": "<p>This is probably best coordinated with Foundation folks, though.</p>",
        "id": 245053257,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1625584517
    },
    {
        "content": "<p>Yeah, offering complete aggregate stats seems like it would be useful and privacy-sensitive. We'd probably want some small floor number as a minimum for any category (e.g., if there are only two people using Rust for some obscure platform, then they should be forced into 'other'). Even more so for any correlation we make available. If we offer to make cross-correlations available on request it could be a lot of work, so we should probably limit the timeframe that offer is open and only make it open to teams.</p>",
        "id": 245107018,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1625610922
    },
    {
        "content": "<p>That all sounds right</p>",
        "id": 245115644,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1625618943
    },
    {
        "content": "<p>I was thinking how useful it was to see (e.g.) \"how long you've been using rust\" correlated with \"how comfortable you feel with rust\", but it's obviously not an \"open ended offer to crunch data\"</p>",
        "id": 245115670,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1625618980
    }
]