[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"250246\">@Jasun Carr</span> so we'd like to start building the survey (even though we're not fully happy with where the design document is). The first step would be to move demographic information into the survey. The way I'd like to do this is by looking at the <a href=\"https://github.com/rust-lang/surveys/blob/main/surveys/2021-annual-survey/design/who.md\">\"who\"</a> design document, as well as the previous years' surveys (which you can currently view <a href=\"https://github.com/rust-lang/surveys/tree/7e9a47b30b4cfb3a9a78bec011e16274bcf0ec8c/surveys\">here</a> in pdf form), and then creating the questions in the <a href=\"https://github.com/rust-lang/surveys/blob/main/surveys/2021-annual-survey/questions.md\">questions.md</a> file.</p>",
        "id": 251420770,
        "sender_full_name": "rylev",
        "timestamp": 1630429891
    },
    {
        "content": "<p>The questions.md is a very, very rough beginning so don't hesitate to delete or move stuff around. Also, if you'd rather work in a Google doc in the meantime that's also fine.</p>",
        "id": 251420909,
        "sender_full_name": "rylev",
        "timestamp": 1630429939
    },
    {
        "content": "<p>The goal is for us to get a first part of the survey done to collect all relevant demographic information based on the who.md document.</p>",
        "id": 251420998,
        "sender_full_name": "rylev",
        "timestamp": 1630429981
    },
    {
        "content": "<p>We shouldn't hesitate to reword questions if it makes sense to, but if there's no reason to re-word, then we should prefer consistency to previous years.</p>",
        "id": 251421071,
        "sender_full_name": "rylev",
        "timestamp": 1630430025
    },
    {
        "content": "<p>Thoughts, questions, doubts?</p>",
        "id": 251421093,
        "sender_full_name": "rylev",
        "timestamp": 1630430034
    },
    {
        "content": "<p>Yes, let's go ahead and start laying out the structure and wording of the survey while we wait on the decision regarding platform.</p>",
        "id": 251438280,
        "sender_full_name": "Jasun Carr",
        "timestamp": 1630436358
    },
    {
        "content": "<p>Here's a pull request for adding some questions to the Rust at Work and Rust in Education sections: <a href=\"https://github.com/rust-lang/surveys/pull/16\">https://github.com/rust-lang/surveys/pull/16</a>. A lot of the questions are marked as \"removed\". They are questions from previous years which have been removed for some reason (usually because they gave not so useful data and just made the survey longer).</p>",
        "id": 251728500,
        "sender_full_name": "rylev",
        "timestamp": 1630594476
    }
]