[
    {
        "content": "<p>I was up last night thinking about whether there are inefficiencies in how we find Incompatibilities that are (Almost)Satisfied.<br>\nThe logick gets called a lot! Once per change, per implication, per decision. And it currently does a scan of <a href=\"https://github.com/pubgrub-rs/pubgrub/blob/dev/src/internal/core.rs#L101\">all incompatibilities</a> to find ones that are related to the changed package and then looks to see the <code>relation</code> with the <code>partial_solution</code>. I had lots of thoughts of different data structures to try, but I may have been dreaming so they may not make enough sense to be worth writing down. What I did want to record ( for my reference or in case you had thoughts ) where 3 places where we may be doing more work than needed.</p>\n<ol>\n<li>Does it happen that we add the <em>same</em> incompatibility to the history multiple times? For example <code>a depends on b</code>, when first we decide on <code>a</code> we will add it to the history, then if something else depends on <code>b</code> then <code>current_package</code> will be <code>b</code> and <code>a depends on b</code> is still <code>AlmostSatisfied</code> so we will add it again.</li>\n<li>If we have an incompatibility with one term, how does it get into the history? Does it successfully get re-added after a backtrack? ( this must work, I just couldn't figure it out when I was half asleep. ) We should make sure that the memory knows not to ask for the range agen after our dependency provider tells us that it is not available.</li>\n<li>If an incompatibility is found to be <code>Contradicted</code> by the <code>partial_solution</code> is there any reason to check it again ( until a backtrack happens ).?</li>\n</ol>",
        "id": 229679182,
        "sender_full_name": "Eh2406",
        "timestamp": 1615389683
    },
    {
        "content": "<ol start=\"3\">\n<li>Just had some time to experiment with it. Removing from consideration incompatibilities that are found to be contradicted can be a perf win. Should definitely come back to it when I have more time.</li>\n</ol>",
        "id": 229922266,
        "sender_full_name": "Eh2406",
        "timestamp": 1615495319
    },
    {
        "content": "<p>It's definitely an area that can be improved, and one of the ways to explore is storing incompatibilities in a smarter way for access. (A map probably).</p>",
        "id": 230157797,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1615636441
    },
    {
        "content": "<ol>\n<li>I don't remember well enough. I'll have a look at it next week</li>\n</ol>",
        "id": 230157904,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1615636557
    },
    {
        "content": "<ol start=\"3\">\n<li>Is it possible that a currently contradicted incompat becomes almost satisfied after a backtrack and thus will be needed later. I don't remember well enough too.</li>\n</ol>",
        "id": 230157995,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1615636666
    },
    {
        "content": "<p>Sorry o think we are misusing \"term\" and \"incompatibilities\" in our conversation. Incompatibilities are always true, so there is no risk of them being removed after z backtrack since backtracking does not touch incompatibilities, just terms in the partial solution</p>",
        "id": 230158366,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1615637033
    },
    {
        "content": "<p>So 2. Is fine since the code that builds the range of potentially valid versions always takes into account all incompatibilities</p>",
        "id": 230158564,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1615637239
    },
    {
        "content": "<p>Then again I can't point you exactly to the related code. I'll try to next week if you don't figure it out before</p>",
        "id": 230158635,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1615637311
    },
    {
        "content": "<p>No rush, I will not have time to work on this deeply for a few weeks.<br>\nI did some experiments and checking for <code>1.</code> ( if it happens at all ) was found to not to be faster on the elm benchmark. <code>3.</code> was found to have some ~10% improvements. So worth exploring some day.</p>\n<blockquote>\n<p>Sorry o think we are misusing \"term\" and \"incompatibilities\" in our conversation. Incompatibilities are always true, so there is no risk of them being removed after z backtrack since backtracking does not touch incompatibilities, just terms in the partial solution</p>\n</blockquote>\n<p>I meant that the <code>partial solution</code> stores the terms implied by some set of <code>incompatibilities</code>. When we backtrack we are shrinking that set ( by removing decisions and the terms implied by them ).  An incompatibility with one term like \"no versions available\", will be the first to have its term removed as it was only discovered after the most recent decision. But in some sense is always relevant as it does not depend on any decision, it is <code>almost satisfied</code> from the beginning.</p>",
        "id": 230165842,
        "sender_full_name": "Eh2406",
        "timestamp": 1615645428
    },
    {
        "content": "<p>I did some quick analysis of the complexity of the packages in the elm benchmark. And I think it is very heavy on small dependence trees. There are only a handful of cases with &gt;200 incompatibilities. (for reference pubgrub-rs has about 200 dependencies in the lockfile) So it is possible that some things improve our big-O but slow down the elm benchmark.<br>\nI am thinking of creating some kind of config file that specifies supsets to use as additional benchmarks. Maybe the most populer, the most complicated, and the ones that error, or something.</p>",
        "id": 230345045,
        "sender_full_name": "Eh2406",
        "timestamp": 1615815545
    }
]