[
    {
        "content": "<p>Currently we do not merge work without explicit approval of all project members.</p>\n<p>We have been taking turns being unavailable to review each other's work. I am finding it as a stressor in my todo list, knowing that some things are waiting on me. I also understand that it is probably demotivating knowing that your work won't get merge for sum indefinite period of time until I get back. So I think it is time we renegotiate our merge policy.</p>",
        "id": 222778674,
        "sender_full_name": "Eh2406",
        "timestamp": 1610655915
    },
    {
        "content": "<p>I wanted to bring it up now to give us time to come to a shared understanding before \"the end of january\" period that Matthieu mentioned.</p>",
        "id": 222779193,
        "sender_full_name": "Eh2406",
        "timestamp": 1610656116
    },
    {
        "content": "<p>To start the conversation: If someone has not responded in 10 days ( long enough that one can check in only on weekends ) then that can be considered approval. At that time things can proceed as if the absent party had sent \"sounds good, do what you want\". Even if no one responds a PR should not be merged by its author. If someone objects to a PR then that needs to be fixed or responded to. Only after it is addressed does the timer restart. If you have thoughts but do not have time to write them up, a comment like \"I want to get back to this.\" will restart the timer, setting you back to having 10 days to respond.</p>\n<p>What do you all think?</p>",
        "id": 222780627,
        "sender_full_name": "Eh2406",
        "timestamp": 1610656787
    },
    {
        "content": "<blockquote>\n<p>Even if no one responds a PR should not be merged by its author</p>\n</blockquote>\n<p>I'm puzzled by this sentence. How can a PR be merged if no one responded in 10 day yet its author cannot merge it? Could you detail your thinking please?</p>\n<p>I'm ok for a 10 days policy. Having us all review everything was important for the beginning of the project. Now we've reach the difficult \"long term project\" barrier where people are not as excited as when beginning and don't have as much time. I personally have been focusing the free time I had on elm-test-rs to finish what I started for exercism. That's also why I'm glad we have this in an independent repo! I'm not done with pubgrub-rs, that's for sure! I'll continue to help where I can (starting with things here <a href=\"https://github.com/pubgrub-rs/advanced_dependency_providers/issues/5\">https://github.com/pubgrub-rs/advanced_dependency_providers/issues/5</a>). But yeah it might take some time before I can refocus some of my energy there.</p>",
        "id": 222976963,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1610797452
    },
    {
        "content": "<blockquote>\n<p>How can a PR be merged if no one responded in 10 day yet its author cannot merge it?</p>\n</blockquote>\n<p>I was thinking that if literally no one responds, then it should not be merged. I would still like code to be reviewed by someone that is not the author. But relax the \"we all agree\" to \"all available contributors agree\".</p>",
        "id": 222990989,
        "sender_full_name": "Eh2406",
        "timestamp": 1610814912
    },
    {
        "content": "<p>Sounds good, that's why only 1 required approval was set up btw.</p>",
        "id": 223052351,
        "sender_full_name": "Alex Tokarev",
        "timestamp": 1610902505
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120179\">@Eh2406</span> I've had a busy weekend sorry, I'll have a look at your PRs next weekend</p>",
        "id": 225612998,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1612820615
    },
    {
        "content": "<p>No probem.</p>",
        "id": 225613029,
        "sender_full_name": "Eh2406",
        "timestamp": 1612820633
    },
    {
        "content": "<p>Now that we have some experience with this, I am wondering whether we can let things go faster when both Matthieu and I have review a PR? If someone spots a problem we can always revert.</p>",
        "id": 241669300,
        "sender_full_name": "Eh2406",
        "timestamp": 1622949730
    },
    {
        "content": "<p>We could indeed shorten the delay when we have both reviewed a PR since we are the two persons knowing well the whole code base. But to be honest I don't mind the delay. In a sense, a slower pace almost feels like less pressure and more long-term sustainable. It might be annoying sometimes though for PRs changing the same piece of code with potential merge conflicts</p>",
        "id": 241697978,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1622995155
    },
    {
        "content": "<p>Good point on sustainability, let us leave it as is. It can be a reminder to take brakes and have other priorities. :-P</p>",
        "id": 241699183,
        "sender_full_name": "Eh2406",
        "timestamp": 1622997001
    }
]