[
    {
        "content": "<p>By the way, I just had a look at the issue for tracking public/private. What is the core idea/problem with \"scoped goals\" and \"public dependencies\"? (I know nothing about the RFC)</p>",
        "id": 248323433,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1628066081
    },
    {
        "content": "<p>I just read the public/private RFC. So if I understand well, there are two goals:</p>\n<ol>\n<li>catch shared usage of a type at different versions at dependency resolution instead of at compilation</li>\n<li>possibly enable more situations for private dependencies (they can basically be any version they want)</li>\n</ol>\n<p>(1) would require a constraint preventing from having two different versions of a crate connected via a chain of public edges (dependencies) in the dependency graph. One remark I have about this RFC is that it will also result in false positives. It could prevent a crate from compiling because in theory two versions of a public dependency are available, but in practice they are not used together.</p>\n<p>(2) I suppose this could even enable situations where we have \"a\" at version 1.1 and 1.2 in the solution if they are both private dependencies? or is that stretching the concept of private too far? because how does that play with a public \"p\" within the private \"a\". I'm not sure I've read in the RFC what is the situations for public deps of private deps.</p>",
        "id": 248329948,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1628070806
    },
    {
        "content": "<p>That all sounds right. Your point about false positives is entirely correct. That is one of the reasons the RFC cannot be implemented as described. It will need some syntax in Cargo.toml for \"I don't care about this conflict\".</p>",
        "id": 248354974,
        "sender_full_name": "Eh2406",
        "timestamp": 1628086313
    },
    {
        "content": "<blockquote>\n<p>have \"a\" at version 1.1 and 1.2 in the solution</p>\n</blockquote>\n<p>That is going further then the RFC does. (Some think it is a better design, but it would be to big a braking change.)<br>\nThe RFC only adds new conflicts/incompatibilities, it does not relax any existing conflicts/incompatibilities.<br>\nIf the pre-RFC resolver thinks there are no solutions, then there are no solutions with the post-RFC resolver.</p>",
        "id": 248355702,
        "sender_full_name": "Eh2406",
        "timestamp": 1628086610
    }
]