[
    {
        "content": "<p>Hello friends! Just wanted to leave a quick message to say thank you for the pubgrub-rs library. I've been meaning to implement the algorithm in Rust and you've saved me a lot of time. The library looks lovely and the documentation is delightful. Thanks!</p>",
        "id": 235104011,
        "sender_full_name": "Louis Pilfold",
        "timestamp": 1618781972
    },
    {
        "content": "<p>You are more then welcome! Most of the credit goes to <span class=\"user-mention\" data-user-id=\"348419\">@Matthieu Pizenberg</span> for the wonderful documentation.</p>",
        "id": 235106346,
        "sender_full_name": "Eh2406",
        "timestamp": 1618784376
    },
    {
        "content": "<p>By the way the dev branch is api compatible with v0.2, but a lot faster and using less memory. We will cut a 0.2.1 one of these days.</p>",
        "id": 235106466,
        "sender_full_name": "Eh2406",
        "timestamp": 1618784503
    },
    {
        "content": "<p>Are you able to share about your use case?</p>",
        "id": 235106613,
        "sender_full_name": "Eh2406",
        "timestamp": 1618784685
    },
    {
        "content": "<p>Awesome to see those documentation efforts pay off :)<br>\n<span class=\"user-mention\" data-user-id=\"406666\">@Louis Pilfold</span> is the author of the Gleam programming language. I've heard a lot of great things about it coming from the elm community.</p>",
        "id": 235107800,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1618786078
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"348419\">Matthieu Pizenberg</span> <a href=\"#narrow/stream/260232-t-cargo.2FPubGrub/topic/Thanks.20from.20Gleam/near/235107800\">said</a>:</p>\n<blockquote>\n<p>Awesome to see those documentation efforts pay off :)<br>\n<span class=\"user-mention silent\" data-user-id=\"406666\">Louis Pilfold</span> is the author of the Gleam programming language. I've heard a lot of great things about it coming from the elm community.</p>\n</blockquote>\n<p>They're fab docs! And thank you, I'm glad people are enjoying the language, even if everything is a bit rough around the edges at the moment.</p>",
        "id": 235160816,
        "sender_full_name": "Louis Pilfold",
        "timestamp": 1618829469
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"120179\">Eh2406</span> <a href=\"#narrow/stream/260232-t-cargo.2FPubGrub/topic/Thanks.20from.20Gleam/near/235106613\">said</a>:</p>\n<blockquote>\n<p>Are you able to share about your use case?</p>\n</blockquote>\n<p>Certainly. I've a little API client for Hex, the Erlang ecosystem package manager. <a href=\"https://github.com/gleam-lang/hexpm-rust/\">https://github.com/gleam-lang/hexpm-rust/</a><br>\nPubgrub seems to be a good fit for Hex so I intend to add dep resolution to the client for use in the Gleam build tool, so we can provide a better experience than the current hacks on top of the Erlang build tool. It's all very early exploration at the moment, but seems to be going well so far</p>",
        "id": 235160985,
        "sender_full_name": "Louis Pilfold",
        "timestamp": 1618829575
    },
    {
        "content": "<p>That is wonderful! Please keep us in the loop about what is or is not working for you!<br>\nAs a heads up our support of \"Pre-releases\" like <code>\"1.0.0-alpha.3\"</code> is still being designed. After we cut the 2.1, we will be getting started on it.<br>\nAlso we have a file format for benchmark cases. We currently use a snapshot of <a href=\"https://github.com/pubgrub-rs/pubgrub/issues/44#issuecomment-727289232\">all elm packages</a>, as our most realistic benchmark. If you want to generate a file based on your workload, that would be very helpful!</p>",
        "id": 235179606,
        "sender_full_name": "Eh2406",
        "timestamp": 1618838725
    },
    {
        "content": "<p>A benchmark sounds good. What would you need here? I just checked the Hex versions endpoint and there 11454 packages with 70684 versions across them.</p>",
        "id": 236816800,
        "sender_full_name": "Louis Pilfold",
        "timestamp": 1619779880
    },
    {
        "content": "<p>I've been trying to determine how to support prerelease versions so that they are not matched by ranges. Is this possible? It seems like I will need to copy Range or OfflineDependencySolver to my codebase and specialise it teach it to skip prereleases. Does that sound right?</p>",
        "id": 236818872,
        "sender_full_name": "Louis Pilfold",
        "timestamp": 1619781107
    },
    {
        "content": "<p>Oh! I have just spotted the issue. I guess there is no recommended approach currently. Cool I'll play about and see where I get</p>",
        "id": 236831519,
        "sender_full_name": "Louis Pilfold",
        "timestamp": 1619788298
    },
    {
        "content": "<p>For the benchmark, copy the data into a <code>OfflineDependencyProvider</code> and serialize that into a Ron file. <br>\nFor the prerelease, ether fork the project and modify the <code>Range</code> type OR use the <code>Range trait</code> branch. And figure out what changes get you working. Then <strong>MOST importantly</strong> report back so we can do something better for <code>0.3</code>.</p>",
        "id": 236841326,
        "sender_full_name": "Eh2406",
        "timestamp": 1619792415
    },
    {
        "content": "<p>OK cool. I'll have to make a little script to pull all the deps for each package from the Hex API so I'll make a note to do this when I have some free time. Does it need to be an <code>OfflineDependencyProvider </code> of <code>Range&lt;SemanticVersion&gt;</code>? I'm not sure that'll work so well because Hex uses preleases so if those are truncated we'll have some duplicate versions<br>\nI'll try the trait branch, thanks</p>",
        "id": 236846811,
        "sender_full_name": "Louis Pilfold",
        "timestamp": 1619794600
    },
    {
        "content": "<p>Good point. For now, yes. For the <a href=\"https://github.com/pubgrub-rs/pubgrub/issues/44#issuecomment-730721051\">zuse</a> benchmark I just filtered out prerelease versions. But if that is not realistic for your use case, then upload one that has prerelease data, and we can start using it when we merge support for it.</p>",
        "id": 236863858,
        "sender_full_name": "Eh2406",
        "timestamp": 1619800533
    }
]