[
    {
        "content": "<p>original <a href=\"https://github.com/rust-lang/rust-forge/issues/317\" target=\"_blank\" title=\"https://github.com/rust-lang/rust-forge/issues/317\">github issue</a></p>\n<p>Zulip is new to me, and my first experience included having to parse the 't-' prefix in the stream names. . This is the first time coming across 't-', and it left me with a minor sense of 'I'm an outsider here', which I believe is considered an undesirable outcome by the rust community . The biggest contributor to this, in my experience was this:</p>\n<blockquote>\n<p>using <code>ctrl-f t-</code> to find explanations is problematic due to '<strong>t-</strong>$name' clashing with 'rus<strong>t-</strong>$foo' </p>\n</blockquote>\n<p>thus, when searching for the answer to \"what is this t- prefix?\" in the rust-forge book, results were polluted, obfuscating the section that explains it.</p>\n<p>My take on why it caused a \"sense of outsider\":</p>\n<ul>\n<li>It seems to be an important part of how this zulip channel is organized</li>\n<li>I have not come across it anywhere else.</li>\n<li>Due to above mentioned clashing of 't-$team_name' and 'rust-$topic', a feeling that this was an 'insider-knowledge' started generating</li>\n</ul>\n<p>Proposed solution: change the 't-' prefix to 'tm-', ideally such that there is little friction when reverting back to 't-' if desired.</p>\n<p>Reasoning:</p>\n<ul>\n<li>searching for 'tm-' will no longer clash in zulip-use documentation (at time of writing). Possibly in other important locations also.</li>\n<li>'tm' is a stronger hint than 't', giving a reduced sense of obfuscation of meaning</li>\n<li>as zulip newcomers become more prominent in the user-base, not knowing 't-' becomes less exclusionary. At that point, reverting back to 't-' might be desired. </li>\n</ul>\n<p>Caveats:<br>\nIt might be worth considering adding a note to the zulip documentation the reasoning for 'tm-' over 't-'.</p>",
        "id": 190467921,
        "sender_full_name": "Ben",
        "timestamp": 1584069963
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"219696\">@XAMPPRocky</span> </p>\n<p>I've started discussion here as recommended in your <a href=\"https://github.com/rust-lang/rust-forge/issues/317#issuecomment-598522668\" target=\"_blank\" title=\"https://github.com/rust-lang/rust-forge/issues/317#issuecomment-598522668\">reply</a> to the github issue.</p>\n<p>I can't say anything to the historical reasons specifically to this issue. </p>\n<p>If Zulip jargon is a common thing, then I could see a jargon page not being out of place. Important to note, this would mitigate the effect, as opposed to addressing the root cause directly. I'm of the view that 'tm-' would eliminate the root cause, which is almost always preferable to outcome mitigation. </p>\n<p>Weighing up the value of historic preservation, and the value of mitigation/elimination on this issue, I cannot say. Also, don't forget the 'leave it' option. It might turn out that it's an insignificant issue, and doesn't justify action in any case. Don't forget the 'minor' quantifier I included, and there are other experiences which have more impact on how newcomers feel included in general. This issue could serve as a prompt to revisit this question with more generality.</p>",
        "id": 190469015,
        "sender_full_name": "Ben",
        "timestamp": 1584071704
    },
    {
        "content": "<p>To be clear I was thinking of a general “rust-lang” jargon page, not a Zulip specific one.</p>",
        "id": 190471213,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1584075042
    },
    {
        "content": "<p>hmmm. 't-$label' and 'wg-$label' would be listed under something like 'community jargon'?</p>",
        "id": 190472163,
        "sender_full_name": "Ben",
        "timestamp": 1584076491
    },
    {
        "content": "<p>If we choose to rename this, why don't we go all the way to \"team-\" for clarity?</p>",
        "id": 190474537,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1584080052
    },
    {
        "content": "<p>Only twe I can think of not to:  1. the 4-char overhead vs 2-char 'tm', means that the final channel name get truncated an extra 2 chars. 2.  subjective aesthetic preferences for one over the other.</p>\n<p>on 2. for the sake of preventing bike-shedding and leaving zero ambiguity, I'd suggest just going for 'team' if we go for the rename. If it looks like its worth saving 2 chars, makes for better aesthetics, or (perhaps most significantly), the 0-ambiguity isn't a big deal, we can try 'tm'</p>\n<p>on 1. Doesn't look like there would be significant difference based on my current sidebar (using firefox)</p>",
        "id": 190475628,
        "sender_full_name": "Ben",
        "timestamp": 1584081811
    },
    {
        "content": "<p>I don't feel like character amount makes a huge difference since Zulip has fuzzy search for mentions e.g. Typing <code>#compiler</code> will bring up <code>#t-compiler</code>. So clarity would be preferable to being short, since if we want to be short we already have it at one character.</p>",
        "id": 190475836,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1584081971
    },
    {
        "content": "<p>I would personally be mostly fine dropping the prefixes entirely, I don't know that they necessarily buy us much. </p>\n<p>However, having said that, I'm not sure if it's worth the change at this point (I think it's going to be rather painful, as it'll mean a divergence in history and links will break etc I expect); in particular because if you don't know what t- stands for it doesn't matter too much.</p>",
        "id": 190497937,
        "sender_full_name": "simulacrum",
        "timestamp": 1584103395
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> I would be against removing the prefixes because for certain teams it makes the room ambiguous and more prone to \"spam\" or offtopic discussion. E.g. <code>#community</code> is not obvious that it's for the community team and not the community. We've been adding prefixes to some channels in the discord to address this exact issue.</p>",
        "id": 190505668,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1584108227
    },
    {
        "content": "<p>Perhaps, yes.</p>",
        "id": 190505784,
        "sender_full_name": "simulacrum",
        "timestamp": 1584108292
    },
    {
        "content": "<p>I agree I think it doesn't matter too much. I think if the onboarding for Zulip was a bit better for newcomers it would resolve most of the problem.</p>",
        "id": 190505999,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1584108428
    },
    {
        "content": "<p>Maybe we can have a custom welcome message.</p>",
        "id": 190506048,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1584108466
    },
    {
        "content": "<p>If making changes risks breakages, this could could do. It would probably be worth making a note to look back iinto it sometime down the track (asking some newcomers explicitly, or whatever) to see that it resolves things.</p>",
        "id": 190508621,
        "sender_full_name": "Ben",
        "timestamp": 1584109870
    },
    {
        "content": "<p>note that \"t-lang\" etc is consistent with GitHub labels (well, almost, it's T-lang there). this is why I personally immediately understood the prefix. so if we decide this is too jargon-y and change it here, we should consistently change it there as well.<br>\nprobably this is less of an issue on the GH label side as labels come with a description. so maybe the missing bit here is just streams having descriptions? if t-lang would be described as \"channel for the language team\" or so, would that help?</p>",
        "id": 190641009,
        "sender_full_name": "RalfJ",
        "timestamp": 1584268523
    },
    {
        "content": "<p>streams <em>do</em> have descriptions, but they aren't very discoverable I think in the UI which might lead to this</p>",
        "id": 190647129,
        "sender_full_name": "simulacrum",
        "timestamp": 1584278882
    },
    {
        "content": "<p>Oh wow, I didn't even realize there were descriptions. You'd think they'd appear in a tooltip or something...</p>",
        "id": 190733443,
        "sender_full_name": "Wesley Wiser",
        "timestamp": 1584370658
    },
    {
        "content": "<p><a href=\"https://github.com/zulip/zulip/issues/5198\" target=\"_blank\" title=\"https://github.com/zulip/zulip/issues/5198\">zulip/zulip#5198</a>: \"Expose stream descriptions beyond subscriptions popup\"</p>",
        "id": 190739265,
        "sender_full_name": "bjorn3",
        "timestamp": 1584372964
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120791\">@RalfJ</span> Personality, I'd love to change them on GitHub as well. :)</p>",
        "id": 191306446,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1584740617
    },
    {
        "content": "<p>Meta-Comment: I started this topic as someone <em>completely</em> uninvolved in the rust project. It's <em>very</em> reassuring seeing the nature of the response. Even knowing how fantastic the Rust community is, I was still prepared to be met with at least a small element of condescension given the nature of this issue. I haven't felt <em>any</em> sense of it. It's amazing. Anyone that has impact on the community culture deserves credit: This sort of experience doesn't come from nowhere. It comes from a long history of many people nudging things in the right direction.</p>\n<p>Thank you.</p>",
        "id": 191422121,
        "sender_full_name": "Ben",
        "timestamp": 1584920009
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"271018\">@Ben</span> Thank you as well! And yeah, that's one of the many things I love about the Rust community: there's no vitriol brought forth by questioning current practices, and instead there's a willingness to examine them if they're causing issues, or explain them if they're mysterious but explicable.</p>",
        "id": 192104551,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1585369048
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span>  Just saw this in quote of the week  &lt;3</p>",
        "id": 193140613,
        "sender_full_name": "Ben",
        "timestamp": 1586235311
    }
]