[
    {
        "content": "<p>Hi folks! We're getting close to rolling out a beta version of web public streams, i.e. a Zulip-native alternative to <a href=\"https://github.com/zulip/zulip-archive\">zulip-archive</a>. We have documented this upcoming feature <a href=\"https://chat.zulip.org/help/web-public-streams\">here</a>, and would love to get some feedback.</p>\n<ol>\n<li>Is anything on the help page unclear/confusing?</li>\n<li>Do you have any questions about this feature that the help page fails to answer?</li>\n<li>Do you have any concerns about the way the feature is designed to work?</li>\n<li>Is there any key functionality that's missing?</li>\n</ol>\n<p>Please feel free to respond here or on the <a href=\"https://chat.zulip.org/#narrow/stream/2-general/topic/web.20public.20streams\">Zulip development community discussion thread</a>. Thanks!</p>",
        "id": 263513109,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1638486725
    },
    {
        "content": "<p>Hmm, it seems unfortunate that information about those not participating in the public stream would also become public through the API because of the existence of the public stream.</p>\n<p>Since it's easy to get an account it's not like that was a substantial secrecy layer, but it's not the model I would have expected, and feels like it would be rough to communicate.</p>\n<p>For example, it would be nice if the experience could be something like a \"This is your first time posting to a public stream in this organization.  By making this post, your name, avatar, role, join date, time zone, and groups will be available publicly [Cancel] [Ok]\".</p>\n<p>But instead, it sounds like the organization will have to make a post like \"WARNING: we will be making a stream public in 2 weeks.  If you don't want your name, avatar, role, join date, time zone, and groups to be available publicly, you need to delete your zulip account by that date\".</p>",
        "id": 263513975,
        "sender_full_name": "scottmcm",
        "timestamp": 1638487317
    },
    {
        "content": "<p>This does indeed sound like it would be hard to communicate.   The nuances of this new feature are expanded because the info exposure only comes from the API (and not the UI).  So one way to read this is (if this zulip enables this feature):  \"your account info will become public to anyone who cares to look\".   But a reasonable response to that would be \"your account info was already public to anyone who cares to sign up\"</p>",
        "id": 263516246,
        "sender_full_name": "Andrew Chin (eminence)",
        "timestamp": 1638488430
    },
    {
        "content": "<blockquote>\n<p>Do you have any concerns about the way the feature is designed to work?</p>\n</blockquote>\n<p>For OSS projects like Rust, I imagine we will want to make all !private channels web public (at least, that is the way <code>zulip-archive</code> works I think). It would be nice if there was a server level setting that allowed us to enable that globally instead of requiring someone to remember to do that every time we create a new channel.</p>",
        "id": 263585797,
        "sender_full_name": "Wesley Wiser",
        "timestamp": 1638541115
    },
    {
        "content": "<p>Hm, interesting. The planned UI for making web public streams is that it will just be an option in the stream creation menu:</p>\n<p><a href=\"/user_uploads/4715/pz3GCtOic6GPO86x-ljg9hKo/Screen-Shot-2021-12-03-at-10.47.56-AM.png\">Screen-Shot-2021-12-03-at-10.47.56-AM.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/4715/pz3GCtOic6GPO86x-ljg9hKo/Screen-Shot-2021-12-03-at-10.47.56-AM.png\" title=\"Screen-Shot-2021-12-03-at-10.47.56-AM.png\"><img src=\"/user_uploads/4715/pz3GCtOic6GPO86x-ljg9hKo/Screen-Shot-2021-12-03-at-10.47.56-AM.png\"></a></div><p>Would you want it to be selected as the default? Or ordered differently? Something else?</p>",
        "id": 263621853,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1638557405
    },
    {
        "content": "<p>There should be an option somewhere else in the organization settings to change the default setting of that menu</p>",
        "id": 263622311,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1638557647
    },
    {
        "content": "<p>(plus possibly a button to switch all public streams to web public, also in org settings)</p>",
        "id": 263622429,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1638557727
    },
    {
        "content": "<p>Hi folks! I'm excited to announce that we should be ready to open up the web-public streams feature for beta-testing here in the next week or so. :)</p>\n<p>Our plan is to give early access to a few organizations like this one so that we can iron out any glitches before releasing the feature to everyone on Zulip Cloud. If you happen to be part of another Zulip Cloud organization that would be interested in testing out web-public streams and providing feedback, please PM me to arrange it.</p>\n<p>In the meantime, you can already check out the feature in the Zulip development community by clicking on \"Access without an account (Beta)\" on the <a href=\"https://chat.zulip.org/login/\">chat.zulip.org login page</a>.</p>",
        "id": 273878469,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1646255916
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"438758\">@Alya Abbott</span> What is the current plan regarding helping notify users who may not be aware that this has changed for a stream?</p>",
        "id": 273886012,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646259347
    },
    {
        "content": "<p>Good question!</p>\n<ol>\n<li>The most prominent way will be that the stream icon will change from a <code>#</code> to a globe everywhere (left sidebar, at the top of the page, etc.).</li>\n<li>There will be an automated notification sent to the \"stream events\" topic in the stream that's changed.</li>\n</ol>",
        "id": 273888276,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1646260512
    },
    {
        "content": "<p>The former doesn't seem sufficiently self-explanatory for people who don't already know about it, but the latter should help, combined with an organizational announcement (e.g. <code>all@</code>).</p>",
        "id": 273890735,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646261687
    },
    {
        "content": "<p>Note that I think for at least the Rust zulip, we already archive publicly all the streams, so there's not an obvious to me 'move' with enabling these -- in fact, I presume the new view is <em>better</em> in some ways since it'll take care of deleted pieces and such more easily, I assume. This'll also mean much more easily excluding some streams.</p>\n<p>(I would still issue an announcement, just that the ship has somewhat sailed for people worried about it).</p>",
        "id": 273893413,
        "sender_full_name": "simulacrum",
        "timestamp": 1646262830
    },
    {
        "content": "<p>No argument there. Just want to make sure people are aware.</p>",
        "id": 273894500,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646263266
    },
    {
        "content": "<p>Along similar lines, when people sign up for the Rust Zulip via <a href=\"\">https://rust-lang.zulipchat.com/</a> , they see a description that just says \"One of the chat platforms for the Rust Programming Language.\". Could we update the description to say something like \"All public channels are publicly archived on the web.\"?</p>",
        "id": 273894618,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646263317
    },
    {
        "content": "<p>Yeah, seems like a good idea.</p>",
        "id": 273895735,
        "sender_full_name": "simulacrum",
        "timestamp": 1646263822
    },
    {
        "content": "<p>I just made that change.</p>",
        "id": 273895791,
        "sender_full_name": "simulacrum",
        "timestamp": 1646263848
    },
    {
        "content": "<p><span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span></p>",
        "id": 273895846,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646263888
    },
    {
        "content": "<p>Ah, I didn't realize that that was just an organization setting here in Zulip, rather than in a git repo somewhere. :)</p>",
        "id": 273895877,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646263914
    },
    {
        "content": "<p>Hi folks! The web-public streams feature is now available in this organization! Streams can be set to web-public visibility once an administrator <a href=\"https://zulip.com/help/web-public-streams#enable-or-disable-web-public-streams\">enables web-public streams</a>. You should also check to make sure you're happy with the set of <a href=\"https://zulip.com/help/web-public-streams#manage-who-can-create-web-public-streams\">roles that can create web-public streams</a>.</p>\n<p>In order to find and fix any remaining issues, we have so far enabled this feature for a very small number of organizations. Please share feedback about any problems you see, big or small!</p>",
        "id": 275280403,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1647283273
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span> Do you want to take point on preparing an announcement and circulating the move to web-public streams for our Zulip (and eventually deprecating/removing zulip-archive)? I have relatively limited bandwidth myself to write up an announcement and circulate it, unfortunately, and it sounds like you have a stronger sense of what you'd like to see in such an announcement :)</p>",
        "id": 275692909,
        "sender_full_name": "simulacrum",
        "timestamp": 1647536410
    },
    {
        "content": "<p>(I would at least personally not feel entirely problematic about starting by moving one or two streams to web-public, e.g., t-compiler/meetings or general, perhaps)</p>",
        "id": 275693061,
        "sender_full_name": "simulacrum",
        "timestamp": 1647536435
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> I don't think I have the bandwidth to circulate the announcement, but I could help draft one.</p>",
        "id": 275702667,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647540207
    },
    {
        "content": "<p>OK -- that's probably a good start</p>",
        "id": 275702798,
        "sender_full_name": "simulacrum",
        "timestamp": 1647540273
    },
    {
        "content": "<p>what are the risks we foresee with the migration to web-public streams, given that we already have the zulip-archive? Its hard to imagine them. The main one I could think of is that people may have gotten used to the significant delay in archival, which gives them time to post things (like zoom passwords) and then delete them...</p>",
        "id": 275711808,
        "sender_full_name": "pnkfelix",
        "timestamp": 1647544500
    },
    {
        "content": "<p>I don't think there are huge risks, which is why I'm not personally too worried about switching</p>",
        "id": 275712080,
        "sender_full_name": "simulacrum",
        "timestamp": 1647544626
    },
    {
        "content": "<p>I think Josh had stronger concerns, though not sure if that was for other (not yet archived) zulips.</p>",
        "id": 275712105,
        "sender_full_name": "simulacrum",
        "timestamp": 1647544641
    },
    {
        "content": "<p>Web-public streams show the list of users that are member of them unlike zulip-archive. That may include user activity status. Haven't check that though.</p>",
        "id": 275716315,
        "sender_full_name": "bjorn3",
        "timestamp": 1647546714
    },
    {
        "content": "<blockquote>\n<p>The following information is available to all users with an account, but not to logged out visitors:</p>\n<ul>\n<li>Presence information, i.e. whether the user is currently online, their status, and whether they have set themselves as unavailable.</li>\n<li>Detailed profile information, such as custom profile fields.</li>\n<li>Which users are subscribed to which web-public streams.</li>\n</ul>\n</blockquote>\n<p>You can scrape names/roles in general (<a href=\"https://zulip.com/help/web-public-streams#information-about-users\">https://zulip.com/help/web-public-streams#information-about-users</a>), but it doesn't seem like that's really a high bar given that creating an account on this Zulip is trivial anyway.</p>",
        "id": 275716994,
        "sender_full_name": "simulacrum",
        "timestamp": 1647547030
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116122\">simulacrum</span> <a href=\"#narrow/stream/122653-zulip/topic/web.20public.20streams/near/275712105\">said</a>:</p>\n<blockquote>\n<p>I think Josh had stronger concerns, though not sure if that was for other (not yet archived) zulips.</p>\n</blockquote>\n<p>I actually have relatively few concerns about people actually incurring more risks than they did previously. Rather, I think it's now more prominent, and I'd expect people to be more likely to raise those concerns. I also wanted to make sure new users weren't surprised, but the message on the signup page solves that.</p>",
        "id": 275718315,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647547590
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"438758\">@Alya Abbott</span> What do links to Web Public messages look like? Asking because many people often copy-paste links directly from Zulip, and I'm wondering if when folks follow those links they'd be able to see messages in the web archive without logging in, and then have the option to make an account or log in as they do now.</p>",
        "id": 275719151,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647547959
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> Rough draft of an announcement:</p>\n<p>The Rust Zulip is used for public and private discussions about the development of Rust. To provide transparency into Rust's development, and to make it easier for people to link to and read discussions from other places (e.g. GitHub issues or the Internals forum), public streams on this Zulip have been archived on the web since 2018.<br>\nWe're migrating from the separate <code>zulip-archive</code> site to Zulip \"web public\" streams, and marking all public Zulip streams as \"web public\". This does not in practice change any aspect of our archiving policy. You can now see an indication at the top of each stream showing that it is web-public.<br>\nPrivate streams will as always remain private. Private messages are <em>always</em> private, with no access even to Zulip administrators.</p>",
        "id": 275719801,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647548256
    },
    {
        "content": "<p>And you're thinking an internals post or inside rust post on that?</p>",
        "id": 275720091,
        "sender_full_name": "simulacrum",
        "timestamp": 1647548384
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"239881\">Josh Triplett</span> <a href=\"#narrow/stream/122653-zulip/topic/web.20public.20streams/near/275719151\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"438758\">Alya Abbott</span> What do links to Web Public messages look like? Asking because many people often copy-paste links directly from Zulip, and I'm wondering if when folks follow those links they'd be able to see messages in the web archive without logging in, and then have the option to make an account or log in as they do now.</p>\n</blockquote>\n<p><a href=\"https://chat.zulip.org/#narrow/stream/1-announce/topic/code.20review.20guide\">https://chat.zulip.org/#narrow/stream/1-announce/topic/code.20review.20guide</a> is a link from the main Zulip (via the web public feature)</p>",
        "id": 275720287,
        "sender_full_name": "simulacrum",
        "timestamp": 1647548469
    },
    {
        "content": "<p><a href=\"/user_uploads/4715/HdhCGAPa5r83RMg9qVzuTUpV/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/4715/HdhCGAPa5r83RMg9qVzuTUpV/image.png\" title=\"image.png\"><img src=\"/user_uploads/4715/HdhCGAPa5r83RMg9qVzuTUpV/image.png\"></a></div>",
        "id": 275720510,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647548567
    },
    {
        "content": "<p>Perfect.</p>",
        "id": 275720515,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647548570
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116122\">simulacrum</span> <a href=\"#narrow/stream/122653-zulip/topic/web.20public.20streams/near/275720091\">said</a>:</p>\n<blockquote>\n<p>And you're thinking an internals post or inside rust post on that?</p>\n</blockquote>\n<p>I was actually just thinking a post on <a class=\"stream\" data-stream-id=\"122649\" href=\"/#narrow/stream/122649-announce\">#announce</a> with a rare use of <code>@everyone</code>.</p>",
        "id": 275720614,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647548627
    },
    {
        "content": "<p>It <em>might</em> make sense to post something to Inside Rust, but that would warrant a different message. In that post, we'd de-emphasize the bits about the change and history, and just announce that Zulip streams are available on the web (with perhaps a footnote mention that they were previously available via another mechanism, but now Zulip links are just automatically readable on the web).</p>",
        "id": 275720797,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647548717
    },
    {
        "content": "<p>Ah, that seems like a good start.</p>",
        "id": 275721291,
        "sender_full_name": "simulacrum",
        "timestamp": 1647548969
    },
    {
        "content": "<p>Also, we might want to set up redirects for the <code>zulip-archive</code> site for the benefit of old links, if that's not excessively painful to do.</p>",
        "id": 275722340,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647549406
    },
    {
        "content": "<p>I was expecting to just stop updating it, not actually delete the site</p>",
        "id": 275722759,
        "sender_full_name": "simulacrum",
        "timestamp": 1647549611
    },
    {
        "content": "<p>(at least for the forseeable future)</p>",
        "id": 275722784,
        "sender_full_name": "simulacrum",
        "timestamp": 1647549616
    },
    {
        "content": "<p>I figured if the links convert over straightforwardly we could just redirect.</p>",
        "id": 275727982,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647551643
    },
    {
        "content": "<p>But yeah, it's not urgent.</p>",
        "id": 275728043,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647551658
    },
    {
        "content": "<p><a href=\"https://zulip-archive.rust-lang.org/stream/122653-zulip/topic/web.20public.20streams.html\">https://zulip-archive.rust-lang.org/stream/122653-zulip/topic/web.20public.20streams.html</a></p>\n<p>vs</p>\n<p><a href=\"#narrow/stream/122653-zulip/topic/web.20public.20streams\">https://rust-lang.zulipchat.com/#narrow/stream/122653-zulip/topic/web.20public.20streams</a></p>\n<p>So <em>probably</em> we can redirect without too much trouble, but it would need some JS work I suspect</p>",
        "id": 275728541,
        "sender_full_name": "simulacrum",
        "timestamp": 1647551809
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"438758\">@Alya Abbott</span> I think I might've asked before, but maybe this is something the upstream zulip-archive would want to support, to give a smooth migration path for users intending to migrate this way?</p>",
        "id": 275728777,
        "sender_full_name": "simulacrum",
        "timestamp": 1647551886
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> The escaping looks the same, so I think that would only need simple URL redirects: add <code>/#narrow</code> at the start and remove <code>.html</code> from the end.</p>",
        "id": 275731053,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647553013
    },
    {
        "content": "<p>That's within what most web servers can easily do.</p>",
        "id": 275731086,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647553031
    },
    {
        "content": "<p>I think the escaping changed at some point, but yes</p>",
        "id": 275731089,
        "sender_full_name": "simulacrum",
        "timestamp": 1647553035
    },
    {
        "content": "<p>right now we're not hosting this on a web server (it's just gh pages + cloudfront), but it would be easy enough to add a redirect to either the 404 page on gh pages or to switch to a \"simple\" lambda function or something</p>",
        "id": 275731162,
        "sender_full_name": "simulacrum",
        "timestamp": 1647553070
    },
    {
        "content": "<p>Oh, right. Yeah, multiple times I've wished GitHub Pages had trivial redirects.</p>",
        "id": 275731292,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647553127
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116122\">simulacrum</span> <a href=\"#narrow/stream/122653-zulip/topic/web.20public.20streams/near/275731089\">said</a>:</p>\n<blockquote>\n<p>I think the escaping changed at some point, but yes</p>\n</blockquote>\n<p>It looks like we already have a redirect in place - <a href=\"https://github.com/rust-lang/zulip_archive/blob/gh-pages/404.html\">https://github.com/rust-lang/zulip_archive/blob/gh-pages/404.html</a></p>",
        "id": 275731299,
        "sender_full_name": "simulacrum",
        "timestamp": 1647553131
    },
    {
        "content": "<p>(for the old -&gt; new format)</p>",
        "id": 275731318,
        "sender_full_name": "simulacrum",
        "timestamp": 1647553138
    },
    {
        "content": "<p>so adding this to that should not be too difficult.</p>",
        "id": 275731331,
        "sender_full_name": "simulacrum",
        "timestamp": 1647553143
    },
    {
        "content": "<p>Hello, i just found out about zulip recently, so i wonder how zulip will scale for a large amount of user?</p>",
        "id": 276426359,
        "sender_full_name": "yoru",
        "timestamp": 1648088635
    }
]