[
    {
        "content": "<p>How much is Zulip different from other thread-based productivity tools in the way it works? Examples are Spectrum, Discourse or even GitHub.<br>\nAll of the examples uses the concept of thread as the basis of the conversation, but in the order I mentioned they are more focused on longer and persistent messages, like the main topic body. Is it a reason Zulip is preferable to those tools?</p>",
        "id": 159321519,
        "sender_full_name": "Tatsuyuki Ishi",
        "timestamp": 1551084319
    },
    {
        "content": "<p>Well one response is that maybe we don't <em>want</em> to optimize for persistence as much as those platforms do</p>",
        "id": 159330013,
        "sender_full_name": "pnkfelix",
        "timestamp": 1551093873
    },
    {
        "content": "<p>but its not a very strong argument</p>",
        "id": 159330016,
        "sender_full_name": "pnkfelix",
        "timestamp": 1551093882
    },
    {
        "content": "<p>Are any of those platforms optimized for live chat?</p>",
        "id": 159330052,
        "sender_full_name": "pnkfelix",
        "timestamp": 1551093937
    },
    {
        "content": "<p>For example, I'm not aware of any one using Discourse or Github for live interaction in practice. (Maybe I'm missing out on something.) And I had not heard of Spectrum before you mentioned it, so I cannot comment on it.</p>",
        "id": 159330106,
        "sender_full_name": "pnkfelix",
        "timestamp": 1551093984
    },
    {
        "content": "<p>but in any case, skimming over a <a href=\"https://spectrum.chat/product-design/general/user-interviews~764331db-16dd-4fc4-a2c5-aabd735a64a9\" target=\"_blank\" title=\"https://spectrum.chat/product-design/general/user-interviews~764331db-16dd-4fc4-a2c5-aabd735a64a9\">sample dialogue</a> on spectrum.chat, and based on my own use of discourse, my most immediate reaction of why I prefer Zulip <em>for live chat</em> is that it encourages short messages</p>",
        "id": 159330161,
        "sender_full_name": "pnkfelix",
        "timestamp": 1551094058
    },
    {
        "content": "<p>Encouraging short messages is what enables, hopefully, interruption from others (when necessary/relevant; no one wants to just invite noise)</p>",
        "id": 159330166,
        "sender_full_name": "pnkfelix",
        "timestamp": 1551094077
    },
    {
        "content": "<p>which is necessary for true dialogue.</p>",
        "id": 159330209,
        "sender_full_name": "pnkfelix",
        "timestamp": 1551094085
    },
    {
        "content": "<p>Conversely, when the UI encourages a person to spell out an email sized chunk of text, that is going to introduce latency on each step of both <em>writing</em> and <em>reading</em></p>",
        "id": 159330243,
        "sender_full_name": "pnkfelix",
        "timestamp": 1551094154
    },
    {
        "content": "<p>seconded, i like zulip because it has the immediacy of a chat program while the threading often avoids new messages drowning out unrelated older ones</p>",
        "id": 159330899,
        "sender_full_name": "Hanna Kruppe",
        "timestamp": 1551094932
    }
]