[
    {
        "content": "<p>I'm working on making some contributions to a Bazel x Cargo project, and basically, there is a need to have a sha256 identifier for crates. Digging around, I noticed that taking the sha256 of a \".crate\" file seems to be the standard -- it's mentioned here: <a href=\"https://doc.rust-lang.org/cargo/reference/registries.html\" title=\"https://doc.rust-lang.org/cargo/reference/registries.html\">https://doc.rust-lang.org/cargo/reference/registries.html</a> -- but I'm having trouble finding more detail on this file format.</p>\n<p>Are there other docs / tools I should read up on to see where this value is being generated? Or perhaps how I can dervice this value given a Cargo.toml + Cargo.lock file?</p>",
        "id": 196117830,
        "sender_full_name": "Sean Klein",
        "timestamp": 1588533117
    },
    {
        "content": "<p>From what I can gather, the \".crate\" file exists in my filesystem under $HOME/.cargo/registry/cache/...,  supposedly it is a tarball of the package, and the checksum used in registries is a sha256 checksum of that tarball</p>",
        "id": 196117901,
        "sender_full_name": "Sean Klein",
        "timestamp": 1588533212
    },
    {
        "content": "<p>but I can't find any reference to that value (either the path to the cache, nor the checksum itself) under commands like cargo metadata</p>",
        "id": 196117952,
        "sender_full_name": "Sean Klein",
        "timestamp": 1588533248
    },
    {
        "content": "<p>Follow-up for anyone else who has seen this: This is the same checksum that's available in the Cargo.lock file. Parsing it from a lock file (via the cargo-lock crate) seems way easier than trying to access the \".crate\" file.</p>",
        "id": 196123680,
        "sender_full_name": "Sean Klein",
        "timestamp": 1588540424
    },
    {
        "content": "<p><code>.crate</code> in <code>~/.cargo</code> is just a cached file downloaded from <code>crates.io</code>. You can download those directly from <a href=\"http://crates.io\" title=\"http://crates.io\">crates.io</a></p>",
        "id": 196180239,
        "sender_full_name": "nagisa",
        "timestamp": 1588599301
    }
]