[
    {
        "content": "<p>Hello, I am currently working on the /sys/wasi directory for the issue <a href=\"https://github.com/rust-lang/rust/issues/73904\">https://github.com/rust-lang/rust/issues/73904</a>.</p>\n<p>I had posted a comment in the issue, but I though I would re-post it here and see if anyone could help me.</p>\n<blockquote>\n<p>Something strange happened while I was applying the changes.. I used ripgrep to search through sys/wasi to find all files with a mention of \"unsafe\". From there, I added #![deny(unsafe_op_in_unsafe_fn)] at the top of the file, and then ran ./x.py check src/libstd to check for errors, which surprisingly resulted in a successful compile. Should I run extra checks or am I going about this the wrong way?</p>\n</blockquote>",
        "id": 204691603,
        "sender_full_name": "Phil Nadon",
        "timestamp": 1595436456
    },
    {
        "content": "<p>I think that's mostly fine, if you did this for all submodules, it might be simpler to add this attribute only in the <code>sys/wasi</code> module itself (as it should apply to all its submodules automatically)</p>",
        "id": 204692022,
        "sender_full_name": "lcnr",
        "timestamp": 1595436687
    },
    {
        "content": "<p>It's probably a good idea to open a PR with your current changes, even if you aren't sure if everything's correct. This should make it easier to see what might be going on here</p>",
        "id": 204692148,
        "sender_full_name": "lcnr",
        "timestamp": 1595436742
    },
    {
        "content": "<p>Yep, you don’t need to put it in each file, just at the top level of the module. There are other linked PRs in the original issue, take a look at them if you want examples <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 204692250,
        "sender_full_name": "Poliorcetics",
        "timestamp": 1595436795
    },
    {
        "content": "<p>Ok thanks, I looked at one of the commits for reference and they seemed to have it per-file but I could be wrong, I'll look into it!</p>",
        "id": 204697234,
        "sender_full_name": "Phil Nadon",
        "timestamp": 1595439070
    }
]