[
    {
        "content": "<p>Is it intentional that the <code>feature(pattern)</code> info is missing from the <a href=\"https://rust-lang.github.io/rfcs/introduction.html\">rfc book</a> It seems <a href=\"https://rust-lang.github.io/rfcs/0528-string-patterns.html\">string-pattern</a> is the updated name but also doesn't have the name of the feature flag nor (it seems) the right tracking issue. (<a href=\"https://github.com/rust-lang/rust/issues/27721\">https://github.com/rust-lang/rust/issues/27721</a>). Is this known?</p>",
        "id": 250695953,
        "sender_full_name": "UebelAndre",
        "timestamp": 1629933103
    },
    {
        "content": "<p>Old RFCs didn't include the feature names, and they are mostly a snapshot in time (they are generally not updated).  Following the link for the tracking issue for RFC 528 (<a href=\"https://github.com/rust-lang/rust/issues/22477\">#22477</a>) it has a link to the new tracking issue (<a href=\"https://github.com/rust-lang/rust/issues/27721\">#27721</a>).</p>",
        "id": 250696364,
        "sender_full_name": "Eric Huss",
        "timestamp": 1629933375
    },
    {
        "content": "<p>Is this something that should be updated? It was a bit of work to track down what the heck <code>feature(pattern)</code> was when I found it in some crate.</p>",
        "id": 250785702,
        "sender_full_name": "UebelAndre",
        "timestamp": 1629989811
    },
    {
        "content": "<p>Hm, I guess I'm not sure what you're asking.  If you want to update the tracking issue link, I could approve that.  But in general we don't have the capacity to update old RFCs in general.  </p>\n<p>But maybe it would help to understand what your process was for discovering it.  Features are documented in the <a href=\"https://doc.rust-lang.org/nightly/unstable-book/library-features/pattern.html\">unstable book</a>.  For me, that's the first link on Google for \"rust feature pattern\".  Most of the Library Features aren't described there beyond linking to the tracking issue, which usually should have enough information to figure out what it means.  Can you say more on where you looked or what wasn't clear or what you would like to see updated?</p>",
        "id": 250787978,
        "sender_full_name": "Eric Huss",
        "timestamp": 1629990631
    },
    {
        "content": "<p>I wanted to use a crate that didn't support the <code>stable</code> channel since it was using unstable features. I hopped over to the RFC book to find out what the flag was and what the state of each flag was. When I started looking for <code>pattern</code>, I couldn't find it. And had to do some spelunking until I came across the existence of the unstable book (which I'd forgotten existed).</p>",
        "id": 251062630,
        "sender_full_name": "UebelAndre",
        "timestamp": 1630163973
    },
    {
        "content": "<p>What is the difference between the RFC book and unstable book?</p>",
        "id": 251062641,
        "sender_full_name": "UebelAndre",
        "timestamp": 1630163987
    },
    {
        "content": "<p>the unstable book only includes things that have been implemented</p>",
        "id": 251062724,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1630164044
    },
    {
        "content": "<p>and also includes things that haven't gone through an RFC, like implementation details</p>",
        "id": 251062734,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1630164062
    },
    {
        "content": "<p>I opened <a href=\"https://github.com/rust-lang/rfcs/pull/3169\">https://github.com/rust-lang/rfcs/pull/3169</a></p>",
        "id": 251063405,
        "sender_full_name": "UebelAndre",
        "timestamp": 1630164791
    }
]