[
    {
        "content": "<p>Hello,<br>\nI didn't see an obvious place to do metadiscussion about GitHub issue stuff, so here we go. I think we might want to do some fiddling with issue labels. And as a reminder, people can set issue labels via comments in an issue with the following syntax:</p>\n<div class=\"codehilite\"><pre><span></span><code>@rustbot label: +{LABEL_A}, -{LABEL_B}\n</code></pre></div>\n<p>where <code>{LABEL_A}</code> and <code>{LABEL_B}</code> can be any two existing labels.</p>\n<p>Anyways, we didn't have a label for <code>A-array</code> so I figured I might as well go ahead and make one, as people were using <code>A-slice</code> for it instead, and const generics has kinda made them much more clearly their own distinct thing, so I figured they should get one.</p>",
        "id": 256486796,
        "sender_full_name": "Jubilee",
        "timestamp": 1633555230
    },
    {
        "content": "<p>I also made a temporary one, unmarked <code>link-dead-code</code>.<br>\ncc <span class=\"user-mention\" data-user-id=\"232545\">@Joshua Nelson</span> <span class=\"user-mention\" data-user-id=\"307537\">@Noah Lev</span> </p>\n<p>I was kinda thinking we might want to separately label linkage-related issues, including linkage subissues, rather than have them in a pile with the other <code>A-</code> issue labels because they are kinda-sorta in their own little weird \"language + compiler + tooling\" area and the way they are organized now makes them hard to pick out from the rest. <code>A-linkage</code> can stay, I mean, I just mean sublabeling them a bit more finely, the way <code>NLL-</code> and <code>const-generics</code> have been used as label prefixes also.</p>",
        "id": 256487598,
        "sender_full_name": "Jubilee",
        "timestamp": 1633555636
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281757\">@Jubilee</span> people can't label arbitrary issues, only those explicitly allowed in triagebot.toml. So they could set A-linkage but not <code>linkage</code>.</p>",
        "id": 256488147,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1633555904
    },
    {
        "content": "<p>Interesting. :D Good to know.</p>",
        "id": 256488263,
        "sender_full_name": "Jubilee",
        "timestamp": 1633555965
    },
    {
        "content": "<p>Anyways that is why I do not have a strong anti-opinion against renaming it!<br>\nmerely a statement of intention: I think we should isolate our linkage-related issues more finely.</p>",
        "id": 256489854,
        "sender_full_name": "Jubilee",
        "timestamp": 1633556753
    },
    {
        "content": "<p>The way I think of <code>A-</code> labels is you have a \"top-level\" label like <code>A-linkage</code> and then, optionally, finer-grained labels like <code>A-link-dead-code</code>. Then, if you want to find <em>all</em> linkage issues, you can search for <code>A-linkage</code>, but if you want to find just <code>-C link-dead-code</code> issues, you can search for <code>A-link-dead-code</code> (or <code>A-linkage</code> + <code>A-link-dead-code</code>).</p>",
        "id": 256490683,
        "sender_full_name": "Noah Lev",
        "timestamp": 1633557212
    },
    {
        "content": "<p>E.g., <code>A-diagnostics</code> is a top-level label and <code>A-suggestion-diagnostics</code> is a sub-label. (Although sometimes I and others use just <code>A-suggestion-diagnostics</code> since it is so common.)</p>",
        "id": 256490809,
        "sender_full_name": "Noah Lev",
        "timestamp": 1633557259
    }
]