[
    {
        "content": "<p>Hello everyone,</p>\n<p>An idea for a project occurred to me a few moments ago and I wanted to see if you guys can point me in the right direction in case I want to pursuit it. </p>\n<p>There might already be solutions for my idea (perhaps <em>xbindkeys</em>, <em>xev</em>, or <em>xdottools</em> could be used) but this is more about the journey than solving a problem kind of thing.</p>\n<h2>The Idea</h2>\n<p>I would like to use my cheap Amazon Basics mouse to do horizontal scroll. The bindings I would like to do is rightclick+scroll.</p>\n<h3>How I see it functioning</h3>\n<ol>\n<li>The user right clicks and the right click default action is triggered (opening of a menu with options, etc)</li>\n<li>The moment the scroll wheel is moved while holding the right click, the default right click action is no longer active (same as if the user lets go of the rightclick) and the scroll wheel now scrolls horizontally.</li>\n</ol>\n<h2>Things I am wondering</h2>\n<ul>\n<li>Would the program have to run as a deamon?</li>\n<li>Would this lead me towards hardware drivers development?<ul>\n<li>If so, what are a few good docs, blog posts, videos that introduces the topic?</li>\n</ul>\n</li>\n</ul>\n<p>Thank you all that reply! <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span></p>",
        "id": 226063261,
        "sender_full_name": "Joel M.",
        "timestamp": 1613080377
    },
    {
        "content": "<p>you might find <a href=\"https://crates.io/crates/device_query\">https://crates.io/crates/device_query</a> helpful</p>",
        "id": 226063937,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1613080691
    },
    {
        "content": "<p>(or some other library, I haven't used that particular one)</p>",
        "id": 226063955,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1613080701
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"389055\">@Joel M.</span> hi again :) which platform are you targeting for such a tool? I see you mention X11 tools so I'll assume Linux.</p>\n<p>I gave a quick look not long ago and tried to play a bit with <code>libevdev</code>, here's a basic script to remap <a href=\"https://gist.github.com/apiraino/25ca3ff037c66bacc18f2ae6342c48a1\">keystrokes to mouse movements</a>.</p>\n<p>Also <code>libinput</code> which (in my limited understanding) is the recommended kernel interface to handle HID input and also supports Wayland. Here's a <a href=\"https://pypi.org/project/python-libinput/\">python libinput library</a>. Libinput is documented <a href=\"https://wayland.freedesktop.org/libinput/doc/latest/features.html\">here</a></p>",
        "id": 226121672,
        "sender_full_name": "apiraino",
        "timestamp": 1613126795
    },
    {
        "content": "<p>side note: I'd found useful prototyping with something like python (i.e. a language to quickly iterate over ~100 lines of code) because I discovered immediately various usability issues when trying to handle streams of input signals.</p>",
        "id": 226121682,
        "sender_full_name": "apiraino",
        "timestamp": 1613126808
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"232545\">Joshua Nelson</span> <a href=\"#narrow/stream/122651-general/topic/Advice.3A.20Program.20to.20create.20custom.20mouse.20bindings/near/226063937\">said</a>:</p>\n<blockquote>\n<p>you might find <a href=\"https://crates.io/crates/device_query\">https://crates.io/crates/device_query</a> helpful</p>\n</blockquote>\n<p>worth mentioning that (on the surface) this library seems to allow querying but not handling input signals. Also requires <code>libx11-*</code> so it's X11 only.<br>\n(note, I'm lying: Wayland supports Xwayland to handle X11 applications)</p>",
        "id": 226121924,
        "sender_full_name": "apiraino",
        "timestamp": 1613126990
    },
    {
        "content": "<p>Xwayland is pretty restricted compared to regular Xorg. For example programs can't communicate with each other. I don't know if it allows getting mouse input outside of the program window. Wayland has been designed to make this kind of things impossible without extensions. This ensures that a keylogger is useless when it is part of a sandboxed program. Which wayland compositor are you using? It may have an extension to allow what you want.</p>",
        "id": 226122202,
        "sender_full_name": "bjorn3",
        "timestamp": 1613127172
    },
    {
        "content": "<p>I'm on <code>wlroots</code> (+sway, xwayland disabled).<br>\nRight, I should have mentioned that I use xwayland only as last resort for those X11 applications standing on old versions of GUI toolkits that were not updated to support Wayland.</p>\n<blockquote>\n<p>I don't know if it allows getting mouse input outside of the program window.</p>\n</blockquote>\n<p>hmm ... (never tried but) by \"program window\" would that imply that a cli application to remap libinput events wouldn't work either?</p>",
        "id": 226123917,
        "sender_full_name": "apiraino",
        "timestamp": 1613128360
    },
    {
        "content": "<p>Correct. I did find <a href=\"https://www.codedbearder.com/posts/writing-keyboard-remapper-wayland/\">https://www.codedbearder.com/posts/writing-keyboard-remapper-wayland/</a> though which requires you to change the permission for the <code>/dev/input</code> device files to make them user readable, thereby circumventing this. Sway also has some input configuration (<code>man sway-input</code>) but it doesn't seem to support this remapping you want.</p>",
        "id": 226124547,
        "sender_full_name": "bjorn3",
        "timestamp": 1613128782
    },
    {
        "content": "<p>Ha! I remember that blog post :-) <br>\nThanks for the info, though!</p>",
        "id": 226125000,
        "sender_full_name": "apiraino",
        "timestamp": 1613129136
    }
]