[
    {
        "content": "<p>Hi all! I have been trying to contact the author of two \"important\" (at least for me :)) crates of the mio/tokio ecosystem for over 4 months, with no success. These crates work well even without maintenance, but they are still targetting mio 0.6.x and tokio 0.2.x, while the rest of the world has moved on to newer versions.</p>\n<p>What are established best practices to resolve this issue?<br>\nShall I just fork the crate repos, make them work with mio 0.7.x/tokio 1.x, and publish them on <a href=\"http://crates.io\">crates.io</a> under new names?<br>\nIs there any interest from the mio/tokio communities to resolve such cases officially and provide a shelter under their GitHub org?</p>",
        "id": 245456101,
        "sender_full_name": "Colin Finck",
        "timestamp": 1625843706
    },
    {
        "content": "<p>my .2 cents on the matter, I'm not sure these can be defined best practices, but:</p>\n<p>After checking if there are already open issues about upgrading these dependencies, I'd publish your fork (so you're not stuck with your work), then leave a visible trace of your fork on the upstream repository (example: a new issue) asking for a feedback from the maintainers and expressing the interest in contributing, perhaps suggesting a merge upstream of your patches.</p>",
        "id": 245459429,
        "sender_full_name": "apiraino",
        "timestamp": 1625845295
    },
    {
        "content": "<p>If after that, months pass by without any feedback, your fork may become an \"unofficial\" fork that people can use at their will, I see nothing wrong about that.<br>\nNote: sometimes maintainers are slow to respond for many valid reasons, so 4 months don't struck me as completely unusual :) so I wouldnt worry too much</p>",
        "id": 245459488,
        "sender_full_name": "apiraino",
        "timestamp": 1625845324
    },
    {
        "content": "<blockquote>\n<p>and publish them on <a href=\"http://crates.io\">crates.io</a> under new names</p>\n</blockquote>\n<p>I would leave this step as last resort if the upstream repository <strong>really</strong> looks completely abandoned (like, after a year or so) without lifesigns</p>",
        "id": 245459876,
        "sender_full_name": "apiraino",
        "timestamp": 1625845533
    }
]