[
    {
        "content": "<p>Hi, can someone help me figure out how I can make the build script identify the target's target-features? For reference, I made an issue on the repository <a href=\"https://github.com/rust-lang/rust/issues/75018\">https://github.com/rust-lang/rust/issues/75018</a> with a minimal example of what my problem is.</p>",
        "id": 205696995,
        "sender_full_name": "Fabian von der Warth",
        "timestamp": 1596313716
    },
    {
        "content": "<p>Pass your <code>-C target-cpu</code> flag with <code>RUSTFLAGS</code>, not <code>cargo rustc</code>.   The flags passed to <code>cargo rustc</code> are only passed to the final compiler invocation, nothing else.</p>",
        "id": 205697940,
        "sender_full_name": "Eric Huss",
        "timestamp": 1596315418
    },
    {
        "content": "<p>When using <code>--target</code>, <code>RUSTFLAGS</code> is not used when compiling build scripts or other crates for the host.</p>",
        "id": 205698011,
        "sender_full_name": "bjorn3",
        "timestamp": 1596315556
    },
    {
        "content": "<p>Passing -C target-cpu with RUSTFLAGS does not work either, due to the reasons bjorn3 has explained. Doesn't this seem like a cargo bug? It is very weird I can't get this to work.</p>",
        "id": 205699421,
        "sender_full_name": "Fabian von der Warth",
        "timestamp": 1596318163
    },
    {
        "content": "<p>Actually, nevermind! After a cargo clean it seems to have bmi2 set in <code>CARGO_CFG_TARGET_FEATURE</code>.  Let me just confirm this on my real project instead of the minimal one.</p>",
        "id": 205699591,
        "sender_full_name": "Fabian von der Warth",
        "timestamp": 1596318480
    },
    {
        "content": "<p>Okay, it works now after all with a cargo clean and reading the env variable. Thanks for resolving this!</p>",
        "id": 205699985,
        "sender_full_name": "Fabian von der Warth",
        "timestamp": 1596319299
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"133247\">@bjorn3</span> even though RUSTFLAGS isn't used for building the build script itself, the <code>CARGO_CFG</code> environment variables use the flags from RUSTFLAGS.</p>",
        "id": 205701967,
        "sender_full_name": "Eric Huss",
        "timestamp": 1596323238
    }
]