[
    {
        "content": "<p>Suppose we have:</p>\n<div class=\"codehilite\"><pre><span></span><code>trait BarT {\n  fn bar(&amp;self) ;\n}\n\nimpl BarT for Dog { ... };\n\nfn main() {\n  let dog: Dog;\n  dog.bar();\n}\n</code></pre></div>\n\n\n<p>now, suppose the cursor is over the bar of <code>dog.bar</code>. At this point, when I try to go to reference, I get thrown to the 'BarT::bar'. However, since the compiler knows that <code>dog: Dog</code>, is there a way to have it jump to <code>impl BarT for Dog::bar</code> ?</p>\n<p>I.e. in situations where the compiler knows the type of the lhs of the <code>.bar</code>, I want it to jump me to the right <code>impl</code>, rather than the generic <code>trait BarT</code></p>\n<p>This works for me in IntelliJ/Rust most of the time, but I can't figure out how to do this in vs code.</p>",
        "id": 197078963,
        "sender_full_name": "zeroexcuses",
        "timestamp": 1589145257
    },
    {
        "content": "<p>(I'm using latest vs code, latest rust analyzer, and rustc nightly)</p>",
        "id": 197079045,
        "sender_full_name": "zeroexcuses",
        "timestamp": 1589145311
    },
    {
        "content": "<p>Not right now, but it might be possible to offer it because once you're on the trait method, you can choose \"Go to Implementations\" and it will highlight the <code>Dog</code> one. Maybe \"Go to Definition\" should take you to the implementation, though I'm not sure it makes sense.</p>",
        "id": 197104967,
        "sender_full_name": "Laurențiu",
        "timestamp": 1589178932
    },
    {
        "content": "<p>I don't know if we are talking the same thing. If I put the cursor over <code>BarT::bar</code>, and hit ctrl-t, it will show me ALL implementations and I can choose. The downside is  that if Dog, Cat, Rat, Donkey, Eagle, ... all implement the trait, then I have to manually pick the one.</p>",
        "id": 197144319,
        "sender_full_name": "zeroexcuses",
        "timestamp": 1589203402
    },
    {
        "content": "<p>It's not the same thing, but since it finds the <code>Dog</code> implementation, it could presumably navigate there</p>",
        "id": 197144779,
        "sender_full_name": "Laurențiu",
        "timestamp": 1589203625
    },
    {
        "content": "<p>Sure, but the problem is the mental cost of doing \"what is the type of this var\" so I can select the right one, whereas I'd really prefer the compiler/IDE just did this for me.</p>",
        "id": 197146760,
        "sender_full_name": "zeroexcuses",
        "timestamp": 1589204591
    }
]