[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"143274\">@Amanieu</span> IIUC parking_lot is implemented internally in terms of deadlines, not timeouts. Is there any rationale for choosing one over the other? Could you point to any references?</p>",
        "id": 200509824,
        "sender_full_name": "Jethro",
        "timestamp": 1591857487
    },
    {
        "content": "<p>Timeout don't deal with interruptions well. For example if a signal handler executes while you were blocked waiting for a mutex.</p>",
        "id": 200512076,
        "sender_full_name": "Amanieu",
        "timestamp": 1591859857
    },
    {
        "content": "<p>Here's a general discussion of intervals vs. deadlines, it might help: <a href=\"https://davmac.wordpress.com/2016/08/12/posix-timer-apis-are-borked/\">https://davmac.wordpress.com/2016/08/12/posix-timer-apis-are-borked/</a>. I think one of the concerns POSIX has against interval timers is that appears to be no non-racy way to make a deadline timer using an interval one. You can look at the current time and compute the difference, but the clock might change in the meanwhile.</p>",
        "id": 200512147,
        "sender_full_name": "Laurențiu",
        "timestamp": 1591859894
    },
    {
        "content": "<p>That's a separate issue of CLOCK_MONOTONIC vs CLOCK_REALTIME. parking_lot uses CLOCK_MONOTONIC everywhere (unless not supported by a particular platform).</p>",
        "id": 200512280,
        "sender_full_name": "Amanieu",
        "timestamp": 1591860030
    },
    {
        "content": "<p>Just to be clear, the problem with interruptions is something like this: you issue a syscall with a specific timeout, it's interrupted and therefore returns early. now you don't know how long to set the timeout when reissuing the syscall?</p>",
        "id": 200514825,
        "sender_full_name": "Jethro",
        "timestamp": 1591862406
    },
    {
        "content": "<p>Yes, essentially.</p>",
        "id": 200519045,
        "sender_full_name": "Amanieu",
        "timestamp": 1591865420
    },
    {
        "content": "<p>The only way to handle that reliably is to convert the timeout to a deadline and then use that.</p>",
        "id": 200519077,
        "sender_full_name": "Amanieu",
        "timestamp": 1591865447
    },
    {
        "content": "<p>Windows meanwhile won't cut your sleep short due to interruptions, but it will round your duration to the nearest scheduler tick in either direction, meaning your sleep can still end early by several milliseconds!</p>",
        "id": 200523086,
        "sender_full_name": "Peter Rabbit",
        "timestamp": 1591868326
    }
]