[
    {
        "content": "<p>Hey, not sure if general is the best channel for this or not. I was curious about the design of Duration. Full disclosure, I'm a C++ dev that follows Rust here and there. Some conversation led me to look at the Duration struct. It seems concerning to me because by its design, it's not going to usable in very high performance applications. In C++ on the other hand, if you look at chrono's approach, you end up with a Duration type that can be a zero cost abstraction. I'm curious what the reasoning was for such a design?</p>",
        "id": 186400243,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579793732
    },
    {
        "content": "<p>what does chrono do differently?</p>",
        "id": 186400361,
        "sender_full_name": "oli",
        "timestamp": 1579793786
    },
    {
        "content": "<p>Sure, so I guess I'll give the background on both. C++ Duration is templated on basically a numeric type, which is stored, and a Ratio type. The ratio type isn't stored, but simply provides, statically, constants that tell you in what units the type is \"counting\" duration. It does this by providing a ratio to seconds.</p>",
        "id": 186400440,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579793853
    },
    {
        "content": "<p>In many high performance applications, what you typically do is simply use 64 bit integers as nanoseconds since epoch. The C++ duration type is fully compatible with this approach, and when compiled with optimizations, operations on durations will have the same codegen as if you did it using simple integers, i.e. it's a zero cost abstraction.</p>",
        "id": 186400608,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579793933
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"260061\">@Nir Friedman</span> I believe <code>Duration</code>'s design was made long before <code>chrono</code> was released.</p>",
        "id": 186400655,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1579793962
    },
    {
        "content": "<p>The rust approach is to store seconds in a 64 bit integer, and nanos in a 32 bit integer. This is simply hardcoded, which already has some disadvantages. However, in addition, it's hardcoded to something which is big (96 bytes), and also because the nanos portion needs to be kept under 1 billion, adding two durations becomes a surprisingly expensive operation. You have to add the nanos, check if the value is over a billion, if yes, then subtract a billion and add one to the seconds... etc</p>",
        "id": 186400897,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579794109
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"219696\">@XAMPPRocky</span> chrono was released in 2011. Is there an easy way to see when std:<span aria-label=\"time\" class=\"emoji emoji-1f557\" role=\"img\" title=\"time\">:time:</span>:Duration was added?</p>",
        "id": 186401052,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579794195
    },
    {
        "content": "<p>Well... it would seem to me like there could be a generic version that <code>Duration</code> is just one concrete impl of</p>",
        "id": 186401062,
        "sender_full_name": "oli",
        "timestamp": 1579794206
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"124288\">@oli</span> yeah, the other thing I was going to point out is if you really badly want both massive precision and massive range, then nothing is stopping you from templating the C++ chrono on a 96 bit integer type. I'm kind of surprised that Rust avoided generics in this situation.</p>\n<p>One thing I don't know for sure is whether Rust's type system can do what C++ does with ratio, i.e. you can have constants associated with a type? I <em>think</em> Rust can but I'm not certain.</p>",
        "id": 186401249,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579794304
    },
    {
        "content": "<p>You can indeed have constants associated with a type. I think prototyping a Duration that does so outside of core/std makes sense; indeed, we may want to merge it in if it works well.</p>",
        "id": 186401334,
        "sender_full_name": "simulacrum",
        "timestamp": 1579794358
    },
    {
        "content": "<p>(potentially, we could do so backwards compatibly, as <span class=\"user-mention\" data-user-id=\"124288\">@oli</span> suggests)</p>",
        "id": 186401489,
        "sender_full_name": "simulacrum",
        "timestamp": 1579794407
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> interesting. Well, I'm not that familiar with Rust (nor honestly have the time), but if someone is interested in prototyping something like that, would be happy to talk to them, explain a  bit about chrono. I think it does serve an important use case, because people in e.g. HFT simply wouldn't be able to use a Duration type like in Rust</p>",
        "id": 186401716,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579794541
    },
    {
        "content": "<p>Boost had a similar type (96 bit) back in the day and it was heavily avoided in HFT (high frequency trading) communities</p>",
        "id": 186401757,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579794573
    },
    {
        "content": "<p>I'd assume it would be similar in other fields where very low latency/high performance is necessary</p>",
        "id": 186401835,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579794604
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"260061\">@Nir Friedman</span> From researching std's duration was chrono's original duration design. Here's a link to the initial commit and the design reform.</p>\n<p><a href=\"https://github.com/rust-lang/rust/commit/5778ed4c926da6069ab899c8d4694527ed89190c\" target=\"_blank\" title=\"https://github.com/rust-lang/rust/commit/5778ed4c926da6069ab899c8d4694527ed89190c\">https://github.com/rust-lang/rust/commit/5778ed4c926da6069ab899c8d4694527ed89190c</a><br>\n<a href=\"https://github.com/rust-lang/rfcs/blob/master/text/1040-duration-reform.md\" target=\"_blank\" title=\"https://github.com/rust-lang/rfcs/blob/master/text/1040-duration-reform.md\">https://github.com/rust-lang/rfcs/blob/master/text/1040-duration-reform.md</a></p>",
        "id": 186401841,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1579794610
    },
    {
        "content": "<blockquote>\n<p>Boost had a similar type (96 bit) back in the day and it was heavily avoided in HFT (high frequency trading) communities</p>\n</blockquote>\n<p><span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span> That sounds like a feature, not a bug</p>",
        "id": 186401919,
        "sender_full_name": "oli",
        "timestamp": 1579794652
    },
    {
        "content": "<p>What was the feature? Sorry don't follow the joke</p>",
        "id": 186401955,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579794675
    },
    {
        "content": "<p>Making life hard for HFT ppl</p>",
        "id": 186401969,
        "sender_full_name": "oli",
        "timestamp": 1579794685
    },
    {
        "content": "<p>That's kinda mean, unfunny, and off topic, all at once</p>",
        "id": 186402161,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579794785
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"219696\">@XAMPPRocky</span> Looking at this RFC, there's an additional pretty major limitation here, which I didn't realize, which is that Duration has to always be positive?</p>",
        "id": 186402302,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579794858
    },
    {
        "content": "<p>I haven't read either two, I just found them.</p>",
        "id": 186402404,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1579794921
    },
    {
        "content": "<p>That doesn't really make much sense, especially once you start thinking about e.g. subtracting time_point's; subtracting two points in time can easily give you a negative duration.</p>",
        "id": 186402545,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579794984
    },
    {
        "content": "<p>As I understand, Duration is only for comparison between <code>SystemTime</code>s, it's not for general date duration.</p>",
        "id": 186402620,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1579795041
    },
    {
        "content": "<p>I think the argument is that distance can't be negative either</p>",
        "id": 186402623,
        "sender_full_name": "oli",
        "timestamp": 1579795043
    },
    {
        "content": "<p>I don't really think that's much of an argument; distance is non-negative by definition because it's a magnitude. Displacement has direction, which in one dimension means signedness. You can always recover distance from displacement, but not vice versa. So you need to have a concept of the more general thing.</p>\n<p>At any rate I don't think that such analogies add much to technical analysis, generally. But <span class=\"user-mention\" data-user-id=\"219696\">@XAMPPRocky</span> , I see what you are saying, to me it seems odd that a second duration type would be needed.</p>",
        "id": 186403209,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579795341
    },
    {
        "content": "<p>I'm not going to argue about it. It's not my design, and I don't particularly care. I'm just providing context.</p>",
        "id": 186403288,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1579795387
    },
    {
        "content": "<p>Do you know if there's more review or discussion of that RFC? I thought such discussions happened on github issues, I did a search there and couldn't find anything</p>",
        "id": 186403504,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579795493
    },
    {
        "content": "<p><a href=\"https://github.com/rust-lang/rfcs/pull/1040\" target=\"_blank\" title=\"https://github.com/rust-lang/rfcs/pull/1040\">https://github.com/rust-lang/rfcs/pull/1040</a></p>",
        "id": 186403640,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1579795565
    },
    {
        "content": "<p>interesting, thanks. Seems like people are divided over whether it's intended to be used as part of a datetime API or not (or at least, there's 2 people arguing over it).</p>",
        "id": 186403923,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579795752
    },
    {
        "content": "<p>I think duration is also non-negative by definition. At least in natural languages you can't say this took \"-5 minutes\"</p>",
        "id": 186403976,
        "sender_full_name": "oli",
        "timestamp": 1579795781
    },
    {
        "content": "<p>Note that there's also the <code>chrono</code> crate, and there may be others that fit the design you envision better</p>",
        "id": 186404170,
        "sender_full_name": "oli",
        "timestamp": 1579795885
    },
    {
        "content": "<p>Again, I don't think analogies (to natural language) are buying you much. If you want to have a duration type that's part of a datetime library, you need to be able to subtract two time_points and have a sensible result, regardless of the order of that subtraction.</p>",
        "id": 186404282,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579795940
    },
    {
        "content": "<p>If you look at prior art (including Joda), 100% of Duration-like types I've seen in various languages support being negative</p>",
        "id": 186404318,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579795968
    },
    {
        "content": "<p>I've looked at chrono, IIRC the standard Duration is based on it, but I could be mixed up</p>",
        "id": 186404345,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579795989
    },
    {
        "content": "<p>I think it's the other way around</p>",
        "id": 186404364,
        "sender_full_name": "oli",
        "timestamp": 1579796008
    },
    {
        "content": "<p><code>chrono::Duration</code> may be a reexport of <code>std::time::Duration</code></p>",
        "id": 186404386,
        "sender_full_name": "oli",
        "timestamp": 1579796023
    },
    {
        "content": "<p>Ah maybe you are right. chrono::Duration allows negatives, so that's a start for sure.</p>",
        "id": 186404393,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579796031
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"260061\">@Nir Friedman</span> <code>Duration</code> is not part of a datetime library. It's only use in std is with <code>SystemTime::duration_since</code>, where it panics if you have a negative duration.</p>",
        "id": 186404397,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1579796034
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"219696\">@XAMPPRocky</span> Sure, I agree, Rust's Duration is not currently, it's just not clear from that thread whether that's the intention moving forward or not.</p>",
        "id": 186404477,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579796071
    },
    {
        "content": "<p>That said, even in that example, I don't think duration_since's behavior is very reasonable (and again, certainly inconsistent with prior art)</p>",
        "id": 186404562,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579796134
    },
    {
        "content": "<p>It's a result, not a panic, and the error has a duration value but it's just a \"kinda negative\" duration.</p>\n<p>So really, \"duration is always positive\" is just weird design all the way through</p>",
        "id": 186406501,
        "sender_full_name": "Lokathor",
        "timestamp": 1579797043
    },
    {
        "content": "<p>Yeah. I don't think that \"it's reasonably common to only want positive Durations\", is reason to limit your main Duration type to just positive. What rust calls <code>SystemTime::now().duration_since(some_other_time)</code> is basically just subtraction of two time points, no matter how you spin it. And you need negative durations for subtraction of time_points to make any sense, and for obvious and desirable identities to hold.</p>",
        "id": 186407410,
        "sender_full_name": "Nir Friedman",
        "timestamp": 1579797519
    },
    {
        "content": "<p>FWIW when I just wanted to do some simple time stuff, I found C++'s maze of templates incredibly hard to navigate, and was pretty happy that Rust's libstd didn't follow that design.^^ I am sure there is a place for a high-performance lib with a complex API, but I am not sure if libstd is that place.</p>",
        "id": 187163198,
        "sender_full_name": "RalfJ",
        "timestamp": 1580565602
    },
    {
        "content": "<p>FWIW Duration <em>is</em> zero cost in a sense that it’s effectively the same thing as the system API (timespec)</p>",
        "id": 187166183,
        "sender_full_name": "nagisa",
        "timestamp": 1580571633
    }
]