[
    {
        "content": "<p>If I'm working in a <code>![no_std]</code> crate, is it somehow possible to detect at compile time whether one of the dependencies in <code>Cargo.toml</code> depends on the standard library? I found that slapping the <code>#![no_std]</code> attribute on my crate does does not prevent other dependencies from pulling in the Rust standard library. I did some research and found that <a href=\"https://github.com/rust-lang/rust/issues/38509\">a lint was once suggested for this</a>, but it was never put into practice. Running <code>cargo tree</code> also doesn't help in my case, because the standard library is not listed between the dependencies. Any solution that detects the presence of the standard library is okay, including using nightly features and crashing the compiler <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 261980183,
        "sender_full_name": "Pointerbender",
        "timestamp": 1637264689
    },
    {
        "content": "<p>I believe the common approach here is to cross compile to a target that does not have STD.</p>",
        "id": 261981900,
        "sender_full_name": "Eh2406",
        "timestamp": 1637265476
    },
    {
        "content": "<p>Have you tried <code>cargo -Z build-std=core,alloc</code>? I think you should then end up without std and thus the build would fail. Haven't tried it though, maybe it would just build a frankenstd.</p>",
        "id": 261981984,
        "sender_full_name": "The 8472",
        "timestamp": 1637265500
    },
    {
        "content": "<p>Thank you for the suggestions, I'll give those a try! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 261982862,
        "sender_full_name": "Pointerbender",
        "timestamp": 1637265870
    },
    {
        "content": "<p>build-std will do it. you'll get a message about std being a missing crate if you try to use it when it's not being built.</p>",
        "id": 262138158,
        "sender_full_name": "Lokathor",
        "timestamp": 1637360230
    }
]