[
    {
        "content": "<p>I know I'm asking a terribly basic question, and I'm not looking for a <em>developer</em> technical answer, but more of a general question regarding the finished product. </p>\n<p>Does incorporating rust into a program cause its binary to increase/decrease/the question doesn't apply the overall size of a finished binary vs a standard stock toolchain?</p>",
        "id": 211726054,
        "sender_full_name": "Grommish",
        "timestamp": 1601452344
    },
    {
        "content": "<p>AFAIK, there are two things going on, in that regard:</p>\n<ul>\n<li>Rust programs very often rely on the standard library, and although the linker can optimize away the unused parts, there are very often two things that still remain there: string formatting and the unwinding \"runtime\". This is what causes a simple <code>println!(\"Hello, World!\");</code> program to already be, by default considerably bigger than its very tiny C counterpart. That being said, such addition is <em>fixed</em>, or at least upper-bounded by the size of the standard library itself, so for big projects that shouldn't matter (Also, see the <a href=\"https://github.com/johnthagen/min-sized-rust\">https://github.com/johnthagen/min-sized-rust</a> repo for some examples as to how to minimize the binary size for the case of \"small programs\").</li>\n<li>The second thing, and, imho, the one that has most impact on binary size, is how easy it is to bundle dependencies within Rust projects. A simple line added to a file, or a simple <code>cargo add dependency_name</code> command, and <em>voilà</em> ! This is one of the greatest things about using Rust, nowadays, that is not directly tied to the language but to the modern tooling around that ecosystem. And I do think that having this power is great, leading to higher quality software (compare that to the C / C++ world where people would often re-roll their own implementation if it avoided the hassle of pulling in another dependency). But it also comes with a drawback: Rust projects thus have a tendency to have an increased number of direct dependencies compared to C / C++ counter-parts, which, recursively / transitively, does lead to a dependency tree which is quite big. So <strong>if left untamed</strong>, it can definitely lead to bigger binaries. That being said, it can be kept in check, by being more selective about the dependencies that get pulled. See this other blog post about it: <a href=\"https://blog.kodewerx.org/2020/06/the-rust-compiler-isnt-slow-we-are.html\">https://blog.kodewerx.org/2020/06/the-rust-compiler-isnt-slow-we-are.html</a> (they mention compilation <em>time</em> rather than <em>size</em>, but obviously they are kind of related, especially when talking about the number and size of the dependencies)</li>\n</ul>",
        "id": 211737469,
        "sender_full_name": "Daniel Henry-Mantilla",
        "timestamp": 1601459662
    },
    {
        "content": "<p>As usual for binary output questions, the answer is that it doesn't have all the much to do with _rust_ itself and much more to do with LLVM and what code you write, <span class=\"user-mention\" data-user-id=\"332271\">@Grommish</span>.  The binary size you get from rustc is about the same as you'd get from a C++ one with clang that was using similar levels of checking (like <code>std::vector::at</code> and not unsafe indexing) and similar sizes of libraries.</p>",
        "id": 211780635,
        "sender_full_name": "scottmcm",
        "timestamp": 1601480950
    },
    {
        "content": "<p>I appreciate the responses!  I'm currently incorporating rust into the OpenWrt build environment, and the concern is always size when dealing with some of thier devices. </p>\n<p>Again, then you for the info!</p>",
        "id": 211807644,
        "sender_full_name": "Grommish",
        "timestamp": 1601493694
    },
    {
        "content": "<p>Make sure you check out the general Rust embedded world as well. I've an Arduino Uno sitting on my desk with Rust code on it. Rust can be small.</p>",
        "id": 211807766,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1601493752
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116155\">Jake Goulding</span> <a href=\"#narrow/stream/122651-general/topic/Does.20compiling.20with.20rustc.20increase.20bin.20size.20vs.20not.20using.20it.3F/near/211807766\">said</a>:</p>\n<blockquote>\n<p>Make sure you check out the general Rust embedded world as well. I've an Arduino Uno sitting on my desk with Rust code on it. Rust can be small.</p>\n</blockquote>\n<p>Oh, interesting.  In my case, I was concerned about the overall size since almost everyone would be cross compiling to another arch, but that title makes it sound like rust compiler itself can be pushed. I will certainly look into it.  Thanks!</p>",
        "id": 211864726,
        "sender_full_name": "Grommish",
        "timestamp": 1601521590
    },
    {
        "content": "<p>worth checking out <a href=\"https://github.com/johnthagen/min-sized-rust\">https://github.com/johnthagen/min-sized-rust</a></p>",
        "id": 211869267,
        "sender_full_name": "lzutao",
        "timestamp": 1601527882
    }
]