[
    {
        "content": "<p>There are a lot of issues with the <code>E-needs-mcve</code> label that are unactionable because the author provided no reproducible info (no repository/gist/snippet).<br>\nThe label description says \"Call for participation: This issue needs a Minimal Complete and Verifiable Example\". Which to my understanding is a label someone can search for and help with.</p>\n<p>Could we add a new label that separates <em>no info provided</em> issues from issues that <em>actually need reduction for example</em>?</p>",
        "id": 267585797,
        "sender_full_name": "fee1-dead",
        "timestamp": 1641910171
    },
    {
        "content": "<p>It's a good idea, I think other open source projects have labels like <code>more info needed</code>. We somewhat use <code>S-waiting-on-author</code> for that purpose, but it might be better to have an explicit label for it.</p>",
        "id": 267634998,
        "sender_full_name": "Noah Lev",
        "timestamp": 1641930434
    },
    {
        "content": "<p>I have also always interpreted <code>S-waiting-on-author</code>twofold as per its description (\"This is awaiting some action (such as code changes or more information) from the author\").</p>\n<p>Currently I see 4 open issues labeled with <code>s-waiting-on-author</code>:<br>\n<a href=\"https://github.com/rust-lang/rust/issues?q=is%3Aopen+label%3AS-waiting-on-author+is%3Aissue\">https://github.com/rust-lang/rust/issues?q=is%3Aopen+label%3AS-waiting-on-author+is%3Aissue</a></p>\n<p>The rest of the <code>s-waiting-for-author</code> are PRs which I assume have the other meaning :)</p>",
        "id": 267641408,
        "sender_full_name": "apiraino",
        "timestamp": 1641933405
    },
    {
        "content": "<p>Yeah, <code>S-waiting-on-author</code> is not used much for issues, I think because people (including me) often forget that it could be used for the \"needs more info\" meaning too.</p>",
        "id": 267661664,
        "sender_full_name": "Noah Lev",
        "timestamp": 1641943494
    },
    {
        "content": "<p>Maybe we should add <code>S-additional-info-needed</code> as a label?</p>",
        "id": 267691283,
        "sender_full_name": "fee1-dead",
        "timestamp": 1641974080
    },
    {
        "content": "<p>I also feel like we need to close this sort of issue at some point, because otherwise they sit around forever without any way of knowing whether they've been fixed.</p>",
        "id": 267707040,
        "sender_full_name": "inquisitivecrystal",
        "timestamp": 1641983998
    },
    {
        "content": "<p>S-needs-info-2022 and close them after a year if theres no followup?</p>",
        "id": 267733897,
        "sender_full_name": "matthiaskrgr",
        "timestamp": 1641998761
    },
    {
        "content": "<p>Rough for those people filing issues on 2022-12-25 :-)</p>",
        "id": 267752637,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1642006534
    },
    {
        "content": "<p>We could always just filter by one year ago in the GitHub search (<code>created:&lt;2021-01-01</code>). That would avoid the end-of-year problem.</p>",
        "id": 267765133,
        "sender_full_name": "Noah Lev",
        "timestamp": 1642011645
    }
]