[
    {
        "content": "<p>Hi, I'm trying to figure out what is causing reduced performance in my framework in emscripten - rendering seems to be 5x slower in the browser versus desktop. In the Chrome profiler I'm noticing heavy Self Time in wasm-to-js invoking invoke_vii invoking js-to-wasm, seemingly for no reason, in code that does not actually perform any external calls to JS as far as I can tell.</p>\n<p><a href=\"/user_uploads/4715/oyR34OExD3c3yEaia4RZhjB3/2021-10-18-15_47_49-Keeshond-Doggymark-_-Space-to-spawn-doggos-_-S-Spawn-slowly-_-Delete-Despaw.png\">2021-10-18-15_47_49-Keeshond-Doggymark-_-Space-to-spawn-doggos-_-S-Spawn-slowly-_-Delete-Despaw.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/4715/oyR34OExD3c3yEaia4RZhjB3/2021-10-18-15_47_49-Keeshond-Doggymark-_-Space-to-spawn-doggos-_-S-Spawn-slowly-_-Delete-Despaw.png\" title=\"2021-10-18-15_47_49-Keeshond-Doggymark-_-Space-to-spawn-doggos-_-S-Spawn-slowly-_-Delete-Despaw.png\"><img src=\"/user_uploads/4715/oyR34OExD3c3yEaia4RZhjB3/2021-10-18-15_47_49-Keeshond-Doggymark-_-Space-to-spawn-doggos-_-S-Spawn-slowly-_-Delete-Despaw.png\"></a></div><p>In my source code, <code>DoggyDrawer::draw()</code> calls directly into <code>draw_sprite()</code> so there should be no reason for the wasm-to-js and js-to-wasm roundabout calls. What would cause this?</p>\n<p>I can provide generated wasm, source code, profiler data, etc. on request.</p>",
        "id": 258088737,
        "sender_full_name": "Cosmic Chip Socket",
        "timestamp": 1634586630
    },
    {
        "content": "<p>Just tried this in Firefox too. The performance is even worse there. If anyone could point me in the direction of a developer or maintainer working on Rust wasm/emscripten I would very much appreciate it.</p>",
        "id": 258123877,
        "sender_full_name": "Cosmic Chip Socket",
        "timestamp": 1634603840
    },
    {
        "content": "<p>That could be for handling unwinding. Try adding <code>panic = \"abort\"</code> under the <code>[profile.dev]</code> and <code>[profile.release]</code> sections in <code>Cargo.toml</code>.</p>",
        "id": 258152198,
        "sender_full_name": "bjorn3",
        "timestamp": 1634627989
    },
    {
        "content": "<p>What do you know, it's over twice as fast now with <code>panic = \"abort\"</code>. I'm assuming that this is a current limitation of the stack unwinding? Any plans to improve this or is it a limitation of wasm?</p>",
        "id": 258242993,
        "sender_full_name": "Cosmic Chip Socket",
        "timestamp": 1634666203
    },
    {
        "content": "<p>There is a proposal for native stack unwinding in wasm, but no implementations yet I think.</p>",
        "id": 258244401,
        "sender_full_name": "bjorn3",
        "timestamp": 1634666631
    },
    {
        "content": "<p>Thank you for pointing out this workaround, it's saved me the embarrassment of making a new issue that would immediately get closed :)</p>",
        "id": 258244585,
        "sender_full_name": "Cosmic Chip Socket",
        "timestamp": 1634666693
    },
    {
        "content": "<p>At this point it seems like the one big remaining bottleneck is doing the matrix multiplication for the drawing transforms. I take it wasm doesn't have a good way to accelerate this yet? Still, I'm up to 150k sprites now. While it's not the 390k I can get on desktop, and a bit shy of the ~200k that pixi.js achieves, it's still pretty good</p>",
        "id": 258245049,
        "sender_full_name": "Cosmic Chip Socket",
        "timestamp": 1634666877
    },
    {
        "content": "<p>I think matrix multiplications benefit a lot from SIMD. For x86_64 SSE2 is enabled by default for 128bit vectors. For wasm the simd feature isn't enabled at all. To enable it you will need to use <code>RUSTFLAGS=\"-Ctarget-features=+simd\"</code> I believe. As far as I know enabling it requires enabling it for all crates though, including the standard library. Rebuilding the standard library to enable simd for it requires nightly currently. On nightly you can pass <code>-Zbuild-std</code> to cargo.</p>",
        "id": 258276162,
        "sender_full_name": "bjorn3",
        "timestamp": 1634679303
    },
    {
        "content": "<p>I ended up stumbling on the SIMD flag myself. Tried to enable it but I'm getting emscripten compiler errors related to unrecognized wasm SIMD instructions in emscripten 2.0.13... and later versions of emscripten don't seem to want to compile because of a missing symbol for <code>__cxa_is_pointer_type</code></p>",
        "id": 258286053,
        "sender_full_name": "Cosmic Chip Socket",
        "timestamp": 1634684393
    },
    {
        "content": "<p>I was able to get it to compile with latest emscripten by issuing <code>-sDISABLE_EXCEPTION_CATCHING=0</code> in the linker flags</p>",
        "id": 258289243,
        "sender_full_name": "Cosmic Chip Socket",
        "timestamp": 1634686134
    },
    {
        "content": "<p>Also according to this page <a href=\"https://v8.dev/features/simd\">https://v8.dev/features/simd</a> the flags to send to rustc are actually <code>RUSTFLAGS=\"-C target-feature=+simd128\"</code>. This doesn't seem to make a big difference in terms of performance though. I'm wondering if there's something else I need to enable as well... but I'm up to 170k sprites, so it's progress. Some of that I think might just be from upgrading to newer emscripten. Or maybe it's just placebo haha</p>",
        "id": 258289475,
        "sender_full_name": "Cosmic Chip Socket",
        "timestamp": 1634686311
    }
]