[
    {
        "content": "<p>hey all, I feel like I've been more grumpy / less open to ideas / less patient lately, but no one's been willing to tell me to my face because I have a lot of \"soft power\" in the rust org. I'd appreciate if you left me anonymous feedback here on whether that's accurate (and anything else you'd like to talk about): <a href=\"https://www.admonymous.co/jyn514\">https://www.admonymous.co/jyn514</a></p>\n<p>FYI I've already shared this in a couple other groups with the goal of making it harder for me to identify any one person, including some that aren't online; so telling me you're from rust / zulip will make it easier for me to tell who you are and I'd suggest not doing that unless it's important to the message.</p>",
        "id": 266173284,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1640612436
    },
    {
        "content": "<p>I know some of you learned english as a second language so maybe run it through google translate and back idk; this seems like a hard problem to avoid in general without showing it to a native english speaker.</p>\n<p>also fun anecdote: google translate turns \"discord chat\" into \"chats of disagreement\" <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span> <br>\n<a href=\"/user_uploads/4715/cjKmYLJoM_hIiHgNidjLL0SL/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/4715/cjKmYLJoM_hIiHgNidjLL0SL/image.png\" title=\"image.png\"><img src=\"/user_uploads/4715/cjKmYLJoM_hIiHgNidjLL0SL/image.png\"></a></div>",
        "id": 266173528,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1640612733
    },
    {
        "content": "<p>I'm new here so I don't have any feedback to contribute directly, but Google translate is extremely good in some languages. I know some native French speakers that would write reports in English and translate to French, because that was better than what they could write.</p>",
        "id": 266173773,
        "sender_full_name": "Patrick Poitras",
        "timestamp": 1640613001
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"232545\">@Joshua Nelson</span> it's great to improve oneself and being aware of it, but, please, be gentle to yourself. I have seen you help lots and lots of people and devoting a lot of time to the project, so maybe you just need some time for yourself and relax.<br>\n Anyhow, thankyou for what you have been doing for the Rust project!</p>",
        "id": 266177854,
        "sender_full_name": "pachi",
        "timestamp": 1640616453
    },
    {
        "content": "<p>small update on this: I've been getting respectful, and for the most part very constructive, feedback throughout the week - thank you all! <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span> the common thread is \"you said you're on vacation but you're still reviewing PRs\" so I'm going to try and stop doing that <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 266432438,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1640874532
    }
]