[
    {
        "content": "<p>I'm having trouble navigating the history of some code that's been moved. I reach a dead end when I get to \"File renamed without changes\". There doesn't seem to be a way to jump to the file before it was renamed?</p>",
        "id": 247705944,
        "sender_full_name": "Chris Denton",
        "timestamp": 1627650904
    },
    {
        "content": "<p>Unfortunately GitHub's history view does not follow renames.  There are a few options:</p>\n<ul>\n<li>Use the <code>Blame</code> view which follows renames. This is what I usually use, though of course it doesn't show a linear history.  I'm normally interested in a specific segment of code.</li>\n<li>Click the rename commit, then click \"parent\", then browse to the old file location, then resume looking at its history.</li>\n<li>Look at the history locally with <code>git</code> (or your IDE if it has fancy git capabilities), which can follow renames.</li>\n</ul>",
        "id": 247708524,
        "sender_full_name": "Eric Huss",
        "timestamp": 1627652164
    },
    {
        "content": "<p>Also, this won't help you with renames, but I just wanted to share <a href=\"https://github.githistory.xyz/\">https://github.githistory.xyz/</a> which I find as a nice way to browse through history.  Unfortunately due to all the renames in the rust-lang/rust repo, it quickly hits a dead end. <span aria-label=\"frown\" class=\"emoji emoji-1f641\" role=\"img\" title=\"frown\">:frown:</span></p>",
        "id": 247708809,
        "sender_full_name": "Eric Huss",
        "timestamp": 1627652296
    },
    {
        "content": "<p>Thanks! It's a bit annoying that a workaround is needed but I'm glad they exist!</p>",
        "id": 247709663,
        "sender_full_name": "Chris Denton",
        "timestamp": 1627652684
    },
    {
        "content": "<p>Hi guys I'm having issues with some unresolved type inferences, can someone help me ?</p>",
        "id": 247724465,
        "sender_full_name": "SigMagiiK",
        "timestamp": 1627659568
    }
]