[
    {
        "content": "<p>Hi all,</p>\n<p>I've decided to stop being involved in the Rust project and other (volunteer) open source work. Between graduating and starting a full time job this fall, various other life stuff, and shifts in my personal priorities over the last year or two, I've decided I can't and don't want to spend my remaining free time on yet more tech work. I'm glad to have been involved in this project and worked alongside so many wonderful people. It's been a long time -- my first contributions date back to 2015 -- but now it's time for me to move on. Goodbye and thanks for all the <del>fish</del> crabs!</p>\n<p>I've been gradually removing myself / unsubscribing from everything Rust-related and will finish this in the next few days. If necessary, you'll still be able to reach me by email or by GH mentions, and I'll try to finish or hand off all reviews currently assigned to me.</p>\n<p>Cheers,<br>\nHanna</p>",
        "id": 206400316,
        "sender_full_name": "Hanna Kruppe",
        "timestamp": 1596988229
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"124289\">@Hanna Kruppe</span> for all your great contributions! Good luck with your new endeavors!</p>",
        "id": 206400554,
        "sender_full_name": "pachi",
        "timestamp": 1596988722
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"124289\">@Hanna Kruppe</span> Thank you for all your work in Rust. And if you ever want to attempt to align your day job and Rust, I'm sure there are many in the community who would be able to help you there.</p>",
        "id": 206409131,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1597002501
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"124289\">@Hanna Kruppe</span> thanks for all the work <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> Don't worry i'll take care of the re-assignments if any <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 206409837,
        "sender_full_name": "DPC",
        "timestamp": 1597003870
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"124289\">@Hanna Kruppe</span> it was a pleasure working with you, and your experience and patience will be thoroughly missed. I wish you all the best for your future endavors!</p>",
        "id": 206560380,
        "sender_full_name": "RalfJ",
        "timestamp": 1597142051
    },
    {
        "content": "<p>We never talked, but I learned so much just from reading your comments on github/internals.<br>\nI re-read the internals thread about Stable ABI every month or so because it's full of insights</p>\n<p>Thank you for contributing so much <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span><br>\nGood luck!</p>",
        "id": 208289319,
        "sender_full_name": "Elichai Turkel",
        "timestamp": 1598571547
    }
]