[
    {
        "content": "<p>Hello all, </p>\n<p>I don't know if this is the right place for this, so please remove if not. I've used a feature from nightly (std::iter::zip), and was wondering where it was at in the process. So I found the issue: (<a href=\"https://github.com/rust-lang/rust/issues/83574\">https://github.com/rust-lang/rust/issues/83574</a>) and it seems to have been merged in March.</p>\n<p>This sort of confuses me since the rust forge book gives a roughly 6 week progression from nightly to beta, and then from beta to stable, which I thought meant that post-merge, a feature takes roughly 12 weeks to get to stable. It seems like I was mistaken, so my question is two-fold:<br>\n1) What details am I missing from the process?<br>\n2) What stage is the above feature, and what steps need to be done for it to become stable?</p>\n<p>Thanks!</p>",
        "id": 262272225,
        "sender_full_name": "Patrick Poitras",
        "timestamp": 1637545220
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"451171\">@Patrick Poitras</span> unfortunately \"stable\" has two meanings - 1. is the stable release channel, like 1.56 or 1.57, and 2. is \"this feature can be used without a feature gate\". So <code>zip</code> is only available on the stable release channel if you use a feature gate (and feature gates are a hard error unless you use nightly).</p>",
        "id": 262272500,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1637545801
    },
    {
        "content": "<p>See also <a href=\"https://rustc-dev-guide.rust-lang.org/stability.html#stabilizing-a-library-feature\">https://rustc-dev-guide.rust-lang.org/stability.html#stabilizing-a-library-feature</a></p>",
        "id": 262272548,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1637545829
    },
    {
        "content": "<p>Ah I see! It's sort of already in the stable branch, but the feature gate requires the nightly release. That explains things.<br>\nThanks very much for the answer!</p>",
        "id": 262272683,
        "sender_full_name": "Patrick Poitras",
        "timestamp": 1637546094
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"451171\">@Patrick Poitras</span> Also, the progression for a feature typically involves some amount of gathering experience with it, which is separate from the timelines of releases; depending on the feature and its complexity, that can take a variable amount of time.</p>",
        "id": 262275807,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1637550736
    },
    {
        "content": "<p>But in this case, the feature seems simple enough, and I don't see any reported issues with it, so I've kicked off the FCP.</p>",
        "id": 262275813,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1637550748
    }
]