[
    {
        "content": "<p>(initially written as a reply to <span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span> on <a href=\"https://github.com/rust-lang/rust/pull/74419\">https://github.com/rust-lang/rust/pull/74419</a>, realized it'd probably fit better here)<br>\n3DS and Switch would likely share very little code. There are currently no non-newlib-based 3DS toolchains, however, there are multiple for the Switch. However, for the 3DS, a pure Rust target would be feasible to implement and probably make more sense than a newlib one, it'd just be much more difficult since it couldn't share code with Unix targets. For the Switch, these toolchains exist:</p>\n<ul>\n<li>DevkitA64: Made up of libnx, a heavily modified newlib fork, and a slightly modified gcc fork. I have a mostly functional Rust target for this, it'd just need some cleanup, testing, and a rebase to be upstreamed. Only supports statically linked binaries (no shared libraries or dynamically linked binaries).</li>\n<li>libtransistor: Mostly dead toolchain based on clang, some developers moved to MegatonHammer/DevkitA64.</li>\n<li>Skyline: Game modding toolkit containing a Rust toolchain dynamically linking against Nintendo's proprietary C library. Could likely be used with the official toolchain with only linking-related changes, though obviously I can't say for sure. Only supports linking shared libraries, which isn't a fundamental limitation but there isn't much interest in using Nintendo's SDK for homebrew outside game modding.</li>\n<li>MegatonHammer: Deprecated project providing a pure-Rust toolchain for the Switch. Replaced by SunriseOS's userspace toolchain.</li>\n<li>SunriseOS: WIP open source pure-Rust implementation of the Nintendo Switch kernel and toolchain, currently both targeting i386. It also includes a minimal userspace, but that exists for the primary purpose of testing the other two. While an aarch64 kernel port is a goal, it isn't an immediate one. An aarch64 port of its toolchain ABI-compatible with the official Switch kernel should hopefully happen in the relatively near future, however. </li>\n</ul>\n<p>I know that there is interest in upstreaming DevkitA64, Skyline, and (once complete) Sunrise targets. What are your thoughts on this?</p>",
        "id": 204270059,
        "sender_full_name": "leo60228",
        "timestamp": 1595027686
    },
    {
        "content": "<p>That sounds reasonable to me.</p>",
        "id": 204270985,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595028641
    },
    {
        "content": "<p>Generally speaking, I would be <em>hesitant</em> to accept a toolkit that would be primarily used for modding proprietary games, just because that could get into legally murky territory. (e.g. someone filing a bug report on rust-lang/rust referencing a mod to a game, which seems very likely to be ROM-adjacent.)</p>",
        "id": 204271099,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595028728
    },
    {
        "content": "<p>I'm not saying we wouldn't take it, I'm saying it would raise questions. :)</p>",
        "id": 204271107,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595028741
    },
    {
        "content": "<p>The other two wouldn't raise any eyebrows.</p>",
        "id": 204271122,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595028751
    },
    {
        "content": "<p>Roughly speaking, I think it would make sense to call those something like <code>aarch64-nintendo-switch-devkita64</code>, <code>aarch64-nintendo-switch-skyline</code>, and <code>aarch64-nintendo-switch-sunrise</code>.</p>",
        "id": 204271152,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595028786
    },
    {
        "content": "<p>Does those names sound reasonable to you?</p>",
        "id": 204271186,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595028821
    },
    {
        "content": "<p>It does.</p>",
        "id": 204271205,
        "sender_full_name": "leo60228",
        "timestamp": 1595028838
    },
    {
        "content": "<p>The main thing I'm unsure of is how related the DevkitA64 target is to newlib targets.</p>",
        "id": 204271268,
        "sender_full_name": "leo60228",
        "timestamp": 1595028869
    },
    {
        "content": "<p>(however, currently the newlib support in the libc crate is limited to old attempts at 3DS and Switch targets...)</p>",
        "id": 204271299,
        "sender_full_name": "leo60228",
        "timestamp": 1595028908
    },
    {
        "content": "<p>I think that because of the origins of the fourth component of target \"triples\", to distinguish \"linux-gnu\" meaning \"linux with glibc\" as compared to \"linux with some other C library\", targets are a little fixated on the fourth component being \"C library\".</p>",
        "id": 204271326,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595028940
    },
    {
        "content": "<p>I think it doesn't matter as much if it uses newlib or some other library, it matters what overall environment it's expected to fit into.</p>",
        "id": 204271338,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595028960
    },
    {
        "content": "<p>Two different targets using newlib might still have different target names, because code for those targets is expected to link to different libraries.</p>",
        "id": 204271385,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595028980
    },
    {
        "content": "<p>One other thing I'm unsure of is how to handle i386 Sunrise. While I'm not sure if there's any plans to upstream i386 Sunrise, <code>i386-nintendo-switch-sunrise</code> wouldn't make much sense because it's neither Nintendo nor the Switch, and it'd be nice if there was consistency between aarch64 and i386 Sunrise.</p>",
        "id": 204271419,
        "sender_full_name": "leo60228",
        "timestamp": 1595029024
    },
    {
        "content": "<p>Would Sunrise still implement the same syscalls and similar that the Switch OS does?</p>",
        "id": 204271513,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595029122
    },
    {
        "content": "<p>(Also, i386 or x86_64?)</p>",
        "id": 204271532,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595029149
    },
    {
        "content": "<p>i386, I don't believe there's any plans for x86_64 support.</p>",
        "id": 204271535,
        "sender_full_name": "leo60228",
        "timestamp": 1595029161
    },
    {
        "content": "<p>It would, yes.</p>",
        "id": 204271544,
        "sender_full_name": "leo60228",
        "timestamp": 1595029173
    },
    {
        "content": "<p>Huh. Even though the target for the Switch uses 64-bit ARM?</p>",
        "id": 204271546,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595029174
    },
    {
        "content": "<p>Yeah, Sunrise started as a school project to implement an i386 kernel.</p>",
        "id": 204271570,
        "sender_full_name": "leo60228",
        "timestamp": 1595029201
    },
    {
        "content": "<p>Go figure.</p>",
        "id": 204271612,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595029208
    },
    {
        "content": "<p>That's kinda awesome.</p>",
        "id": 204271616,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595029210
    },
    {
        "content": "<p>So, despite the precedent for things like <code>-sony-psp</code>, I'm wondering if maybe for legal reasons we <em>shouldn't</em> say <code>nintendo-switch</code>.</p>",
        "id": 204271635,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595029234
    },
    {
        "content": "<p>It'd be <em>accurate</em>, but I could also very easily imagine the C&amp;D-happy Nintendo complaining about the use of the name, and in particular that it implies some kind of endorsement.</p>",
        "id": 204271654,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595029268
    },
    {
        "content": "<p>I was wondering the same. What do other toolchains do here?</p>",
        "id": 204271670,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1595029290
    },
    {
        "content": "<p>For what it's worth, the Switch supports both aarch32 and aarch64 applications, but there's very little interest from homebrew developers in aarch32 (pretty much all official aarch32 applications are ports from the 32-bit Wii U).</p>",
        "id": 204271685,
        "sender_full_name": "leo60228",
        "timestamp": 1595029305
    },
    {
        "content": "<p>Interesting. (Massive side note: how much do the Wii U and the Switch have in common, in terms of being able to port an application from one to the other?)</p>",
        "id": 204271750,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595029348
    },
    {
        "content": "<p>Very little, they have completely unrelated operating systems. The Wii U is also big-endian PowerPC, while the Switch is little-endian ARM.</p>",
        "id": 204271812,
        "sender_full_name": "leo60228",
        "timestamp": 1595029403
    },
    {
        "content": "<p>Ah.</p>",
        "id": 204271827,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595029414
    },
    {
        "content": "<p>So why does aarch32 make sense for porting WiiU software? Just because people make assumptions that 64-bit breaks?</p>",
        "id": 204271843,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595029427
    },
    {
        "content": "<p>I'm guessing so, yeah. I don't know for sure, but that's what would make the most sense to me.</p>",
        "id": 204271910,
        "sender_full_name": "leo60228",
        "timestamp": 1595029468
    },
    {
        "content": "<p>I think we might be back on-topic for the thread, with the concern about target naming.</p>",
        "id": 204271924,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595029490
    },
    {
        "content": "<p>Looking at some other Rust homebrew toolchains, N64 uses <code>mips-nintendo64-none</code> while the Wii uses <code>powerpc-unknown-eabi</code>.</p>",
        "id": 204271941,
        "sender_full_name": "leo60228",
        "timestamp": 1595029510
    },
    {
        "content": "<p>Are either of those in-tree?</p>",
        "id": 204271963,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595029540
    },
    {
        "content": "<p>No. From what I've seen, most homebrew targets don't require any compiler changes beyond the target spec, so it's generally preferred to use a target JSON and Xargo.</p>",
        "id": 204272038,
        "sender_full_name": "leo60228",
        "timestamp": 1595029608
    },
    {
        "content": "<p>The proposed GBA target is actually so similar to what a generic thumbv4 embedded target would look like, that we could instead turn it into just that – and avoid any naming questions altogether.</p>",
        "id": 204272042,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1595029618
    },
    {
        "content": "<p>Is there value in having the target know something about the environment?</p>",
        "id": 204272067,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595029660
    },
    {
        "content": "<p>For a Switch target, I'd expect an actual operating system and syscalls, so it's not generic.</p>",
        "id": 204272071,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595029672
    },
    {
        "content": "<p>The Switch and 3DS are microkernels so it'd be more IPC than syscalls, but your point still stands.</p>",
        "id": 204272128,
        "sender_full_name": "leo60228",
        "timestamp": 1595029714
    },
    {
        "content": "<p>For the GBA, would the standard library or similar make calls into the firmware, invoke interrupts, rely on memory layout or peripherals, or otherwise make assumptions about the environment that would not be true of a completely generic armv4/thumbv4 target?</p>",
        "id": 204272135,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595029734
    },
    {
        "content": "<p>Yeah. For the GBA less so, it's basically a bare-metal embedded target from what I understand.</p>",
        "id": 204272143,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1595029749
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"239881\">Josh Triplett</span> <a href=\"#narrow/stream/122651-general/topic/homebrew.20target.20bikeshedding/near/204272135\">said</a>:</p>\n<blockquote>\n<p>For the GBA, would the standard library or similar make calls into the firmware, invoke interrupts, rely on memory layout or peripherals, or otherwise make assumptions about the environment that would not be true of a completely generic armv4/thumbv4 target?</p>\n</blockquote>\n<p>Not any more than the existing generic thumb targets I think</p>",
        "id": 204272161,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1595029783
    },
    {
        "content": "<p>Then in that case, it might make sense to make it a generic target. I'll leave you to argue that with <span class=\"user-mention\" data-user-id=\"224471\">@Lokathor</span>. ;)</p>",
        "id": 204272213,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595029805
    },
    {
        "content": "<p>I doubt it. The GBA <em>does</em> have a BIOS, but the only thing it provides that could be useful for libcore is a memcpy, and the overhead from interrupts would probably make using it over a Rust one somewhat pointless.</p>",
        "id": 204272235,
        "sender_full_name": "leo60228",
        "timestamp": 1595029847
    },
    {
        "content": "<p>The only usecase I'd see for a separate GBA target is for a GBA MMIO crate to <code>compiler_error!</code> if it's not being used on a GBA, but that's not a very major motivation.</p>",
        "id": 204272357,
        "sender_full_name": "leo60228",
        "timestamp": 1595030010
    },
    {
        "content": "<p>The GBA has a BIOS which has a limited selection of things you can do, but it's more like a grab-bag of routines Nintendo thought that GBA developers would consider useful, not anything at all like a C standard library.</p>",
        "id": 204272375,
        "sender_full_name": "Lokathor",
        "timestamp": 1595030039
    },
    {
        "content": "<p>The BIOS is a good point – however as long as you don't hook it up to compiler_builtins it can probably be exposed from some library instead of requiring toolchain support</p>",
        "id": 204272422,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1595030078
    },
    {
        "content": "<p>And yes, my exact reason in wanting to have a GBA target was for <code>cfg</code> related reasons.</p>",
        "id": 204272425,
        "sender_full_name": "Lokathor",
        "timestamp": 1595030079
    },
    {
        "content": "<p>Would you expect that any of those BIOS routines would be actually called in the standard library?</p>",
        "id": 204272441,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595030103
    },
    {
        "content": "<p>Or, would you expect that such <code>cfg</code> usage would occur in the standard library, or only in the ecosystem?</p>",
        "id": 204272464,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595030143
    },
    {
        "content": "<p>(the BIOS would) Never (be called by <code>std</code>), they're like.. lz77 decompression and a slightly fast memset sort of thing, and a sound driver system thing, nothing at all close to what the Rust standard library considers to be \"standard\"</p>",
        "id": 204272504,
        "sender_full_name": "Lokathor",
        "timestamp": 1595030162
    },
    {
        "content": "<p><del>Despite the name, that's actually a memcpy, not a memset.</del> (it's actually both for some reason)</p>",
        "id": 204272547,
        "sender_full_name": "leo60228",
        "timestamp": 1595030225
    },
    {
        "content": "<p>well whatever :P it's a bunch of random junk that would never be called by any sort of Rust standard library, core or std</p>",
        "id": 204272636,
        "sender_full_name": "Lokathor",
        "timestamp": 1595030304
    },
    {
        "content": "<p>The main reason for the <code>cfg</code> support being wanted was for the <code>gba</code> crate to be able to declare the MMIO stuff and then mark the volatile reads and writes as safe operations because you \"know\" you're targeting a GBA. Otherwise you're just marking a bunch of volatile accesses as safe and <em>just hoping</em> that the user runs them on a GBA.</p>",
        "id": 204272665,
        "sender_full_name": "Lokathor",
        "timestamp": 1595030340
    },
    {
        "content": "<p>Perhaps standardizing on <code>--target thumbv4t-none-eabi --cfg gba</code> could be a reasonable compromise?</p>",
        "id": 204272699,
        "sender_full_name": "leo60228",
        "timestamp": 1595030387
    },
    {
        "content": "<p>I'd have to double check but I admit that we <em>probably</em> could turn it into a completely standard <code>thumbv4t-none-eabi</code>target profile</p>",
        "id": 204272701,
        "sender_full_name": "Lokathor",
        "timestamp": 1595030387
    },
    {
        "content": "<p>This is a similar idea to <code>--cfg procmacro2_semver_exempt</code>, which seems to generally be considered a reasonable idea.</p>",
        "id": 204272807,
        "sender_full_name": "leo60228",
        "timestamp": 1595030452
    },
    {
        "content": "<p>I probably wouldn't worry about that – the entire embedded ecosystem doesn't (and couldn't) deal with that, it just assumes that you use the right peripheral access crate for your target</p>",
        "id": 204272822,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1595030463
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"239881\">Josh Triplett</span> <a href=\"#narrow/stream/122651-general/topic/homebrew.20target.20bikeshedding/near/204271654\">said</a>:</p>\n<blockquote>\n<p>It'd be <em>accurate</em>, but I could also very easily imagine the C&amp;D-happy Nintendo complaining about the use of the name, and in particular that it implies some kind of endorsement.</p>\n</blockquote>\n<p>Since we seem to have solved this for the GBA, any ideas for how to handle this for other targets?</p>",
        "id": 204272925,
        "sender_full_name": "leo60228",
        "timestamp": 1595030572
    },
    {
        "content": "<p>call it <code>mimtemdo</code> instead, nobody will know /s</p>",
        "id": 204273040,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1595030652
    },
    {
        "content": "<p>I think I'd agree with just having a generic arm4 baremetal target + a GBA crate. seems to follow the methodology of most baremetal board's mmio handling</p>",
        "id": 204273526,
        "sender_full_name": "jam1garner",
        "timestamp": 1595031132
    },
    {
        "content": "<p>the nintendo cereal commercial has the line \"Nin-ten-do, it's a cereal now!\", so clearly we codename it \"cereal\"</p>",
        "id": 204273543,
        "sender_full_name": "Lokathor",
        "timestamp": 1595031151
    },
    {
        "content": "<p>Oh I'd also like to add to the mention of skyline</p>",
        "id": 204274262,
        "sender_full_name": "jam1garner",
        "timestamp": 1595032046
    },
    {
        "content": "<p>SunriseOS and Megaton Hammer creator here. The current sunriseos target triple is <code>i386-unknown-sunrise</code> to avoid this whole issue entirely ^^. Megaton-Hammer used the <code>aarch64-roblabla-switch</code> triple. IMO the ideal situation for the Nintendo Switch specifically would be to unify all triples under <code>aarch64-switch-&lt;environment&gt;</code>, where environment can be libnx, libtransistor, nintendo (or whatever name makes sense for nintendo's proprietary framework) and sunrise. This way, switch-specific but toolchain-independant code can be cfg'd with <code>target_os = \"switch\"</code>, while target-dependant code can use <code>target_env = \"sunrise\"</code>. </p>\n<p>FWIW though, I don't plan on ever upstreaming SunriseOS targets into rustc. I've got an OK system set up to patch my libstd modifications in (applying patches to rust-src, and using xargo to build it), and I don't think the upsides of having it in-tree would justify the maintenance burden. Besides, I'm basically the only user, and I don't expect this to change ever X).</p>",
        "id": 204274273,
        "sender_full_name": "roblabla",
        "timestamp": 1595032077
    },
    {
        "content": "<p>what leo referred to as \"skyline\" is actually \"skyline-rs\", which is essentially a Rust fork designed around linking as if you're an official nintendo binary</p>",
        "id": 204274318,
        "sender_full_name": "jam1garner",
        "timestamp": 1595032085
    },
    {
        "content": "<p>(not using any SDK stuff, entirely just reverse engineered)</p>",
        "id": 204274325,
        "sender_full_name": "jam1garner",
        "timestamp": 1595032099
    },
    {
        "content": "<p>You mean <code>aarch64-nintendo-switch-environment</code>/<code>aarch64-none-switch-environment</code>? Also, I feel like there would be plenty of other people (at least myself) who would be interested in an aarch64 sunrise-libuser target, even if not an i386 SunriseOS target.</p>",
        "id": 204274475,
        "sender_full_name": "leo60228",
        "timestamp": 1595032313
    },
    {
        "content": "<p>and I would be interested in upstreaming it, but I'm not sure if it'd resemble a homebrew/modding target or treat it as if it's official since it <em>could</em> be used for actual games</p>",
        "id": 204274526,
        "sender_full_name": "jam1garner",
        "timestamp": 1595032335
    },
    {
        "content": "<p>To be fair, that's true for libnx too in theory, the question is whether Nintendo would allow it :P</p>",
        "id": 204274626,
        "sender_full_name": "leo60228",
        "timestamp": 1595032476
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239001\">@leo60228</span> Yeah, I mean, either works. If putting <code>nintendo</code> in the target is a big nono for legal reasons, then <code>none</code> would work just as well. FWIW there's already precedent in using <code>target_os = \"switch\"</code>, see <a href=\"https://github.com/rust-lang/libc/blob/master/src/lib.rs#L114\">libc</a></p>",
        "id": 204274628,
        "sender_full_name": "roblabla",
        "timestamp": 1595032478
    },
    {
        "content": "<p>I vaguely recall hearing about a commercial GBA game using DevkitARM?</p>",
        "id": 204274636,
        "sender_full_name": "leo60228",
        "timestamp": 1595032502
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239001\">@leo60228</span> actually it's not true of libnx... it'll fuck up sdk TLS stuff</p>",
        "id": 204274641,
        "sender_full_name": "jam1garner",
        "timestamp": 1595032505
    },
    {
        "content": "<p>I'll go ahead with using the triple <code>aarch64-unknown-switch-devkita64</code> for now.</p>",
        "id": 204274806,
        "sender_full_name": "leo60228",
        "timestamp": 1595032718
    },
    {
        "content": "<p>and maybe for skyline an equivalant triple would be aarch64-unknown-switch-nnsdk?</p>",
        "id": 204274855,
        "sender_full_name": "jam1garner",
        "timestamp": 1595032792
    },
    {
        "content": "<p>(as in, in the future)</p>",
        "id": 204274896,
        "sender_full_name": "jam1garner",
        "timestamp": 1595032804
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"322737\">@jam1garner</span> that's the idea yeah</p>",
        "id": 204275258,
        "sender_full_name": "roblabla",
        "timestamp": 1595033311
    },
    {
        "content": "<p>I use the vendor field generally for the game console itself, though I target more primitive consoles. For example, I use w65c816-snes-none-elf for the SNES.</p>",
        "id": 204275283,
        "sender_full_name": "Connor Horman",
        "timestamp": 1595033375
    },
    {
        "content": "<p>device name as vendor actually makes so much sense i'm embarrassed</p>",
        "id": 204277242,
        "sender_full_name": "Lokathor",
        "timestamp": 1595036221
    },
    {
        "content": "<p>Even the GBA is a family of multiple devices though</p>",
        "id": 204277697,
        "sender_full_name": "Fenrir",
        "timestamp": 1595036932
    },
    {
        "content": "<p>yeah but the <em>software</em> can't tell if it's on a GBA or GBASP or GBA-Player etc</p>",
        "id": 204277832,
        "sender_full_name": "Lokathor",
        "timestamp": 1595037127
    },
    {
        "content": "<p>That's fair then</p>",
        "id": 204277839,
        "sender_full_name": "Fenrir",
        "timestamp": 1595037148
    },
    {
        "content": "<p>I think it can actually?</p>",
        "id": 204277849,
        "sender_full_name": "leo60228",
        "timestamp": 1595037186
    },
    {
        "content": "<p>idk if they can tell in the case of the GBA family</p>",
        "id": 204277858,
        "sender_full_name": "Fenrir",
        "timestamp": 1595037208
    },
    {
        "content": "<p>Games can detect if they're on old or new 3DS though</p>",
        "id": 204277873,
        "sender_full_name": "Fenrir",
        "timestamp": 1595037219
    },
    {
        "content": "<p>I can't speak outside of GBA, but on the GBA as far as I know you can't tell what hardware you're on.</p>\n<p>(Mild Exception: at least one emulator supports debug IO registers which give you a \"stdout\" sort of ability from within the ROM into a debugger window that the GUI shows. Obviously this is radically different from the normal hardware situation though, so i'm not counting it.)</p>",
        "id": 204278022,
        "sender_full_name": "Lokathor",
        "timestamp": 1595037433
    },
    {
        "content": "<p>There's a BIOS function (0xD) that returns BAAE1880 on *DS and BAAE187F on original hardware</p>",
        "id": 204278068,
        "sender_full_name": "leo60228",
        "timestamp": 1595037483
    },
    {
        "content": "<p>And the Gameboy Player has a really fantastic way to detect it: if you display the Gameboy Player logo for 2 seconds then it'll press Up+Down+Left+Right simultaneously</p>",
        "id": 204278105,
        "sender_full_name": "leo60228",
        "timestamp": 1595037509
    },
    {
        "content": "<p>I’m slightly partial to specifying <code>vendor=nintendo</code> for nintendo switch targets just because switch in isolation sounds confusable.</p>",
        "id": 204278110,
        "sender_full_name": "nagisa",
        "timestamp": 1595037525
    },
    {
        "content": "<p>but other than that I don’t think there's  much difference between utilizing the vendor or not.</p>",
        "id": 204278120,
        "sender_full_name": "nagisa",
        "timestamp": 1595037550
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239001\">@leo60228</span> very good catch, I'd forgotten about that one.</p>",
        "id": 204278131,
        "sender_full_name": "Lokathor",
        "timestamp": 1595037580
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span> if you're curious, <a href=\"https://problemkaputt.de/gbatek.htm#biosfunctions\">https://problemkaputt.de/gbatek.htm#biosfunctions</a> has a list of the BIOS functions available on GBA / DS / DSi. You activate them by putting the args in place and triggering a software interrupt, so they're far more expensive to call than a normal function, but a few of them do special enough things to justify the extra cost.</p>",
        "id": 204278273,
        "sender_full_name": "Lokathor",
        "timestamp": 1595037739
    }
]