[
    {
        "content": "<p>Hello, <code>bytemuck</code> author here. It's a crate for safe transmuting. It has a trait for \"plain old data\" types. On advice of some folks who seemed to know what they were talking about (who shall remain nameless to protect the innocent), an impl of this trait was added for the raw pointer types.</p>\n<p>\"you can do <code>raw_ptr as usize</code> and <code>usize as raw_ptr</code>, so obviously you must be able to transmute to usize or other pod type as well.\", the logic went.</p>\n<p>Well apparently not so! And now that trait impl has to go. While this is strictly a breaking change, the \"unsoundness must always be fixed\" clause overrides that.</p>\n<p>The current crate version is 1.5.1, though i was about to release a 1.6.0 when I found out about this problem.</p>\n<p><strong>question:</strong> Should I just release the 1.6 and yank all the past versions, or is there some better path?</p>",
        "id": 242130234,
        "sender_full_name": "Lokathor",
        "timestamp": 1623272844
    },
    {
        "content": "<p>How long was the impl there for?</p>",
        "id": 242131340,
        "sender_full_name": "nagisa",
        "timestamp": 1623273311
    },
    {
        "content": "<p>like since pre 1.0, basically since i wrote the trait</p>",
        "id": 242131514,
        "sender_full_name": "Lokathor",
        "timestamp": 1623273351
    },
    {
        "content": "<p>Worth reading <a href=\"https://github.com/briansmith/ring/issues/774\">https://github.com/briansmith/ring/issues/774</a> to get informed on yanking.</p>",
        "id": 242131922,
        "sender_full_name": "nagisa",
        "timestamp": 1623273501
    },
    {
        "content": "<p>My immediate reaction in this instance would be to \"just\" release 2.0 and leave the other versions be.</p>",
        "id": 242131992,
        "sender_full_name": "nagisa",
        "timestamp": 1623273534
    },
    {
        "content": "<p>hmm, why is this unsound? does the impl apply to fat pointers?</p>",
        "id": 242132066,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1623273569
    },
    {
        "content": "<p>Then going through all dependents, getting them updated, and _maybe_ then yanking.</p>",
        "id": 242132069,
        "sender_full_name": "nagisa",
        "timestamp": 1623273572
    },
    {
        "content": "<p>ah, nevermind, I recall some discussions around this</p>",
        "id": 242132205,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1623273633
    },
    {
        "content": "<p>I do remember that ring thread.</p>\n<p>Thankfully at least on this case the minimum rust version has not moved since 1.0, so anyone using 1.0 or later can surely move forward to 1.6</p>",
        "id": 242132223,
        "sender_full_name": "Lokathor",
        "timestamp": 1623273642
    },
    {
        "content": "<p>I'm still hoping we can find a solution that doesn't require giving this up</p>",
        "id": 242132252,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1623273659
    },
    {
        "content": "<p>See <a href=\"https://github.com/rust-lang/unsafe-code-guidelines/issues/286\">https://github.com/rust-lang/unsafe-code-guidelines/issues/286</a> for Soundness explanation</p>",
        "id": 242132268,
        "sender_full_name": "Lokathor",
        "timestamp": 1623273671
    },
    {
        "content": "<p>TLDR is that this is <em>already</em> broken in current llvm. even if this is fixed in the future to become sound, it's not sound in today's rust.</p>",
        "id": 242132336,
        "sender_full_name": "Lokathor",
        "timestamp": 1623273710
    },
    {
        "content": "<p>To be clear, it's not <em>currently</em> definitively UB, it's only broken with unclear semantics</p>",
        "id": 242132344,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1623273721
    },
    {
        "content": "<p>and one solution is to make it UB, while another solution is to make it defined and break other stuff</p>",
        "id": 242132425,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1623273752
    },
    {
        "content": "<p>and in particular there are several unresolved questions about the handling of pointers in stacked borrows that directly affect this issue. I don't really see this issue being resolved definitively until rust adopts SB or an alternative as the official memory model</p>",
        "id": 242132720,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1623273895
    },
    {
        "content": "<p>and re: llvm bugs, I think llvm is internally inconsistent here, so there is no choice of semantics that will make llvm do the right thing in all cases</p>",
        "id": 242133074,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1623274075
    },
    {
        "content": "<p>I'm not sure what the difference to the end user is to compare \"definitely UB\" vs \"broken with unclear semantics\".</p>\n<p>They both sound equally harmful to the user's intent, and like you shouldn't do that thing.</p>",
        "id": 242134050,
        "sender_full_name": "Lokathor",
        "timestamp": 1623274564
    },
    {
        "content": "<p>The difference is that if it's an LLVM bug then we can solve the issue there without changing peoples' code</p>",
        "id": 242134655,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1623274878
    },
    {
        "content": "<p>If it's a really long term bug then maybe users will want to work around it and that might look like an equivalent effect to UB</p>",
        "id": 242134769,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1623274925
    },
    {
        "content": "<p>The LLVM bug only triggers in fairly contrived conditions though AFAIK</p>",
        "id": 242134819,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1623274962
    },
    {
        "content": "<p>miscompiles aren't great regardless though</p>",
        "id": 242134861,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1623274980
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224471\">@Lokathor</span> my take on <em>your</em> situation: submit the breaking release without the impl for pointers, but keep the older version around. The idea is to ultimately yank the current versions, but not do it immediately.</p>\n<ul>\n<li>\n<p>In the following paragraph, I'll call <code>1.a</code> your current (unsound) version, <code>2.0</code> the fixed one (semver incompatible), and <code>1.linted</code> one which would be semver compatible with <code>1.a</code> (<em>e.g.</em>, <code>linted = a + 1</code>).</p>\n</li>\n<li>\n<p>One thing you could do, in the meantime, is to add a new semver-compatible version, <code>1.linted</code>, which only features the unsound impl through an <code>unsound-pointer-impl</code> feature. This would allow you to set up yanking the previous versions (<code>&lt; 1.linted</code>) (although you should wait a bit). That way, users that don't directly depend on <code>::bytemuck</code>, but who may be depending on a crate that transitively depends on something <code>&lt; 1.linted</code>, when they <code>cargo update</code>, they <em>would still be able to make their project compile</em> by enabling that linting feature themselves. Ideally, in order to do so, they'd check either your repo or the problematic intermediate crate relying on it, and submit an issue until they find out about the workaround, and the reasons for it. Once most of these intermediate crates have been fixed or are at least aware of the issue, you could yank the crates <code>&lt; 1.linted</code>.</p>\n</li>\n<li>\n<p>That way you still force a bit the hand of the people depending on your crate, but at least you give a chance to all the end users to still make the compilation work.</p>\n</li>\n</ul>\n<p>Note that the above suggestion does not need to be undertaken right away, maybe wait a few months until most users have already naturally transitioned to your <code>2.0</code> version.</p>\n<p>FWIW, I personally think that it should be possible to do <code>cargo update -p bytemuck --precise 1.a.x --dangerous-allow-yanked</code>, with that command then displaying  a big warning about the operation, but still letting the operation go on. Fully breaking <code>Cargo.lock</code>-less transitively-dependent builds <em>with no solution whatsoever</em> cannot be better than depending on something potentially dangerous.</p>",
        "id": 242256400,
        "sender_full_name": "Daniel Henry-Mantilla",
        "timestamp": 1623352601
    },
    {
        "content": "<p>Alright, <a href=\"https://github.com/Lokathor/bytemuck/pull/65\">https://github.com/Lokathor/bytemuck/pull/65</a> does what you're suggesting, if I understand you properly.</p>",
        "id": 242267458,
        "sender_full_name": "Lokathor",
        "timestamp": 1623357531
    },
    {
        "content": "<p>i'd wait for something more concrete before yanking, but i agree you should move towards removing it for now. that said, i suspect in practice a lot of code depends on the ability to transmute pointers &lt;=&gt; usize (usually in the context of arrays)...</p>",
        "id": 242267950,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1623357765
    }
]