[
    {
        "content": "<p>Hi all, Please, I never programmed before, I don't know how to programming yet. I would like to get a good suggestion about any book that should help me to understand RUST - I have Rust 1.48 installed in Debian Linux.</p>",
        "id": 246352610,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1626570044
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"427444\">Robson Herrera</span> <a href=\"#narrow/stream/122651-general/topic/Omit.20.60.7B.7D.60.20in.20.60impl.20X.20for.20X.20.7B.7D.60/near/246352610\">said</a>:</p>\n<blockquote>\n<p>Hi all, Please, I never programmed before, I don't know how to programming yet. I would like to get a good suggestion about any book that should help me to understand RUST - I have Rust 1.48 installed in Debian Linux.</p>\n</blockquote>\n<p>The Rust Book is quite good, it's one of the best on-boarding tutorials for a language I've seen:<br>\n<a href=\"https://doc.rust-lang.org/book/\">https://doc.rust-lang.org/book/</a></p>",
        "id": 246353112,
        "sender_full_name": "Alexander Huszagh (He/Him)",
        "timestamp": 1626571048
    },
    {
        "content": "<p>Thank you very much for answering, Alexander</p>",
        "id": 246356683,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1626577843
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"427444\">@Robson Herrera</span> You stated in DMs that you had additional doubts and concerns- if you would like to know more, please describe those concerns, so that we may attempt to address them.</p>",
        "id": 246358639,
        "sender_full_name": "Zoey",
        "timestamp": 1626581478
    },
    {
        "content": "<p>Thank you very much for your attention, and I'm sorry for the inconvenience committed on the other channel.  I want to know if there is any complementary book or study that I need to assume, taking into account that I have no programming background because I have never studied in this area before.<br>\nI started reading the book 'The Rust Programming Language'. I have not entered technical affairs properly. If I focus only on this book (which in fact, I already realized that it is a Treaty on Rust), will I be able to move forward, making use of practice in Debian Linux? I have already installed language in OS.</p>",
        "id": 246358765,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1626581759
    },
    {
        "content": "<p>In short: Yes, that should be fine. You can also use Rustlings to help you get started. I'd also recommend trying some historical \"Advent of Code\" challenges.</p>",
        "id": 246358863,
        "sender_full_name": "Zoey",
        "timestamp": 1626581946
    },
    {
        "content": "<p>I have plenty of time available to invest in Rust's studies, I intend to collaborate with this wonderful project soon, as soon as possible. And, studying and practicing Rust will be my only study activity from now on, along with continuous practices in Debian, which will be my platform Rust for testing and studies.</p>",
        "id": 246358870,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1626581999
    },
    {
        "content": "<p>Since it's your first programming language, I'd also suggest reading an introduction to programming and algorithms, but I don't have a good recommendation (and it will likely depend on your other experience, education and so on). The Rust book is mostly written for people who already know another language.</p>",
        "id": 246362455,
        "sender_full_name": "Laurențiu",
        "timestamp": 1626588857
    },
    {
        "content": "<p><a href=\"http://exercism.io\">exercism.io</a> also has nice programming exercises, and they're mostly easier than AoC</p>",
        "id": 246362464,
        "sender_full_name": "Laurențiu",
        "timestamp": 1626588903
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"427444\">@Robson Herrera</span>  Because you have never programmed before, I would recommend that you complete CS 50 which is an excellent course. The explanations for the basic concepts are helpful and the course is self paced and free.  Then you will be ready to tackle Rust or any other language you want to learn.<br>\n<a href=\"https://cs50.harvard.edu/x/2021/\">https://cs50.harvard.edu/x/2021/</a></p>",
        "id": 246365181,
        "sender_full_name": "Doc Jones",
        "timestamp": 1626594304
    },
    {
        "content": "<p>Thank you very much for answering me, Doc Jones. I'm really interested in Rust Language. I'll read about this CS50 Course. Really helped me with your information <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 246534957,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1626744205
    },
    {
        "content": "<p>Thank you Laurentiu, for information provided !</p>",
        "id": 246535048,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1626744258
    },
    {
        "content": "<p>I've already had some tips around here about the requirements for starting to learn Rust, as I don't have any programming experience and knowledge. Here I am exploring the various paths, the various possibilities to learn Rust.</p>",
        "id": 246648412,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1626814568
    },
    {
        "content": "<p>Study and practice of language C is more advisable to learn Rust, for those who have never programmed? Or would C ++ be more viable for this investment?</p>",
        "id": 246648452,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1626814600
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"427444\">@Robson Herrera</span> It's perfectly valid to learn Rust without having programmed before, and you don't need to learn another language first.</p>",
        "id": 246651998,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1626815796
    },
    {
        "content": "<p>Experience with C or C++ is not required.</p>",
        "id": 246652037,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1626815811
    },
    {
        "content": "<p>Josh, Triplett, thank you for answering me ! My fear is learning some language before Rust, and having to get rid of outdated programming concepts later, as I get my initial contact with Rust.<br>\nCan you please give me any suggestions on how to get started? I already had some suggestions; but, I would like to have your opinion as well, as this vision of yours is very much in line with what I have as an ideal to start learning Rust.</p>",
        "id": 246652631,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1626815994
    },
    {
        "content": "<p>The easiest path to learn Rust is to learn Rust, not C or C++. Knowledge of those languages (or other computer languages generally) will help compared to not knowing anything about programming, but detouring through another language is more work than just learning Rust directly, if that's your goal</p>",
        "id": 246657857,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1626819333
    },
    {
        "content": "<p>I'm not sure how much resources are available in Rust for people completely new to programming.  Regardless, I still wouldn't suggest starting with C or C++ first.</p>\n<p>You could consider finding an introduction that's intentionally limited to focus just on some basics, then jump to Rust after that.  Something like the free <a href=\"https://www.edx.org/course/cs50s-introduction-to-programming-with-scratch\">https://www.edx.org/course/cs50s-introduction-to-programming-with-scratch</a> might be interesting for that.</p>\n<p>I'd love to see a purpose-made course of Rust for people with zero programming background, though.  It'd be really interesting to see how they difficulties students hit in that compared to those they might hit in other languages, or those encountered by people learning Rust after having gotten used to other languages.</p>",
        "id": 246660785,
        "sender_full_name": "scottmcm",
        "timestamp": 1626821849
    },
    {
        "content": "<p>Mario Carneiro,  although I am totally lay in the subject, I also had this impression (by intuition, I presume), to learn another programming language before Rust to know Rust, would be an indirect effort, and therefore unnecessary.<br>\nI just needed the opinion of more experienced people than me, and so I came here in this chat, which receives the beginners with the maximum respect and attention, something very rare to see today in the specialized chats <span aria-label=\"hug\" class=\"emoji emoji-1f917\" role=\"img\" title=\"hug\">:hug:</span><br>\nThank you immensely your tip and information! Your opinion, and Josh Triplett will be the sources of inspiration that I will take with me, next to the official Treaty on Rust, 'The Rust Programming Language'.</p>",
        "id": 246661282,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1626822155
    },
    {
        "content": "<p>scottmcm, Thank you immensely your tip. A complement of studies, as this source you addressed, can become very useful too, which does not mean having to learn C and C ++.<br>\nI believe that all who are beginners and approach Rust, tend to feel afraid to go ahead.<br>\nAs difficult as Rust learning can be for a beginner, if he has the rust in the spirit and heart, surely he will be able to move forward.</p>",
        "id": 246661615,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1626822450
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"427444\">@Robson Herrera</span> I've also heard good things about <a href=\"https://smile.amazon.com/Programming-Rust-Fast-Systems-Development-dp-1492052590/dp/1492052590/\">https://smile.amazon.com/Programming-Rust-Fast-Systems-Development-dp-1492052590/dp/1492052590/</a> ; I know at least one professor (<span class=\"user-mention\" data-user-id=\"220717\">@Bart Massey</span>) using that to teach a class on Rust.</p>",
        "id": 246672186,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1626833206
    },
    {
        "content": "<p>I don't know how well either book works for learning Rust as a first language.</p>",
        "id": 246672204,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1626833229
    },
    {
        "content": "<p>Fine, Josh, thank you very much for this link. Surely I'll have a look on it and go ahead with my Project focused in Rust Learning. I've seen here this book I downloaded last week (and other books about Rust), but I hadn't no idea about it. Really thank you for your attention, kindness and Great Support ! <span aria-label=\"hug\" class=\"emoji emoji-1f917\" role=\"img\" title=\"hug\">:hug:</span></p>",
        "id": 246672409,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1626833419
    },
    {
        "content": "<p>A practical project (something you're interested in but not something you need urgently) is a great way to learn. Take your time, evolve the project along with your understanding of Rust, and don't worry if the code quality isn't perfect from the start.</p>",
        "id": 246673115,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1626834173
    },
    {
        "content": "<p>/me did exactly that, and <em>heavily</em> evolved the project as his understanding of Rust improved.</p>",
        "id": 246673130,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1626834193
    },
    {
        "content": "<p>You can be sure that I will also follow your advice !<br>\nI have the 'cargo' and the Rust compiler already installed on Debian. I will still develop the idea of a small project to practice, always reading the book and following Your recommendations, Josh <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 246673405,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1626834515
    },
    {
        "content": "<p>You know Josh, I am interested in developing a lot in Rust, to the point of using this Language Professionally as a Consultant.<br>\nI still have no idea of the professional perspectives for someone who is already experienced in this Powerful Programming Language; but that is what I intend to tread and to mature this work project over time. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 246673570,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1626834757
    },
    {
        "content": "<p>Can highly recommend <em>Programming Rust</em>, but it really is aimed at someone with C/C++ or similar who understands pointers and stuff.</p>\n<p>Rust as a first programming language is quite challenging. The general community advice these days is to learn programming in Python, which super beginner-friendly for basic concepts. Once you have a few small programs under your belt and have mastered the fundamentals, moving on to Rust might be easier.</p>",
        "id": 246777170,
        "sender_full_name": "Bart Massey",
        "timestamp": 1626900882
    },
    {
        "content": "<p>Well Bart, I had doubts about whether it was humanly possible to learn to program already with Rust.<br>\nSince it's possible, that's what I'm going to do. The members here who answered me positively about the possibility of learning Rust without having to go through other languages before, helped me a lot in this decision making.<br>\nI'm not really worried about difficulties, they will exist, but they will be overcome.<br>\nStudying Python and then going to Rust could help; but, at the same time, it would force me to dedicate myself to a Language that does not interest me as Rust does.<br>\nSo, in the end, it would turn out to be an easy rather than a pleasurable activity; while facing Rust right away will be a difficult and arduous activity, but also a rewarding and pleasurable one.</p>",
        "id": 247290826,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1627356810
    },
    {
        "content": "<p>Hello everybody. Please, I need to prepare an outreach article about the Rust Language, and I'm counting on your help for this.<br>\nI need to list the advantages of Rust for the Security of a UNIX-Like and Linux System.</p>",
        "id": 247374269,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1627411614
    },
    {
        "content": "<p>What Future Developments in Rust is Envisioned or Proposed by the Rust Project for the Security of the Linux Kernel?<br>\nIt is a Social Network with 31,151 Members, and I want to write this article to promote the Rust Language for Kali Linux and Debian Users.</p>",
        "id": 247374301,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1627411630
    },
    {
        "content": "<p>This is a question probably better posted to the internals forum or users forum (or both with cross-links).</p>",
        "id": 247374358,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1627411654
    },
    {
        "content": "<p><a href=\"https://internals.rust-lang.org/\">https://internals.rust-lang.org/</a> <a href=\"https://users.rust-lang.org/\">https://users.rust-lang.org/</a></p>",
        "id": 247374410,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1627411676
    },
    {
        "content": "<p>There are a number of studies about the security properties of Rust, including concrete evaluations of the number of security bugs prevented by Rust. There are also a number of articles about the Rust-in-Linux work. (That work has its own Zulip and mailing list, as well.)</p>",
        "id": 247374521,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1627411720
    },
    {
        "content": "<p><a href=\"https://msrc-blog.microsoft.com/2019/07/22/why-rust-for-safe-systems-programming/\">https://msrc-blog.microsoft.com/2019/07/22/why-rust-for-safe-systems-programming/</a><br>\n<a href=\"https://security.googleblog.com/2021/04/rust-in-android-platform.html\">https://security.googleblog.com/2021/04/rust-in-android-platform.html</a></p>",
        "id": 247374584,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1627411757
    },
    {
        "content": "<p>Thank You Josh, for information <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span> I'll visit these links and prepare a good material for security Rust in Linux.</p>",
        "id": 247374650,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1627411793
    },
    {
        "content": "<p><a href=\"https://hacks.mozilla.org/2019/02/rewriting-a-browser-component-in-rust/\">https://hacks.mozilla.org/2019/02/rewriting-a-browser-component-in-rust/</a></p>",
        "id": 247374709,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1627411805
    },
    {
        "content": "<p>That's all I need for now, thank you very much Josh Triplett !</p>",
        "id": 247375051,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1627411973
    },
    {
        "content": "<p>Hi all, Please, I'm still doing outreach work on Rust, and I'd like to know where to find a list of the security improvements Rust brings compared to C and C++. I particularly need information about these anticipated improvements for Linux, with the adoption of Rust for this purpose.</p>",
        "id": 247777418,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1627693653
    },
    {
        "content": "<p>I searched several websites for this list more specifically aimed at security enhancements in the Linux Kernel through the adoption of Rust, but without much success.</p>",
        "id": 247777551,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1627693876
    },
    {
        "content": "<p>I recall Alex Gaynor had a very good talk on that topic: <a href=\"https://www.youtube.com/watch?v=drfXNB6p6nI\">https://www.youtube.com/watch?v=drfXNB6p6nI</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"drfXNB6p6nI\" href=\"https://www.youtube.com/watch?v=drfXNB6p6nI\"><img src=\"https://uploads.zulipusercontent.net/848c80046bfbb37b011a25546984e2e3ac4bda6c/68747470733a2f2f692e7974696d672e636f6d2f76692f647266584e423670366e492f64656661756c742e6a7067\"></a></div>",
        "id": 247808582,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1627744301
    },
    {
        "content": "<p>My English was terrible; I meant: sorry for late response Mario Carneiro. It's a good article, but I need something more specifically related to Linux. Thank You anyway.</p>",
        "id": 248300065,
        "sender_full_name": "Robson Herrera",
        "timestamp": 1628038536
    }
]