[
    {
        "content": "<p>I just had a weird experience with cargo pulling the wrong version of a crate. My project was compiling fine, then broke last night with a strange error in a dependency. I tried cargo clean, cargo update -p wonky-package, etc, and nothing worked. Finally, I went into the cargo cache, manually deleted the directory, and cargo finally pulled the package again, and the issue was gone.</p>",
        "id": 234540240,
        "sender_full_name": "Daniel Joyce",
        "timestamp": 1618421242
    },
    {
        "content": "<p>have you maybe edited a file in the package cache by accident?</p>",
        "id": 234544156,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1618422553
    },
    {
        "content": "<p>does cargo not mark those as readonly?</p>",
        "id": 234546418,
        "sender_full_name": "The 8472",
        "timestamp": 1618423365
    },
    {
        "content": "<p>no, I don't think so</p>",
        "id": 234549939,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1618424721
    },
    {
        "content": "<p>No, I don't think so. The issue was with block comments.</p>",
        "id": 234559850,
        "sender_full_name": "Daniel Joyce",
        "timestamp": 1618428488
    },
    {
        "content": "<p>what exactly was the error?</p>",
        "id": 234575745,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1618434403
    },
    {
        "content": "<p>I hat a similar Problem in my Case a dependency was corrupted. Concretely in rusty_fork the fork method had Fn trait bonds instead of FnMut bound.</p>",
        "id": 234739694,
        "sender_full_name": "Philipp Korber",
        "timestamp": 1618515543
    },
    {
        "content": "<p>While I had some other suspects first I later blamed visual studio code, as I had cases where a rename feature renamed dependencies code before (through in typescript). Mainly it seems that of you open a project through a sym-link dir vscode can get really confused with all kinds of things and I had it opened like that. (I was aware of the sym-link problem before but forgot to make sure to use a real path).</p>\n<p>Through I have no proof at all that the sys-link problem was the cause in this case, it was just a likely subject.</p>",
        "id": 234740417,
        "sender_full_name": "Philipp Korber",
        "timestamp": 1618515822
    },
    {
        "content": "<p>yeah, rust-analyzer will also happily edit dependency code</p>",
        "id": 234740841,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1618515980
    },
    {
        "content": "<p>There are a few proposals for a ready only mode being added to vscode/lsp but nothing's materialized so far.</p>",
        "id": 234843139,
        "sender_full_name": "Jeremy Kolb",
        "timestamp": 1618575770
    }
]