[
    {
        "content": "<p>I'm not familiar with MacOS, so I have a small question. Given a binary compiled in MacOS 11, is it likely to work on 10.15? If not, should I use an older version of XCode to build it, or point a newer one to the older SDK? This is about compiling on GitHub Actions, they have a bunch of versions pre-installed.</p>",
        "id": 265084801,
        "sender_full_name": "Laurențiu",
        "timestamp": 1639607082
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"203546\">Laurențiu</span> has marked this topic as resolved.</p>",
        "id": 265084829,
        "sender_full_name": "Notification Bot",
        "timestamp": 1639607097
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"203546\">Laurențiu</span> has marked this topic as unresolved.</p>",
        "id": 265084832,
        "sender_full_name": "Notification Bot",
        "timestamp": 1639607102
    },
    {
        "content": "<p>Set the <code>MACOSX_DEPLOYMENT_TARGET</code> environment variable to the desired minimum macOS version for the compilation/linking process. Rustc will pass the version to the LLVM backend and the linker will use it to ensure that all referenced symbols are available in the shared libraries for this version.</p>",
        "id": 265088162,
        "sender_full_name": "Hans Kratz",
        "timestamp": 1639609055
    },
    {
        "content": "<p>Thanks, that seems useful. What happens if it's not set?</p>",
        "id": 265088867,
        "sender_full_name": "Laurențiu",
        "timestamp": 1639609386
    },
    {
        "content": "<p>If <code>MACOSX_DEPLOYMENT_TARGET</code> is not set the linker uses the SDK default, which is the minimum of the default version specified by the currently selected SDK and the current OS version. If you don't specify an SDK via the <code>SDKROOT</code> env variable the selected SDK is taken from the currently selected Xcode commandline tools version (which can be changed via <code>xcode-select</code>). And of course it varies with Xcode version.</p>",
        "id": 265090191,
        "sender_full_name": "Hans Kratz",
        "timestamp": 1639610104
    },
    {
        "content": "<p>Thanks again. I can't test the binaries, but at least they build.</p>",
        "id": 265117205,
        "sender_full_name": "Laurențiu",
        "timestamp": 1639636582
    }
]