[
    {
        "content": "<p>Is it safe to transmute a new type into the inner type eg: <code>struct NewType(T)</code> -&gt; <code>T</code> and vice versa? Naively I'm assuming they should be layout compatible.</p>",
        "id": 232900912,
        "sender_full_name": "Lukas Bergdoll",
        "timestamp": 1617371500
    },
    {
        "content": "<p>It is only guaranteed if <code>NewType</code> is marked <code>#[repr(transparent)]</code></p>",
        "id": 232902726,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1617372526
    },
    {
        "content": "<p>repr(C) would do it as well</p>",
        "id": 232904150,
        "sender_full_name": "Lokathor",
        "timestamp": 1617373322
    },
    {
        "content": "<p><code>#[repr(C)]</code> is fine if the transmuted type is a function pointer where <code>NewType</code> or <code>T</code> is an argument or return type. For example transmuting <code>fn(NewType)</code> to <code>fn(T)</code> is not allowed when <code>NewType</code> is not <code>#[repr(transparent)]</code>. Some calling conventions use a different pass mode for integers and integer struct wrappers. Only <code>#[repr(transparent)]</code> ensures an identical pass mode.</p>",
        "id": 232920787,
        "sender_full_name": "bjorn3",
        "timestamp": 1617381536
    },
    {
        "content": "<blockquote>\n<p>Naively I'm assuming they should be layout compatible.</p>\n</blockquote>\n<p>A sufficiently advanced compiler doing whole program analysis might see that your newtype (unlike the wrapped one) is mostly used in arrays and it would be beneficial to use simd operations on them and thus decides to bump its alignment to be more simd-friendly. This would at least make T -&gt; newtype transmutes incorrect.</p>",
        "id": 232925385,
        "sender_full_name": "The 8472",
        "timestamp": 1617383570
    },
    {
        "content": "<p>rustc isn't doing that right now, but for such an optimization to be allowed in the future the absence of layout guarantees is important</p>",
        "id": 232925860,
        "sender_full_name": "The 8472",
        "timestamp": 1617383770
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"118745\">Lukas Bergdoll</span> <a href=\"#narrow/stream/122651-general/topic/new.20type.20safe.20to.20transmute.20to.20inner/near/232900912\">said</a>:</p>\n<blockquote>\n<p>Naively I'm assuming they should be layout compatible.</p>\n</blockquote>\n<p>Philosophically, Rust tends to prefer that if you're relying on something there's a marker in the code about it somehow.  That means the compiler can help you by failing if it were ever changed to <code>struct NewType(T, bool);</code>, or it could add extra checking to non-transparent types in debug or something by tracking extra state in the type.</p>",
        "id": 232929419,
        "sender_full_name": "scottmcm",
        "timestamp": 1617385378
    },
    {
        "content": "<p>Hmm, it looks like there is an ambiguity in this thread that leads to seemingly different answers:</p>\n<ul>\n<li>if you are actually transmuting a <code>Wrappee</code> to a <code>NewTypeWrapper</code> and <em>vice versa</em>, then:<ul>\n<li><code>#[repr(C)]</code> suffices,</li>\n<li><code>#[repr(transparent)]</code> works too, and is a bit more constraining on the actual definition of <code>NewTypeWrapper</code>, making the pattern a bit more resilient to refactoring. It should thus be preferred when possible.</li>\n<li>It should be noted that transmuting seems overkill here, since a \"manual\" wrapping / into_inner operation will achieve the same (barring privacy constructor / pattern destructor concerns, or drop impls for destructuring)</li>\n<li><code>#[repr(Rust)]</code> (the default when no repr annotation is around) <strong>will also be fine</strong>, soundness-wise, provided <code>mem::transmute</code> is used. Indeed, if it compiles, it means they have the same size. Stability-wise, however, you could get compilation breakage from the size of the newtype changing (I doubt that will happen, but it technically can). In that regard, <span class=\"user-mention\" data-user-id=\"330154\">@The 8472</span> is not totally right: alignment alone does not matter when transmuting by value (except when the alignment becomes bigger than the intrinsic size, since that will lead to a stride that is bundled within the effective size, thus changing it).</li>\n</ul>\n</li>\n<li>If transmuting a composite type, stuff becomes way more subtle:<ul>\n<li>If transmuting simple pointer / reference types (<em>a.k.a.</em>, casting), then you will indeed need to have the actual pointer be aligned to the destination type's alignment, and for reference types it is sufficient that the two types have the same alignment, which is possible to guarantee with <code>#[repr(C)]</code> and no extra fields nor alignment annotations, or by a <code>#[repr(transparent)]</code>. This makes <code>#[repr(Rust)]</code> quite ill-suited for the task.</li>\n<li><strong>if transmuting function pointer types, then <code>#[repr(transparent)]</code> is mandatory</strong> (any other repr does not suffice).</li>\n<li>if transmuting a composite type, <em>e.g.</em>, <code>Foo&lt;Wrappee&gt;</code> to/from <code>Foo&lt;NewTypeWrapper&gt;</code>, then, nothing is guaranteed, not even with <code>#[repr(transparent)]</code> (consider, for instance, <code>Foo = Option</code> and <code>UnsafeCell&lt;TypeWithNiche&gt;</code>). You will have to \"study\" the transmutability on a case per case basis.</li>\n</ul>\n</li>\n</ul>",
        "id": 232998901,
        "sender_full_name": "Daniel Henry-Mantilla",
        "timestamp": 1617447999
    },
    {
        "content": "<p>Note that all this relates to type layout: about not breaking the most frequent <em>validity</em> invariants of the types involved. </p>\n<p>Observing, for instance, that <code>NonZeroU32</code> is a transparent wrapper around <code>u32</code> shows that the wrapper can add extra validity invariants, which would make these transmutations unsound in the general case, unless extra checks were to be added.</p>\n<p>But even barring this <em>niche</em> case (heh), the newtype wrapper can also add (or remove!) <em>safety</em> invariants <em>w.r.t.</em> its wrappee, so care should be taken not to break any of these</p>",
        "id": 232999125,
        "sender_full_name": "Daniel Henry-Mantilla",
        "timestamp": 1617448286
    },
    {
        "content": "<p>Yeah, I assumed the question was about general transmutability which might be done either by pointer access or by value. Doing one but avoiding the other is more subtle.</p>",
        "id": 233017419,
        "sender_full_name": "The 8472",
        "timestamp": 1617468235
    }
]