[
    {
        "content": "<p>Hey, a couple weeks back <span class=\"user-mention\" data-user-id=\"433532\">@mejrs</span> and I were chatting on discord about the Subtyping and Variance chapter. We seemed to agree with others that it's currently geared very much towards OOP and not towards Rust thinking. As such, it's not very suitable as a document to help Rust developers avoid safety violations.</p>\n<p>Anecdote: I had read through it several times without actually understanding the purpose, and I still needed people on the discord to explain it to me.</p>\n<p>So, I have re-written it <a href=\"https://github.com/rust-lang/nomicon/pull/340\">https://github.com/rust-lang/nomicon/pull/340</a> and I'd appreciate any feedback. I am intending to A/B test the two documents with my peers at work, but I haven't had the time to put together the survey just yet</p>",
        "id": 273086394,
        "sender_full_name": "Conrad Ludgate",
        "timestamp": 1645708070
    },
    {
        "content": "<p>You may want to also show this to <a class=\"stream\" data-stream-id=\"136281\" href=\"/#narrow/stream/136281-t-lang.2Fwg-unsafe-code-guidelines\">#t-lang/wg-unsafe-code-guidelines</a></p>",
        "id": 273089277,
        "sender_full_name": "bstrie",
        "timestamp": 1645709740
    },
    {
        "content": "<p>Cc <span class=\"user-group-mention\" data-user-group-id=\"692\">@WG-traits</span>  too (I want to take a look at this at some point)</p>",
        "id": 273095214,
        "sender_full_name": "Jack Huey",
        "timestamp": 1645712617
    },
    {
        "content": "<p>oh this is a great idea, the original chapter never made any sense to me because of the focus on animals instead of lifetimes <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 273095903,
        "sender_full_name": "Boxy [she/her]",
        "timestamp": 1645712947
    },
    {
        "content": "<p>Personally, I thought it was very helpful to have a more 'concrete' example of subtyping</p>",
        "id": 273108494,
        "sender_full_name": "Aaron Hill",
        "timestamp": 1645718374
    },
    {
        "content": "<p>I found it confusing because the animal examples dont actually feel like they relate back to lifetimes in any way</p>",
        "id": 273112094,
        "sender_full_name": "Boxy [she/her]",
        "timestamp": 1645719740
    },
    {
        "content": "<p>for example <code>'static</code> can be turned into _any_ lifetime but there is no equivelent for this in the animal/cat/dog/whatever exampels</p>",
        "id": 273112154,
        "sender_full_name": "Boxy [she/her]",
        "timestamp": 1645719765
    },
    {
        "content": "<p>and with the animal stuff everything can be turned into an animal, its like the opposite of how <code>'static</code> works <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 273112198,
        "sender_full_name": "Boxy [she/her]",
        "timestamp": 1645719792
    },
    {
        "content": "<p>I can see why a concrete example could be useful but it just didn't work for me because the animal stuff doesnt seem to nicely map onto lifetimes</p>",
        "id": 273112424,
        "sender_full_name": "Boxy [she/her]",
        "timestamp": 1645719884
    },
    {
        "content": "<p>Yeah my problem is that it never made sense as to why I needed to read the page that was being presented to me. The explanation using Animals was presented up front with no context, and by the time it finally got to lifetimes, nothing had stuck.</p>\n<p>The issue that mejrs' raised included this blog post that has some good points regarding this: <a href=\"https://viralinstruction.com/posts/defense/\">https://viralinstruction.com/posts/defense/</a></p>",
        "id": 273125567,
        "sender_full_name": "Conrad Ludgate",
        "timestamp": 1645725326
    },
    {
        "content": "<p>My original intention was to just restructure it to present the lifetime problem up front, but I realised that switching between lifetimes and animals got confusing quickly</p>",
        "id": 273125767,
        "sender_full_name": "Conrad Ludgate",
        "timestamp": 1645725398
    },
    {
        "content": "<p>I liked the original as well, reading it was the first time variance really clicked for me. The new one is definitely more directly applicable to rust, but I feel its a shame to lose the old examples</p>",
        "id": 273128479,
        "sender_full_name": "Alex Macleod",
        "timestamp": 1645726549
    },
    {
        "content": "<p>I wonder how much this relates to experience with OOP concepts. My background has very little OOP, so while I understand classes and inheritance, the concepts didn't feel natural to me. Especially since it _forced_ itself into rust as an abstract concept</p>",
        "id": 273129963,
        "sender_full_name": "Conrad Ludgate",
        "timestamp": 1645727197
    },
    {
        "content": "<p>I don't have much experience with really OOP designs, and I think I understand the ideas behind it pretty well but the animal analogies didn't really do much for me<br>\nI have trouble understanding how it relates to rust</p>",
        "id": 273157153,
        "sender_full_name": "mejrs",
        "timestamp": 1645741123
    }
]