[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"463652\">@John Naulty</span> That's a generous offer! #t-compiler/help may not be the best channel to get people's attention on this topic quickly. I'm going to move this over to #general and also point some people to it.</p>",
        "id": 264501698,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1639167187
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"182449\" href=\"/#narrow/stream/182449-t-compiler.2Fhelp/topic/OpenSSF.20MFA.20Hardware.20Donation.20to.20Critical.20OSS.20Projects\">#t-compiler/help &gt; OpenSSF MFA Hardware Donation to Critical OSS Projects</a> by <span class=\"user-mention silent\" data-user-id=\"239881\">Josh Triplett</span></p>",
        "id": 264501734,
        "sender_full_name": "Notification Bot",
        "timestamp": 1639167212
    },
    {
        "content": "<p>cc <span class=\"user-group-mention\" data-user-group-id=\"2943\">@T-infra</span></p>",
        "id": 264501755,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1639167230
    },
    {
        "content": "<p>I'm curious what counts as a contributor, since I've been helping out with project portable-simd a lot, and am a member, though not really by contributing much code yet. I don't have a hardware security token and would like one, though I'd expect there are better people to give the tokens to.</p>",
        "id": 264528689,
        "sender_full_name": "Jacob Lifshay",
        "timestamp": 1639182324
    },
    {
        "content": "<p>Likewise. I've contributed some to stdlib and the compiler and would be interested, but it's not like I'm a key person here; I have no \"special\" permissions such as approving PRs.</p>",
        "id": 264537926,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1639192822
    },
    {
        "content": "<p>If you want but don't get one now, any U2F token will probably work with GitHub and they can be had for $15-$30 in various places. And I think Google doesn't ship them everywhere in the world.</p>",
        "id": 264548871,
        "sender_full_name": "Laurențiu",
        "timestamp": 1639209656
    },
    {
        "content": "<p>My view here is that many \"key persons\" are able to bill that on their employer and if we want to encourage token usage, they should lobby their employer. I'd rather use this chance to give that to individuals and not build a ranking. While 15-30 may seem small, keeping away any cost from individual contributors is IMHO a good thing. In the end, finding a rule around this is probably not worth it for 10 items, so liberally giving them away to people expressing interest and maybe providing such an offer more often would be useful.</p>",
        "id": 264693135,
        "sender_full_name": "Florian Gilcher",
        "timestamp": 1639394935
    },
    {
        "content": "<p>Also keep in mind it does not matter what you have \"social permission\" to do, it matters what your account can technically do. Major changes require in RFC, but I have merge permissions on several repository's. If my account were stolen they would not have to make an RFC to do damage. (Personally I got a yubikey as a birthday gift a few years ago, so just using me as an example.) If you say have the ability to close issues, it would still be very disruptive for your compromised account to go around closing all of them.</p>",
        "id": 264721748,
        "sender_full_name": "Eh2406",
        "timestamp": 1639409035
    },
    {
        "content": "<p>well, i have merge permission on portable-simd</p>",
        "id": 264722272,
        "sender_full_name": "Jacob Lifshay",
        "timestamp": 1639409250
    },
    {
        "content": "<p>i prefer a yubikey if given the choice</p>",
        "id": 264722423,
        "sender_full_name": "Jacob Lifshay",
        "timestamp": 1639409308
    },
    {
        "content": "<p>I'm pretty big on using yubikeys for SSH and OpenPGP  for commit signing. It's not _that_ hard to setup and having all my key material safe made things a ton easier for me.</p>",
        "id": 264730311,
        "sender_full_name": "Florian Gilcher",
        "timestamp": 1639412323
    },
    {
        "content": "<p>I've had an U2F key for a while, but GitHub lets me enter a password instead, so that's a bit strange. Anyway, my point above is that if you want and can afford one, there's probably no reason to not get a token.</p>",
        "id": 264730605,
        "sender_full_name": "Laurențiu",
        "timestamp": 1639412454
    },
    {
        "content": "<p>The weird thing about GH is that it expect the second factor on second login, but uses just password for confirmation (e.g. changes and such). (Which, TBH, halfway makes sense - if your screen is unlocked and the key attached and unlocked, you may want to check the pw in all cases).</p>",
        "id": 264733326,
        "sender_full_name": "Florian Gilcher",
        "timestamp": 1639413571
    },
    {
        "content": "<p>Hey folks,<br>\nI see it might be hard to distinguish between 'maintainers' and 'contributors'.<br>\nThe idea is to improve the security posture of the project overall. I think it is clear why prioritization might go to 'maintainers', but at this point, the deadline for some of the coupon codes is approaching (12/31), and it would be wasteful to not give them out.<br>\nI am willing to work on a 'first come, first serve' basis, and we can figure out a more structured way to do this during future MFA Device giveaways (hopefully this happens again :) )</p>\n<p>So, one definitely should go to <span class=\"user-mention\" data-user-id=\"245610\">@Jacob Pratt</span> , for he helped me in DMs and requested one.<br>\nCan the people interested in getting a device please provide an e-mail address they can receive the coupon code at, as well as some form of proof they have contributed to any of these core rust projects.</p>\n<p>Thanks!</p>",
        "id": 264945624,
        "sender_full_name": "John Naulty",
        "timestamp": 1639525563
    },
    {
        "content": "<p>I'm on <a href=\"https://www.rust-lang.org/governance/teams/library\">https://www.rust-lang.org/governance/teams/library</a> under portable simd, my email is <a href=\"mailto:programmerjake@gmail.com\">programmerjake@gmail.com</a></p>",
        "id": 264947159,
        "sender_full_name": "Jacob Lifshay",
        "timestamp": 1639526580
    },
    {
        "content": "<p>Just to publicly say what I said in a DM, if there are 10+ others (there are ten tokens available) then I would rather they get the tokens than myself.</p>",
        "id": 264947311,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1639526676
    },
    {
        "content": "<p>if given the choice, i prefer a yubikey because it also supports gpg</p>",
        "id": 264947562,
        "sender_full_name": "Jacob Lifshay",
        "timestamp": 1639526849
    },
    {
        "content": "<p>iirc</p>",
        "id": 264947566,
        "sender_full_name": "Jacob Lifshay",
        "timestamp": 1639526856
    },
    {
        "content": "<p>Note that git itself now supports signing with SSH keys:</p>\n<p><a href=\"https://lore.kernel.org/git/xmqq8rxpgwki.fsf@gitster.g/\">https://lore.kernel.org/git/xmqq8rxpgwki.fsf@gitster.g/</a></p>\n<blockquote>\n<p>In addition to GnuPG, ssh public crypto can be used for object and<br>\n push-cert signing.  Note that this feature cannot be used with<br>\n ssh-keygen from OpenSSH 8.7, whose support for it is broken.  Avoid<br>\n using it unless you update to OpenSSH 8.8.</p>\n</blockquote>\n<p>I assume github will support that for verified commits in the near future.</p>",
        "id": 264948962,
        "sender_full_name": "The 8472",
        "timestamp": 1639527879
    },
    {
        "content": "<p>A little clarification:</p>\n<p>There's a category of tokens generally called \"security keys\" that just do WebAuthn / U2F. Those are mainly used for web logins. For instance, these are a great way to secure your GitHub account.</p>\n<p>As of OpenSSH 8.2 (<a href=\"https://www.openssh.com/txt/release-8.2\">https://www.openssh.com/txt/release-8.2</a>), a security key _can_ be used for SSH authentication using U2F challenges. Both client and server have be  &gt;8.2, and this isn't general purpose key storage, so I believe it can't be used for signing git commits.</p>\n<p>The Yubico Security Key Series (<a href=\"https://www.yubico.com/products/\">https://www.yubico.com/products/</a>) and the Google Titan are both in this category.</p>\n<p>Yubico also has the more expensive \"YubiKey 5 Series.\" Those have additional applets on them for GPG and PIV. The PIV applet allows you to generate and store a regular RSA or ECDSA key on the device; you can use it to store a \"normal\" SSH key on device. If you want to do commit signing I believe you need the 5 Series. I'm not sure from the OP whether the Yubikeys being offered are 5 Series or not. I'm guessing they're Security Keys. Either way, it's a great offer, thank you <span class=\"user-mention\" data-user-id=\"463652\">@John Naulty</span>.</p>\n<p>Also I'd definitely encourage anyone who wants one to just go for it; if we exhaust the supply from this offer I'm very happy to help source more. Security keys are awesome!</p>",
        "id": 264957492,
        "sender_full_name": "jsha",
        "timestamp": 1639535133
    },
    {
        "content": "<p>I just ordered a free YubiKey 5, thanks <span class=\"user-mention\" data-user-id=\"463652\">@John Naulty</span> and everyone else who was involved!</p>",
        "id": 265957042,
        "sender_full_name": "Jacob Lifshay",
        "timestamp": 1640296882
    },
    {
        "content": "<p>Likewise. Thank you <span class=\"user-mention\" data-user-id=\"463652\">@John Naulty</span> and all others involved.</p>",
        "id": 266015593,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1640368262
    },
    {
        "content": "<p>Coupon codes went out for those who got one.</p>\n<p>For those who DID NOT get one, have faith (and keep on contributing to OSS <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span> ) , I think OpenSSF will be helping orchestrate another giveaway in 2022 (hopefully)</p>",
        "id": 266019276,
        "sender_full_name": "John Naulty",
        "timestamp": 1640372986
    },
    {
        "content": "<p>I received my Yubikey in the mail today. Thank you <span class=\"user-mention\" data-user-id=\"463652\">@John Naulty</span> and everyone else.</p>",
        "id": 266748258,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1641251717
    },
    {
        "content": "<p>got mine today</p>",
        "id": 267155259,
        "sender_full_name": "Jacob Lifshay",
        "timestamp": 1641536142
    },
    {
        "content": "<p>Incredibly belatedly, mine finally lives.</p>",
        "id": 269536675,
        "sender_full_name": "Jubilee",
        "timestamp": 1643270422
    },
    {
        "content": "<p>Extremely belatedly, mine now lives as well. Thank you.</p>",
        "id": 271809226,
        "sender_full_name": "fee1-dead",
        "timestamp": 1644835227
    }
]