[
    {
        "content": "<p>Now that we can choose to build dependencies with a different optimization level than the current crate, would it make sense for the playground to build all dependencies in release mode all the time?</p>",
        "id": 212250084,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1601859893
    },
    {
        "content": "<p>they should build with a higher opt-level perhaps, but still with debug_assertions on or off according to the user's build setting</p>",
        "id": 212254446,
        "sender_full_name": "Lokathor",
        "timestamp": 1601867498
    },
    {
        "content": "<p>That'd be the most unfortunate outcome from my perspective, sadly. I was hoping I could get away with building the dependencies once instead of twice. That would mean build them twice but with a slower build both times <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 212300550,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1601905497
    },
    {
        "content": "<p>meh, just do opt+debug_assertions and call it a day</p>",
        "id": 212321131,
        "sender_full_name": "cuviper",
        "timestamp": 1601914037
    },
    {
        "content": "<p>you're not building production code here</p>",
        "id": 212321145,
        "sender_full_name": "cuviper",
        "timestamp": 1601914045
    },
    {
        "content": "<p>The only problem there would be people who use playground to look at optimized ASM, but maybe they shouldn't be doing that with dependencies anyway.</p>",
        "id": 212327577,
        "sender_full_name": "scottmcm",
        "timestamp": 1601917158
    },
    {
        "content": "<p>There's also the use case of comparing debug and release ASMs and sometimes even behavior (usually when there's a compiler bug or UB involved)<br>\nBut I personally go to godbolt in these cases, and you also just talk about deps but it might even make things weirder for those use cases<br>\n(and godbolt doesn't have dependencies support AFAIK)</p>\n<p>EDIT: I realize now that it sounds similar to what <span class=\"user-mention\" data-user-id=\"125270\">@scottmcm</span> but I'm more centered around different behavior in debug VS release, not just asm</p>",
        "id": 212366398,
        "sender_full_name": "Elichai Turkel",
        "timestamp": 1601938562
    }
]