[
    {
        "content": "<p>Hello! I was looking at the API for the entry related items in std::collections::HashMap and saw some inconsistencies and room for improvement. I threw together a crate of what I think this API should look like, and was hoping people would be interested in taking a look!</p>",
        "id": 275318895,
        "sender_full_name": "Mason Boeman",
        "timestamp": 1647307250
    },
    {
        "content": "<p>Existing discussion:</p>\n<p><a href=\"https://github.com/rust-lang/rust/issues/65225\">https://github.com/rust-lang/rust/issues/65225</a></p>",
        "id": 275318907,
        "sender_full_name": "Mason Boeman",
        "timestamp": 1647307267
    },
    {
        "content": "<p>Repo:</p>\n<p><a href=\"https://github.com/maboesanman/InPlace\">https://github.com/maboesanman/InPlace</a></p>",
        "id": 275318920,
        "sender_full_name": "Mason Boeman",
        "timestamp": 1647307298
    },
    {
        "content": "<p>Docs:</p>\n<p><a href=\"https://maboesanman.github.io/InPlace/in_place/\">https://maboesanman.github.io/InPlace/in_place/</a></p>",
        "id": 275318934,
        "sender_full_name": "Mason Boeman",
        "timestamp": 1647307317
    },
    {
        "content": "<p>On the topic of Entry, I wish it didn't require owning the key, but instead accepted a <code>Cow&lt;'_, KeyRef&gt;</code> somehow.<br>\nIt only needs ownership in the event that the entry is vacant, so requiring ownership all the time might be wasteful, but always forcing a clone inside is also not great because you might already have ownership that you no longer need</p>",
        "id": 275334353,
        "sender_full_name": "Conrad Ludgate",
        "timestamp": 1647326036
    },
    {
        "content": "<p>I was trying to use ToOwned, among a few other ideas, but ToOwned doesn’t actually do what I want. As of now I have two functions on the InPlace trait for getting entries: one that takes key by value, and one that takes it by reference and clones if needed. I’m not a huge fan of that approach though.</p>",
        "id": 275337617,
        "sender_full_name": "Mason Boeman",
        "timestamp": 1647329452
    },
    {
        "content": "<p>I’ve made a bunch of updates to my mock api! Now it really feels like the correct abstraction over data structures for manipulating data in them. Without having to re-query</p>\n<p>Check out the changes in the repo:</p>\n<p><a href=\"https://github.com/maboesanman/InPlace\">https://github.com/maboesanman/InPlace</a></p>",
        "id": 275614718,
        "sender_full_name": "Mason Boeman",
        "timestamp": 1647501698
    },
    {
        "content": "<p>My GitHub actions deployment for the docs is borked so unfortunately I’ll have to fix that tomorrow, but if you’re curious about my take on the Entry API for hashmap and btreemap (and LinkedList and [T]). I’ll be adding tons of documentation and writing a proper RFC shortly</p>",
        "id": 275614941,
        "sender_full_name": "Mason Boeman",
        "timestamp": 1647501903
    },
    {
        "content": "<p>I cant find you links at the moment, but there have bean (pre-)RFC's about this in the past. The <a href=\"https://docs.rs/hashbrown/latest/hashbrown/raw/index.html\">https://docs.rs/hashbrown/latest/hashbrown/raw/index.html</a> is one of the things that came out of it. Please make shore to find them and link them in your RFC. How dose yours address all of the concerns that have come up on previous (pre-)RFC's.</p>",
        "id": 275686116,
        "sender_full_name": "Eh2406",
        "timestamp": 1647534785
    }
]