[
    {
        "content": "<p>Which language can replace Java?</p>\n<p><a href=\"https://www.quora.com/Which-language-can-replace-Java\" target=\"_blank\" title=\"https://www.quora.com/Which-language-can-replace-Java\">https://www.quora.com/Which-language-can-replace-Java</a></p>\n<p>There are 3 questions of this sort. I gave a high level response to this a manager can decode. However a more authoritative answer is recommended here.</p>\n<p>Anyway here was my response:</p>\n<p>As of today Web Assembly frequently used with JavaScript is a compiled format that runs in the browser.</p>\n<p>However you can now compile to run outside the browser (disk access) and so this greatly expands the use cases.<br>\nThat isn't it though. RUST, used by Mozilla is used for OS, IoT and high level applications development. It runs as fast as C.</p>\n<p>Catch this though. It has zero cost abstractions and no garbage collect. Yup. No garbage collect, no dispose.</p>\n<p>Best of all. You know of the multibillion dollar Nulls problem and memory safety issues. 70% of all bugs. IT HAS NO NULLS. Unless you need them. While still allowing dynamic environments and thus C, C++, Python, Java (etc) and native APIs can be used.</p>\n<p>It is strongly typed and uses lifetimes for objects which requires a learning curve and a bit more upfront effort but not much. It is difficult to create buggy code as the compiler rejects it.</p>\n<p>There is no other language that comes close and none that out perform it. It is the future.<br>\nEND QUOTE.</p>\n<p>I would suggest a few of you head over there and answer a few questions. Terrorists banned from your community forum are generally not considered authoritative. <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 182258095,
        "sender_full_name": "David G. Horsman",
        "timestamp": 1575152045
    },
    {
        "content": "<p>Lol. My new account is on hold. The old one blocked as spam. I can always get answers and change identity, I just don't bother.  We should be friends. Or not... You might block all these accounts and do a proper job of it. Who cares.</p>",
        "id": 182258695,
        "sender_full_name": "David G. Horsman",
        "timestamp": 1575153296
    }
]