[
    {
        "content": "<p>Does anyone know where the libs team hosts their discussions? I couldn't find a <code>t-libs</code> channel on Discord. There is discussions here for stdarch and the allocators WG, but I couldn't find a general channel ala <a class=\"stream\" data-stream-id=\"213817\" href=\"/#narrow/stream/213817-t-lang\">#t-lang</a>.</p>",
        "id": 182096988,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1574936351
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"219696\">@XAMPPRocky</span> they are on irc/matrix</p>",
        "id": 182102179,
        "sender_full_name": "DPC",
        "timestamp": 1574941597
    },
    {
        "content": "<p>I would need more information than that to actually find them.</p>",
        "id": 182104022,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1574943521
    },
    {
        "content": "<p>#rust-libs on mozilla's servers</p>",
        "id": 182105302,
        "sender_full_name": "lqd",
        "timestamp": 1574944894
    },
    {
        "content": "<p>They don't use IRC anymore AFAICT.</p>",
        "id": 182118596,
        "sender_full_name": "gnzlbg",
        "timestamp": 1574956011
    },
    {
        "content": "<p>Most of them are here on zulip, but essentially they just use issues tagged with T-libs, @rust-lang/libs, etc. to communicate. There are also no meetings.</p>",
        "id": 182118633,
        "sender_full_name": "gnzlbg",
        "timestamp": 1574956051
    },
    {
        "content": "<p>All of them read <a href=\"http://internals.rust-lang.org\" target=\"_blank\" title=\"http://internals.rust-lang.org\">internals.rust-lang.org</a>, so you can open a new libs thread there as well.</p>",
        "id": 182118702,
        "sender_full_name": "gnzlbg",
        "timestamp": 1574956088
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"132920\">@gnzlbg</span> I find this a bit concerning to be honest. Every other team has a dedicated discussion forum, both for people to come ask the teams questions and for members to discuss topics, having no meetings seems especially odd given that there's over 600 open issues and PRs tagged with the libs team and there seems to be no form of triage, even the community team has monthly meetings. Both these aspects makes the libs team appear overly closed off compared to every other team in terms of participation.</p>",
        "id": 182296857,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1575227908
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"219696\">@XAMPPRocky</span> The libs team is more bandwidth-limited than most others currently -- a sync communication channel requires non-zero amounts of effort to maintain; if you need something specific then I can reach out if it helps and try and connect you with someone.</p>",
        "id": 182297001,
        "sender_full_name": "simulacrum",
        "timestamp": 1575228125
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> I don't mean a sync channel, I mean an async channel like a stream in zulip or a channel in discord. I would accept being bandwidth limited more if there was a clear way for people who are not in the libs team to help with that bandwidth constraint, however that is not the case so bandwidth being limited is a self fulfilling prophecy, people don't know how to participate and help, so no one does, so there's only a few individuals who can.</p>",
        "id": 182297147,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1575228397
    },
    {
        "content": "<p>It is a known problem and one that is on core team's mind for something we want to solve. I agree with you that the current situation is not ideal.</p>",
        "id": 182297158,
        "sender_full_name": "simulacrum",
        "timestamp": 1575228444
    },
    {
        "content": "<p>(it is my impression that an async channel -- e.g. Discord/Zulip -- is at this point unlikely to be super helpful, either)</p>",
        "id": 182297163,
        "sender_full_name": "simulacrum",
        "timestamp": 1575228471
    },
    {
        "content": "<p>I don't think a channel would be the sole solution to this problem. The solution is to get more people involved, and in order to organise that kind of effort you need to place to communicate.</p>",
        "id": 182297274,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1575228619
    },
    {
        "content": "<p>I feel like you're not wrong, but we currently are not at the point where we're ready to get more people involved, etc.</p>",
        "id": 182297485,
        "sender_full_name": "simulacrum",
        "timestamp": 1575229042
    },
    {
        "content": "<p>Okay, but what do we need to do get to the point that people feel like we're ready to get more people involved? That answer is dissatisfying to me because it feels like a stonewall. Of course I know, and don't expect you personally to be able to answer this question, but there has to be some way to make actionable progress in this area.</p>",
        "id": 182297978,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1575229805
    },
    {
        "content": "<p>I think time, primarily, and probably some internal discussions -- I agree it's a stonewall, it's \"intended\" to be so, I'm afraid. I'm not really sure I can offer more guidance and we're heavily bandwidth limited right now</p>",
        "id": 182298387,
        "sender_full_name": "simulacrum",
        "timestamp": 1575230570
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"219696\">@XAMPPRocky</span> I don't think that's a problem, every team chooses its own communication channels and what works best for the team.  The libs-team chooses to use github for everything, and I think that's quite approachable. The barrier of entry is definitely lower than requiring Zulip, Discord, or IRC.</p>",
        "id": 182324244,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575275498
    },
    {
        "content": "<p>Also it is not true that there is no progress in the issues tagged with libs-team, I regularly see FCPs being opened, discussions happening, and progress being made. You can check the FCPbot website to know what's being worked on right now.</p>",
        "id": 182324326,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575275592
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"132920\">@gnzlbg</span> GitHub is not a communication channel, unless there was a libs-team repo like how other teams and working groups use GitHub, we would not recommend people to ask their libs team questions by filing issues on <code>rust-lang/rust</code> for example. I never said there was no progress on T-libs issues, I said there's no triage so what issues do make progress feels arbitrary (Of course this is  not a problem that's unique to the libs team, but doesn't make it less of a problem.) Teams are free to organise however they want, however it's important that, that is done in an open fashion that allows for new contributors and team members. Through that lens the libs is probably the most closed team we have.</p>",
        "id": 182326504,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1575278003
    },
    {
        "content": "<p>IIUC the way triage works is, if a team member thinks there should be progress in an issue, either they push the issue forward, of it it is ready, then FCP it.</p>\n<p>If any user thinks an issue can make progress, they just ping the libs team. So far, they have been very responsive when I've pinged them.</p>",
        "id": 182326568,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575278059
    },
    {
        "content": "<blockquote>\n<p>we would not recommend people to ask their libs team questions by filing issues on rust-lang/rust for example.</p>\n</blockquote>\n<p>That's pretty much how I understand this works for this particular team. Maybe they need a repo documenting their process (how to contact them, raise issues to their attention, ask questions, etc.), but I don't think there is anything intrinsically bad about their process per se.</p>",
        "id": 182326591,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575278089
    },
    {
        "content": "<p>If you want a specific example of how the current process has failed, you can look at <a href=\"https://github.com/rust-lang/rfcs/issues/1937\" target=\"_blank\" title=\"https://github.com/rust-lang/rfcs/issues/1937\">rfc#1937</a> and the fact that <code>Termination</code> requires <code>Debug</code> and not <code>Display</code>. There's been no real retrospective or change in the process as result of this and I'm not confident that this kind of mistake won't happen again.</p>",
        "id": 182334510,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1575284505
    },
    {
        "content": "<p>I don't see that as a failure in the process, but rather as the process working as expected.</p>",
        "id": 182334935,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575284896
    },
    {
        "content": "<p>The <code>Termination</code> requirement of <code>Debug</code> went through the RFC process IIRC (in the tracking issue), and that was stabilized.</p>",
        "id": 182334948,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575284919
    },
    {
        "content": "<p>Only after stabilization people started a discussion of changing that to <code>Display</code>, but that's a backward incompatible change.</p>",
        "id": 182334963,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575284937
    },
    {
        "content": "<p>Nobody has submitted an RFC that's backward compatible and fixes the issue.</p>",
        "id": 182335110,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575285080
    },
    {
        "content": "<p>The outcome of this is obviously not good, but the only thing that would have helped is if more people would have participated in the RFC review, or experimented with it on nightly and gave feedback _before_ stabilization.</p>",
        "id": 182335127,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575285121
    },
    {
        "content": "<p>The compiler and lang teams have the exact same problem (lack of users participating in the RFC process, or testing on nightly), with the same outcome (issues being discovered after stabilization).</p>",
        "id": 182335375,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575285395
    },
    {
        "content": "<p>For example, the RFC that you point to was mainly handled <a href=\"https://github.com/rust-lang/rust/issues/48854\" target=\"_blank\" title=\"https://github.com/rust-lang/rust/issues/48854\">by the lang-team</a>, which had a communication channel in Discord at the time. So its unclear to me how adding a similar communication channel for the libs team would prevent this particular issue.</p>",
        "id": 182335590,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575285612
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"132920\">@gnzlbg</span> If you read the tracking issue (which is hard since most of it is long and hidden), the people that brought up the issue are <a href=\"https://github.com/rust-lang/rust/issues/43301#issuecomment-388575730\" target=\"_blank\" title=\"https://github.com/rust-lang/rust/issues/43301#issuecomment-388575730\">libs team members</a> not external members in the community. When you have no easy communication and no active triage, you'll always be reactive to issues not proactive which is the actual problem I'm talking about, not the outcome of this particular rfc.</p>",
        "id": 182337699,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1575287842
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"219696\">@XAMPPRocky</span> pinging the libs team on that issue would have been as easy as tagging the issue T-libs, or writing \"@rust-lang/libs\"</p>",
        "id": 182340331,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575290232
    },
    {
        "content": "<p>yet the teams that were assigned to and signed on that feature were the lang and dev teams</p>",
        "id": 182340376,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575290265
    },
    {
        "content": "<p>even if the libs team had a more active triage process, meetings, etc. that process would only apply to issues for which the libs team is responsible</p>",
        "id": 182340529,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575290360
    },
    {
        "content": "<p>and that particular feature wasn't one of them</p>",
        "id": 182340536,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575290366
    },
    {
        "content": "<p>also, during that time, the libs team was using IRC for communication, so they had an active communication channel, and that did not help avoid this because the process failed somewhere else</p>",
        "id": 182340674,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575290480
    },
    {
        "content": "<p>In this particular case, the RFC was tagged T-libs and T-lang, but the tracking issue only T-lang and T-compiler, and the stabilization was signed off by T-lang and T-devs-tools.</p>",
        "id": 182340934,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575290663
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"219696\">@XAMPPRocky</span>  you are not the only facing this. I've faced it a bottleneck while triaging as well. Trying to find ways we can improve this situation in 2020</p>",
        "id": 182358148,
        "sender_full_name": "DPC",
        "timestamp": 1575301629
    },
    {
        "content": "<p>It's a \"well known\" gap in the process.</p>",
        "id": 182376986,
        "sender_full_name": "Lokathor",
        "timestamp": 1575312870
    },
    {
        "content": "<p>people who care to interact with T-libs almost immediately hit the problem</p>",
        "id": 182377025,
        "sender_full_name": "Lokathor",
        "timestamp": 1575312900
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 182439064,
        "sender_full_name": "DPC",
        "timestamp": 1575373279
    },
    {
        "content": "<blockquote>\n<p>you are not the only facing this. I've faced it a bottleneck while triaging as well.</p>\n</blockquote>\n<p>What issues have you run on? @rust-lang/libs works within the rust-lang org at least.</p>",
        "id": 182445949,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575378436
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"132920\">@gnzlbg</span> only team members can ping teams though</p>",
        "id": 182461164,
        "sender_full_name": "RalfJ",
        "timestamp": 1575387692
    },
    {
        "content": "<p>FWIW, my personal experience is that I have to ping specific lib team members; pinging the entire team sometimes results in no reaction at all.</p>",
        "id": 182461279,
        "sender_full_name": "RalfJ",
        "timestamp": 1575387746
    },
    {
        "content": "<p>Ah, I thought everyone could just ping the libs team whenever an issue pops up.</p>",
        "id": 182461566,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575387904
    },
    {
        "content": "<p>If a ping to the team is the preferred way of interacting with the team, anyone should be able to ping them.</p>",
        "id": 182461631,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575387951
    },
    {
        "content": "<blockquote>\n<p>anyone should be able to ping them</p>\n</blockquote>\n<p>good luck convincing github</p>",
        "id": 182462414,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1575388353
    },
    {
        "content": "<p>put a bot on the team and ping the bot and it pings the team then.</p>\n<p>or the team should get a better communication channel.</p>",
        "id": 182488134,
        "sender_full_name": "Lokathor",
        "timestamp": 1575402751
    },
    {
        "content": "<p>Not being able to ping teams on github if you are not on a team is a general problem.</p>",
        "id": 182506387,
        "sender_full_name": "gnzlbg",
        "timestamp": 1575413811
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224471\">@Lokathor</span> You don't need a bot, you can just ping the entire team but then it happens in many teams that people see the team ping and think \"somebody else will take care of it\" so it just passes around <span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span></p>",
        "id": 182506790,
        "sender_full_name": "DPC",
        "timestamp": 1575414087
    },
    {
        "content": "<p>you can't if you're outside rust-lang</p>",
        "id": 182506820,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1575414114
    },
    {
        "content": "<p>Yes I meant for someone from the organisation</p>",
        "id": 182511260,
        "sender_full_name": "DPC",
        "timestamp": 1575417454
    },
    {
        "content": "<blockquote>\n<p>They don't use IRC anymore AFAICT.</p>\n</blockquote>\n<p>That wasn’t accurate. <code>#rust-libs</code> on IRC was still the appropriate channel, even it’s low-traffic. Anyway we’re moving to Zulip: <a href=\"https://internals.rust-lang.org/t/the-library-team-is-moving-from-irc-to-zulip/11598\" target=\"_blank\" title=\"https://internals.rust-lang.org/t/the-library-team-is-moving-from-irc-to-zulip/11598\">https://internals.rust-lang.org/t/the-library-team-is-moving-from-irc-to-zulip/11598</a></p>",
        "id": 185224556,
        "sender_full_name": "Simon Sapin",
        "timestamp": 1578585131
    }
]