[
    {
        "content": "<p>When someone requests changes on my PR in github, and I push new commits that I believe address those concerns, am I expected to hit the \"resolve conversation\" button? I've been doing so in an attempt to indicate that I believe the concern to be addressed, but am now worrying that this may be a bit of a faux pas and it is actually expected that the person requesting the changes be allowed to make the decision of whether or not to mark as resolved</p>",
        "id": 276134678,
        "sender_full_name": "Jake",
        "timestamp": 1647913501
    },
    {
        "content": "<p>I've been doing both. Largely marking them myself for nits and other minutiae which has an obvious solution and I'm pretty sure I've resolved. I leave it unresolved and maybe add a comment if the topic is non-trivial for any reason.</p>",
        "id": 276135763,
        "sender_full_name": "nagisa",
        "timestamp": 1647914713
    },
    {
        "content": "<p>I often review PRs later for context on stuff so I often leave things \"unresolved\" in the UI sense because I want to be able to see them... but only if they matter, so yeah, same. Nits I just close.</p>",
        "id": 276137395,
        "sender_full_name": "Jubilee",
        "timestamp": 1647916631
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"123586\">nagisa</span> <a href=\"#narrow/stream/122651-general/topic/Typical.20GitHub.20Process/near/276135763\">said</a>:</p>\n<blockquote>\n<p>I've been doing both. Largely marking them myself for nits and other minutiae which has an obvious solution and I'm pretty sure I've resolved. I leave it unresolved and maybe add a comment if the topic is non-trivial for any reason.</p>\n</blockquote>\n<p>Likewise. If someone reports something highly subjective, and I haven't already had a comment exchange with them to ask if something would work, then I'll push something and ask them. But if something seems like a largely objective request and I've addressed it, I'll mark it resolved. It can always be <em>un</em>-resolved if they disagree.</p>",
        "id": 276139136,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647918733
    },
    {
        "content": "<p>And that helps with using it as a todo list.</p>",
        "id": 276139139,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647918741
    },
    {
        "content": "<p>interesting to see how others deal with this, I'm going to reconsider what I do :)</p>",
        "id": 276233213,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1647973171
    },
    {
        "content": "<p>I often just mark things as resolved as soon as I think are resolved, expecting that the reviewer will check things again and judge if more iterations are needed or if it's good to go</p>",
        "id": 276233357,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1647973216
    },
    {
        "content": "<p>i feel it's better to leave it to the reviewer to mark it as resolved</p>",
        "id": 276247766,
        "sender_full_name": "DPC",
        "timestamp": 1647979878
    },
    {
        "content": "<p>I'm firmly in the \"PR author does the resolving\" camp <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 276271338,
        "sender_full_name": "nnethercote",
        "timestamp": 1647993962
    },
    {
        "content": "<p>I resolve conversation if I feel I've addressed their concerns. They then re-review and can open additional comments if necessary</p>",
        "id": 276297467,
        "sender_full_name": "Conrad Ludgate",
        "timestamp": 1648021593
    },
    {
        "content": "<p>Imo it depends on multiple factors. How trivial is the feedback and fix? Is the diff outdated after refactoring? Was it the reviewer who made the comment?</p>",
        "id": 276309363,
        "sender_full_name": "The 8472",
        "timestamp": 1648029504
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"120989\">nnethercote</span> <a href=\"#narrow/stream/122651-general/topic/Typical.20GitHub.20Process/near/276271338\">said</a>:</p>\n<blockquote>\n<p>I'm firmly in the \"PR author does the resolving\" camp :)</p>\n</blockquote>\n<p>In principle I agree with this, and similarly that issue submitters should confirm that a change fixes their issue. But in practice, it seems to scale better to go ahead and resolve things, <em>because</em> resolving something is trivially reversible.</p>",
        "id": 276358025,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1648051884
    }
]