[
    {
        "content": "<p>I recently made <a href=\"https://github.com/davidtwco/dotfiles/blob/master/.local/bin/workman\" target=\"_blank\" title=\"https://github.com/davidtwco/dotfiles/blob/master/.local/bin/workman\">a small bash script</a> that I've been using to manage my working directories and keep them up-to-date. Thought I'd drop a link here in case anyone is interested.</p>\n<p>In my workflow, I have a <code>projects/rust</code> directory with my <code>config.toml</code> in it. I then have a <code>projects/rust/workdirs</code> directory containing my working copies of <code>rust-lang/rust</code> (around nine at the moment), in directories <code>rust0</code> through <code>rust8</code>. Each working directory symlinks the <code>config.toml</code> from the parent directory. When I start on a new issue, I pick a working directory, check out a branch in it, and leave it assigned to that issue until the PR lands - that way I can always go back and respond to feedback quickly.</p>\n<p>With this script, I define a <code>.workman_config</code> file alongside my <code>config.toml</code> which contains the project name, git urls (both upstream and my fork) and commands to run. After that, I can run..</p>\n<ul>\n<li><code>workman new</code> and it'll create a new working directory with the next index, clone from my fork, add the upstream remote, pull from that, symlink the <code>config.toml</code>,  do a <code>x.py clean</code> and do a <code>x.py build</code>. </li>\n<li><code>workman assign issue-29383</code> which finds an unassigned directory, checks out a branch and opens a tmux session. </li>\n<li><code>workman unassign isue-29383</code> (when I'm done with a issue) which finds that assigned directory, checks out master, pulls from upstream, pushes that to my fork's master branch, runs <code>x.py clean</code> and kills any tmux sessions.</li>\n<li><code>workman list</code> to list all the directories.</li>\n<li><code>workman update</code> to go through each working directory that is unassigned, pull from upstream, push to my fork, do a <code>x.py clean</code> and <code>x.py build</code>. I run this command in a cronjob every night so that I've always got up-to-date working directories when I need them.</li>\n</ul>\n<p>It also will look for a file in the working directory that will allow it to update the directory, but not assign it. I use this to keep a unoptimized build directory that takes longer to build but I can use with a debugger better.</p>\n<p>It can share the same <code>workdirs</code> directory for multiple projects. I currently use it with <code>rust</code>, <code>rust-analyzer</code> and <code>compiler-team</code>, each with their own config file and a zsh alias for <code>workman</code> that loads the right config file.</p>",
        "id": 160277023,
        "sender_full_name": "davidtwco",
        "timestamp": 1552039416
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116107\">@davidtwco</span> do you know \"git worktree\"? that way you can have multiple check-outs of the same repo, sharing repo configuration and git object store. (unfortunately, submodules are not shared though.)</p>",
        "id": 160277325,
        "sender_full_name": "RalfJ",
        "timestamp": 1552039779
    },
    {
        "content": "<p>That won't affect needing to rebuild when I checkout other branches though, right?</p>",
        "id": 160277433,
        "sender_full_name": "davidtwco",
        "timestamp": 1552039870
    },
    {
        "content": "<p>Huh, maybe it would.</p>",
        "id": 160277456,
        "sender_full_name": "davidtwco",
        "timestamp": 1552039913
    },
    {
        "content": "<p>Oh well, figured it was likely that there'd be a far easier way, particularly after I'd put the effort into writing that script.</p>",
        "id": 160277537,
        "sender_full_name": "davidtwco",
        "timestamp": 1552040003
    },
    {
        "content": "<p>I don't think it changes much, and your script does way more</p>",
        "id": 160277543,
        "sender_full_name": "RalfJ",
        "timestamp": 1552040022
    },
    {
        "content": "<p>but it'd save you some cloning and pulling -- which I guess doesn't matter much for you because of the cron job. I like that idea but my machine is usually turned off at night, so I can't copy it :/</p>",
        "id": 160277597,
        "sender_full_name": "RalfJ",
        "timestamp": 1552040058
    },
    {
        "content": "<p>I could probably make the script use worktrees instead of the cloning and pulling. But still use this to handle the resetting and updating of working directories.</p>",
        "id": 160277606,
        "sender_full_name": "davidtwco",
        "timestamp": 1552040077
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116107\">@davidtwco</span> thanks for sharing. do you use something to keep track of changes to your <code>config.toml</code> too?</p>",
        "id": 160298892,
        "sender_full_name": "ange",
        "timestamp": 1552059123
    },
    {
        "content": "<p>I don't, I just copy it from machine to machine.</p>",
        "id": 160298932,
        "sender_full_name": "davidtwco",
        "timestamp": 1552059167
    },
    {
        "content": "<p>I wish more people would share tips and tricks they're using in their setup. I'm sure I'm not the first person who cooked up a script to normalize away insignificant differences in debug logs, or wanted to grep and then do a vimdiff of pretty-printed (<code>{:#?}</code>) structures that extend over multiple lines</p>",
        "id": 160299308,
        "sender_full_name": "ange",
        "timestamp": 1552059373
    },
    {
        "content": "<p>(fwiw <a href=\"https://github.com/aoikonomopoulos/contgrep/\" target=\"_blank\" title=\"https://github.com/aoikonomopoulos/contgrep/\">https://github.com/aoikonomopoulos/contgrep/</a>)</p>",
        "id": 160299369,
        "sender_full_name": "ange",
        "timestamp": 1552059431
    },
    {
        "content": "<p>I really should be using git-worktree (or at least investigating it)</p>",
        "id": 160579478,
        "sender_full_name": "pnkfelix",
        "timestamp": 1552404028
    },
    {
        "content": "<p>Just curious, is there a reason why you are creating new projects instead of creating new branches every time? It might make things easier</p>",
        "id": 160617592,
        "sender_full_name": "DPC",
        "timestamp": 1552430484
    },
    {
        "content": "<p>I don't know if the question was addressed to me, but: if our build times were instantaneous, then maybe I could imagine just keeping work-in-progress on different branches and switching between branches as necessary</p>",
        "id": 160619700,
        "sender_full_name": "pnkfelix",
        "timestamp": 1552432444
    },
    {
        "content": "<p>but since it takes a long time to bootstrap a <code>rustc</code> build, i tend to make separate clones of the repo, so that the work-in-progress on that project is kept along side its most recent build.</p>",
        "id": 160619769,
        "sender_full_name": "pnkfelix",
        "timestamp": 1552432546
    },
    {
        "content": "<p>Addressed if to David but it's fine that you answered. Yeah makes sense if you build rustc in parallel</p>",
        "id": 160634267,
        "sender_full_name": "DPC",
        "timestamp": 1552451416
    },
    {
        "content": "<p>Exactly what <span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span> said.</p>",
        "id": 160641012,
        "sender_full_name": "davidtwco",
        "timestamp": 1552461176
    },
    {
        "content": "<p>Hm, I tried git worktrees but didn't find them useful.<br>\nFirst, multiple builds eat all the space on my SSD.<br>\nSecond, I usually start any work with rebase on master so I have to build anyway, and the build from <em>some rustc or std crate changed during rebase</em> to <code>test --stage 1 src/test/ui --test-args something</code> is only few minutes.<br>\nAfter that I usually build multiple times anyway to test intermediate changes, so the initial build time is amortized.</p>",
        "id": 160652284,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1552473798
    },
    {
        "content": "<p>So, branches all the way.</p>",
        "id": 160652431,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1552473922
    },
    {
        "content": "<blockquote>\n<p>Just curious, is there a reason why you are creating new projects instead of creating new branches every time? It might make things easier</p>\n</blockquote>\n<p>one thing I will admit that is <em>bad</em> about creating new projects rather than creating branches in the same working directory: I'm pretty sure it makes <code>ccache</code> much less effective. (I am currently assuming there are absolute paths ending up in the intermediate build products for LLVM, which makes the ccache unable to be shared between projects. If this assumption is incorrect, though, then I do not know why I am observing such a low hit rate for my set up.)</p>",
        "id": 161752925,
        "sender_full_name": "pnkfelix",
        "timestamp": 1553600695
    },
    {
        "content": "<p>For anyone who uses <code>workman</code> (cc <span class=\"user-mention\" data-user-id=\"124288\">@oli</span>), I've just added experimental git-worktree support (it's off by default as there's no nice way to migrate to it) and a remove subcommand:</p>\n<p><a href=\"https://github.com/davidtwco/dotfiles/commit/bffe3f90cd8bce28847d6383c3a9e969215ca50a\" target=\"_blank\" title=\"https://github.com/davidtwco/dotfiles/commit/bffe3f90cd8bce28847d6383c3a9e969215ca50a\">https://github.com/davidtwco/dotfiles/commit/bffe3f90cd8bce28847d6383c3a9e969215ca50a</a></p>",
        "id": 166437162,
        "sender_full_name": "davidtwco",
        "timestamp": 1558690900
    },
    {
        "content": "<p>perfect timing, I was just about to start setting up workman in a new environment</p>",
        "id": 166451018,
        "sender_full_name": "oli",
        "timestamp": 1558703833
    },
    {
        "content": "<p>git-worktree is strange in that it doesn't allow a branch to be checked out in more than one working directory, so workman keeps the unassigned with a detached HEAD which <em>should</em> be updated with master. There might be a bug or two to work out around that.</p>",
        "id": 166452771,
        "sender_full_name": "davidtwco",
        "timestamp": 1558704957
    },
    {
        "content": "<p>Or rather, it isn't strange, it's just one place where it doesn't quite work how workman would like it to.</p>",
        "id": 166452879,
        "sender_full_name": "davidtwco",
        "timestamp": 1558705012
    },
    {
        "content": "<p>While I am for the third time in 2 days waiting for LLVM to compile, which takes forever... is there a way to share the compiled LLVM across working directories? Do you usually do that?</p>",
        "id": 167666861,
        "sender_full_name": "RalfJ",
        "timestamp": 1560026530
    },
    {
        "content": "<p>alternatively if I can make it not build 3 dozens backends but only x86, that might also save some time^^</p>",
        "id": 167666867,
        "sender_full_name": "RalfJ",
        "timestamp": 1560026573
    },
    {
        "content": "<p>technically there is <code>ccache</code> (you can enable it in <code>config.toml</code>), but it doesn't seem to work across working dirs</p>",
        "id": 167666880,
        "sender_full_name": "oli",
        "timestamp": 1560026608
    },
    {
        "content": "<p>theoretically you can copy/symlink LLVM directory but... no idea if that'll actually work</p>",
        "id": 167667407,
        "sender_full_name": "simulacrum",
        "timestamp": 1560027459
    },
    {
        "content": "<p>you can easily change targets built for llvm</p>",
        "id": 167676912,
        "sender_full_name": "nagisa",
        "timestamp": 1560043734
    },
    {
        "content": "<p>but that doesn’t really reduce the llvm build time that much</p>",
        "id": 167676924,
        "sender_full_name": "nagisa",
        "timestamp": 1560043758
    },
    {
        "content": "<p><code>ccache</code> itself supports single cache for multiple build directories and multiple source directories (with some restrictions on their relative paths).<br>\nI didn't try to use it with LLVM specifically, but used it with some other projects.<br>\nRustbuild is probably missing the necessary configuration though (<code>CCACHE_HASHDIR</code>/<code>CCACHE_BASEDIR</code>).</p>",
        "id": 167687506,
        "sender_full_name": "Vadim Petrochenkov",
        "timestamp": 1560064082
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"119009\">@eddyb</span> ^</p>",
        "id": 167687542,
        "sender_full_name": "oli",
        "timestamp": 1560064135
    },
    {
        "content": "<p>sccache which we use on CI doesn't support BASEDIR, so that does seem likely. PRs welcome!</p>",
        "id": 167698729,
        "sender_full_name": "simulacrum",
        "timestamp": 1560084633
    }
]