[
    {
        "content": "<p>Several questions about Zulip. We're trying to decide on whether to switch from Slack to a different chat provider and Zulip is top of the list.</p>\n<p>1. Is rust-lang self hosted?<br>\n2. If it's self-hosted are you using AWS for hosting? <br>\n3. What are the costs like?<br>\n4. How many users are currently registered?<br>\n5. Have you encountered any major issues? <br>\nThanks in advance for even taking the time to read this!</p>",
        "id": 169251205,
        "sender_full_name": "Tyler Thrailkill",
        "timestamp": 1561747417
    },
    {
        "content": "<p>1. I believe this instance is <em>not</em> self hosted, but you can definitely do that if you want;</p>",
        "id": 169254496,
        "sender_full_name": "nagisa",
        "timestamp": 1561749736
    },
    {
        "content": "<p>4. You can see user list on the right hand side. It contains 309 entries ATM</p>",
        "id": 169254641,
        "sender_full_name": "nagisa",
        "timestamp": 1561749846
    },
    {
        "content": "<p>5. I don’t remember any issues occurring and the Zulip people are fairly responsive to feature requests too in my experience.<br>\nDisclaimer: just an user, not an authoritative answer.</p>",
        "id": 169254684,
        "sender_full_name": "nagisa",
        "timestamp": 1561749892
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"123586\">@nagisa</span> ah thank you! so rust-lang only retains the last 10k messages then right? and yes I wondered if that was the full list on the right, wasn't sure as it feels like there are way more users discussing stuff.</p>",
        "id": 169261930,
        "sender_full_name": "Tyler Thrailkill",
        "timestamp": 1561755781
    },
    {
        "content": "<p>Not sure about 10k – at the very least we still have history all the way back to the beginning of our Zulip use (from about a year ago)</p>",
        "id": 169262891,
        "sender_full_name": "nagisa",
        "timestamp": 1561756509
    },
    {
        "content": "<p>but I’m sure that we either do pay for the service and/or we have a special deal of some sort.</p>",
        "id": 169262959,
        "sender_full_name": "nagisa",
        "timestamp": 1561756572
    },
    {
        "content": "<p>I don't <em>think</em> we pay for Zulip or have a special deal (it definitely isn't self-hosted though). I think the only major issues we've ran into is that some folks aren't a fan of the design/interface. In the last few months, we switched to Zulip where I work and in both cases, they've been really receptive to PRs and feature requests - I've landed a few with them and it's always been a pretty easy process.</p>",
        "id": 169264861,
        "sender_full_name": "davidtwco",
        "timestamp": 1561758217
    },
    {
        "content": "<p>I think the biggest thing we'd want for the Rust instance is a way to not require a login to read the messages.</p>",
        "id": 169265093,
        "sender_full_name": "davidtwco",
        "timestamp": 1561758374
    },
    {
        "content": "<p>I think there are around ~1440 users on this instance.</p>",
        "id": 169265160,
        "sender_full_name": "davidtwco",
        "timestamp": 1561758431
    },
    {
        "content": "<p>I can say that self-hosting is relatively painless though. We self-host our instance at work and it's very low maintenance, easy to backup and upgrade. I can't speak to cost since we run it on our internal network and not on AWS or anything like that.</p>",
        "id": 169265291,
        "sender_full_name": "davidtwco",
        "timestamp": 1561758523
    },
    {
        "content": "<p>I think our \"special\" deal is an open source org:</p>\n<blockquote>\n<p>Yes! Zulip Cloud Standard is free for open source projects and affiliated institutions. We also offer steep discounts to non-profits, educational institutions, groups of friends, and in scenarios where most of the users are not paid employees (e.g. company support forums). Just contact <a href=\"mailto:sales@zulipchat.com\" title=\"mailto:sales@zulipchat.com\">sales@zulipchat.com</a> and we’d be happy to discuss your situation! </p>\n</blockquote>\n<p>from <a href=\"https://zulipchat.com/plans/\" target=\"_blank\" title=\"https://zulipchat.com/plans/\">https://zulipchat.com/plans/</a> FAQ</p>",
        "id": 169265611,
        "sender_full_name": "simulacrum",
        "timestamp": 1561758860
    },
    {
        "content": "<p>I've been curious to try it out at work too. Does anyone know how difficult it is to set up public access with authentication and notifications for apps?</p>",
        "id": 169314811,
        "sender_full_name": "Skyler Hawthorne",
        "timestamp": 1561848007
    },
    {
        "content": "<p>For self hosted I mean</p>",
        "id": 169314920,
        "sender_full_name": "Skyler Hawthorne",
        "timestamp": 1561848315
    },
    {
        "content": "<p>Fantastic, all of this info is extremely useful. The fact that they are open to PRs/Feature Requests is amazing as well. 1400+ users also seems right for how many messages I see go through here. </p>\n<p><span class=\"user-mention\" data-user-id=\"116107\">@davidtwco</span> the fact that you run it at work also is interesting to me. did you switch from slack or a competitor? or did you start straight off with zulip? The low maintenance is pretty important.</p>",
        "id": 169317392,
        "sender_full_name": "Tyler Thrailkill",
        "timestamp": 1561853603
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"201600\">@Tyler Thrailkill</span> we were originally using HipChat, but Slack bought that and discontinued it so we were looking around for alternatives.</p>",
        "id": 169327013,
        "sender_full_name": "davidtwco",
        "timestamp": 1561875271
    },
    {
        "content": "<p>gotcha!</p>",
        "id": 169327016,
        "sender_full_name": "Tyler Thrailkill",
        "timestamp": 1561875293
    }
]