[
    {
        "content": "<p>Does anyone have any reading suggestions for theory on formal verification? I'm after something introductory.<br>\nApologies if this isn't the right stream to ask in – if it isn't I'd be grateful if someone could suggest where the correct place to ask this would be.</p>",
        "id": 203695360,
        "sender_full_name": "Teymour Aldridge",
        "timestamp": 1594633450
    },
    {
        "content": "<p>what's your background? is there anything in specific you're interested in?</p>",
        "id": 203695412,
        "sender_full_name": "Xavier Denis",
        "timestamp": 1594633489
    },
    {
        "content": "<p>I don't really have a background in anything specific – I have some general computer science knowledge though. I'm interested in formal verification (proving that programs work as intended) of software programs – something that would allow me to understand Prusti's codebase (it's a \"prototype verifier\" built on Viper) would be useful.</p>",
        "id": 203695575,
        "sender_full_name": "Teymour Aldridge",
        "timestamp": 1594633586
    },
    {
        "content": "<p>To understand Prusti's internals a necessary step is to learn about <a href=\"https://www.pm.inf.ethz.ch/research/viper.html\">Viper</a>. That page links to several papers, but the <a href=\"http://viper.ethz.ch/tutorial/\">tutorial</a> is probably the best starting place. If you are looking for a broader introduction to formal software verification, I would suggest to look for lecture slides or recordings on Google. For example, <a href=\"https://www.pm.inf.ethz.ch/education/courses/program-verification.html\">this course at ETH</a> explains how Viper is realized.</p>",
        "id": 203696876,
        "sender_full_name": "Federico Poli",
        "timestamp": 1594634552
    },
    {
        "content": "<p>you can also look at this course from the MPRI <a href=\"https://www.lri.fr/~marche/MPRI-2-36-1/\">https://www.lri.fr/~marche/MPRI-2-36-1/</a> for a general introduction to deductive verification</p>",
        "id": 203696920,
        "sender_full_name": "Xavier Denis",
        "timestamp": 1594634603
    },
    {
        "content": "<p>Thanks a lot for these recommendations! These look interesting. I'll have a look at the suggested courses (and search DuckDuckGo for some more).</p>",
        "id": 203700246,
        "sender_full_name": "Teymour Aldridge",
        "timestamp": 1594637206
    },
    {
        "content": "<p>also ask questions here!! I want to revive this channel as much as possible</p>",
        "id": 203702179,
        "sender_full_name": "Xavier Denis",
        "timestamp": 1594638716
    },
    {
        "content": "<p>I have this tab pinned so it's nearly always open for me</p>",
        "id": 203702222,
        "sender_full_name": "Xavier Denis",
        "timestamp": 1594638726
    },
    {
        "content": "<p>Thanks for the offer! I'll try and join in on the revival of the formal methods channel.</p>",
        "id": 203702455,
        "sender_full_name": "Teymour Aldridge",
        "timestamp": 1594638937
    }
]