[
    {
        "content": "<p>This is believe to be correct for OCaml. I'm not whether there is a formal proof for this. It has been done for Isabelle by targeting CakeML. See the discussion in sec 5 <a href=\"https://hal.archives-ouvertes.fr/hal-02380196v2/document\">here</a>.<br>\nThere an discussion <a href=\"https://github.com/MetaCoq/metacoq/issues/163\">issue</a> about the ocaml semantics.<br>\nThe Galinette teams wants to use semantic typing from Rustbelt for ocaml verification <span class=\"user-mention\" data-user-id=\"120791\">@RalfJ</span> ;-) <br>\n<a href=\"https://coq.discourse.group/t/phd-position-on-certified-extraction-in-nantes/1044\">https://coq.discourse.group/t/phd-position-on-certified-extraction-in-nantes/1044</a></p>",
        "id": 230162132,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1615641206
    },
    {
        "content": "<blockquote>\n<p>The Galinette teams wants to use semantic typing from Rustbelt for ocaml verification @RalfJ ;-)<br>\n<a href=\"https://coq.discourse.group/t/phd-position-on-certified-extraction-in-nantes/1044\">https://coq.discourse.group/t/phd-position-on-certified-extraction-in-nantes/1044</a></p>\n</blockquote>\n<p>Awesome. :-)</p>",
        "id": 230163921,
        "sender_full_name": "RalfJ",
        "timestamp": 1615643348
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"382207\">@Bas Spitters</span>  regarding the functional fragment of Rust, as a first step I am not even asking for a proof, I am asking for a formal statement of the desired property ;)</p>",
        "id": 230163986,
        "sender_full_name": "RalfJ",
        "timestamp": 1615643425
    },
    {
        "content": "<p>We print from metacoq to rust0 with a restricted form of references and closures.<br>\n<a href=\"https://github.com/AU-COBRA/ConCert/blob/master/extraction/theories/RustExtract.v\">https://github.com/AU-COBRA/ConCert/blob/master/extraction/theories/RustExtract.v</a><br>\nLet's start easy. Suppose I have a function computing a bool in Coq. Can we prove using rustbelt that this translation computes the same boolean?</p>",
        "id": 230164807,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1615644347
    },
    {
        "content": "<p>in terms of langauge semantics, RustBelt is not doing anything clever, or at least not a lot. it is basically a reduced ML-style lambda-calculus (reduced because there are no compound values such as products or sums) with a CompCert-style memory model (products and sums are realized in-memory, like in Rust); the only cleverness is in the concurrency aspect of the memory model where we made sure that data races are UB (so our safety theorem proves absence of data races).</p>",
        "id": 230165480,
        "sender_full_name": "RalfJ",
        "timestamp": 1615645069
    },
    {
        "content": "<p>so doing a proof such as what you are asking for should be basically a standard compiler correctness proof from a purely functional to an imperative language? I guess how hard this is depends on how you represent values and in particular closures, and if there is any sharing going on. Do you use <code>Arc</code> or <code>Box</code> for pointer indirections (I assume you have ptr indirections to support recursive types), and do you rely on Rusts closures or do your own form of closure conversion?</p>",
        "id": 230165730,
        "sender_full_name": "RalfJ",
        "timestamp": 1615645302
    },
    {
        "content": "<p>FWIW, RustBelt is intended to work on the MIR level, which is post closure conversion</p>",
        "id": 230165737,
        "sender_full_name": "RalfJ",
        "timestamp": 1615645315
    },
    {
        "content": "<p>Coming in a bit late to this. We use arena allocation with standard references so that sharing is as simple as possible (with <code>Rc</code>/<code>Arc</code> I believe we would have to clone manually, at least before closures). For closures we rely on Rust closures that live on the heap. One problem with that is that Rust does not support recursive closures, so for internal fixpoints we do recursion through the heap. For an example, this is how we extract the standard <code>ack</code> with its dependencies: <a href=\"https://gist.github.com/jakobbotsch/39adc8ad1b7ec8d79e240ba098ab7ca9\">https://gist.github.com/jakobbotsch/39adc8ad1b7ec8d79e240ba098ab7ca9</a></p>",
        "id": 230321912,
        "sender_full_name": "Jakob Botsch Nielsen",
        "timestamp": 1615803912
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120791\">@RalfJ</span>  How much would one obtain by using rustbelt? We are targeting rust and not MIR, moreover rustbelt is not MIR. <br>\nIn any case, we'll likely wait for the ocaml project to progress, as we can likely profit from that technology.</p>",
        "id": 230341831,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1615814225
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"397574\">@Jakob Botsch Nielsen</span> ah so you basically \"leak\" memory until the end of the computation when the arena is freed? okay yes that makes things easier</p>",
        "id": 230545401,
        "sender_full_name": "RalfJ",
        "timestamp": 1615912000
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"382207\">@Bas Spitters</span> if you are using only safe code and targeting surface Rust, then RustBelt in its current state is probably not going to help much</p>",
        "id": 230545848,
        "sender_full_name": "RalfJ",
        "timestamp": 1615912166
    },
    {
        "content": "<p>Yep indeed</p>",
        "id": 230556957,
        "sender_full_name": "Jakob Botsch Nielsen",
        "timestamp": 1615915871
    }
]