[
    {
        "content": "<p><span class=\"user-group-mention\" data-user-group-id=\"3111\">@WG-prioritization/alerts</span> issue <a href=\"https://github.com/rust-lang/rust/issues/93774\">#93774</a> has been requested for prioritization.</p>\n<h1><a href=\"https://forge.rust-lang.org/compiler/prioritization/procedure.html#assign-priority-to-unprioritized-issues-with-i-prioritize-label\">Procedure</a></h1>\n<ul>\n<li>Priority?</li>\n<li>Regression?</li>\n<li>Notify people/groups?</li>\n<li>Needs <code>I-nominated</code>?</li>\n</ul>",
        "id": 271127270,
        "sender_full_name": "triagebot",
        "timestamp": 1644327143
    },
    {
        "content": "<p>The kind of error and regression here is similar enough to <a href=\"https://github.com/rust-lang/rust/issues/91949\">#91949</a> for me to assume this might be P-high, too, unless I misunderstood the classification for that one. (The rationale also mentioned something about \"incremental compilation\", and I don't know whether this issue is related to incremental compilation, too. Still gotta do that bisect eventually..)</p>",
        "id": 271400051,
        "sender_full_name": "Frank Steffahn",
        "timestamp": 1644481885
    },
    {
        "content": "<p>I see, thanks for the additonal info <span class=\"user-mention\" data-user-id=\"280891\">@Frank Steffahn</span> </p>\n<p>Yes, it looks pretty bad, I mean it also hangs when I open the file in Emacs and rust-analyzer tries to parse the file.</p>\n<p>one question: do you think that code sample is specifically \"ad hoc\" to reproduce the issue or people can trip on this accidentally? Since this in stable since a while and - to my knowledge - unreported, I'm thinking how likely is to trigger this issue?<br>\n(the code may be a bit difficult to follow for me, but it doesn't look like completely made up to trigger the issue)</p>",
        "id": 271417967,
        "sender_full_name": "apiraino",
        "timestamp": 1644492361
    },
    {
        "content": "<p>The code example is verbatim how I came across this, it's not fabricated to try to reproduce any issue. Sure the code example does contain mistakes that do warrant an overflow error (I've linked the \"correct\" and working version with the mistakes fixed in the issue)</p>",
        "id": 271418876,
        "sender_full_name": "Frank Steffahn",
        "timestamp": 1644492938
    }
]