[
    {
        "content": "<p>TL;DR: does <code>zicsr</code> exist on riscv32imc and should that be available via rustup?</p>\n<p>I'm investigating compiling Rust on a simulated PULPissimo chip with an Ibex core for research. This platform implements riscv32imc. The existing build system uses a modified RISC-V GCC 7.1.1 to compile C that is linked with a runtime library supplied by upstream.</p>\n<p>If I build a binary using the nightly rustc via rustup with target=riscv32imc-unknown-elf and link it using the old build system's linker &amp; upstream configurations, the simulated core throws \"Illegal Instruction\" at encountering a particular instruction: <code>csrwi</code> a.k.a. some form of a \"write control status register\". Compiling the C-source with the existing system runs alright, including that same instruction: <code>csrwi</code>, located in the linked upstream runtime library.</p>\n<p>I traced the instruction to the RISC-V specification and to an extension called \"zicsr\" a.k.a. \"control status register instructions\", and thus suspect that not having this enabled in the rustc/LLVM backend may be my root cause for why the simulator throws \"Illegal instruction\". Calling <code>rustc --target=riscv32imc-unknown-none-elf --print target-features</code> verifies that rustc is not aware of an extension called \"zicsr\".</p>\n<p>Now, my questions are: could I be on the right track with my suspected root cause or could it just be that my linkage is way dangerous, does the missing \"zicsr\" make sense, is it possible to add that feature, and how hard would that be (yeah, YMMV)?</p>",
        "id": 229656065,
        "sender_full_name": "Henri Lunnikivi",
        "timestamp": 1615382477
    },
    {
        "content": "<p>Target features can only control (enable or disable) emission of instructions. I would be surprised if it could have a global effect on whether the same instruction works or faults.</p>",
        "id": 229656720,
        "sender_full_name": "nagisa",
        "timestamp": 1615382703
    },
    {
        "content": "<p>The call to <code>csrwi</code> instruction is located in the runtime library, the code for which is emitted by the existing build system which probably has the feature. It's linked in with the minimal Rust binary also using the existing build system's linker. It's strange that going through the <code>cargo</code> build system somehow changes the resultant simulator behavior here.</p>\n<p>It's good to have confirmation anyway that the target feature only affects emission of instructions.</p>",
        "id": 229658309,
        "sender_full_name": "Henri Lunnikivi",
        "timestamp": 1615383217
    },
    {
        "content": "<p>To be clear: since the features should not have an effect on this, the problem is likely in the hardware platform. There's some 2-way interaction between the hardware simulation configuration and code generation, so it's entirely possible there's something wrong there that has nothing to do with the riscv32imc target of Rust/LLVM.</p>",
        "id": 229658924,
        "sender_full_name": "Henri Lunnikivi",
        "timestamp": 1615383430
    },
    {
        "content": "<p>I think the more plausible reason is that your binary does not have the C runtime initialization objects linked in or something along those lines.</p>",
        "id": 229659237,
        "sender_full_name": "nagisa",
        "timestamp": 1615383545
    },
    {
        "content": "<p>Because you're building with a <code>unknown-none-elf</code> target</p>",
        "id": 229659367,
        "sender_full_name": "nagisa",
        "timestamp": 1615383599
    },
    {
        "content": "<p>Thanks for the tip! Sounds very reasonable.</p>",
        "id": 229660057,
        "sender_full_name": "Henri Lunnikivi",
        "timestamp": 1615383833
    },
    {
        "content": "<p>The _start &amp; _entry areas of the built assembler look fine at least. I believe the runtime library supplies the C run time initialization code. The original C-source is compiled with <code>-nostartfiles</code>. The Rust code also executes fine in the simulator up until the control-status register access (after/within _entry and _start). It feels like it's an issue with setting up the hardware control status registers :S</p>",
        "id": 229662477,
        "sender_full_name": "Henri Lunnikivi",
        "timestamp": 1615384614
    },
    {
        "content": "<p>I got it! If I use rustc to compile into object files only, then return to the existing toolchain, I'm able to create functioning binaries. So somehow using cargo breaks something somewhere even if cargo is instructed to use the linker from the existing toolchain.</p>",
        "id": 229731181,
        "sender_full_name": "Henri Lunnikivi",
        "timestamp": 1615405898
    }
]