[
    {
        "content": "<p>Is there a high-level overview of the way clippy works laying around anywhere?</p>",
        "id": 246269140,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626464389
    },
    {
        "content": "<p>As in, everything from parsing to type-checking and the driver itself. I'm looking at how feasible it would be to create a custom linter and wanted to look at how clippy works in general.</p>",
        "id": 246269339,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626464511
    },
    {
        "content": "<blockquote>\n<p>a custom linter</p>\n</blockquote>\n<p>Like, for specific Rust libraries, or... (I'm asking about the former in <a class=\"stream-topic\" data-stream-id=\"257328\" href=\"/#narrow/stream/257328-clippy/topic/SNAFU-specific.20lints\">#clippy &gt; SNAFU-specific lints</a> )</p>",
        "id": 246271921,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1626465920
    },
    {
        "content": "<p>My thought was to create something roughly similar to clippy, but with wasm dylibs that are provided by anyone. The lint wouldn't necessarily be for a given library, but that would of course be a major use case.</p>",
        "id": 246272128,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626466045
    },
    {
        "content": "<p>I'm aware that the AST isn't guaranteed, but I would like to <em>try</em> to get something stable-ish that can be converted bidirectionally as necessary. That's not particularly relevant to my question, though.</p>",
        "id": 246272260,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626466109
    },
    {
        "content": "<p>ah, yes, Wasm. I always forget about that.</p>",
        "id": 246273153,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1626466630
    },
    {
        "content": "<p>There was <a href=\"https://github.com/trailofbits/dylint\">https://github.com/trailofbits/dylint</a></p>",
        "id": 246273259,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1626466685
    },
    {
        "content": "<p>I saw that, ironically the day <em>after</em> I thought of this. Imo the problem with that is the inflexibility and weight of it (spawning any number of drivers). I'd prefer to have a nicer API anyways, which isn't really possible without creating one separately.</p>",
        "id": 246273477,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626466811
    },
    {
        "content": "<p>Though I suppose I could dig into that to see how they extracted various things from clippy. I just wasn't sure if there was an architectural overview of clippy itself somewhere that I wasn't aware of.</p>",
        "id": 246273561,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626466876
    },
    {
        "content": "<p>well, let me know if you make something that enables writing library-specific lints <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span></p>",
        "id": 246273627,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1626466923
    },
    {
        "content": "<p>Will do! I was drafting up an API for how diagnostics could be emitted in a general way yesterday.</p>",
        "id": 246273712,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626466982
    },
    {
        "content": "<p>You might be interested in <a href=\"https://internals.rust-lang.org/t/proposal-stabilizable-proc-macro-based-lints/15022/\">https://internals.rust-lang.org/t/proposal-stabilizable-proc-macro-based-lints/15022/</a></p>",
        "id": 246275381,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1626467846
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"232545\">Joshua Nelson</span> <a href=\"#narrow/stream/257328-clippy/topic/architecture/near/246275381\">said</a>:</p>\n<blockquote>\n<p>You might be interested in <a href=\"https://internals.rust-lang.org/t/proposal-stabilizable-proc-macro-based-lints/15022/\">https://internals.rust-lang.org/t/proposal-stabilizable-proc-macro-based-lints/15022/</a></p>\n</blockquote>\n<p>Already commented <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 246275637,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626467977
    },
    {
        "content": "<p>Oh this looks kind of neat<br>\n<a href=\"https://github.com/trailofbits/dylint\">https://github.com/trailofbits/dylint</a></p>",
        "id": 246277304,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1626468914
    },
    {
        "content": "<p>Now picture that without having to spawn multiple drivers and with a cleaner API :)</p>",
        "id": 246277610,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626469082
    },
    {
        "content": "<p>A pretty minimalistic custom linter, that functions kind of like clippy is <a href=\"https://github.com/nbdd0121/klint\">klint</a> from the Rust-for-Linux project. This is just a prototype at the moment and not used in production.</p>\n<p>Since in the last 2 weeks I talked with various people about custom lints / linters, I thought about if it were helpful to provide a linter template, that you can quickly set up with <code>cargo generate</code> (or similar). </p>\n<hr>\n<p>For your question on how Clippy works:</p>\n<ul>\n<li>There is <code>clippy-driver</code>, which uses the <a href=\"https://doc.rust-lang.org/nightly/nightly-rustc/rustc_driver/struct.RunCompiler.html\">RunCompiler</a> API of rustc_driver. Lints are registered with the <code>callbacks</code> field of this struct.</li>\n<li>Then there is <code>cargo-clippy</code>, which is just the cargo wrapper for the driver. This mostly just does additional argument handling for the part behind <code>--</code> in <code>cargo clippy -- &lt;here&gt;</code> and calls the <code>clippy-driver</code> programmatically</li>\n<li>How lints work is closely tied to the highly unstable API of rustc itself. You can think of it, that Clippy runs rustc and just uses the AST/HIR/MIR, that rustc produced. So for example to get the type of an expression, rustc analyses the crate and Clippy then asks rustc for the type with <code>cx.tcx.expr_ty(expr)</code>. (This is no 100% accurate, but a good mental model for it IMO)</li>\n<li>Clippy has many helper functions in <code>clippy_utils</code>. We don't want to publish <code>clippy_utils</code> on <a href=\"http://crates.io\">crates.io</a>, since this is just as unstable as rustc itself. But if more people write custom lint tools and want to see helper functions from <code>clippy_utils</code> uplifted into rustc, this is definitely something that can be done.</li>\n</ul>",
        "id": 246310721,
        "sender_full_name": "flip1995",
        "timestamp": 1626506769
    },
    {
        "content": "<p>klint looks like a good place for me to start, as it's quite straightforward as to what it's doing (hooking into the compiler and all). My main problem will definitely be getting a stable interface that can be bidirectionally converted. I can easily see how I could convert klint to something pluggable, though.<br>\nThanks for the info. It's certainly not an easy topic to dive into.</p>",
        "id": 246310993,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626507277
    },
    {
        "content": "<p>How much desire is there for custom lints anyways? dylint just happened to pop up right when I was thinking about it, and I could picture a number of crates providing their own lints.</p>",
        "id": 246311139,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626507536
    },
    {
        "content": "<p>I think the need for custom linters will get more important over time. As I said, this topic came up 3 or 4 times for me in the past 2 weeks. So I would be willing to help work on making writing custom linters / lints easy.</p>",
        "id": 246311313,
        "sender_full_name": "flip1995",
        "timestamp": 1626507765
    },
    {
        "content": "<p>Non-exhaustive list of problems I see right now:</p>\n<ol>\n<li>To set up your linter, you have to write a considerable amount of boilerplate code.</li>\n<li>You have to hook into <code>#[feature(rustc_private)]</code> and by extent you have to use a nightly toolchain to use your linter.</li>\n<li>You have to use completely unstable rustc APIs that are subject to change on a daily basis.</li>\n<li>... And probably more, that I don't think of, since I never wrote a custom linter from scratch.</li>\n</ol>\n<hr>\n<p>How this could be addressed:</p>\n<ol>\n<li>This could be easily addressed by providing a template, where you then just have to fill in the linting code</li>\n<li>You could circumvent this by using <code>RUSTC_BOOTSTRAP=1</code> and could use any toolchain you like. You would still be bound to one toolchain and updating to a new toolchain will be a PITA, because of 3.</li>\n<li>Making any compiler internals stable seems impossible to me. Even providing a stable API for custom linters seems impossible. This would just make improving the compiler way more difficult. So the only thing I can see here is a stable-ish  API for analysis queries. But I have no idea where to start here. Also much of linting is matching on the AST / HIR directly without calling queries, which is really hard to provide a stable-ish API for.</li>\n</ol>\n<hr>\n<p><span class=\"user-mention\" data-user-id=\"222148\">@Felix Kohlgrüber</span> wrote his master thesis about this topic, which may be a starting point: <a href=\"https://github.com/rust-lang/rust-clippy/issues/3875\">rust-clippy#3875</a></p>",
        "id": 246312443,
        "sender_full_name": "flip1995",
        "timestamp": 1626509337
    },
    {
        "content": "<p><a href=\"https://github.com/fkohlgrueber/pattern-matching\">https://github.com/fkohlgrueber/pattern-matching</a></p>",
        "id": 246312717,
        "sender_full_name": "flip1995",
        "timestamp": 1626509743
    },
    {
        "content": "<ol>\n<li>This actually wouldn't be the case as I'm planning on having dynamically loadable wasm libraries. As such, the only code needed to be written by the lint author would be the lint itself (and some metadata).</li>\n<li>Using internal APIs is absolutely a must, barring reimplementing literally everything from scratch. It wouldn't be difficult to provide binaries to the end users, so using nightly shouldn't in and of itself be an issue.</li>\n<li>We wouldn't need to stabilize the internals, \"just\" something that can be converted to and from the internals. No doubt still a difficult task, but certainly easier than stabilizing the internals itself. The internal structure would only need to be updated as necessary, given that the various crates would be compiled into the final binary (with end users not caring about it at all). I know there's work on creating a formal grammar for Rust, which would help with the AST side of things. I also plan on looking into <code>syn</code> for a potential starting point for an AST.</li>\n</ol>\n<p>This is unquestionably an enormous project that will take significant time and effort. I'll certainly look over the links you've provided when I have time. Right now I'm still trying to organize the thoughts in my head in addition to finding others that may be interested in collaborating to an extent. No idea if this is something a project group might be good for, but the API design will presumably be the most difficult challenge.</p>",
        "id": 246312974,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626510186
    },
    {
        "content": "<p>Ah, I think I now understand what your plan is. I'm definitely willing to collaborate in this project.  This is an interesting and difficult project. So if you want to bounce ideas, let me know!</p>",
        "id": 246313442,
        "sender_full_name": "flip1995",
        "timestamp": 1626510848
    },
    {
        "content": "<p>Writing things out is probably step one! I'll create a repository where issues can be filed and whatnot at some point. Quite busy tomorrow (and likely thru Tuesday), but we'll see. I'll definitely let you and <span class=\"user-mention\" data-user-id=\"116155\">@Jake Goulding</span> know when things happen.</p>",
        "id": 246314002,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626511789
    },
    {
        "content": "<p>One final thing before I finally go to sleep, what I'm thinking of is glue code, to put a term to it.</p>",
        "id": 246314197,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626512122
    },
    {
        "content": "<p>Hey, I've just caught up with the discussion and I would also be happy to help out <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 246424378,
        "sender_full_name": "xFrednet",
        "timestamp": 1626680035
    },
    {
        "content": "<p>Awesome! I'll probably draft something up Tuesday evening and put it out on IRLO on Wednesday, assuming everything in the meantime goes well (other priorities).</p>",
        "id": 246424776,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626680364
    },
    {
        "content": "<p>Should this be a project group? I see there's a template repository under the rust-lang GitHub. The primary focus would realistically be creating a stable API to act as glue code between end users and the various rustc crates. This would unlock user-provided lints with relative ease. There's other use cases as well to say the least.</p>",
        "id": 246520522,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626731877
    },
    {
        "content": "<p>We could start a project group for it. But I'm not too worried about under which name or orga structure we work on this project.</p>",
        "id": 246554886,
        "sender_full_name": "flip1995",
        "timestamp": 1626767462
    },
    {
        "content": "<p>Yay, I just found this. Disclaimer: I work for Trail of Bits who developed dylint and and we do write custom lints</p>",
        "id": 247276315,
        "sender_full_name": "Disconnect3d",
        "timestamp": 1627341811
    },
    {
        "content": "<p>regarding how clippy works, I know this was answered but this may also give some insight or fill some gaps (?): <a href=\"https://www.trailofbits.com/post/write-rust-lints-without-forking-clippy\">https://www.trailofbits.com/post/write-rust-lints-without-forking-clippy</a></p>",
        "id": 247276343,
        "sender_full_name": "Disconnect3d",
        "timestamp": 1627341838
    },
    {
        "content": "<p>Feel free to have trail of bits pitch in with regard to this effort! I created a GitHub org for those that are interested.</p>",
        "id": 247283110,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1627348918
    },
    {
        "content": "<p>I've actually been messing around with this too as sort of tangential to my GSoC project. <span class=\"user-mention\" data-user-id=\"245610\">@Jacob Pratt</span> do you have a link to this org?</p>\n<p>The things I've come up with are:</p>\n<ol>\n<li>To allow downstream crates (users of your lib that have specific lints) to use the lints from a tool without doing a bunch of work I went with including the wasm bytes in the original lib with a \"magically\" named static <code>__PLUGIN_BYTES</code> or something similar. This would be under a feature flag so it doesn't add to binary size.</li>\n<li>The linter program checks each dylib for this static and registers the lints if found by loading the dynamic lib and then running the wasm bytes found.</li>\n</ol>\n<p>I haven't gotten as far as designing the linter, although I was probably planning on using rust analyzer internals. I started a proof of concept <a href=\"https://github.com/DevinR528/ruma-check\">https://github.com/DevinR528/ruma-check</a> and I also experimented with a <code>Visitor</code> trait using rust analyzers <code>ast</code> types <a href=\"https://github.com/DevinR528/ruma-check/blob/visit/src/visit.rs\">https://github.com/DevinR528/ruma-check/blob/visit/src/visit.rs</a> (even more experimental and not close to done). I just realized this would need a <code>Early/LateContext</code> thing for all the methods too.</p>",
        "id": 247319369,
        "sender_full_name": "DevinR528",
        "timestamp": 1627384195
    },
    {
        "content": "<p>Just to be sure, is the thing you want to build a way for projects to develop &amp; run their own lints? Or is it about an easier &amp; (hopefully) stable way to match patterns? Or both?</p>",
        "id": 247325730,
        "sender_full_name": "Disconnect3d",
        "timestamp": 1627388701
    },
    {
        "content": "<p>It's mostly about providing a stable API to the compiler internals. This API may or may not include something that makes it easier for projects to write their own lints. We're still figuring things out.</p>",
        "id": 247326415,
        "sender_full_name": "flip1995",
        "timestamp": 1627389086
    },
    {
        "content": "<p>My end goal is to provide a custom linter. The stable API is a necessary prerequisite to attain the type of linter I'm imagining.</p>",
        "id": 247360736,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1627405123
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"243877\">@DevinR528</span> the org is rust-linting. Nothing there yet. Would you like me to invite you to it?</p>",
        "id": 247360787,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1627405150
    },
    {
        "content": "<p>Yes please!</p>",
        "id": 247360818,
        "sender_full_name": "DevinR528",
        "timestamp": 1627405164
    },
    {
        "content": "<p>What's your GitHub?</p>",
        "id": 247360866,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1627405192
    },
    {
        "content": "<p><a href=\"https://github.com/DevinR528\">https://github.com/DevinR528</a></p>",
        "id": 247361079,
        "sender_full_name": "DevinR528",
        "timestamp": 1627405247
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"245610\">@Jacob Pratt</span> Custom linter, or, a lint? Also, why not Dylint?</p>",
        "id": 247361316,
        "sender_full_name": "Disconnect3d",
        "timestamp": 1627405325
    },
    {
        "content": "<p>Custom linter, not just a single lint. There's a post on IRLO I made regarding this if you're interested.</p>",
        "id": 247361401,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1627405361
    },
    {
        "content": "<p>I guess its this one: <a href=\"https://internals.rust-lang.org/t/towards-a-stable-compiler-api-and-custom-lints/15048\">https://internals.rust-lang.org/t/towards-a-stable-compiler-api-and-custom-lints/15048</a> ; will check it out ;)</p>",
        "id": 247361645,
        "sender_full_name": "Disconnect3d",
        "timestamp": 1627405467
    },
    {
        "content": "<p>Correct</p>",
        "id": 247361878,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1627405577
    }
]