[
    {
        "content": "<p>Going through old issues... I think it would be nice to have labels for <code>global-analysis</code> and <code>range-analysis</code>. There are a lot of suggested lints that fall in these categories. In both cases, we don't really have any solutions and don't plan to in the short term, but we probably should leave these ideas open in case we do some day.</p>",
        "id": 261377987,
        "sender_full_name": "Cameron Steffen",
        "timestamp": 1636834639
    },
    {
        "content": "<p>I don't know if \"global analysis\" is the right term - I basically mean considering how a function is implemented together with how it is used. Range analysis is like \" <code>a &gt; 1 &amp;&amp; a &lt; 0</code> doesn't make sense\".</p>",
        "id": 261378520,
        "sender_full_name": "Cameron Steffen",
        "timestamp": 1636835303
    },
    {
        "content": "<p>Just had another idea - a label for <code>unsafe</code> (T-unsafe?) basically for lints that deal with pointers</p>",
        "id": 261379312,
        "sender_full_name": "Cameron Steffen",
        "timestamp": 1636836565
    },
    {
        "content": "<p>I think in cppcheck this was called valueflow (analysis) :)</p>\n<p>But yeah having some kind of more advanced \"this value is X here and you later check against if it is Y which is always false\" or something would be neat to have.</p>",
        "id": 261381536,
        "sender_full_name": "matthiaskrgr",
        "timestamp": 1636839983
    },
    {
        "content": "<p>Usually we just close issues where someone asks for a global analysis, since Clippy isn't really the right tool to do that. We could label them though.</p>\n<p>Why do you want an extra label for range-analysis though? Isn't this a lint like every other lint?</p>",
        "id": 261479125,
        "sender_full_name": "flip1995",
        "timestamp": 1636971574
    },
    {
        "content": "<p>For example <a href=\"https://github.com/rust-lang/rust-clippy/issues/3029\">https://github.com/rust-lang/rust-clippy/issues/3029</a> falls under range-analysis. IMO we shouldn't bother implementing such lints until we have (create) some sort of range analysis framework that all such lints can share. Otherwise we'd be re-implementing logic like \"in <code>a &amp;&amp; b</code>, <code>a</code> is true when <code>b</code> is evaluated\".</p>",
        "id": 261522434,
        "sender_full_name": "Cameron Steffen",
        "timestamp": 1636993943
    },
    {
        "content": "<p>Maybe instead of a label, I can just open an issue about range analysis and link related tickets.</p>",
        "id": 261522765,
        "sender_full_name": "Cameron Steffen",
        "timestamp": 1636994075
    }
]