[
    {
        "content": "<p>Hey all! So for the last week I've been working intensively on organizing <a href=\"https://vaccinateca.com/\">https://vaccinateca.com/</a> . It's reached a scale where it's definitely an huge time commitment, which I should mostly be able to make by using up all my free time, but that's not sustainable. It already seems very likely that this might be some of the most impactful stuff I ever do, and I want to be able to help it succeed.</p>\n<p>In the interest of avoiding sudden burnout (which is almost a certainty if I continue at the same levels for another week, though i don't plan to) I would like to state that for the next few weeks, at least, I cannot make any new time commitments or take on more work items wrt Rust. I understand that this is rather untimely, given all the work on our plate right now.</p>\n<p>I do not intend to drop any existing commitments in the of the project, though I may at some point  remove myself from reviewer rotations. I intend to be around, and  I shall try to balance for the fact that I will likely have less context by mostly listening as opposed to stating opinions on things unless asked. I will be aggressively unsubscribing from issues which I am not a direct point person on (i.e. as a reviewer or it's something i'm driving), however you should _not hesitate_ to @ me on issues you think you want my input on, or @ me on discord. I'm cutting back on involvement, I do not intend to disappear, and I _very much_ do not want to leave anyone stranded, and there are things you intended to depend on me for ping me and we can figure this out.</p>\n<p>Happy to talk more about this and help adjust expectations.</p>",
        "id": 223296482,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1611091233
    },
    {
        "content": "<p>Just wanted to say that it has been very inspiring to see the all progress that project has made so far <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span></p>",
        "id": 223348989,
        "sender_full_name": "Phil H",
        "timestamp": 1611134935
    },
    {
        "content": "<p>That is really cool! I agree, it's inspiring to see that you are working on something that you are passionate about, and is impactful! I for one am not offended if I have a PR that sits around for a while (but I may break things).</p>",
        "id": 223385547,
        "sender_full_name": "Cameron Steffen",
        "timestamp": 1611155287
    }
]