[
    {
        "content": "<p>Hello everyone, I'm currently working on a new metadata collector for Clippy to collect lint documentation, configuration etc. The next step it to adapt the website and I wanted to get your opinion on the documentation syntax. (Tracking issue <a href=\"https://github.com/rust-lang/rust-clippy/issues/7172\">rust-clippy#7172</a>)</p>\n<p>Clippy's lint documentation currently uses bold text via <code>**&lt;headline&gt;**</code> to define a headline. This is a bit uncommon for Markdown and would require more specific handling. The current website uses several loops to display this correctly, which is probably also a reason for the comparatively slow loading times.</p>\n<p>I would like to update the entire lint documentation to use the Markdown headlines <code>### &lt;headline&gt;</code> instead. This would simplify the implementation and also align us with rustc's documentation style (See <a href=\"https://github.com/rust-lang/rust/blob/7a0f1781d04662041db5deaef89598a8edd53717/compiler/rustc_lint/src/builtin.rs#L833-L879\">example</a>). What are your thought's about it?</p>",
        "id": 238516191,
        "sender_full_name": "xFrednet",
        "timestamp": 1620841852
    },
    {
        "content": "<p>Since the documentation is displayed in a header style on the website anyway  this would definitely make sense. <span class=\"user-mention\" data-user-id=\"360405\">@Cameron Steffen</span> also suggested to change this recently as part of his PoC PR moving lint doc to separate files.</p>\n<p>I only see advantages we'd get from this change, so this is definitely a YES from me.</p>",
        "id": 238516888,
        "sender_full_name": "flip1995",
        "timestamp": 1620842154
    },
    {
        "content": "<p>Yup SGTM. I suggested two <code>##</code> but I guess it's arbitrary <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span></p>",
        "id": 238709030,
        "sender_full_name": "Cameron Steffen",
        "timestamp": 1620959058
    },
    {
        "content": "<p>Awesome! I'll make the switch when the metadata collection is up in running and then create a PR for it.</p>\n<p>The choice of using three hashtags was mostly based on the lint doc syntax inside the compiler. They most likely choose this syntax to build the following hierarchy:</p>\n<ol>\n<li>Lint group (for instance <em>Allowed-by-default lints</em>)</li>\n<li>Lint name (for instance <em>anonymous-parameters</em>)</li>\n<li>Lint documentation extracted from the doc comment</li>\n</ol>\n<p>Example: <a href=\"https://doc.rust-lang.org/rustc/lints/listing/allowed-by-default.html#anonymous-parameters\">here</a>. I think it's reasonable to do the same in case we want to switch over to MdBook at some point in time</p>",
        "id": 239103181,
        "sender_full_name": "xFrednet",
        "timestamp": 1621263128
    }
]