[
    {
        "content": "<p>I was implementing something like <code>needless_borrow</code> and then realized that <code>needless_borrow</code> already exists in the nursery. Ho hum. Anyways, I thought of no less than four different variables that this lint could be configured on. I know this is a picky lint to begin with, but am I over-complicating it? Any feedback?</p>\n<ul>\n<li><code>needless-borrow-deref: bool</code> default <code>true</code> unless - only lint borrows when every usage is derefed or autoderefed</li>\n<li><code>needless-borrow-copy: bool</code> default <code>true</code> - include borrows of any <code>Copy</code> type in addition to references</li>\n<li><code>needless-borrow-ref: bool</code> default <code>true</code> - include borrows from a <code>ref</code> binding</li>\n<li><code>needless-borrow-binding-mode: bool</code> default <code>false</code> - include borrows caused by the binding mode (<code>match &amp;x</code>)</li>\n</ul>\n<p>To clarify, the fix for binding mode is to change <code>match x</code> to <code>match *x</code> and add <code>ref</code> on any bindings that still need to borrow. Yeah, not a good default lint, but this fits my style preference for one. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>\n<p>Finally, I'm hoping to make this lint warn-by-default with the deref option on to avoid FPs. Is it possible to change the default config if <code>pedantic</code> is on?</p>",
        "id": 227810710,
        "sender_full_name": "Cameron Steffen",
        "timestamp": 1614276433
    },
    {
        "content": "<p>I don't really know the context about the lint (why it is in nursery and so on).</p>\n<blockquote>\n<p>Is it possible to change the default config if pedantic is on?</p>\n</blockquote>\n<p>Maybe you could use <code>utils::run_lints</code> to determine, if the lint is enabled. But I don't think we know if the configuration is set in a config file or is the default configuration.</p>",
        "id": 227900894,
        "sender_full_name": "flip1995",
        "timestamp": 1614330755
    },
    {
        "content": "<p>I think I need to rephrase: In the absence of any user config, is it possible for clippy to determine the default configuration value based on whether pedantic is enabled? Or, can I have <code>needless_borrow</code> be more noisy by default when <code>warn(pedantic)</code> is on?</p>",
        "id": 228000418,
        "sender_full_name": "Cameron Steffen",
        "timestamp": 1614376301
    }
]