[
    {
        "content": "<p>BTW, things slowed down a bit here for a few reasons, but I wanted to give a few updates.</p>\n<p>1. Part of the reason for the slowdown is that (on the wg-traits side) we were looking against rustc-chalk integration. I still think though we should be pursuing the RLS 2.0 integration. A lot of the hard problems though will be the same in both cases.<br>\n2. That said, I spent a fair amount of time refactoring chalk to enable \"query-ification\" and I plan to open some PRs for that soon. It's not all the way done but at least the path is becoming clear.</p>",
        "id": 162947763,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1554842314
    },
    {
        "content": "<p>I've actually been working on preparing for Chalk integration on the rust-analyzer side (see also <a href=\"https://github.com/rust-analyzer/rust-analyzer/issues/1120\" target=\"_blank\" title=\"https://github.com/rust-analyzer/rust-analyzer/issues/1120\">rust-analyzer#1120</a>), so I hope we'll be ready to do it once the Chalk queryfication is done :)</p>",
        "id": 162948843,
        "sender_full_name": "Florian Diebold",
        "timestamp": 1554843044
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"129457\">@Florian Diebold</span> great! I was planning on creating a doodle today to find a time to discuss the queries and setup in more depth. Maybe you can talk about what you've been doing as well so we can line them up.</p>",
        "id": 162988665,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1554888848
    },
    {
        "content": "<p>And/or feel free to leave some notes here now :)</p>",
        "id": 162988668,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1554888852
    },
    {
        "content": "<p>One thing that became clear btw, when <span class=\"user-mention\" data-user-id=\"117350\">@Sunjay Varma</span> and I were looking, is that the notion of \"current crate\" does not want to completely go away</p>",
        "id": 162988680,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1554888869
    },
    {
        "content": "<p>I think the way this will map to <strong>rust-analyzer</strong> is that there needs to be a distinct \"trait solver\" for each crate -- this is because each crate operates with a different set of impls</p>",
        "id": 162988707,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1554888907
    },
    {
        "content": "<p>basically, I think the rust-analyzer has no notion of current crate, and that's fine, but chalk does, and so rust analyzer will always talk to chalk with a current crate in mind</p>",
        "id": 162988750,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1554888947
    },
    {
        "content": "<p>hm yeah, that's true</p>",
        "id": 162989094,
        "sender_full_name": "Florian Diebold",
        "timestamp": 1554889271
    },
    {
        "content": "<p>That makes total sense, yeah. Question: would solvers for different crates share any data?</p>\n<p>For example, each crate depends on std, so each solver has to know about all of std's impls. If we naively duplicate the impls per solver, we'll have O(N^2) situation</p>",
        "id": 162990153,
        "sender_full_name": "matklad",
        "timestamp": 1554890411
    },
    {
        "content": "<p>I've been wondering about that. I'm not sure the answer.</p>",
        "id": 162990180,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1554890451
    },
    {
        "content": "<p>I think initially they would share minimal state, but we might be able to increase it.</p>",
        "id": 162990281,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1554890553
    },
    {
        "content": "<p>That said, my hope would be that we aren't (e.g.) type-checking other crates that often :)</p>",
        "id": 162990294,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1554890579
    },
    {
        "content": "<p>So it may not be a big issue in practice</p>",
        "id": 162990305,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1554890586
    },
    {
        "content": "<p>We'd at least be type-checking all the crates in the workspace, which may already be a few... but we'll see :)</p>",
        "id": 163001268,
        "sender_full_name": "Florian Diebold",
        "timestamp": 1554900924
    }
]