[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281950\">@Aman Arora</span> I was thinking that with respect to the auto-trait issue, it'd be better to write <code>constituent_types_for_ty</code> so that it <em>always</em> returns the tuple type, and not the way you had it, where it sometimes did and sometimes didn't. it'll be harder to debug problems that way I imagine.</p>",
        "id": 211992011,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1601598144
    },
    {
        "content": "<p>I'm not entirely sure</p>\n<p>From what I understand constituent types returns a list of types, which in case for closures looks something like:</p>\n<ul>\n<li>Pre capture analysis: vector containing a single inference variable</li>\n<li>Post capture analysis: vector containing n elements T1, ..Tn where Ti is the type of the ith captured place. </li>\n</ul>\n<p>Are you suggesting that in the post analysis case we return vector containing 1 element - the tuple (T1, ..., Tn) ?</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"307184\">@rocksand</span></p>",
        "id": 211993161,
        "sender_full_name": "Aman Arora",
        "timestamp": 1601599296
    },
    {
        "content": "<p>If so I think we will have to work on figuring out how to hide some of the details in the output. <br>\n<a href=\"https://github.com/sexxi-goose/rust/commit/f6acb32358ca2ae0b69915fed01ce8245add25c7\">https://github.com/sexxi-goose/rust/commit/f6acb32358ca2ae0b69915fed01ce8245add25c7</a></p>\n<p>The calls to shallow resolve can be removed but don't think it will change the test output</p>",
        "id": 211994586,
        "sender_full_name": "Aman Arora",
        "timestamp": 1601601035
    },
    {
        "content": "<p>I was thinking about this, and I think regardless of output we should do this, since the change to fix diagnostics (<a href=\"https://github.com/sexxi-goose/rust/pull/23/files#diff-4b0c915b012b616fb2269340b313ab75R1334-R1336\">https://github.com/sexxi-goose/rust/pull/23/files#diff-4b0c915b012b616fb2269340b313ab75R1334-R1336</a>) ignores the first tuple we see</p>",
        "id": 212580675,
        "sender_full_name": "Aman Arora",
        "timestamp": 1602086522
    }
]