[
    {
        "content": "<p>I'm most likely going to busy during meeting hours today, don't particularly have project questions right now</p>\n<ul>\n<li>\n<p>Is there any time that you're available before 12PM EST for meetings, because then I can keep continuing the meeting sessions which we would prefer. Else we can keep the current time and <span class=\"user-mention\" data-user-id=\"282466\">@Dhruv Jauhar</span>  or <span class=\"user-mention\" data-user-id=\"282522\">@azhng</span>  will attend</p>\n</li>\n<li>\n<p>Status update: Resurrected all our ongoing work</p>\n</li>\n<li>Closure printing: Did a first prototype based on the initial proposal. PR for proposal updated with discussions from today. <a href=\"https://github.com/rust-lang/project-rfc-2229/pull/17\">https://github.com/rust-lang/project-rfc-2229/pull/17</a>. Should be able to finish implementation by end of the week</li>\n<li>Inference variable capture types tuple: 180 tests fail right of now (including diagnostic messages). There might be some more feedback that needs to be applied from our discussions earlier.</li>\n<li>Closure captures bridge: Old analysis works with the new bridge code without any significant duplication.  Need to spend some time looking at the intermediate structure to ensure things look correct.</li>\n</ul>",
        "id": 210092541,
        "sender_full_name": "Aman Arora",
        "timestamp": 1600148860
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281950\">@Aman Arora</span> yeah we can find an earlier slot, maybe on a different day</p>",
        "id": 210148766,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1600185348
    },
    {
        "content": "<p>One question is whether it'd be useful to do a zoom meeting to go over e.g. inference variable capture or other things</p>",
        "id": 210148846,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1600185369
    },
    {
        "content": "<p>I guess I'd like to know if there is a better way for me to support y'all</p>",
        "id": 210148970,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1600185442
    },
    {
        "content": "<p>Yeah we can do another day of the week. </p>\n<p>We can decide next week on the inference variable stuff, once we have spent some time investigating a bit more ourselves. If doesn't work out amongst us we can do discuss over zoom</p>",
        "id": 210149369,
        "sender_full_name": "Aman Arora",
        "timestamp": 1600185603
    }
]