[
    {
        "content": "<p><a href=\"https://rust-lang.github.io/all-hands-2020/\" target=\"_blank\" title=\"https://rust-lang.github.io/all-hands-2020/\">https://rust-lang.github.io/all-hands-2020/</a> now says:</p>\n<blockquote>\n<p>This year the all hands event for 2020 has been cancelled, we're currently figuring out when to have the next event.</p>\n</blockquote>\n<p>not sure what's going on, can anyone confirm?</p>",
        "id": 187162882,
        "sender_full_name": "RalfJ",
        "timestamp": 1580564915
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120791\">@RalfJ</span> Did you not receive the cancellation email?</p>",
        "id": 187163223,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1580565603
    },
    {
        "content": "<p>no</p>",
        "id": 187163243,
        "sender_full_name": "RalfJ",
        "timestamp": 1580565668
    },
    {
        "content": "<p>the total number of emails concerning the 2020 all-hands that I got so far is 0</p>",
        "id": 187163247,
        "sender_full_name": "RalfJ",
        "timestamp": 1580565686
    },
    {
        "content": "<p>Dear All Hands participants,</p>\n<p>We have bad news: we are cancelling the Rust All Hands that was scheduled for March. </p>\n<p>This wasn't an easy decision to make. However, we encountered unexpected logistical hurdles that we were not going to be able to resolve in the time remaining. Therefore, we decided it is not feasible to continue with the event as planned. We may attempt to reschedule for later in the year, but that's not certain yet (more on this later).</p>\n<p>We know that many of you have made plans around the event, including booking non-refundable tickets. We are deeply sorry about this and we will do what we can to make it right.</p>\n<p>For those who have already booked flights, Mozilla intends to repay out-of-pocket expenses for individuals where possible. To help us figure out exactly what is needed, we request the following:</p>\n<p>If you purchased flights or hotel, please attempt to cancel them. Hotel reservations, in particular, are often refundable.<br>\nPlease fill out this form detailing the \"out of pocket\" expenses you were not able to get refunded (e.g., the cost of a cancellation fee). Please fill out this form even if you have already sent your reimbursements information earlier, so that we have all the info collected in one place.<br>\nTo help us move quickly, please submit this form data by February 10th!<br>\nPlease reach out to me (Niko) or another member of the Core or All Hands teams if you want to talk in more detail about your situation.<br>\nAlso, if you are a WG lead and you invited anyone to the All Hands, please forward this mail to them. We have included all e-mail addresses we know of, but there may be some who were missed.</p>\n<p>I'm sure you've got many questions. We plan to publish a retrospective in the next week or two that looks over what happened and what went wrong. There were a number of contributing factors and it's not really the fault of any one person or thing.</p>\n<p>In the spirit of turning lemons into lemonade, we do think this is an opportunity to discuss the future of the Rust All Hands. For example, should we attempt to organize an All Hands later this year? And, now that we've grown, do we want to change its structure? These are questions we should be thinking about -- but, for the moment, let's resolve the current situation first.</p>\n<p>Regardless, we wish to thank the University of Macedonia, which was to be our venue, and we'd like to thank the four companies who had offered sponsorship funds which (alias) we will not be using. They were ready to step up and support the Rust community and we think they still deserve credit for it. Those sponsors were:</p>\n<ul>\n<li>Embark</li>\n<li>Facebook</li>\n<li>Fastly</li>\n<li>Mozilla</li>\n</ul>\n<p>Regards,<br>\nNiko, on behalf of the Core Team and the All Hands Working Group</p>\n<p>PS, Apologies for any duplicate mails. I included quite a wide To list to make sure everyone sees it.</p>",
        "id": 187163293,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1580565731
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120791\">@RalfJ</span> What teams/wgs are you part of?</p>",
        "id": 187163298,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1580565754
    },
    {
        "content": "<p>UCG, and kind-of affiliated with lang</p>",
        "id": 187163308,
        "sender_full_name": "RalfJ",
        "timestamp": 1580565808
    },
    {
        "content": "<p>Okay, I believe we have an issue where team working groups aren't on the <code>all@</code> mailing list.</p>",
        "id": 187163375,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1580565916
    },
    {
        "content": "<p>and I think someone added me to the const-eval team on GH as well^^</p>",
        "id": 187163381,
        "sender_full_name": "RalfJ",
        "timestamp": 1580565930
    },
    {
        "content": "<p>well, I guess its good then that I didnt book anything yet :(</p>",
        "id": 187163419,
        "sender_full_name": "RalfJ",
        "timestamp": 1580565977
    }
]