[
    {
        "content": "<p>Hey everyone, we've had some requests for having remote compatible meetings, allowing people who cannot attend in person to still be able to attend the meetings, through video calls. We're wondering if there is a general interest in having this for more meetings?</p>",
        "id": 186398710,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1579792866
    },
    {
        "content": "<p>we probably want that for infra meetings</p>",
        "id": 186398849,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1579792939
    },
    {
        "content": "<p>as aidan might not make it to the all hands</p>",
        "id": 186398861,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1579792948
    },
    {
        "content": "<p>I would, in general, prefer to avoid doing so; it substantially complicates meetings and increases friction. If there's a <em>specific</em> meeting for which we need a specific person or two who are critical to the meeting's success and can't come in person, by all means we should make such arrangements. But I don't think we should be doing that for all meetings.</p>",
        "id": 186416282,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1579802346
    },
    {
        "content": "<p>I also expect that we'll be having some meetings on sensitive topics, for which people will be uncomfortable being on camera. (For instance, trying to talk through sensitive conflicts.)</p>",
        "id": 186416352,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1579802397
    },
    {
        "content": "<p>So I'd suggest that we make it something that <em>can</em> be arranged on request for a specific meeting, if the in-person attendees specifically need an external attendee there to be successful.</p>",
        "id": 186416452,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1579802424
    },
    {
        "content": "<p>oh, I'd definitely not want to make every meeting remote by default</p>",
        "id": 186416490,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1579802458
    },
    {
        "content": "<p>My concern would be in setting the expectation that we'd make a meeting remote because someone <em>wanted</em> to attend remotely, rather than that those attending in person <em>needed</em> someone remote to attend.</p>",
        "id": 186417493,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1579803101
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span> This is more about seeing if there's enough interest to see if it's worth setting up the logistics to have software &amp; hardware to help reduce the friction, it's up to the teams to decide to actually make the call.</p>",
        "id": 186420053,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1579804572
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"219696\">@XAMPPRocky</span> Thank you for the clarification. In that case, it sounds like there's interest. :)</p>",
        "id": 186420282,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1579804758
    },
    {
        "content": "<p>If it helps, I would also imagine that such logistics might only need to be available in one room, and meetings that need such logistics could then get scheduled in that room.</p>",
        "id": 186420387,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1579804816
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span> that would be difficult as we have concurrent meetings at the same time</p>",
        "id": 186431085,
        "sender_full_name": "DPC",
        "timestamp": 1579810751
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120823\">@DPC</span> Concurrent meetings that all need remote attendees, that can't be rescheduled to not be concurrent?</p>",
        "id": 186431143,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1579810798
    },
    {
        "content": "<p>That's a possibility but for that we will have to know in advance</p>",
        "id": 186431214,
        "sender_full_name": "DPC",
        "timestamp": 1579810822
    },
    {
        "content": "<p>(I'm not suggesting that they <em>have</em> to be, I'm just suggesting that we shouldn't need such infrastructure in <em>every</em> room. If we need it in two rooms, that's still better than needing it in every room.)</p>",
        "id": 186431216,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1579810823
    },
    {
        "content": "<p>Yeah it's most likely going to be opt-in</p>",
        "id": 186431256,
        "sender_full_name": "DPC",
        "timestamp": 1579810854
    }
]