[
    {
        "content": "<p>[pt-BR]<br>\nOlá, pessoal, tudo bem?</p>\n<p>Estou interessado em contribuir com a localização do Rust Book para português, pois tenho interesse em divulgar a linguagem entre meus alunos, e ter a versão em português facilitaria muito. Entretanto, percebi que o repositório usado para isso está parado há um tempo e bem atrasado com relação ao texto do repositório original.</p>\n<p>Alguém aqui sabe como está a situação?</p>\n<p>[en]<br>\nHello, guys, how's it going?</p>\n<p>I'm interested in contributing to the localization of the Rust Book to Brazilian Portuguese because I want to introduce the language to my students, and having the Portuguese  version would help a lot. But I get that the repo that is being used for that has not been updated in a while and is behind the upstream by a lot.</p>\n<p>Anyone here knows about it?</p>",
        "id": 226318121,
        "sender_full_name": "Arthur Rodrigues Araruna",
        "timestamp": 1613327232
    },
    {
        "content": "<p>Cara, tem um repositorio no github mas me parece que está meio largado. O pessoal se organiza mais no grupo brasileiro no telegram.</p>",
        "id": 227838874,
        "sender_full_name": "luizdepra",
        "timestamp": 1614287166
    },
    {
        "content": "<p>Sim, eu falei lá nesse grupo do telegram, mas ninguém relacionado ao repositório se manifestou e a conversa morreu...</p>\n<p>Olhando o repo, eu entendi que tiveram muita dificuldade em atualizar a versão do livro sem perder o esforço de tradução que já tinha acontecido e o negócio estagnou depois disso.<br>\nEu queria ter tido feedback se ainda vai continuar por lá, se vai recomeçar ou outra opção.</p>\n<p>(Desculpa a demora de resposta, mas perdi o e-mail de notificação, me envolvi em outras coisas e só agora me lembrei de conferir...)</p>",
        "id": 231398913,
        "sender_full_name": "Arthur Rodrigues Araruna",
        "timestamp": 1616454776
    },
    {
        "content": "<p>Opa! Pena que os brasileiros ou próprios portugueses não aderiram o zulip.<br>\nAcredito os mais populares atualmente seja o discord ou telegram e whatsapp (exceto telegram, desconheço se há algum grupo rust-br).</p>",
        "id": 251062980,
        "sender_full_name": "Matheus C. França",
        "timestamp": 1630164315
    },
    {
        "content": "<p>Estou cá pessoal! <br>\nDe Lisboa com Amor! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 251924199,
        "sender_full_name": "Nelson J Morais",
        "timestamp": 1630694081
    }
]