[
    {
        "content": "<p>I'm creating this topic to start gathering how different tools are using MIR to help us understand current use cases. If you are working or using a tool that uses MIR, can you please add some information about your tool. Here is a quick set of questions that would help us understand your use case:</p>\n<ol>\n<li>What's the name of the tool? If possible, can you please add a link to the source code or any relevant documentation?</li>\n<li>How does it interface with the compiler? E.g.: Fork the compiler, custom driver, custom codegen.</li>\n<li>Does this tool rely on any data flow analysis information?</li>\n<li>Does it require any sort of extra metadata?</li>\n<li>Does it perform any code transformation?</li>\n<li>Any other information that you would like to be captured in a stable MIR?</li>\n</ol>",
        "id": 278062564,
        "sender_full_name": "Celina V.",
        "timestamp": 1649268087
    },
    {
        "content": "<ol>\n<li><a href=\"https://github.com/bjorn3/rustc_codegen_cranelift\">rustc_codegen_cranelift</a>: Cranelift based codegen backend focused on compilation speed.</li>\n<li>Custom codegen using <code>-Zcodegen-backend</code>.</li>\n<li>No</li>\n<li>No</li>\n<li>No</li>\n<li>Nothing the LLVM backend doesn't need either.<br>\nnote: cg_clif will likely keep using the unstable MIR format as it is planned to be distributed as part of rustc in the future</li>\n</ol>",
        "id": 278071443,
        "sender_full_name": "bjorn3",
        "timestamp": 1649272079
    },
    {
        "content": "<ol>\n<li><a href=\"https://github.com/xldenis/creusot\">Creusot</a>: A deductive verifier for safe code.</li>\n<li>Custom Driver</li>\n<li>Yes, liveness + initialization checks</li>\n<li>Yes, we currently have to create a custom metadata file which we use to encode the contracts of verified functions in dependent crates</li>\n<li>Only minor MIR cleanups: removing false edges, etc..</li>\n<li>Invariants, proof assertions and ghost code. In general annotations on <code>DefId</code>s are important as they are used to signal different thigns to Creusot (ie: 'trust this function')</li>\n</ol>",
        "id": 278288367,
        "sender_full_name": "Xavier Denis",
        "timestamp": 1649416106
    },
    {
        "content": "<ol>\n<li><a href=\"https://github.com/viperproject/prusti-dev\">Prusti</a>: a deductive verifier.</li>\n<li>Custom driver.</li>\n<li>Yes: borrowck facts, liveness, initialization.</li>\n<li>Currently no, but it is possible that we will follow the Creusot path.</li>\n<li>No: it is important for us that the used MIR is as close to the unoptimized MIR as possible.</li>\n<li>Same as Creusot.</li>\n</ol>",
        "id": 278409038,
        "sender_full_name": "Vytautas Astrauskas [he/him]",
        "timestamp": 1649509141
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116852\">@Andrea Lattuada</span> Could you please add <a href=\"https://github.com/secure-foundations/verus\">Verus</a>?</p>",
        "id": 278409157,
        "sender_full_name": "Vytautas Astrauskas [he/him]",
        "timestamp": 1649509233
    }
]