[
    {
        "content": "<p>Hi: How is it decided who can approve which blog posts? <a href=\"https://github.com/rust-lang/blog.rust-lang.org/pulls\" target=\"_blank\" title=\"https://github.com/rust-lang/blog.rust-lang.org/pulls\">https://github.com/rust-lang/blog.rust-lang.org/pulls</a> I was looking to see about the blog post from the last meeting (which I was slow to put up) and found myself doing some meta thinking, regarding wondering who is able to approve blog posts summarizing meetings and such routine things and if there is more than one person who can do this. I asked Nell if she can and she said no, and she's not sure who can other than Niko. She said this would be a good place to post this question.</p>",
        "id": 190229665,
        "sender_full_name": "Val Grimm",
        "timestamp": 1583877033
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"249394\">@Val Grimm</span> For the main blog, it is approved by the core team. For the \"Inside Rust\" team it is approved by relevant team leads.</p>",
        "id": 190230348,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1583877408
    },
    {
        "content": "<p>There's more information about this on forge. <a href=\"https://forge.rust-lang.org/core/blogs.html\" target=\"_blank\" title=\"https://forge.rust-lang.org/core/blogs.html\">https://forge.rust-lang.org/core/blogs.html</a></p>",
        "id": 190230542,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1583877547
    },
    {
        "content": "<p>oh derp, of course. Thanks. I need to read through all that.</p>",
        "id": 190230629,
        "sender_full_name": "Val Grimm",
        "timestamp": 1583877567
    },
    {
        "content": "<p>Huh, it doesn't talk about who does approvals tho. But still useful. Here's a potentially stupid question: Would it be helpful for extra-busy team leads to have a blog post approval delegate? (Not volunteering, and not impatient, just found myself thinking about all the snowflakes of tasks that become an avalanche)</p>",
        "id": 190230976,
        "sender_full_name": "Val Grimm",
        "timestamp": 1583877752
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"249394\">@Val Grimm</span> Well I think it depends on what you mean by approval. The website maintainers act some kind of delegate for leads who don't have merge permission.</p>",
        "id": 190232230,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1583878550
    },
    {
        "content": "<p>One of the problems with the blog is currently doesn't assign the right people for reviews.</p>",
        "id": 190232454,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1583878688
    }
]