[
    {
        "content": "<p>We had a really interesting discussion in a recent compiler-team meeting that kind of changed my perspective here. The core idea that <span class=\"user-mention\" data-user-id=\"125250\">@Wesley Wiser</span> raised was that we could categorize groups not so much by whether they are pursuing a fixed project or not (as I had proposed) but more by their <strong>activity level</strong>. In the compiler team, we would have three levels of activity:</p>\n<ul>\n<li>Notification groups -- no leadership or agenda, just a list of people to ping. We use these for things like \"cleanup crew\".</li>\n<li>Project group -- has a lead and a plan and regular activity. It's something you can join. But joining basically means showing up and participating. If this activity slows down, may get demoted to a notification group.</li>\n<li>Team -- an established project with a decision making structure. Membership is more of a commitment, and we really shouldn't let these dissolve lightly.</li>\n</ul>\n<p>The meeting was held on Zulip, you can read it in <a class=\"stream-topic\" data-stream-id=\"238009\" href=\"/#narrow/stream/238009-t-compiler.2Fmeetings/topic/.5Bdesign.20meeting.5D.20areas.20of.20the.20compiler.20compiler-team.23288\">#t-compiler/meetings &gt; [design meeting] areas of the compiler compiler-team#288</a></p>",
        "id": 202359707,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1593460264
    },
    {
        "content": "<p>Still pondering it</p>",
        "id": 202359735,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1593460279
    },
    {
        "content": "<p>Hm, that is an interesting distinction. Though it seems that at a particular point in time, a team might actually have less activity than a project group, without changing their categorization.</p>",
        "id": 202368062,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1593464805
    },
    {
        "content": "<p>I think the temporary/permanent distinction is probably the most valuable: teams are intended to last indefinitely, project groups have some idea of when they'll be \"done\".</p>",
        "id": 202368250,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1593464903
    },
    {
        "content": "<p>worth discussing in meeting today as part of group definition RFC prep?</p>",
        "id": 203353852,
        "sender_full_name": "Val Grimm",
        "timestamp": 1594275502
    }
]