[
    {
        "content": "<p>About 6 months ago, someone came to the governance channel and posted a link to the \"Sustainable Free and Open Source Communities\" project's page on governance. Centril pulled out this quote and took issue with it:</p>\n<blockquote>\n<p>Rust consists of several teams, with ultimate authority resting in the “core team”. [...] However - the issue here is that, ultimately, if the core team itself should fail to represent the will of the Rust community, there would be no recourse.</p>\n</blockquote>\n<p>The discussion starts here:</p>\n<p><a href=\"https://discordapp.com/channels/442252698964721669/557273736118796289/638457756952559631\">https://discordapp.com/channels/442252698964721669/557273736118796289/638457756952559631</a></p>",
        "id": 199786999,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1591294311
    },
    {
        "content": "<p>Centril asserted that non-core teams are not subordinate to the core team, despite that being the relationship described in the governance RFC, <a href=\"https://github.com/rust-lang/rfcs/blob/master/text/1068-rust-governance.md\">#1068</a>. But I didn't feel that I had any more clarity about the relationship after the discussion than before it.</p>",
        "id": 199787374,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1591294475
    },
    {
        "content": "<p>I just think that's wrong.</p>",
        "id": 199788381,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591295049
    },
    {
        "content": "<p>It has not come up very often, and I think the general belief is that if the core team \"has to\" intervene or over-rule that's a failure condition, but the structure was definitely setup to be hierarchical.</p>",
        "id": 199788461,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591295088
    },
    {
        "content": "<p>I think that we've been very fortunate that the core team has not <em>had</em> to intervene almost ever, so it's sort of hard to tell :)</p>",
        "id": 199788522,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591295114
    },
    {
        "content": "<p>As someone closely involved in the drafting of <a href=\"https://github.com/rust-lang/rfcs/issues/1068\">RFC#1068</a>, I can definitely tell you that this was a core debate that we discussed quite a lot (whether the core team as the \"root\" of a tree or what)</p>",
        "id": 199788575,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591295145
    },
    {
        "content": "<p>Now we could discuss whether the current setup is <em>right</em> -- I've gone back and forth on that a bit here and there -- but I've ultimately come to the feeling that it is good to have a \"buck stops here\" group.</p>",
        "id": 199788676,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591295180
    },
    {
        "content": "<p>(That doesn't imply that the system is perfect as designed.)</p>",
        "id": 199788698,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591295192
    },
    {
        "content": "<p><a href=\"https://github.com/rust-lang/rfcs/issues/1068\">RFC#1068</a> to be clear, not your \"kill rust abi 2\" PR from 2011. <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 199788720,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1591295205
    },
    {
        "content": "<p>LOL</p>",
        "id": 199788731,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591295210
    },
    {
        "content": "<p>Yes...</p>",
        "id": 199788780,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591295230
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116009\">nikomatsakis</span> <a href=\"#narrow/stream/223182-wg-governance/topic/Core.20team.20and.20.22unilateral.22.20decisions/near/199788381\">said</a>:</p>\n<blockquote>\n<p>I just think that's wrong.</p>\n</blockquote>\n<p>Sorry, what's just wrong? SFOSC's description of Rust's governance structure, or Centril's assertion that that description was incorrect?</p>",
        "id": 199807853,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1591304442
    },
    {
        "content": "<p>I think the assertion is incorrect. Core has not exercised that 'buck stops here' bit often, but I think we do need something like that, and I think that it is the case today.</p>\n<p>I would agree agree that it's likely not a perfect system, but I think it is the right system for us at this time, though adjustments could of course be made if there's arguments for that.</p>",
        "id": 199808647,
        "sender_full_name": "simulacrum",
        "timestamp": 1591304895
    },
    {
        "content": "<p>I would agree with that, there needs to be some kind of way to escalate concerns. I do worry though that some of the meta structures around core have become a bit opaque over the past few years as the core team has changed. Membership for example in 2015 I remember it being a pretty clear one-to-one mapping of core to of leads in the teams, nowadays however core has members who are not leads of teams and there are teams that are not represented in core.</p>",
        "id": 199816851,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1591309927
    },
    {
        "content": "<p>Not that that is a problem necessarily , but I think it could be clarified.</p>",
        "id": 199817071,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1591310108
    },
    {
        "content": "<p>for sure!</p>",
        "id": 199818911,
        "sender_full_name": "simulacrum",
        "timestamp": 1591311414
    },
    {
        "content": "<p>Yes, Centril's assertion is incorrect here. He's said stuff like that a couple times, unsure where he got it from. The core team very very strongly avoids exercising this power, though.</p>\n<p>In the cases where subteam concerns have come up to the core team the modus operandi is basically \"core team discusses it, and lead of that toplevel subteam (who is also on core) continues the discussion within the team, incorporating core feedback\"</p>",
        "id": 200124085,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1591634253
    },
    {
        "content": "<p>like, if there were devtools issues that core was made aware of, core would discuss it with me present and then I'd discuss it with the team and we'd come up with something. core provides input, not top-down decisionmaking. usually</p>",
        "id": 200124205,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1591634303
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"219696\">XAMPPRocky</span> <a href=\"#narrow/stream/223182-wg-governance/topic/Core.20team.20and.20.22unilateral.22.20decisions/near/199816851\">said</a>:</p>\n<blockquote>\n<p>Membership for example in 2015 I remember it being a pretty clear one-to-one mapping of core to of leads in the teams, nowadays however core has members who are not leads of teams and there are teams that are not represented in core.</p>\n</blockquote>\n<p>While I agree that we need to clarify how someone gets to be a member of core (and this has been on our list of topics to address for a while), I was not a team lead when I joined and before me, wycats was not a team lead and was on core</p>",
        "id": 200135904,
        "sender_full_name": "Carol (Nichols || Goulding)",
        "timestamp": 1591640064
    },
    {
        "content": "<p>That's fair, I had only started participating in Rust at that time, so there's probably a lot of history I'm missing. The first Rust thing I saw actually was your talk on the history of Rust. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 200136370,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1591640292
    },
    {
        "content": "<p>As I recall, the original idea of the core team was:</p>\n<ul>\n<li>it includes all team leads</li>\n<li>and it includes other \"wise people\" that may not have time for that</li>\n</ul>\n<p>The rule that it must include all team leads has not, I think, weathered particularly well, especially as we've grown a richer team structure. I'm not sure of the best replacement, though I have some thoughts.</p>",
        "id": 200158817,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1591651985
    }
]