[
    {
        "content": "<p>The topic name comes from <a href=\"https://www.reddit.com/r/rust/comments/qzme1z/comment/hlnxl9f/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">this Reddit post by Matthieu M</a> written in the wake of his and the rest of the erstwhile moderation team's resignation.</p>\n<p>While I have no further context on the instigating factors than what the moderation team offered in their resignation, I can't help but be reminded of this <a href=\"#narrow/stream/223182-wg-governance/topic/Core.20team.20and.20.22unilateral.22.20decisions/near/199786999\">prior conversation we've had</a> about whether or not the Core Team is in fact capable of \"unilateral\" decision-making.</p>\n<p>Since then, of course, this group has become essentially defunct, for various reasons (despite the badge saying our status is \"active\" in <a href=\"https://github.com/rust-lang/wg-governance\">the repo</a>).</p>\n<p>What I would like to know is, can this working group be revitalized to help address the current \"crisis\"? (And, for anyone with more insight into what's actually happening, do you agree with MM's assessment, which may be somewhat hyperbolic, that this is a \"crisis\"?) It seems like any analysis of the problem needs to happen in private for now, since the details of what transpired are intentionally not public. So presumably Zulip is not the right forum for that. But we do at least constitute a set of people interested in helping develop more transparent and resilient governance structures and practices.</p>\n<p><span class=\"user-group-mention\" data-user-group-id=\"2317\">@WG-governance</span></p>",
        "id": 262384906,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1637619237
    },
    {
        "content": "<p>I'm going to say that this group hasn't done much that has been seen by the community, and does not have a level of community trust (as a group; individuals might) that we are capable of doing stuff like this, so I'd be very wary of us inserting ourselves into a complex mess that we as a group have little context on and have little community trust to go fix.</p>\n<p>I think this stuff will need to be addressed; and ideally by a group that's not just core (though i see immediate progress on this as mostly being in core's hands), but I don't think this group is that.</p>",
        "id": 262385824,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1637619630
    },
    {
        "content": "<p>I largely agree with <span class=\"user-mention\" data-user-id=\"132040\">@Manish Goregaokar</span> here</p>",
        "id": 262394259,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1637625125
    },
    {
        "content": "<p>but I appreciate the sentiment, <span class=\"user-mention\" data-user-id=\"120076\">@BatmanAoD (Kyle Strand)</span></p>",
        "id": 262394266,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1637625132
    },
    {
        "content": "<p>This might be a good case for one of the more ephemeral group types that were mentioned in a Rust Blog a while back. I think drafting the plan for such a group would be within the purview of this space, which can then be finalized and executed by non-Core members</p>",
        "id": 262395096,
        "sender_full_name": "Khionu Sybiern",
        "timestamp": 1637625654
    },
    {
        "content": "<p>My concern is not acting too slowly. By no means do I want to rush things, we should take our time especially with how this hits the community emotionally, Step 0 should happen soon.</p>",
        "id": 262395197,
        "sender_full_name": "Khionu Sybiern",
        "timestamp": 1637625722
    },
    {
        "content": "<p>What I've heard is that for the sake of appearances, some sort of statement should be made within 48h, as a general guideline for PR.</p>",
        "id": 262395317,
        "sender_full_name": "Khionu Sybiern",
        "timestamp": 1637625794
    },
    {
        "content": "<p>Not saying we need to hold to that, but it's an idea of what kind of time scale is at play</p>",
        "id": 262395340,
        "sender_full_name": "Khionu Sybiern",
        "timestamp": 1637625814
    },
    {
        "content": "<p>I'll say that there's already been an effort to build such a group for wider purpose (unrelated to this specific drama) and i think that that group may be able to work on this if it can be spun up quickly enough.</p>\n<p>I don't think that this group; which largely was formed out of random volunteers, didn't end up doing much, and has no trust within the community -- should be in charge of fixing this.</p>",
        "id": 262395409,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1637625852
    },
    {
        "content": "<p>What other group is that? I've not heard of it</p>",
        "id": 262395430,
        "sender_full_name": "Khionu Sybiern",
        "timestamp": 1637625877
    },
    {
        "content": "<p>doesn't exist yet, and it's not been publicly talked about, but it is part of the improvements in rust governance a core team blog post hinted to</p>",
        "id": 262395470,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1637625915
    },
    {
        "content": "<p>it's being discussed amongst team leads</p>",
        "id": 262395516,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1637625920
    },
    {
        "content": "<p>I would like to make sure the Mods Team has representation there</p>",
        "id": 262395608,
        "sender_full_name": "Khionu Sybiern",
        "timestamp": 1637625969
    },
    {
        "content": "<p>given rust's governance i think if any non-core group is going to take the lead of fixing this it should be the toplevel teams or the toplevel team leads</p>",
        "id": 262395610,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1637625971
    },
    {
        "content": "<p>(i don't think it's productive to discuss in-progress plans in a public channel like this)</p>",
        "id": 262395637,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1637626004
    },
    {
        "content": "<p>As a naive community member, where/when can I get updates about the crisis?</p>",
        "id": 262699909,
        "sender_full_name": "Iago-lito",
        "timestamp": 1637843379
    },
    {
        "content": "<p>I would expect anything official to be posted on the rust blog. I’m not sure what kind of unofficial updates there might be, but Twitter, r/rust, hacker news seem to pick things up pretty quickly</p>",
        "id": 262708941,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1637848900
    },
    {
        "content": "<p><a href=\"https://blog.rust-lang.org/inside-rust/2021/11/25/in-response-to-the-moderation-team-resignation.html\">https://blog.rust-lang.org/inside-rust/2021/11/25/in-response-to-the-moderation-team-resignation.html</a> was already posted</p>",
        "id": 262723583,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1637857029
    }
]