[
    {
        "content": "<p>So I think we should discuss the future of this group at some point. I'm taking a hard look at my own time/resources and trying to focus and pare back where it makes sense, and I know a lot of us who were involved are going through various transitions right now. There's also the ongoing work to create a foundation which will consume time and energy.</p>",
        "id": 208345259,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598622835
    },
    {
        "content": "<p>I guess I'm wondering if it makes sense to suspend the group meetings (and maybe group) for a bit, and consider revisiting? On the other hand, I think a lot of the questions we've been talking about (domain working groups, rfcs, etc) are still quite relevant.</p>",
        "id": 208345388,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598622888
    },
    {
        "content": "<p>Similarly I still feel like the compiler team could use help in writing down and formulating our processes etc</p>",
        "id": 208349545,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598624932
    },
    {
        "content": "<p>in short I still think there's work to do :)</p>",
        "id": 208349556,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598624937
    },
    {
        "content": "<p>but I am rethinking my own commitments and trying to make sure they are realistic</p>",
        "id": 208349588,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598624951
    },
    {
        "content": "<p>Can some of the work be subsumed into other activities/groups? (I don't have any specific ideas for how this would work.) Would it help for me to take a more active role and spend more time on this group's projects?</p>",
        "id": 208356833,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1598628258
    },
    {
        "content": "<p>Yeah I was going to discuss this next week. With the shortage of time I think we should focus on trying to get just a single task completed for the end of the year. I have an idea of what that could be which I think ties together our previous work. Basically inspired by the <a href=\"https://github.com/django/deps/blob/master/accepted/0010-new-governance.rst\">django governance rfc</a>, I would love if we could have a similar document that provides a similar high level overview of the governance of the project. </p>\n<p>I don't know if one task requires regular meetings though. It seems like something that can handled mostly async.</p>",
        "id": 208364403,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1598631789
    },
    {
        "content": "<p>That does inspirational, though I think it's no small task</p>",
        "id": 208378395,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598639058
    },
    {
        "content": "<p>It is possible that we could find a way to operate that would help, not sure, it is also possible that other folks might like to get involved (e.g., <span class=\"user-mention\" data-user-id=\"116014\">@ag_dubs</span>, though she's not presently subscribed to this stream) and that might increase overall bandwidth.</p>",
        "id": 208378468,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598639098
    },
    {
        "content": "<p>I think a key thing would be \"how is that document made\" -- we've talked about the idea of going in to work <em>with</em> teams to get the work done</p>",
        "id": 208378517,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598639127
    },
    {
        "content": "<p>(and in that sense I personally might enjoy participating not as a member of gov wg but as a rep of compiler or lang or something)</p>",
        "id": 208378547,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598639143
    },
    {
        "content": "<p>Yeah, thinking on this more I think there's a blocker to writing that document which is more of the teams having charters so their roles are clear and can be then be included as a summary in a higher level document. There's been quite a bit of <a href=\"https://hackmd.io/FasfT5zzQZuy0c0AxYQRBg\">progress on the libs team</a> towards this, so maybe we should start to approach more teams about helping to create a charter?</p>",
        "id": 208429803,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1598701454
    },
    {
        "content": "<p>So far I’ve found the “general compass direction” kind of support from the group in what we should be trying to establish and what tools/approaches work for other teams to be really helpful. Maybe capturing some of that in docs would be a low-bandwidth way to support other teams?</p>",
        "id": 208429945,
        "sender_full_name": "Ashley Mannix",
        "timestamp": 1598701783
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"219696\">@XAMPPRocky</span> that was our current plan, iirc, we just haven't made a lot of progress on it for other teams -- but starting with libs seems good.</p>",
        "id": 208433315,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598706785
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span> and I would be enthusiastic to do the work from lang</p>",
        "id": 208433324,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598706808
    },
    {
        "content": "<p>it's also true that the last like 3 weeks have been... a bit distracting :)</p>",
        "id": 208433329,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598706817
    },
    {
        "content": "<p>Indeed. Might I suggest a hiatus, and we can re-evaluate in two months?</p>",
        "id": 208437744,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1598712995
    },
    {
        "content": "<p>Happy to support the creation of the document in any way that is practicable. Indeed, recent events have been quite distracting.</p>",
        "id": 208532875,
        "sender_full_name": "Val Grimm",
        "timestamp": 1598863445
    },
    {
        "content": "<p>I think that taking a hiatus is a good idea and re-evaluating</p>",
        "id": 208739427,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598990289
    },
    {
        "content": "<p>we could just say 1 month</p>",
        "id": 208739438,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598990293
    },
    {
        "content": "<p>I do feel like a lot more will be clearer then</p>",
        "id": 208739466,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598990305
    },
    {
        "content": "<p>no need to stop pursuing the work on libs charter etc in the meantime</p>",
        "id": 208739482,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598990316
    },
    {
        "content": "<p>and I think we could do async work e.g. on a lang charter, <span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span></p>",
        "id": 208739498,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598990323
    },
    {
        "content": "<p>though we may just not have time for that, no pressure...plenty to do</p>",
        "id": 208739518,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1598990337
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 208739533,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1598990345
    },
    {
        "content": "<p>Hi, some sad news: My new job is very demanding and it is clear I won't be able to contribute to the development of the very good RFC recently posted or other efforts for some time, although I can help review papers for RustConf next year as I'll have had some time to adapt by then . . . I'll remove myself from the group list on Github. Someday I hope to find another way to help.</p>",
        "id": 212971111,
        "sender_full_name": "Val Grimm",
        "timestamp": 1602432715
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"249394\">@Val Grimm</span> No worries, that’s completely understandable, thank you for your helpful contributions. 🙂</p>",
        "id": 213002744,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1602485217
    },
    {
        "content": "<p>And best of luck with the new job!</p>",
        "id": 213002750,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1602485234
    }
]