[
    {
        "content": "<p>Thought I'd share this (short) blog post about governance discoverability, which I found interesting: <a href=\"https://third-bit.com/2020/08/31/governance.html\">https://third-bit.com/2020/08/31/governance.html</a></p>",
        "id": 208588207,
        "sender_full_name": "Eric Huss",
        "timestamp": 1598894089
    },
    {
        "content": "<p>I like the idea. Rust's <code>CONTRIBUTING</code> is probably more helpful in this regard than most projects' would be; it links to the RFCs repository almost immediately after the table of contents. But otherwise, governance isn't really mentioned. There's a very short summary, mentioning the core team, in the <code>README</code>, but it's at the bottom of the document, in the \"Trademark\" section.</p>",
        "id": 208590698,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1598895425
    },
    {
        "content": "<p>It seems the blog post is suggesting that <code>GOVERNANCE.md</code> would be the \"official\" source of truth regarding how governance works; since Rust's governance is officially documented by RFC 1068, I'm not sure if the <code>GOVERNANCE.md</code> file (if we were to adopt one) would simply have a brief explanation with links to the RFC and  to the \"teams\" page on the website, or if its content would largely be copied from the RFC itself.</p>",
        "id": 208590975,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1598895595
    },
    {
        "content": "<p>I actually think the latter makes more sense: that way, as new RFCs or the actions of this WG change how governance works, they would always be reflected by changes in <code>GOVERNANCE.md</code>. Updating that file would be how governance-related RFCs are \"implemented\".</p>",
        "id": 208591158,
        "sender_full_name": "BatmanAoD (Kyle Strand)",
        "timestamp": 1598895699
    },
    {
        "content": "<p>/me would be interested in seeing that documented in such a way.</p>",
        "id": 208601259,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1598900471
    }
]