[
    {
        "content": "<p>One thing I talked with others at rustconf a bit is splitting out a linker step from rustc, and while motivated by a bunch of other things it's also pretty relevant to pipelining. Often the final crate can be one of the biggest (think build scripts, procedural macros, binaries, etc), but we currently can't pipeline them at all. If Cargo could, however, split out the linker step, we would be able to pipeline everything.</p>\n<p>Imagine, for example, that instead of <code>rustc foo.rs --tons --of --flags</code> Cargo instead executed:</p>\n<div class=\"codehilite\"><pre><span></span>$ rustc foo.rs --do-not-link --tons --of --flags\n$ rustc foo.rs --do-only-link --tons --of --flags\n</pre></div>\n\n\n<p>If we had a scheme like that then <code>--do-not-link</code> would be a pipelineable compilation (it only needs the rmeta from upstream crates) and <code>--do-only-link</code> would have to wait for everything to fully finish. This would be a relatively large-ish change to the compiler but perhaps not the worst thing in the world. Ideally <code>--do-only-link</code> would be <em>very</em> fast since it would forcibly skip all of typechecking and such. Ideally <code>--do-not-link</code> would emit something like a <code>*.rlib</code> but perhaps call it a <code>*.rlink</code> which has all the intermediate information for <code>--do-only-link</code> to immediately resume at the linking phase.</p>\n<p>I think this would allow us to get 100% of the benefit from pipelining architecturally (other than making rmeta generation cheaper and further forward in compilation). This would also have lots of cascading effects on other strategies which want to separate the linker. This would be a relatively big feature for the compiler, though, so it probably wants both experimentation and an RFC to accompany it. Wanted to make sure I wrote down the thoughts though!</p>",
        "id": 174939907,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1567651150
    },
    {
        "content": "<p>I've <a href=\"https://github.com/rust-lang/rust/issues/64191\" target=\"_blank\" title=\"https://github.com/rust-lang/rust/issues/64191\">opened an issue</a> for this topic</p>",
        "id": 175010895,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1567714674
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116015\">@Alex Crichton</span> Has there been any progress on linker pipelining? Is there enough that Cargo could add preliminary support?</p>",
        "id": 204258226,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595019490
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span> I'm not aware of progress myself</p>",
        "id": 204258315,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1595019558
    },
    {
        "content": "<p>I remember a PR for <code>--only-link</code> but I'm not sure where that PR ended up</p>",
        "id": 204258337,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1595019569
    },
    {
        "content": "<p>I saw the one for not linking; I didn't see the one for only linking.</p>",
        "id": 204260758,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595020854
    },
    {
        "content": "<p>I'm very interested in anything that will allow more parallelism. :)</p>",
        "id": 204260787,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1595020867
    },
    {
        "content": "<p>one of the neat bits is that splitting out the linker also makes more of the build cacheable</p>",
        "id": 204265906,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1595024143
    },
    {
        "content": "<p>b/c we basically just need to cache the rlib just-before-the-linker</p>",
        "id": 204265923,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1595024156
    }
]