[
    {
        "content": "<p>Hi folks,<br>\nI'm looking into supporting pipelined compilation in Bazel's rules_rust. There it'd be a big challenge to implement the approach cargo is taking (signalling that metadata are produced and continuing with the link). So instead I'd like to invoke rustc twice, once for metadata files, and once for link.</p>\n<p>AFAIU rmeta files produced only by --emit=metadata cannot be used for downstream compilations, they are only used for cargo check. If I want to use rmeta files for compilations, I have to at least run --emit=metadata,mir. At least my test crate builds fine with mir. So:</p>\n<p>1) is it enough in all cases to emit mir? Or I should conservatively emit link?<br>\n2) would it be possible to make --emit=metadata usable for compilations? In my test crate  emitting mir already slows down the rustc invocation to the point it doesn't make sense. I'm asking about theoretical possibilities at this point, but would it be a welcomed contribution if I attempted to make it work?</p>\n<p>Thank you and have a lovely day :)</p>",
        "id": 225277825,
        "sender_full_name": "Marcel Hlopko",
        "timestamp": 1612518237
    },
    {
        "content": "<blockquote>\n<p>is it enough in all cases to emit mir? Or I should conservatively emit link?.</p>\n</blockquote>\n<p>I think this just happens to work, but isn't guaranteed.</p>\n<blockquote>\n<p>would it be possible to make --emit=metadata usable for compilations? In my test crate emitting mir already slows down the rustc invocation to the point it doesn't make sense. I'm asking about theoretical possibilities at this point, but would it be a welcomed contribution if I attempted to make it work?</p>\n</blockquote>\n<p>The MIR is not encoded in the metadata when using just <code>--emit=metadata</code> to make <code>cargo check</code> faster.</p>",
        "id": 225278710,
        "sender_full_name": "bjorn3",
        "timestamp": 1612518826
    },
    {
        "content": "<p>I see, and we need MIR for downstream compilations. If we're only interested in getting rmeta files for compilations, and we ignore that it's not guaranteed to work, is there some work that --emit=metadata,mir does but could be skipped? Obviously writing the MIR file is one such thing. Is there anything else?</p>",
        "id": 225281412,
        "sender_full_name": "Marcel Hlopko",
        "timestamp": 1612520519
    },
    {
        "content": "<p>I don't think there's anything else. I think an option to emit mir in metadata should work for this use case.</p>",
        "id": 226746082,
        "sender_full_name": "tmandry",
        "timestamp": 1613605979
    }
]