[
    {
        "content": "<p>When I was looking at updating the dependencies for rustc, I noticed that measureme is the only thing that holds back that only one version of parking_lot i compiled so do you think that it is possible to make a new release of measureme?<br>\nit looks like there is no breaking changes for measureme from 0.7.1 until what is on master now but there is one dependency removed and parking_lot is updated</p>",
        "id": 209709020,
        "sender_full_name": "andjo403",
        "timestamp": 1599771895
    },
    {
        "content": "<p><a href=\"https://github.com/rust-lang/measureme/compare/0.7.1...master\">https://github.com/rust-lang/measureme/compare/0.7.1...master</a><br>\nthe only thing that I can see for measureme in that diff is the removal of byteorder and adding some  \"Send + Sync\" to some results</p>",
        "id": 209709637,
        "sender_full_name": "andjo403",
        "timestamp": 1599772203
    },
    {
        "content": "<p>I think the <code>Send+Sync</code> changes are breaking changes but those are easy to fix.</p>",
        "id": 209752383,
        "sender_full_name": "mw",
        "timestamp": 1599812300
    },
    {
        "content": "<p>I wonder if we could drop the <code>parking_lot</code> dependency altogether. On x86_64 Linux the <code>std</code> Mutex implementation performs about the same. But I don't know about other platforms.</p>",
        "id": 209752721,
        "sender_full_name": "mw",
        "timestamp": 1599812533
    },
    {
        "content": "<p>Hmm do not know why I was thinking last night the send sync was backwards compatible.<br>\nAbout the parking_lot dependency I do not know there is already multiple other crates in rustc that use it.<br>\nBut if you think there is no benefit, less dependencies to keep updated is better.</p>",
        "id": 209758667,
        "sender_full_name": "andjo403",
        "timestamp": 1599816717
    },
    {
        "content": "<blockquote>\n<p>But if you think there is no benefit</p>\n</blockquote>\n<p>It's hard to tell without profiling on all the major platforms</p>",
        "id": 209764810,
        "sender_full_name": "mw",
        "timestamp": 1599820635
    },
    {
        "content": "<p>There's a breaking change in progress (maybe two) so I think it's best to wait a bit for the dust to settle and then we can ship a single new version with all the breaking changes.</p>",
        "id": 209773413,
        "sender_full_name": "Wesley Wiser",
        "timestamp": 1599827154
    },
    {
        "content": "<p><a href=\"https://github.com/rust-lang/measureme/pull/132\">https://github.com/rust-lang/measureme/pull/132</a> is almost done but before we do a new release, I'd also like to fix an issue where <code>measureme</code> crashes when writing too much data (e.g. when compiling <code>rustc_middle</code>). It should be easy enough to push the boundary from 1GB to 4GB.</p>",
        "id": 211243040,
        "sender_full_name": "mw",
        "timestamp": 1601031286
    }
]