[
    {
        "content": "<p>BTW, one thing we had talked about was adding the ability to organize the profile per <code>DefId</code> or source-code location as well, so that people could get an idea what part of their programs are forcing compilation to take a long time. This just came up when I was talking to <span class=\"user-mention\" data-user-id=\"116609\">@Frank McSherry</span>, so it popped in my mind again -- I know it's not on the MVP plans, but do we still have this down as a kind of \"eventually\" sort of item?</p>",
        "id": 160362670,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1552129483
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116609\">@Frank McSherry</span> may have some good ideas of what specifically they want, as well. I remember <span class=\"user-mention\" data-user-id=\"116015\">@Alex Crichton</span> also being interested.</p>",
        "id": 160362673,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1552129495
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116015\">@Alex Crichton</span> and <span class=\"user-mention\" data-user-id=\"119235\">@David Tolnay</span> asked me about this at All Hands. We should have some kind of place to track these longer term ideas. Right now we're blocked on standardizing the export format from <code>rustc</code>. After that happens, a lot of these tools could probably be developed rather independently. Which might be a good opportunity for new people wanting to contribute.</p>",
        "id": 160374010,
        "sender_full_name": "Wesley Wiser",
        "timestamp": 1552149110
    },
    {
        "content": "<p>profiling per query key is definitely planned. Source-code locations I don't know...</p>",
        "id": 160463777,
        "sender_full_name": "mw",
        "timestamp": 1552297039
    },
    {
        "content": "<p>I think per-key is roughly the same thing as source-code locations</p>",
        "id": 160713939,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1552501248
    }
]