[
    {
        "content": "<p>I've opened <a href=\"https://github.com/rust-lang/rust/issues/76044\">#76044</a> with the extension to the dataflow framework required to implement flow-sensitive const propagation. I don't know the current state of MIR const propagation, and I suspect there's more work to be done before switching to the dataflow-based approach. However, there should soon be one less blocker for those who wish to take this on.</p>",
        "id": 208461037,
        "sender_full_name": "Dylan MacKenzie (ecstatic-morse)",
        "timestamp": 1598747277
    },
    {
        "content": "<p>So with <a href=\"https://github.com/rust-lang/rust/issues/76044\">#76044</a> it should be possible remove bounds checks such as those presented in e.g. <a href=\"https://github.com/rust-lang/rust/issues/75525\">#75525</a> by having a lattice that stores something like struct Bounds {lower: u128, higher: u128} where the bounds would get updated in transfer functions for e.g. Lt statements?</p>",
        "id": 208486718,
        "sender_full_name": "Simon Vandel Sillesen",
        "timestamp": 1598796472
    },
    {
        "content": "<p>That should be possible. You need to be careful about convergence for a lattice as big as the set of ranges of a 128-bit integer though. For instance, trying to model arithmetic operations in that context is a no-go, since incrementing a  counter in a loop would cause your analysis to hang indefinitely.</p>",
        "id": 208496437,
        "sender_full_name": "Dylan MacKenzie (ecstatic-morse)",
        "timestamp": 1598809742
    },
    {
        "content": "<p>Sure. As a first draft an iteration limit should allow termination rather simply. I don’t know if you thoughts on anything more advanced?</p>",
        "id": 208606119,
        "sender_full_name": "Simon Vandel Sillesen",
        "timestamp": 1598902961
    },
    {
        "content": "<p>My thought was that your optimization will work better if arithmetic operations on a place cause that place to be assigned a maximally conservative range. This may have been your plan all along, but it wouldn't have been obvious to me. Hitting an iteration limit means that you cannot optimize <em>anything</em> in the function, since fixpoint wasn't reached.</p>",
        "id": 208607145,
        "sender_full_name": "Dylan MacKenzie (ecstatic-morse)",
        "timestamp": 1598903565
    },
    {
        "content": "<p>Modulo by a constant would be fine of course, but trying to model addition or subtraction by a constant is probably not a good idea.</p>",
        "id": 208608045,
        "sender_full_name": "Dylan MacKenzie (ecstatic-morse)",
        "timestamp": 1598904019
    },
    {
        "content": "<p>Is this something where widening (as in abstract interpretation) can be used? I don't have any practical experience with that, but from what I've read and understand they are used to avoid infinite or impractically long chains during fixpoint computations.</p>",
        "id": 208654443,
        "sender_full_name": "Jannis Harder",
        "timestamp": 1598946379
    },
    {
        "content": "<p>Perhaps? I'm not familiar with that particular piece of jargon.  If it means: \"Make a more conservative assumption about the possible values of a variable to speed up convergence\", then yes.</p>",
        "id": 208720724,
        "sender_full_name": "Dylan MacKenzie (ecstatic-morse)",
        "timestamp": 1598981436
    },
    {
        "content": "<p>Yes, but instead of saying arithmetic operations are always approximated maximally conservative you do it dynamically instead, e.g. every time an interval grows, you require it to double in size, and if it doesn't you make it larger so it does</p>",
        "id": 208724767,
        "sender_full_name": "Jannis Harder",
        "timestamp": 1598983496
    },
    {
        "content": "<p>At least that's my intuitive understanding, as I haven't used it myself I'm not sure how well that matches the actual theory... besides widening there is also something called narrowing, which you do after you find a fixed point to regain some of the precision lost during widening... but I don't have any intuition for that at all</p>",
        "id": 208725061,
        "sender_full_name": "Jannis Harder",
        "timestamp": 1598983593
    },
    {
        "content": "<p>I sadly didn't keep notes when I last read about abstract interpretation and I wasn't really interested in widening/narrowing at that time, but I did remember that quickly finding the exact bounds for loops that increment counters was one of the prototypical examples, so I thought mentioning that here can't hurt</p>",
        "id": 208726694,
        "sender_full_name": "Jannis Harder",
        "timestamp": 1598984325
    },
    {
        "content": "<p>Ah, that doubling strategy is an interesting compromise and certainly worth looking into.</p>",
        "id": 208736764,
        "sender_full_name": "Dylan MacKenzie (ecstatic-morse)",
        "timestamp": 1598988947
    },
    {
        "content": "<p>Skimming chapter 7 of <a href=\"https://cs.au.dk/~amoeller/spa/\">https://cs.au.dk/~amoeller/spa/</a> they describe another trick in widening. We can divide the u128 domain into intervals which can be seeded from the mir body. So for instance the intervals could be 0, 5, 8, Inf given that 5 and 8 are constants derived from e.g Lt and Gt statements. That should converge the algorithm faster</p>",
        "id": 208743731,
        "sender_full_name": "Simon Vandel Sillesen",
        "timestamp": 1598992108
    },
    {
        "content": "<p>to find out more about this, it is called \"(value) range analysis\" in the literature. But I guess this can also ask the question of representation: either we can use published algorithms to have their safety/soundness/efficiency properties but they mostly use SSA or e-SSA, or we have to adapt them and risk losing some of those properties (which is similar to Cranelift's situation in the past, prompting them to switch from EBBs to BBs)</p>",
        "id": 208928692,
        "sender_full_name": "lqd",
        "timestamp": 1599117444
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"139182\">@Simon Vandel Sillesen</span> today's the day my auto-imposed deadline of two weeks is due. Uni still hasn't got back to me <span aria-label=\"cry\" class=\"emoji emoji-1f622\" role=\"img\" title=\"cry\">:cry:</span> so that means I'm now definitely relinquishing the flow sensitive const-prop to you. Best of luck <span aria-label=\"sparkling heart\" class=\"emoji emoji-1f496\" role=\"img\" title=\"sparkling heart\">:sparkling_heart:</span></p>",
        "id": 209132277,
        "sender_full_name": "Félix Fischer",
        "timestamp": 1599247597
    },
    {
        "content": "<p>Also, if I may suggest a cool name: you can totally call this feature \"Non-Lexical Const Prop\" ;)</p>",
        "id": 209132325,
        "sender_full_name": "Félix Fischer",
        "timestamp": 1599247634
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"212698\">@Félix Fischer</span> sorry to hear about uni<span aria-label=\"exhausted\" class=\"emoji emoji-1f625\" role=\"img\" title=\"exhausted\">:exhausted:</span> I don't want to claim too much work, so feel free to start on it <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> I can only work some time of my free time in it anyway</p>",
        "id": 209151747,
        "sender_full_name": "Simon Vandel Sillesen",
        "timestamp": 1599264572
    }
]