[
    {
        "content": "<p>Hi! We were wondering in #project-portable-simd if the aarch64 build triples are supposed to always include Neon SIMD support even if e.g. other armv8 triples do not? ARMv8 is specified to not necessarily <em>have to</em> include SIMD, but everything seems to suggest aarch64 itself does (or at least supports some subset) which is why I ask, e.g. <a href=\"https://developer.arm.com/documentation/den0024/a/aarch64-floating-point-and-neon\">https://developer.arm.com/documentation/den0024/a/aarch64-floating-point-and-neon</a></p>\n<blockquote>\n<p>Both floating-point and NEON are required in all standard ARMv8 implementations. However, implementations targeting specialized markets may support the following combinations:</p>\n</blockquote>\n<p>I also understand it has an \"aarch32\" identity that is mostly like the armv7{a,t} architectures and can run code like they do, and I was wondering if it supports using the Neon SIMD units as 64-bit vectors in aarch64 mode, or only in aarch32 mode. The question in particular is really, \"if I issue a 64-bit vector instruction to aarch64, will it accept that instruction, and if it does, will it execute a 64-bit vector operation where no activity occurs in the other 64 bits of the SIMD vector, or will it execute a 128-bit vector operation and try to pretend the other 64 bits didn't matter?\" The latter behaviour Works, but is of slight concern because then the question is if those bits are allowed to e.g. set floating point flags, amongst other things.</p>",
        "id": 211435020,
        "sender_full_name": "Jubilee",
        "timestamp": 1601241586
    },
    {
        "content": "<p>Technically speaking an ARMv8 CPU is <em>required</em> to support NEON.</p>",
        "id": 211439999,
        "sender_full_name": "Amanieu",
        "timestamp": 1601249636
    },
    {
        "content": "<p>All armv8 triples should have the neon feature enabled.</p>",
        "id": 211440042,
        "sender_full_name": "Amanieu",
        "timestamp": 1601249663
    },
    {
        "content": "<p>In some cases you may want to compile with FP/NEON disabled, e.g. in a kernel. But this is done with a custom target.</p>",
        "id": 211440062,
        "sender_full_name": "Amanieu",
        "timestamp": 1601249715
    },
    {
        "content": "<p>If NEON is support you are guaranteed to have the full 128-bit registers and instructions available. There are separate instructions for 64-bit SIMD and 128-bit SIMD.</p>",
        "id": 211440124,
        "sender_full_name": "Amanieu",
        "timestamp": 1601249783
    },
    {
        "content": "<p>Ah, I thought there were some Neon implementations for armv7 targets that only had 64-bit vector registers,<br>\nand that ARMv8-M does not necessarily support Neon instructions?</p>",
        "id": 211442293,
        "sender_full_name": "Jubilee",
        "timestamp": 1601253147
    },
    {
        "content": "<p>It says on page linked above that \"floating-point and NEON are required in all standard ARMv8 implementations\", but also \"implementations targeting specialized markets may support the following combinations\" one of which is \"No NEON or floating-point\".</p>",
        "id": 211442613,
        "sender_full_name": "Lokathor",
        "timestamp": 1601253734
    },
    {
        "content": "<p>I'm less familiar with ARMv8-M, but that's a 32-bit only architecture.</p>",
        "id": 211442633,
        "sender_full_name": "Amanieu",
        "timestamp": 1601253785
    },
    {
        "content": "<p>Well my point is that <em>standard</em> <code>ARMv8</code> has Neon, but not <em>all</em> <code>ARMv8</code> will have it.</p>\n<p>Still, our target profiles should have it enabled and then people can make alternate target profiles for their exceptional CPUs that don't have it.</p>",
        "id": 211442697,
        "sender_full_name": "Lokathor",
        "timestamp": 1601253884
    },
    {
        "content": "<p>I searched and confirmed that there's some background work for armv8r targets that do not have Neon as a feature.</p>",
        "id": 211531532,
        "sender_full_name": "Jubilee",
        "timestamp": 1601318152
    },
    {
        "content": "<p>I'm going to run down the person who added that and chatter with them. armv8r shouuuld always be it's own target, but</p>",
        "id": 211536435,
        "sender_full_name": "Jubilee",
        "timestamp": 1601320313
    },
    {
        "content": "<p>Why do you need to know this? Just check for the <code>neon</code> target feature.</p>",
        "id": 211547315,
        "sender_full_name": "Amanieu",
        "timestamp": 1601325565
    },
    {
        "content": "<p>Well it's important to know because we need to write documentation about default features of targets down as part of writing the SIMD usage guide.</p>",
        "id": 211552860,
        "sender_full_name": "Lokathor",
        "timestamp": 1601328582
    },
    {
        "content": "<p>armv8 covers many things, too many to be useful as a target discriminator on<br>\nits own.</p>\n<p>The Arm architecture has three profiles: A, R and M. The A profile targets<br>\nphones, laptops, servers, anything where the OS needs an MMU. The R and M<br>\nprofiles target more embedded use cases from hard drives to sensors, usually<br>\nusing RTOSes. Each profile will have different target triples.</p>\n<p>armv8-A: NEON is <em>required</em>. Often the A is omitted when referring to armv8-A<br>\narmv8-R, NEON is optional.<br>\narmv8-M, no NEON. The M-Profile is a bit particular, it doesn't have 64-bit<br>\nsupport or even 32-bit arm, it only supports the Thumb instruction set. In the<br>\nRust compiler it is supported as thumbv8m* triples.</p>\n<p>Recently the M-Profile gained optional support for vector extension (MVE), but<br>\nMVE is different from NEON and is not available on other profiles.</p>\n<p>HTH,<br>\nRodolph.</p>",
        "id": 211907057,
        "sender_full_name": "Rodolph Perfetta",
        "timestamp": 1601558024
    },
    {
        "content": "<p>It does, thank you!</p>",
        "id": 211907732,
        "sender_full_name": "Jubilee",
        "timestamp": 1601558284
    }
]