[
    {
        "content": "<p>Hi! My project is getting an \"updating <a href=\"http://crates.io\">crates.io</a>\" index on every build, even no-op ones, which is mildly annoying as it slows down builds. I'd like some help figuring out why it is doing this.</p>\n<p>I've tried deleting the project's target directory as well as deleting <code>~/.cargo/git</code>. I have a <code>CARGO_LOG=debug</code> log of Cargo up to the point where it emits the message <a href=\"https://gist.github.com/lf-/9f757e36e189e283a69af672693219db\">here</a>, and the project in question is at <a href=\"https://github.com/lf-/mu\">https://github.com/lf-/mu</a></p>\n<p>I am familiar enough with cargo to build it from git if necessary.</p>\n<p>Specific cargo invocations that do this for me: <code>cargo b --release</code> <em>in <code>kern/</code> or <code>shoo/</code></em> (working dir required to pick up the target config settings). Don't worry about the makefile, it doesn't do anything necessary to reproduce this. You will need <code>clang</code> and a nightly toolchain on your system to build this, but nothing else is required for looking at cargo shenanigans.</p>\n<p><code>cargo --version</code>: <code>cargo 1.53.0-nightly (65d57e6f3 2021-04-04)</code></p>",
        "id": 235509304,
        "sender_full_name": "Jade",
        "timestamp": 1619011676
    },
    {
        "content": "<p>Hm this definitely sounds like a bug! My guess is that it's probably related to <code>-Zbuild-std</code> in one form or another. Can you report a bug on Cargo?</p>",
        "id": 235532399,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1619019217
    },
    {
        "content": "<p>Alright, filed one. The reduction for the bug implies it is definitely something build-std related. <a href=\"https://github.com/rust-lang/cargo/issues/9390\">https://github.com/rust-lang/cargo/issues/9390</a></p>",
        "id": 235618005,
        "sender_full_name": "Jade",
        "timestamp": 1619065631
    }
]