[
    {
        "content": "<p>Hey guys, during the discussions of a RFC, I wondered what needs to happen if we want to introduce a breaking change to cargo. There was some talk about \"edition change\", but I don't understand what that means in context of cargo rather than rust.</p>",
        "id": 233120969,
        "sender_full_name": "pksunkara",
        "timestamp": 1617579830
    },
    {
        "content": "<p>We do not have as formal a policy about how and when we do braking changes. We try to have them be opted in, like by depending on a flag in the <code>Cargo.toml</code> ( like <code>edition</code> ), but can hadal it other ways when that is not possible. What did you have in mined?</p>",
        "id": 233121222,
        "sender_full_name": "Eh2406",
        "timestamp": 1617580084
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120179\">@Eh2406</span> Discussion is about which way to take this RFC, <a href=\"https://github.com/rust-lang/rfcs/pull/3020\">https://github.com/rust-lang/rfcs/pull/3020</a></p>",
        "id": 233121280,
        "sender_full_name": "pksunkara",
        "timestamp": 1617580190
    },
    {
        "content": "<p>Backward compatible by introducing a new key, or changing the existing key and behaviour with 2021 edition</p>",
        "id": 233121340,
        "sender_full_name": "pksunkara",
        "timestamp": 1617580226
    },
    {
        "content": "<p>I have not read that one, yet. My feeling is that we would want it to be a new key to allow for testing. If it is widely liked and used, we can make it opt out in the next edition that roles around. ( like what we are doing with <code>resolver=2</code> ) But it is just my first impression, and not a desition. let alone the desition of the team.</p>",
        "id": 233121585,
        "sender_full_name": "Eh2406",
        "timestamp": 1617580537
    },
    {
        "content": "<p>I was thinking the same. It has been how cargo was being developed, right?</p>",
        "id": 233121654,
        "sender_full_name": "pksunkara",
        "timestamp": 1617580602
    },
    {
        "content": "<p>Yes, that is a patter we use often.</p>",
        "id": 233122777,
        "sender_full_name": "Eh2406",
        "timestamp": 1617581846
    }
]