[
    {
        "content": "<p>In <a href=\"https://github.com/rust-lang/rfcs/blob/master/text/2906-cargo-workspace-deduplicate.md\">RFC 2906</a>, it talks about implicitly adding the version field to path dependencies.  For people leaving off the version field today, it will cause it to now be set.  This probably is fine for most cases but if a dev-dependency depends on something not published but doesn't explicitly call out <code>publish = false</code>, publishing will break.  I looked through the RFC and tracking issue discussions and didn't see this discussed at all.</p>\n<p>Is this a concern or are we ok with this?</p>",
        "id": 278722814,
        "sender_full_name": "Ed Page",
        "timestamp": 1649783376
    },
    {
        "content": "<p>On a only slightly related note, I'm still a bit unsure of the value of this behavior.  Superficially it seems helpful but when combined with <code>version.workspace = true</code> in the dependency, its going to force both to release all the time which is less than ideal but worse is this can get messy with circular dependencies via dev-dependencies.</p>",
        "id": 278723069,
        "sender_full_name": "Ed Page",
        "timestamp": 1649783501
    },
    {
        "content": "<p>Actually, that made me realize this feature does break for users for the <code>publish = true</code> case as well.</p>\n<p>Example crate: <code>clap_derive</code> used to own its own tests and would have a dev-dependency on <code>clap</code>.  <code>clap</code> exports <code>clap_derive</code>.  Both are published.  According to the RFC, <code>clap_derive</code> will implicitly get a <code>clap = { path = \"..\", version = \"{clap.version}\" }</code></p>\n<p>Case 1: If <code>clap_derive</code> and <code>clap</code> use <code>version.workspace = true</code>, then when we bump <code>workspace.version</code>, <code>clap_derive</code> will point to the new <code>clap</code> but it won't be released yet and will fail the verification build that <code>cargo publish</code> does</p>\n<p>Case 2: If we keep the versions independent, we'll break within <code>cargo-release</code> because it bumps all versions in a single commit before doing any <code>cargo publish</code>.  Again, <code>clap_derive</code> will have a dev-dependency on <code>clap</code> that doesn't exist and <code>cargo publish</code>s build will fail.</p>",
        "id": 278723670,
        "sender_full_name": "Ed Page",
        "timestamp": 1649783830
    }
]