[
    {
        "content": "<p>I was reading over  <a href=\"https://github.com/rust-lang/cargo/pull/10308\">https://github.com/rust-lang/cargo/pull/10308</a> today which points to <a href=\"https://internals.rust-lang.org/t/proposal-move-some-cargo-config-settings-to-cargo-toml/13336/14?u=fee1-dead\">https://internals.rust-lang.org/t/proposal-move-some-cargo-config-settings-to-cargo-toml/13336/14?u=fee1-dead</a> saying that we decided in a meeting that this was ok to implement. I may have missed that meeting or I guess I've forgotten, but I recall that we specifically didn't put this setting in the manifest because it's a build-time configuration thing rather than a global configuration thing on the workspace?</p>\n<p>Additionally this PR also claims to fix <a href=\"https://github.com/rust-lang/cargo/issues/9451\">https://github.com/rust-lang/cargo/issues/9451</a> but I'm not sure how moving the configuration around would do that...</p>",
        "id": 268603472,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1642626385
    },
    {
        "content": "<p>As I recall the meeting we were OK with the idea of moving them in general, but wanted them in small chunks so that we could review for exactly this kind of thing. I would not read that comment as saying \"we looked over the list and were totally OK with everything you said\".  If there are reasons this one should not move, we don't need to move it. imo.</p>",
        "id": 268604676,
        "sender_full_name": "Eh2406",
        "timestamp": 1642627056
    },
    {
        "content": "<p>This, exactly. The general concept of \"go ahead and do this in reasonable chunks\" was something we had consensus on, but the specifics of any one item we didn't necessarily have <em>complete</em> consensus on.</p>",
        "id": 268604888,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1642627190
    },
    {
        "content": "<p>hm I may still be forgetting what we talked about, what is there to move other than the <code>build-std</code> configuration itself? Right now there's not really any other configuration and it's just lots of stuff within Cargo that gets tweaked</p>",
        "id": 268604972,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1642627233
    },
    {
        "content": "<p>so I'm not sure what it means to incrementally move from <code>.cargo/config.toml</code> to <code>Cargo.toml</code></p>",
        "id": 268604987,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1642627242
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116015\">@Alex Crichton</span> This wasn't just about build-std, it was about all sorts of settings from <code>.cargo/config.toml</code>.</p>",
        "id": 268605200,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1642627357
    },
    {
        "content": "<p>The internal thread was about lots of things not just bild std</p>",
        "id": 268605204,
        "sender_full_name": "Eh2406",
        "timestamp": 1642627361
    },
    {
        "content": "<p>aha</p>",
        "id": 268605221,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1642627369
    },
    {
        "content": "<p>wow I'm blind and can't read the title</p>",
        "id": 268605236,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1642627380
    },
    {
        "content": "<p>I don't really remember the discussion.   Just a quick peek, I would prefer to not make build-std part of <code>Cargo.toml</code> at this time.  I think it is a global setting, and doesn't make sense to be per-package.</p>\n<p>It's hard to see if it addresses <a href=\"https://github.com/rust-lang/cargo/issues/9451\">cargo#9451</a>, as I think per-package-target is essentially unfinished (unrelated to build-std).</p>\n<p>I would prefer not to move forward with big changes to this section of cargo while <a href=\"https://github.com/rust-lang/cargo/issues/9992\">cargo#9992</a> is in flight.</p>",
        "id": 268606208,
        "sender_full_name": "Eric Huss",
        "timestamp": 1642627902
    },
    {
        "content": "<blockquote>\n<p>It's hard to see if it addresses <a href=\"https://github.com/rust-lang/cargo/issues/9451\">cargo#9451</a>, as I think per-package-target is essentially unfinished (unrelated to build-std).</p>\n</blockquote>\n<p>I'm the author of the PR, and it resolves that issue because the build-std handling logic is now for each package instead of the entire build. I just abstracted simple logic that retrieves the CompileKinds for a package (which respects per-package-target). FYI I added a test for build-std interacting with per-package-target and it passed CI (<a href=\"https://github.com/rust-lang/cargo/pull/10308/commits/51aa5510c96d3435d72b09d1033f4d998be7472c\">https://github.com/rust-lang/cargo/pull/10308/commits/51aa5510c96d3435d72b09d1033f4d998be7472c</a>).</p>\n<blockquote>\n<p>I think it is a global setting, and doesn't make sense to be per-package.</p>\n</blockquote>\n<p>It would perhaps make sense for build-std to specify a target-triple to build-std-crates-and-features map, because the problem is users want to use build-std in workspaces and it is annoying to force using cli options when building a bare-metal crate (custom alias could help but simply <code>cargo build</code>/ <code>cargo check</code> wouldn't work)</p>",
        "id": 268679361,
        "sender_full_name": "fee1-dead",
        "timestamp": 1642678759
    }
]