[
    {
        "content": "<p>I was just updating our vendor directory for fuchsia and I noticed that cargo vendor dropped all the permissions flags in the process. Is this intentional?</p>",
        "id": 220175197,
        "sender_full_name": "Rob Tsuk",
        "timestamp": 1608153976
    },
    {
        "content": "<p>Is this a change from previous versions?</p>",
        "id": 220176482,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1608154715
    },
    {
        "content": "<p>I do not think so, looking at the git history it has always done it. This is the first time I've seen it, though, that I can recall.</p>",
        "id": 220179100,
        "sender_full_name": "Rob Tsuk",
        "timestamp": 1608156020
    },
    {
        "content": "<p>I would expect <code>cargo vendor</code> to respect umask, if that helps.</p>",
        "id": 220183727,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1608158423
    },
    {
        "content": "<p>The specific issue here is that in the past, someone vendored crates with +x. Now, when I run vendor again, those +x bits are stripped. The files are otherwise unchanged.</p>",
        "id": 220187590,
        "sender_full_name": "Rob Tsuk",
        "timestamp": 1608160823
    },
    {
        "content": "<p>How they got into the repo with +x is a mystery. Some of the files are .sh, which might be expected to have +x set. Others are Rust source files, where you wouldn't.</p>",
        "id": 220187647,
        "sender_full_name": "Rob Tsuk",
        "timestamp": 1608160867
    },
    {
        "content": "<p>That said, if the published crate had a file with +x, I think that the vendored version should too</p>",
        "id": 220187693,
        "sender_full_name": "Rob Tsuk",
        "timestamp": 1608160910
    },
    {
        "content": "<p>I might file an issue about it, if I get my head better wrapped around what I'd expect to happen.</p>",
        "id": 220187762,
        "sender_full_name": "Rob Tsuk",
        "timestamp": 1608160950
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"372231\">@Rob Tsuk</span> we did have a fix awhile back (maybe 5-6 versions of rustc?) where we always extract a pristine copy of the tarball when vendoring. Previously we'd vendor whatever was in <code>~/.cargo/registry</code> which sometimes had accidental changes, so maybe someone accidentally <code>chmod +x -R $HOME/.cargo/registry</code> and then vendored? Just a wild guess though</p>",
        "id": 220193001,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1608164850
    }
]