[
    {
        "content": "<p>So I have a cargo toml like this:</p>\n<div class=\"codehilite\"><pre><span></span><code>[dependencies]\nndarray = &quot;&gt;= 0.13, &lt; 0.15&quot;\nother_crate = &quot;1.2.3&quot; # depends on ndarray = ^0.13\n</code></pre></div>\n<p>Now that ndarray has released 0.14, cargo is duplicating the ndarray dependency rather than just using 0.13. Is this the intended behaviour?</p>",
        "id": 227615600,
        "sender_full_name": "nagisa",
        "timestamp": 1614180549
    },
    {
        "content": "<p>Minimizing duplicate dependencies is NP-hard, though I think heuristics in cargo have slowly been improving</p>",
        "id": 227616171,
        "sender_full_name": "Steven Fackler",
        "timestamp": 1614180748
    },
    {
        "content": "<p>Personally I would much rather have <code>cargo update</code> take longer to run than have more dependencies</p>",
        "id": 227616823,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1614180967
    },
    {
        "content": "<p>sure, but unless you're willing to wait an exponentially longer amount of time as your dependency graph grows, doing that requires something akin to a high performance SAT solver or nonlinear optimizer which is a pretty complex beast</p>",
        "id": 227617104,
        "sender_full_name": "Steven Fackler",
        "timestamp": 1614181081
    },
    {
        "content": "<p>Currently Cargo makes very little effort to minimize the number of dependencies like this. When there are multiple solutions to a resolution graph (such as picking 0.13 or picking both 0.13 and 0.14 here) Cargo doesn't provide great knobs to control which solution gets picked. Cargo also has no automatic guidance of which solution to pick. Long ago the idea of public/private dependencies were thought to be a way to force Cargo to \"unify\" versions here since it would be a hard constraint on the version resolution solution.</p>",
        "id": 227617724,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1614181292
    },
    {
        "content": "<p>See also <a href=\"https://github.com/rust-lang/cargo/issues/9029#issuecomment-752801333\">https://github.com/rust-lang/cargo/issues/9029#issuecomment-752801333</a></p>",
        "id": 227618137,
        "sender_full_name": "Eric Huss",
        "timestamp": 1614181432
    },
    {
        "content": "<p>Thanks Eric, I was just going to try to find that comment. That comment still encapsulates my thoughts.<br>\nPubgrub is making progress, and will make adding knobs more doable. (but know promesses especially about timeline.)</p>",
        "id": 227619380,
        "sender_full_name": "Eh2406",
        "timestamp": 1614181855
    }
]