[
    {
        "content": "<p>When I tried using <code>cargo doc --open</code> for the first time on this device, it opened up in <code>dillo</code>. I couldn't figure out how to change the default browser or whatever to make it open it in <code>chromium</code>, so I just <em>uninstalled</em> <code>dillo</code>. Easy victory, right? No, now <code>cargo doc --open</code> opens the file in <code>geany</code> instead.</p>\n<p>So, how does <code>cargo doc</code> decide what browser to open the page in?</p>\n<p>OS: Raspberry Pi OS 64-bit. It's like a modified Debian kinda.</p>",
        "id": 207924028,
        "sender_full_name": "Lokathor",
        "timestamp": 1598329928
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224471\">@Lokathor</span> <code>cargo doc --open</code> uses the <code>opener</code> crate, which on Linux uses <a href=\"https://github.com/Seeker14491/opener/blob/master/opener/src/xdg-open\">a copy of <code>xdg-open</code></a>.</p>",
        "id": 207925452,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1598332087
    },
    {
        "content": "<p><code>xdg-open</code> tries to open your default browser; how it detects that depends on your environment.</p>",
        "id": 207925458,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1598332107
    },
    {
        "content": "<p>Setting your default browser in your desktop environment is typically the easiest solution.</p>",
        "id": 207925468,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1598332138
    },
    {
        "content": "<p>If you don't have a default set (or don't have a desktop environment), it'll look for an application that says it can handle an HTML file.</p>",
        "id": 207925564,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1598332305
    },
    {
        "content": "<p>If you want to override all of that and you don't have a convenient way to set your desktop environment's default browser, just set the <code>BROWSER</code> environment variable (e.g. <code>BROWSER=firefox</code> or <code>BROWSER=chromium</code>).</p>",
        "id": 207925621,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1598332355
    },
    {
        "content": "<p>so i fiddled with xdg a bit and couldn't get it to use chromium, but chromium itself has a button in the settings so that the browser can make itself the default browser, and whatever that button does it worked and the docs open in chromium now.</p>",
        "id": 207926475,
        "sender_full_name": "Lokathor",
        "timestamp": 1598333853
    }
]