[
    {
        "content": "<p>Is there a way to use Cargo as a library, so it has an API instead of a CLI, or is there an RFC for this? I'm thinking of libgit as a role model. My use case for this feature is to create a GUI around Cargo, but this feature could also be useful for integrating Cargo with other build tools. If there isn't already an RFC, I would like to start one. IDE support is considered an area of primary focus for Rust, so I suppose there could be more people than me who are interested.</p>",
        "id": 231201289,
        "sender_full_name": "Veverak",
        "timestamp": 1616313935
    },
    {
        "content": "<p>Yes, cargo is published as library crate on <a href=\"http://crates.io\">crates.io</a>: <a href=\"https://docs.rs/cargo/0.51.0/cargo/\">https://docs.rs/cargo/0.51.0/cargo/</a></p>",
        "id": 231210525,
        "sender_full_name": "bjorn3",
        "timestamp": 1616326196
    },
    {
        "content": "<p>I noticed that crate, but it took me some time to understand what it is. The readme on <a href=\"http://crates.io\">crates.io</a> contains no information about the library, only about Cargo in general. The documentation on <a href=\"http://docs.rs\">docs.rs</a> is empty enough to camouflage the entire purpose of the crate. The Cargo book doesn't mention it. I was able to figure out how it works only by looking for dependent crates and reading their code. It could be a lot better supported. The type <code>ops::NewOptions</code> depends on the type <code>NewProjectKind</code>, which is not exported. Every operation prints its output in text format, which is not suitable for a GUI. I guess I'll have to make a proposal to change all operations to output structured data.</p>",
        "id": 231214179,
        "sender_full_name": "Veverak",
        "timestamp": 1616330483
    },
    {
        "content": "<p>So far we have not stabilized any part of the API. We can and do make braking changes with each release. While eventually that will probably have to change, it will make a lot more work for the maintainers. I do not see how we can accept an RFC, without some long term source of new contributors and maintainers. Of cores I am just one vote, and I have bean wrong about the feasibility of proposed RFCs before.</p>",
        "id": 231659668,
        "sender_full_name": "Eh2406",
        "timestamp": 1616601610
    },
    {
        "content": "<p>There are CLI commands that give stable and machine readable info about how Cargo sees a project. Mostly <code>cargo metadata</code>, but there are others. That is how we recommend programs interface with Cargo. If it is insufficient for your concrete use case, we are happy to find a way to extend it.</p>",
        "id": 231660375,
        "sender_full_name": "Eh2406",
        "timestamp": 1616601827
    },
    {
        "content": "<p>I agree that stabilizing the cargo API just isn't something we have the bandwidth for at the moment.</p>",
        "id": 231662617,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1616602564
    },
    {
        "content": "<p>We would welcome new regular Cargo contributors, though.</p>",
        "id": 231662704,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1616602598
    }
]