[
    {
        "content": "<p>When putting a .cargo config in a sub-project of a workspace, cargo build behavior differs from where cargo build is launched. This seems like expected behavior after reading the docs, but it seems really strange to me that cargo build behavior would differ when building with <code>cargo build</code> in the sub-project vs when building with <code>cargo build -p sub-proj</code> in the top of the workspace.</p>\n<p>This also causes issues when using rust-analyzer. Rust-analyzer seems to always execute from the top of the workspace, ignoring .cargo/config.toml files lower down in the project. Even if the editor (e.g. nvim) is launched in the same directory containing .cargo, rust-analyzer still seems to execute from the top of the workspace. This causes full rebuilds to be required for every manual cargo build invocation while using rust-analyzer. This is because rust-analyzer didn't include the config, while the manual cargo build invocation does include the config.</p>\n<p>The obvious solution seems like always including the .cargo config at the workspace root, but that makes it impossible to have separate cargo configs for different crates in a workspace. Is there a cleaner way to handle per-subcrate cargo configs without basically breaking workflows incorporating rust-analyzer?</p>",
        "id": 272066884,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1644978895
    },
    {
        "content": "<p>Cargo looks at the <code>.cargo/config.toml</code> in the current dir and all parent dirs. If you do <code>cargo build -p sub-proj</code> it won't look at <code>sub-proj/.cargo/config.toml</code> as you didn't cd into sub-proj/.</p>",
        "id": 272084052,
        "sender_full_name": "bjorn3",
        "timestamp": 1644998803
    },
    {
        "content": "<p>I understand, but this makes it basically infeasible to have per sub-project cargo.toml files when using Rust analyzer, and leads to general confusion when building. Would it be possible to enhance cargo so that it is possible to include per-subcrate cargo configs, independent of where cargo build is launched from?</p>",
        "id": 272102136,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1645009949
    },
    {
        "content": "<p>Unfortunately it is a complex issue. We try to maintain backwards compatibility, so we can't easily change cargo's behavior.  There is more information at <a href=\"https://github.com/rust-lang/cargo/issues/9769\">cargo#9769</a>.  </p>\n<p>Perhaps you can share why you are using config files in the first place?  Perhaps there are alternate solutions to what you are trying to achieve.</p>",
        "id": 272137615,
        "sender_full_name": "Eric Huss",
        "timestamp": 1645028105
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120518\">@Eric Huss</span> So they're config files to set rustflags for tokio-console:</p>\n<div class=\"codehilite\"><pre><span></span><code>[target.x86_64-unknown-linux-gnu]\nrustflags = [&quot;--cfg&quot;, &quot;tokio_unstable&quot;]\n</code></pre></div>\n<p>For my specific use case, building all projects in the workspace with these flags is somewhat acceptable, so I can afford to move them to the workspace root, and avoid this issue, but I'd still strongly prefer not building all my projects with this flag, only the ones where I actually require the tokio console.</p>\n<p>Perhaps it would be nice if I could set flags like this in the cargo.toml of the project?</p>",
        "id": 272145789,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1645031452
    },
    {
        "content": "<p>If you want I can file an issue describing what I'm encountering, but I thought that it would be nice to start a preliminary discussion here.</p>",
        "id": 272146159,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1645031593
    },
    {
        "content": "<p>I also talked to the rust-analyzer people to see if they could invoke whatever cargo commands they use with the working directory set to the actual sub-project being checked, but they told me that would require them to check each project individually, which they didn't want to do.</p>",
        "id": 272146580,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1645031749
    },
    {
        "content": "<p>I personally would avoid using <code>--cfg</code> and stick to features. I understand there are some limitations that are difficult to work around, though.  Another option is to use <a href=\"https://doc.rust-lang.org/nightly/cargo/reference/unstable.html#profile-rustflags-option\">rustflags in profiles</a>.</p>",
        "id": 272148815,
        "sender_full_name": "Eric Huss",
        "timestamp": 1645032570
    },
    {
        "content": "<p>Yeah, I don't know why tokio chose to use a rustflag there instead of a feature. I would also prefer features, but I don't know why tokio chose to use rustflags here.</p>\n<p>But rustflags in profiles seem like exactly what I need! Thank you so much! I look forward to getting this on stable!</p>",
        "id": 272151474,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1645033618
    },
    {
        "content": "<p>(that said, others might or might not find a more robust system for per sub-project cargo configs useful, but for my use case it's not relevant anymore.)</p>",
        "id": 272151667,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1645033689
    },
    {
        "content": "<p>for <code>cfg</code> in particular, that can be done from a build script too without disrupting rustflags</p>",
        "id": 272151802,
        "sender_full_name": "cuviper",
        "timestamp": 1645033740
    },
    {
        "content": "<p>Cool, i'll suggest to put that in the tokio-console documentation awaiting the stabilization of rustflags in profiles</p>",
        "id": 272152079,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1645033847
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"398861\">Frederik Baetens</span> <a href=\"#narrow/stream/246057-t-cargo/topic/Confusing.20build.20.20with.20.2Ecargo.20config.20in.20sub-project/near/272151474\">said</a>:</p>\n<blockquote>\n<p>Yeah, I don't know why tokio chose to use a rustflag there instead of a feature. I would also prefer features, but I don't know why tokio chose to use rustflags here.</p>\n</blockquote>\n<p>The probably chose it to prevent other dependencies of yours from enabling it, instead requiring the end user to enable it. If other dependencies could enable them, you could for example end up with a situation where different crates require a different semver compatible version of tokio to compile due to breaking changes of said unstable features. Cargo doesn't allow depending on multiple semver compatible versions of a crate at the same time, it will always unify them.</p>",
        "id": 272154273,
        "sender_full_name": "bjorn3",
        "timestamp": 1645034623
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"138448\">cuviper</span> <a href=\"#narrow/stream/246057-t-cargo/topic/Confusing.20build.20.20with.20.2Ecargo.20config.20in.20sub-project/near/272151802\">said</a>:</p>\n<blockquote>\n<p>for <code>cfg</code> in particular, that can be done from a build script too without disrupting rustflags</p>\n</blockquote>\n<p>A build script can only add <code>cfg</code>'s for the current crate. It can't add it for a dependency (in this case tokio).</p>",
        "id": 272154397,
        "sender_full_name": "bjorn3",
        "timestamp": 1645034658
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"398861\">@Frederik Baetens</span> What about adding <code>rustflags = [\"--cfg tokio_unstable\"]</code> to the whole project <code>.cargo/config.toml</code> instead of just the sub project? It probably doesn't hurt for the main project, right?</p>",
        "id": 272154605,
        "sender_full_name": "bjorn3",
        "timestamp": 1645034733
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"133247\">@bjorn3</span> so it's definitely possible for me to put the .cargo/config.toml in the workspace root (even though it's not ideal), effectively solving this issue for me, but I found this an incredibly annoying problem to diagnose, and would like to prevent future users from running into it.</p>",
        "id": 272154999,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1645034866
    },
    {
        "content": "<p>Aside from that, some users may have legitimate use cases that can't be solved by putting the .cargo/config.toml in the workspace root, but fortunately putting it in the workspace root is fine for me.</p>",
        "id": 272155237,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1645034952
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"398861\">Frederik Baetens</span> <a href=\"#narrow/stream/246057-t-cargo/topic/Confusing.20build.20.20with.20.2Ecargo.20config.20in.20sub-project/near/272155237\">said</a>:</p>\n<blockquote>\n<p>Aside from that, some users may have legitimate use cases that can't be solved by putting the .cargo/config.toml in the workspace root, but fortunately putting it in the workspace root is fine for me.</p>\n</blockquote>\n<p><code>rustflags</code> inside of profiles doesn't work at all for sub crates of a workspace. Profiles can only be defined in the workspace root and apply to the whole workspace. You can override profile settings for specific packages, but that skips the dependencies of said crate.</p>",
        "id": 272155725,
        "sender_full_name": "bjorn3",
        "timestamp": 1645035125
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"133247\">@bjorn3</span> Hmm, that doesn't adress the per-projects flag use case (which I don't necessarily need). But rustflags in the profile would prevent users from running into the same problem as I did, where cargo invocations in a different directory lead to full rebuilds.</p>",
        "id": 272156103,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1645035265
    },
    {
        "content": "<p>Why are .cargo/config.toml configurations even allowed lower down than the workspace root if it seems hard to get that to work properly? That seems like a feature which causes more confusion than that it solves actual problems.</p>",
        "id": 272156785,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1645035554
    },
    {
        "content": "<p>Or perhaps the user could just be warned that .cargo/config.toml in sub-crates might lead to strange behaviour like this?</p>",
        "id": 272156987,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1645035638
    },
    {
        "content": "<p><code>.cargo/config.toml</code> already existed with the current behavior long before workspaces were introduced. In addition it works the same way for individual crates. If you <code>cd /tmp &amp;&amp; cargo build --manifest-path /my/project/Cargo.toml</code>, it will only look in <code>/tmp/.cargo/config.toml</code>, <code>/.cargo/config.toml</code> and <code>~/.cargo/config.toml</code> and not <code>/my/project/.cargo/config.toml</code>.</p>",
        "id": 272157108,
        "sender_full_name": "bjorn3",
        "timestamp": 1645035689
    },
    {
        "content": "<p>Might a warning be appropriate then? I can't see too many legitimate use cases for the current behavior since it's so easy to use it in an inconsistent manner.</p>",
        "id": 272158305,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1645036233
    },
    {
        "content": "<p>Or would you be open to some extra documentation warning against putting .cargo/config.toml files below the workspace or crate root? Perhaps on this page: <a href=\"https://doc.rust-lang.org/cargo/reference/config.html\">https://doc.rust-lang.org/cargo/reference/config.html</a> ?</p>",
        "id": 272168551,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1645040760
    }
]