[
    {
        "content": "<p>Hello everyone,</p>\n<p>We've recently been looking at how <a href=\"https://blog.rust-lang.org/inside-rust/2022/02/22/compiler-team-ambitions-2022.html#faster-builds-initiatives--%EF%B8%8F\">compile times look in practice</a> across a wider slice of the ecosystem. Looking at cargo schedules, it seems there are quite a few projects where build scripts, proc-macros, and their dependencies are on the critical path, and the reason why I'm opening this thread: to discuss the default settings used to build the \"for host\" nodes.</p>\n<p>There were already great insights about these a few years ago: cargo focuses on fast compile times rather than raw throughput of the built artifacts, leading to the current defaults for build dependencies (for the people following at home: <a href=\"https://doc.rust-lang.org/cargo/reference/profiles.html#build-dependencies\">no optimizations, no limits on CGUs</a>). These defaults merge with the other profile defaults, leading to the additional settings that the <code>dev</code>profile brings: debuginfo at level 2, and incremental turned on.</p>\n<p>To illustrate my proposal, I'll take building <code>syn-1.0.86</code>locally as an example: It's present in so many projects using proc-macros that any improvement will be noticeable across the whole ecosystem (which is also why I've experimented with prioritizing it in the build schedules with interesting results that I've discussed with eh2406, so more about that in the future -- or just tried to remove its and <code>proc-macro2</code>'s build scripts altogether, with most of the same effect).</p>\n<p>I'd like to specifically discuss these in the <code>dev</code> profile:</p>\n<ul>\n<li><code>-Cdebuginfo=2</code>: is this removable ? I myself have never tried running a build script or proc-macro in a debugger (and I'd suspect the latter to be hindered by the proc macro bridge + rustc execution model) but that would impact backtraces and lineinfo, if panics happen (though I'm not sure how compile errors generated by panicking proc-macros look under a different debuginfo level). On <code>syn</code>, this improves from scratch debug builds by 13% or so.</li>\n<li><code>-Cincremental</code>: this looks removable. Incremental compilation is a 30%-50% pessimization, that is amortized by building things more than once. Build dependencies are most likely only built once. I've now noticed this is already tracked in <a href=\"https://github.com/rust-lang/cargo/issues/8545\">this cargo issue</a> about build scripts: it would improve build scripts, but they are usually small so the absolute improvements would also be small. proc-macros and their dependencies on the other hand, especially on the critical path, would see noticeable effects. On <code>syn</code>, this also improves from scratch debug builds by 12% or so.</li>\n<li><code>-Cstrip=debuginfo</code>: on the targets where the linker is aware of this (rather than stripping after the fact) this is also a slight win (on <code>syn</code>s build script only, it's around 10%, and on the whole crate it's like 1%). This one could arguably be added to the <code>release</code> profile as well if for some reason we wanted to be as aggressive as possible, but it's probably slightly better but within noise in release builds of <code>syn</code>.</li>\n</ul>\n<p>Overall with these three on <code>syn</code>, we have <code>cargo check</code>s improved by 13%, and by 17% when all its features are toggled on; <code>cargo build</code>s by 27% and 35%, respectively. These numbers are only an informative proxy of realistic use in a different context, and mostly to illustrate the effect each setting has, so I've tried to validate them in the real world: </p>\n<ul>\n<li>since this is quite simple to try, I've made <a href=\"https://github.com/lqd/cargo/commit/f6cfe00baa8bb06bc83bc735e3e7a9ff9bc75d1c\">a prototype of this</a></li>\n<li>did a <a href=\"https://github.com/rust-lang/rust/pull/94851\">perf.rlo run</a> to \"ensure\" there are no surprising regressions (but perf.rlo itself only tracks leaf crates build times in most situations)</li>\n<li>and <a href=\"https://lqd.github.io/rustc-benchmarking-data/experiments/cargo-build-defaults/\">benchmarked it locally</a> over our extended set of crates, with check and debug builds. There's a readme in there with more info, simple summaries and hyperfine results for each crate. (Note that these benchmarks were done with the slightly more aggressive \"symbols\" stripping, but it seems more sensible to only strip \"debuginfo\" in the odd case a panic happens. That's a 1% improvement at best anyways. I have not measured stripping in release builds either)</li>\n</ul>\n<p>These wins seem to indeed translate to real world uses. In the cases we're interested in, heavy build dependencies on the critical path, that is quite noticeable: a lot of nice improvements with a tight confidence interval, both for <a href=\"https://lqd.github.io/rustc-benchmarking-data/experiments/cargo-build-defaults/summary-check-j12-improvements.txt\">check builds</a> and <a href=\"https://lqd.github.io/rustc-benchmarking-data/experiments/cargo-build-defaults/summary-build-j8-improvements.txt\">debug builds</a>. The regressions are smaller in magnitude and with a wide confidence interval: there are a few super short benchmarks (20-30% of all the crates), making variance in timing more impactful in their results (both improvements and regressions). That looks like an improvement to me.</p>\n<p>These just being the default values means they're easily overridable by users, and documentation would be needed to show which settings to choose for maximum debuggability of build dependencies when needed, rather than fastest compile times. I believe all of the above is achievable today by individual crates, by overriding the <code>dev</code> build profile (and if anyone reading this is interested, it's <a href=\"https://gist.github.com/lqd/cb65b8582cd213bb901502093089ec72\">as simple as that</a>), and an alternative could be to just document that without changing the defaults. I'd probably prefer these defaults as the \"pit of success\" for the common cases and faster compiles, but could have easily missed important use-cases making this change unacceptable.</p>\n<p>What do you all think ?</p>",
        "id": 275241014,
        "sender_full_name": "lqd",
        "timestamp": 1647267174
    },
    {
        "content": "<p>Incremental compilation is disabled for non-local dependencies already.</p>",
        "id": 275241500,
        "sender_full_name": "bjorn3",
        "timestamp": 1647267372
    },
    {
        "content": "<p>As for debuginfo maybe switch to <code>-Cdebuginfo=1</code> for build dependencies by default?</p>",
        "id": 275241648,
        "sender_full_name": "bjorn3",
        "timestamp": 1647267455
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"133247\">bjorn3</span> <a href=\"#narrow/stream/246057-t-cargo/topic/Defaults.20for.20faster.20compilation.20of.20.22for.20host.22.20units/near/275241500\">said</a>:</p>\n<blockquote>\n<p>Incremental compilation is disabled for non-local dependencies already.</p>\n</blockquote>\n<p>ah maybe, in that case the improvements are mostly from the build script ?</p>",
        "id": 275242063,
        "sender_full_name": "lqd",
        "timestamp": 1647267616
    },
    {
        "content": "<p>Most changes come from disabling debuginfo I think.</p>",
        "id": 275242149,
        "sender_full_name": "bjorn3",
        "timestamp": 1647267659
    },
    {
        "content": "<p>could be, yeah. compounding over many nodes in the schedules</p>",
        "id": 275242369,
        "sender_full_name": "lqd",
        "timestamp": 1647267755
    },
    {
        "content": "<p>in any case, these nodes are all bottlenecks and any improvement becomes significant</p>",
        "id": 275242749,
        "sender_full_name": "lqd",
        "timestamp": 1647267892
    },
    {
        "content": "<p>(and I'd also like to see numbers for these using cg_clif <span class=\"user-mention\" data-user-id=\"133247\">@bjorn3</span> if that's already testable :)</p>",
        "id": 275243426,
        "sender_full_name": "lqd",
        "timestamp": 1647268195
    },
    {
        "content": "<p>Yes, cg_clif is more than complete enough. It has supported proc-macros for a long time now.</p>",
        "id": 275244874,
        "sender_full_name": "bjorn3",
        "timestamp": 1647268839
    },
    {
        "content": "<p>great</p>",
        "id": 275245024,
        "sender_full_name": "lqd",
        "timestamp": 1647268915
    },
    {
        "content": "<p>You can build it from source or download a prebuilt version from <a href=\"https://github.com/bjorn3/rustc_codegen_cranelift/actions/runs/1980357175\">https://github.com/bjorn3/rustc_codegen_cranelift/actions/runs/1980357175</a> The build directory contains a cargo-clif executable you can use in the place of cargo. It invokes cargo in such a way that cg_clif is used.</p>",
        "id": 275245118,
        "sender_full_name": "bjorn3",
        "timestamp": 1647268940
    },
    {
        "content": "<p>nice, thank you. <br>\nI remember your benchmarks where build times were improved over cg_llvm for debug builds, and run times a bit lower, the cool thing is the latter shouldn't matter much for the build dependencies, so it could be interesting to see the effect here. I'll have to look into that, and will let you know if there are interesting results.</p>",
        "id": 275245796,
        "sender_full_name": "lqd",
        "timestamp": 1647269263
    },
    {
        "content": "<p>One thing to be aware if is that I haven't yet implemented parallel compilation, so while the user time is lower, the wall time may be a bit higher if only a single crate is being compiled. If multiple dependencies are being compiled at the same time cg_clif is likely to finish ~30% earlier than cg_llvm.</p>",
        "id": 275246294,
        "sender_full_name": "bjorn3",
        "timestamp": 1647269470
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116113\">@lqd</span> I would love to see those changes by default in the profile used to build dependencies.</p>",
        "id": 275252976,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647272029
    },
    {
        "content": "<p>In build-override, specifically, not in the base dev profile.</p>",
        "id": 275253220,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647272119
    },
    {
        "content": "<p>I don't know if the team has regular meetings and nominations ?  Would you say I should just open a PR ?</p>",
        "id": 275253362,
        "sender_full_name": "lqd",
        "timestamp": 1647272165
    },
    {
        "content": "<p>We have weekly meetings. If the change is just a couple of lines to the default build override (and the docs), go ahead and send a PR (including the performance numbers) and I'll put it on tomorrow's agenda. If it wouldn't be a trivial PR, post an issue with the numbers and we can review it tomorrow and approve first.</p>",
        "id": 275253722,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647272293
    },
    {
        "content": "<p>The change I've made is indeed a <a href=\"https://github.com/lqd/cargo/commit/f6cfe00baa8bb06bc83bc735e3e7a9ff9bc75d1c\">couple of lines</a> (though I haven't changed the book yet) but I wasn't sure about all of them (e.g. it's possible that stripping is slower on osx IIRC) wrt debugging and backtraces, and if I was missing other important considerations. The specifics can be discussed in the PR as well, so I'll change the docs and open one soon. Thanks!</p>",
        "id": 275254416,
        "sender_full_name": "lqd",
        "timestamp": 1647272571
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"133247\">bjorn3</span> <a href=\"#narrow/stream/246057-t-cargo/topic/Defaults.20for.20faster.20compilation.20of.20.22for.20host.22.20units/near/275246294\">said</a>:</p>\n<blockquote>\n<p>If multiple dependencies are being compiled at the same time cg_clif is likely to finish ~30% earlier than cg_llvm.</p>\n</blockquote>\n<p>that's veering into off-topic for this thread but I'm indeed seeing around 27% in check builds on \"syn as a proxy for build dependencies compilation\" (fun: in release as well, but that's not for build dependencies of course), and 7-10% in debug builds, a sign we should benchmark this more thoroughly. And also one that we really should land your PR to distribute cg_clif via rustup, so that people would simply <code>codegen-backend</code> their <code>build-override</code>s to test and enjoy <span aria-label=\"ok\" class=\"emoji emoji-1f44c\" role=\"img\" title=\"ok\">:ok:</span></p>",
        "id": 275278730,
        "sender_full_name": "lqd",
        "timestamp": 1647282519
    },
    {
        "content": "<p>Would be fun to test that. I'm curious how much of a runtime performance hit there is for parsing Rust code with the resulting syn.</p>",
        "id": 275301499,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647293748
    },
    {
        "content": "<p>debug mode cg_llvm and cg_clif should be roughly even. i expect within like 10%.</p>",
        "id": 275302923,
        "sender_full_name": "bjorn3",
        "timestamp": 1647294681
    },
    {
        "content": "<p>Oh, interesting! I previously had the impression that that wasn't the case?</p>",
        "id": 275305031,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647295987
    },
    {
        "content": "<p>I'm glad to hear that that's not an issue.</p>",
        "id": 275305045,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647295996
    },
    {
        "content": "<p>I saw this while updating unit tests: how impactful is reuse between regular and build dependencies ? </p>\n<p>Changing the build-override defaults to e.g. remove debuginfo can build such a shared dependency twice (once with debuginfo for the dev dependency, and once without debuginfo for the build dependency) where it used to only build it once</p>",
        "id": 275361384,
        "sender_full_name": "lqd",
        "timestamp": 1647344692
    },
    {
        "content": "<p>(I won't be done with the PR before today's t-cargo meeting so I've opened an issue as josh suggested <a href=\"https://github.com/rust-lang/cargo/issues/10481\">https://github.com/rust-lang/cargo/issues/10481</a>)</p>",
        "id": 275417046,
        "sender_full_name": "lqd",
        "timestamp": 1647369244
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span> , at what date+time <em>is</em> the cargo meeting where the above issue would be discussed?</p>",
        "id": 275423045,
        "sender_full_name": "pnkfelix",
        "timestamp": 1647372117
    },
    {
        "content": "<p>It was at <time datetime=\"2022-03-15T15:00:00Z\">2022-03-15T11:00:00-04:00</time>, the next one will be at  <time datetime=\"2022-03-22T16:00:00Z\">2022-03-22T12:00:00-04:00</time> .</p>",
        "id": 275423370,
        "sender_full_name": "Eh2406",
        "timestamp": 1647372292
    },
    {
        "content": "<p>Thanks for the t-cargo meeting feedback!</p>\n<p>I've <a href=\"https://github.com/rust-lang/cargo/issues/10481#issuecomment-1071210673\">added more numbers</a> and info to the issue, to show some of the impact of each of those settings, why I believe turning debuginfo off is the way to go, and that I'll be working on the error messages to the either lower or disable debuginfo without degrading the user experience.</p>",
        "id": 275710045,
        "sender_full_name": "lqd",
        "timestamp": 1647543636
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"239881\">Josh Triplett</span> <a href=\"#narrow/stream/246057-t-cargo/topic/Defaults.20for.20faster.20compilation.20of.20.22for.20host.22.20units/near/275301499\">said</a>:</p>\n<blockquote>\n<p>Would be fun to test that. I'm curious how much of a runtime performance hit there is for parsing Rust code with the resulting syn.</p>\n</blockquote>\n<p>I don't have an easy way to get these numbers exactly, but a reasonable facsimile: a cg_clif check build at j12. 528 wins, 248 losses, no failures/ICEs. 470 wins over 10%, 140 over 20%. 100 losses over 20%, 3 around 40%. I believe that many of those are due to many benchmarks being super short, and the backend having no parallelism yet, other than cargo's own.</p>\n<p>(I'm imagining a shiny future <span aria-label=\"crab\" class=\"emoji emoji-1f980\" role=\"img\" title=\"crab\">:crab:</span> where <code>build-override</code> also has: lld/mold, cg_clif + we finish splitting linking from rustc so that we can also pipeline the compilation phase and not just metadata)</p>",
        "id": 275710142,
        "sender_full_name": "lqd",
        "timestamp": 1647543673
    },
    {
        "content": "<blockquote>\n<p>we finish splitting linking from rustc so that we can also pipeline the compilation phase and not just metadata</p>\n</blockquote>\n<p>That is in principle doable using only cargo changes. <code>-Zno-link</code> and <code>-Zlink-only</code> are already supported by rustc. They aren't tested though and <code>#![crate_type]</code> doesn't work with it currently.</p>",
        "id": 275710403,
        "sender_full_name": "bjorn3",
        "timestamp": 1647543775
    },
    {
        "content": "<p>I know but IIRC it's still not optimal/complete, although I haven't checked in a while</p>",
        "id": 275710573,
        "sender_full_name": "lqd",
        "timestamp": 1647543846
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116113\">@lqd</span> Based on the information you posted, I agree that we could turn off debuginfo for build-override as the highest-impact change.</p>",
        "id": 275717621,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647547284
    },
    {
        "content": "<p>With an update to the documentation, and an update to the message shown when a build script fails.</p>",
        "id": 275717658,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1647547306
    },
    {
        "content": "<p>cool :) I'll keep working in this direction then</p>",
        "id": 275720453,
        "sender_full_name": "lqd",
        "timestamp": 1647548539
    },
    {
        "content": "<p>I've updated tests and the message shown when a build script fails, and have opened the draft PR, for discussion and guidance on the remaining tasks (whether the tests relying on build reuse are acceptable ? how to fix <code>-Z scrape-examples</code> which seems to be incorrect wrt build reuse as well) here: <a href=\"https://github.com/rust-lang/cargo/pull/10493\">https://github.com/rust-lang/cargo/pull/10493</a></p>",
        "id": 276060527,
        "sender_full_name": "lqd",
        "timestamp": 1647873846
    },
    {
        "content": "<p>I've opened <a href=\"https://github.com/rust-lang/cargo/issues/10500\">https://github.com/rust-lang/cargo/issues/10500</a> to track the pre-existing <code>-Z rustdoc-scrape-examples</code> issue, which I assume would block the PR (it would otherwise very likely prevent the unstable feature from working altogether). Will said he'll look into it <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>",
        "id": 276373896,
        "sender_full_name": "lqd",
        "timestamp": 1648057699
    },
    {
        "content": "<p>another update: after discussing <a href=\"https://github.com/rust-lang/rust/issues/10500\">#10500</a> with Will, it turns out that their other PR <a href=\"https://github.com/rust-lang/cargo/pull/10343\">https://github.com/rust-lang/cargo/pull/10343</a> had a fix for it. That unblocks <a href=\"https://github.com/rust-lang/rust/issues/10493\">#10493</a> so I've incorporated the fix and tests, and marked the PR as ready to review.</p>",
        "id": 276981339,
        "sender_full_name": "lqd",
        "timestamp": 1648547632
    },
    {
        "content": "<p>I was wondering, given the recent t-cargo Inside Rust blog post, would this work be rejected as a new feature, or just delayed until reviewers have time to look at it (which is perfectly fine and expected to be clear) ?</p>",
        "id": 278713361,
        "sender_full_name": "lqd",
        "timestamp": 1649779074
    },
    {
        "content": "<p>I've been running some benchmarks locally (they are running right now).  I'm having some mixed results on different projects, and I want to get a better understanding of how much of a win it is.</p>",
        "id": 278713544,
        "sender_full_name": "Eric Huss",
        "timestamp": 1649779162
    },
    {
        "content": "<p>I believe were excited for this work, and will happily see incremental progress on this. We will merge it at whatever pace we can manage.</p>",
        "id": 278713548,
        "sender_full_name": "Eh2406",
        "timestamp": 1649779165
    },
    {
        "content": "<p>This is a pretty major change since it causes <em>more</em> rustc compilations in some cases, and I'm not sure if we want to make that jump or not.</p>",
        "id": 278713904,
        "sender_full_name": "Eric Huss",
        "timestamp": 1649779291
    },
    {
        "content": "<p>interesting yes, in the cases where some dependencies are shared between the build dependencies and the leaf crates it could cause another compilation to be triggered</p>",
        "id": 278714199,
        "sender_full_name": "lqd",
        "timestamp": 1649779395
    },
    {
        "content": "<p>(thanks to the both of you for the answers)</p>",
        "id": 278714224,
        "sender_full_name": "lqd",
        "timestamp": 1649779406
    },
    {
        "content": "<p>if you have specific benchmarks I could also take a look at them</p>",
        "id": 278714272,
        "sender_full_name": "lqd",
        "timestamp": 1649779424
    },
    {
        "content": "<p>esp if they're not the crates we've been looking at earlier, or have big regressions</p>",
        "id": 278714397,
        "sender_full_name": "lqd",
        "timestamp": 1649779469
    },
    {
        "content": "<p>the ones we saw were <a href=\"https://github.com/lqd/rustc-benchmarking-data/tree/main/experiments/cargo-build-defaults\">here</a> in the \"regressions.txt\" files for check and debug builds, and were often short and high-variance</p>",
        "id": 278714548,
        "sender_full_name": "lqd",
        "timestamp": 1649779554
    },
    {
        "content": "<p>while the improvements had a tighter confidence range and higher magnitude</p>",
        "id": 278714693,
        "sender_full_name": "lqd",
        "timestamp": 1649779602
    },
    {
        "content": "<p>We talked briefly about the idea of a \"debug = don't care\" mechanism, for \"prefer to unify and do one build rather than two, only omit debug info if nothing else building this crate has a preference\". But that'd be a larger and more invasive change, and unification seems subtle and quick to anger.</p>",
        "id": 278730165,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1649786627
    },
    {
        "content": "<p>at the very least we can document these defaults in nick's rust perf book chapter on compile times</p>",
        "id": 278731570,
        "sender_full_name": "lqd",
        "timestamp": 1649787226
    }
]