[
    {
        "content": "<p>Hi all (but particularly <span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span> and <span class=\"user-mention\" data-user-id=\"120518\">@Eric Huss</span>), I wanted to start a thread here to discuss two PRs I have open (<a href=\"https://github.com/rust-lang/rust/issues/10461\">#10461</a> and <a href=\"https://github.com/rust-lang/rust/issues/10322\">#10322</a>). Both of them solve the problem I have (the <code>package::reserved_windows_name</code> test fails on recent Windows versions), but they do have rather different implications.</p>\n<p><a href=\"https://github.com/rust-lang/rust/issues/10322\">#10322</a> fixes the problem by adding a runtime test on Windows to see whether reserved names are actually allowed and gates the test on that result. This seems consistent with existing behavior, where there are packages that work on most platforms but cannot be unpacked on Windows.</p>\n<p><a href=\"https://github.com/rust-lang/rust/issues/10461\">#10461</a> fixes the problem by instead making path names like <code>aux.rs</code> unable to be unpacked on any platform. The advantage of this is that it means Cargo has consistent behavior on all supported platforms. It is also somewhat in the spirit of the warning you current get when you try to create a package with a reserved Windows name.</p>\n<p>I can see arguments for both approaches, but overall I'm most in favor of <a href=\"https://github.com/rust-lang/rust/issues/10322\">#10322</a>. It's completely reasonable that a package may not be able to run or supported on Windows, so in that case it seems unnecessary and undesirable to restrict what would otherwise be perfectly valid filenames. There is already a warning, which seems reasonable, but it doesn't seem necessary to make this warning into a hard error given that doing so may break existing packages. It also seems counter-intuitive to make Cargo more restrictive as a result of Windows becoming more permissive.</p>\n<p>Anyway, I'm happy to go with whatever the Cargo team thinks is best, but I wanted to at least state my opinion and open the discussion given that it seems there was some disagreement on the right approach here.</p>",
        "id": 274437425,
        "sender_full_name": "eholk",
        "timestamp": 1646678128
    },
    {
        "content": "<p>My primary reason for originally suggesting the approach of prohibiting it on all platforms was that that would be consistent with what <a href=\"http://crates.io\">crates.io</a> did. My secondary reason was that it had seemed odd to me for a test of that prohibition by the OS to first test that same prohibition empirically; that had seemed circular to me.</p>\n<p>However, reconsidering the latter point, it may not actually be circular to do so, as long as the testing of the OS's prohibition is not using the same actually the same as what Cargo uses internally.</p>",
        "id": 274452413,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646684780
    },
    {
        "content": "<p>I'm not opposed to going back to the original approach and letting cargo unpack these filenames on all platforms that support them.</p>",
        "id": 274452501,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646684842
    },
    {
        "content": "<p>I've closed the new PR and requested one minor change to the original PR. Does that change sound reasonable?</p>",
        "id": 274453468,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646685348
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"239881\">Josh Triplett</span> <a href=\"#narrow/stream/246057-t-cargo/topic/Handling.20Windows-reserved.20paths/near/274452413\">said</a>:</p>\n<blockquote>\n<p>However, reconsidering the latter point, it may not actually be circular to do so, as long as the testing of the OS's prohibition is not using the same actually the same as what Cargo uses internally.</p>\n</blockquote>\n<p>I agree, it did seem weird to be like \"if this test will work, then run the test.\" Ideally I would have done something like <code>#[cfg(windows, version &lt; 11.whatever)]</code>, but we don't really have a way to do that with <code>cfg</code> and I don't think this behavior has a version number associated with it that we could check. I asked the dev who made the change and Windows and this was the approach he recommended for detecting whether the OS had the new or old behavior.</p>",
        "id": 274457805,
        "sender_full_name": "eholk",
        "timestamp": 1646687394
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"239881\">Josh Triplett</span> <a href=\"#narrow/stream/246057-t-cargo/topic/Handling.20Windows-reserved.20paths/near/274453468\">said</a>:</p>\n<blockquote>\n<p>I've closed the new PR and requested one minor change to the original PR. Does that change sound reasonable?</p>\n</blockquote>\n<p>Yup, that seems reasonable! I'll make the change and update the PR.</p>",
        "id": 274457950,
        "sender_full_name": "eholk",
        "timestamp": 1646687419
    },
    {
        "content": "<p>Thanks for articulating that; yeah, \"if this test will work, then run the test\" was roughly my initial reaction to the original PR. ;)</p>",
        "id": 274465106,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646690718
    }
]