[
    {
        "content": "<p>I want to tackle: <a href=\"https://github.com/rust-lang/cargo/issues/7992\">https://github.com/rust-lang/cargo/issues/7992</a> as it is an issue at my job.  Would such a fix get merged? At first look it seems that cargo uses the servo url crate, and the url crate or usage of it might need to change(Haven't looked in depth yet I might be able to completely avoid this). But assuming that I would have to make more substantial changes to the usage of the url crate, how should I approach that? If I need large changes should I make an RFC?</p>",
        "id": 242154568,
        "sender_full_name": "Francis Nixon",
        "timestamp": 1623293873
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"410712\">@Francis Nixon</span> .  I don't have the context in memory right now, but IIRC the issue is that cargo doesn't handle relative submodules at all?  And it seems like all it needs to do is join the parent's URL with the relative path (if it starts with <code>./</code> or <code>../</code>?  That seems like it should be a relatively small fix inside cargo.  </p>\n<p>I think the fix would go <a href=\"https://github.com/rust-lang/cargo/blob/b3475e6df9f9d0b3e61c84a5746f7dc872368637/src/cargo/sources/git/utils.rs#L363-L418\">around here</a> where it would just need to call <code>.join()</code> on the parent's url with the child's if it is relative.  Not sure if the parent URL is readily available there, but I imagine it can be passed in if not.</p>\n<p>For contributing to cargo, there is a guide <a href=\"https://doc.crates.io/contrib/\">here</a> with information on how to get started and how to run and write tests.</p>",
        "id": 242156434,
        "sender_full_name": "Eric Huss",
        "timestamp": 1623296430
    },
    {
        "content": "<p>And I think a PR with the fix is all that is needed, we usually don't use RFCs for code changes or fixes.</p>",
        "id": 242156446,
        "sender_full_name": "Eric Huss",
        "timestamp": 1623296474
    }
]