[
    {
        "content": "<p>rustc_codegen_cranelift has support for jitting rust code. Unfortunately it is not possible to use this with cargo. There are two problems: First off all dependencies must be available as dylib either directly or included in the dylib of another dependency. Second problem is that rustc doesn't have a way to pass the fact that the executable must be jitted. For this reason I use an env var (CG_CLIF_JIT), however that env var also gets passed to build scripts, so cargo will not find the build script executables, as they were jitted.</p>\n<p>The first problem could be solved by either somehow forcing all dependencies to be build as dylibs or cargo could make a dylib crate that depends on all dependencies of the executable and then pass that crate as extra dependency to the executable. The second problem could be solved by either unsetting <code>CG_CLIF_JIT</code> for build scripts or just jitting the build script and not try to call it afterwards.</p>\n<p>How hard would those changes be? And would a PR for this be accepted at all?</p>",
        "id": 203698319,
        "sender_full_name": "bjorn3",
        "timestamp": 1594635669
    },
    {
        "content": "<p>I don't know how hard it would be to impl. But I'd be ok to having a -Z flag for you to start experimenting!</p>",
        "id": 203731360,
        "sender_full_name": "Eh2406",
        "timestamp": 1594654975
    },
    {
        "content": "<p>I think there is already an open issue asking to have the <code>build.rs</code> have a separate env/do not take in <code>RUSTFLAGS</code>, the workaround for it is to always pass <code>--target</code>, it seems an expansion on that.</p>",
        "id": 204191012,
        "sender_full_name": "Luca Barbato",
        "timestamp": 1594981707
    },
    {
        "content": "<p>This would also be useful for miri: <a href=\"https://github.com/rust-lang/miri/issues/1661\">rust-lang/miri#1661</a></p>",
        "id": 221229758,
        "sender_full_name": "bjorn3",
        "timestamp": 1609349206
    }
]