[
    {
        "content": "<p>Does the cargo team hold regular meetings? I don't usually follow Cargo development, so I'm not sure how formalized the process is. :)</p>",
        "id": 269327418,
        "sender_full_name": "bstrie",
        "timestamp": 1643146096
    },
    {
        "content": "<p>Yes, we meet one a week for 1h on a video call.</p>",
        "id": 269333090,
        "sender_full_name": "Eh2406",
        "timestamp": 1643148909
    },
    {
        "content": "<p>Is it open to the public? If so, what time?</p>",
        "id": 269334635,
        "sender_full_name": "bstrie",
        "timestamp": 1643149620
    },
    {
        "content": "<p>Is there a particular topic you want to see the discussion of?</p>",
        "id": 269336653,
        "sender_full_name": "Eh2406",
        "timestamp": 1643150739
    },
    {
        "content": "<p>Yes, there are two big huge enormous PRs (<a href=\"https://github.com/rust-lang/cargo/pull/9992\">https://github.com/rust-lang/cargo/pull/9992</a> and <a href=\"https://github.com/rust-lang/cargo/pull/10061\">https://github.com/rust-lang/cargo/pull/10061</a>) and I wanted to offer my help in reviewing them. It's worth noting that I'm an employee at the company that sponsored the work on these PRs, so I worry that if I just said \"hey I reviewed it, you can trust me\" then people might perceive it as a conflict of interest. At the same time it's a lot to ask for the volunteers on the Cargo team to review two 6,000-line PRs in their spare time. So I wanted to figure out the best way to proceed.</p>",
        "id": 269338599,
        "sender_full_name": "bstrie",
        "timestamp": 1643151759
    },
    {
        "content": "<p>So, there are two types of review that those PRs need.</p>",
        "id": 269362728,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1643171935
    },
    {
        "content": "<p>One is \"does the PR's code generally look reasonable\". I've already done that review, and if that were the only thing we needed, we could likely merge them soon.</p>",
        "id": 269362746,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1643171959
    },
    {
        "content": "<p>The other is \"do these changes fit well into Cargo's internal architecture and handling of crates and dependencies\".</p>",
        "id": 269362765,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1643171991
    },
    {
        "content": "<p>I'm <em>on</em> the Cargo team and I don't feel sufficiently qualified to give that portion of the review; the changes look good to me, as far as that goes, but I have less deep knowledge of certain parts of Cargo's internal architecture than <span class=\"user-mention\" data-user-id=\"120518\">@Eric Huss</span> or <span class=\"user-mention\" data-user-id=\"116015\">@Alex Crichton</span>.</p>",
        "id": 269362840,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1643172043
    },
    {
        "content": "<p>If you feel like you have expertise on those internals of Cargo, or you were interested in <em>getting</em> that expertise through primarily code delving and experimentation, that'd <em>wildly useful</em> for us, not just for these PRs but many many other things.</p>",
        "id": 269362887,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1643172111
    },
    {
        "content": "<p>If not, we'd still absolutely welcome code review for PRs in general, that's something we're backlogged in, but reviewing those two PRs at a code-review level isn't going to help us merge them sooner.</p>",
        "id": 269362944,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1643172158
    },
    {
        "content": "<p>(Eric and Alex can chime in if there's a way they think you could help. I certainly can vouch for your diligence and willingness to do hard work that others haven't volunteered for.)</p>",
        "id": 269362964,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1643172190
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256342\">@bstrie</span> Does that answer your question?</p>",
        "id": 269362965,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1643172197
    },
    {
        "content": "<blockquote>\n<p>or you were interested in getting that expertise through primarily code delving and experimentation</p>\n</blockquote>\n<p>I'd be interested in this, however I imagine it would take a while for me to acquire such expertise. If Eric and Alex think that it will take them a while before they'll be able to look at this then I'd be happy to start getting familiar with the codebase as a medium-to-long-term fallback. But in the short term, if Eric and Alex have more important things on their plates that I <em>am</em> qualified to help with, then I'd also be happy to take some of that labor on myself if it means increasing the likelihood of them having time and energy to tackle these PRs.</p>",
        "id": 269430620,
        "sender_full_name": "bstrie",
        "timestamp": 1643211474
    },
    {
        "content": "<p>Naive question about 9992: does it permit depending on a pre-built rlib? I'm unclear on the various library types (I should know better by now :-) )</p>",
        "id": 269448508,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1643217831
    },
    {
        "content": "<p>No, it just causes cargo to build a binary/staticlib as a dependency.</p>",
        "id": 269448960,
        "sender_full_name": "Eric Huss",
        "timestamp": 1643217990
    },
    {
        "content": "<p>Ah! I Totally read the RFC backwards!</p>",
        "id": 269451223,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1643218826
    },
    {
        "content": "<p>the dreaded CFR <span aria-label=\"scream\" class=\"emoji emoji-1f631\" role=\"img\" title=\"scream\">:scream:</span></p>",
        "id": 269453713,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1643219733
    }
]