[
    {
        "content": "<p>There is a project cargo-wharf made by Denys Zariaiev that I used for a while before it fell out of maintenance.  It uses BuildKit as a sort of llvm and Cargo as the language to produce CRI (Container Runtime Interface) containers. The sort of containers you run with Docker or Kubernetes. Check it out:</p>\n<p><a href=\"https://github.com/denzp/cargo-wharf\">https://github.com/denzp/cargo-wharf</a></p>\n<p>I feel given the prevalence on container based development today it would be very useful to have as a first class supported target like x86_64-unknown-linux-cri. Being able to generate an optimized container directly would really set Rust apart. </p>\n<p>Just wanted to throw this thought out there. Thanks! :)</p>",
        "id": 226331746,
        "sender_full_name": "Mateus Amin",
        "timestamp": 1613345204
    },
    {
        "content": "<p>I suppose since Rust uses llvm it would make sense to start there and make a CRI backend. Then work on enabling it rustc. If being rather opinionated with the output there may not be a need for any frontend work in cargo initially. But I am sure eventually some options would be wanted.</p>",
        "id": 226540871,
        "sender_full_name": "Mateus Amin",
        "timestamp": 1613494382
    },
    {
        "content": "<p>I suppose I could use cgo to wrap buildkit to call from the C++ llvm backend code... It really should end up being an extra step on existing targets. Probably a way to reuse them.</p>",
        "id": 226543539,
        "sender_full_name": "Mateus Amin",
        "timestamp": 1613495357
    },
    {
        "content": "<p>Why would rustc need a CRI backend? It isn't a compilation target, but a combination of an API and some libraries. This has nothing to do with compilation itself. It can be implemented as a regular crate.</p>",
        "id": 226546854,
        "sender_full_name": "bjorn3",
        "timestamp": 1613496684
    },
    {
        "content": "<p>That's true. rustc doesn't need a CRI backend and, it can be implement as a regular crate.  Although, the cargo-wharf project takes another route. </p>\n<p>Motivationally. having an easy CRI path when developing for platforms that only expose container runtimes would be very convenient. There seems to be a better way to go about doing this then having tens of thousands of man hours spent optimizing dockerfiles. So  I am thinking about it. </p>\n<p>Building a container nowadays is pretty much limit to wrapping a pre-generated binary. So all work happens post-compilation. However, that's a design choice. One that makes container building very portable. And I do think you can take very far. I imagine there are benefits to be had doing the building up the chain. But I am not good enough to say what those would be.</p>\n<p>The cargo and rustc do take user inputs in the cargo file, as arguments, and as env variable that can be used to construct an optimal container image with almost no additional input from the user. </p>\n<p>For example, in the simplest case everything is statically linked.  However if the binary has dynamic links to  a library then we know we need to pull this library into the container as a layer. And in the compilation chain we have the information to do this automatically (maybe with some user specification of library location/version). Yet, people spend alot of time on this problem set. Even the simpler case of a statically linked binary. You can see first hand with a quick browse.</p>\n<p>Obviously, we are aware of where the binaries are, there name,  versions, arch, and os which we can resuse in the container spec.  Overall I don't see anything in the OCI spec that can be supplied by preexisting user inputs.</p>\n<p>You could even go further into the runtime specifications,  such as storage types and permission. If we see from the code that there are only read calls to the filesystem we can set minimal read-only permissions. But this is off-topic.</p>\n<p>Perhaps building on cargo wharf with a crate that implements a cargo extension while pulling in the builder image functionality as a native  function would be a good route.</p>",
        "id": 226681556,
        "sender_full_name": "Mateus Amin",
        "timestamp": 1613578545
    },
    {
        "content": "<p>It would be nice to push parts of the functionality lower in stack if only so that other language can reuse the work.</p>",
        "id": 226682704,
        "sender_full_name": "Mateus Amin",
        "timestamp": 1613578963
    },
    {
        "content": "<p>Also I suppose I should be referring to OCI instead CRI here if are going to ignore runtime settings so I am gonna edit the title.</p>",
        "id": 226687140,
        "sender_full_name": "Mateus Amin",
        "timestamp": 1613580590
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>                   OCI LLVM Crate---\\                                               \n                      ^              ------\\                                        \n                      |                     ---&gt;Rust BuildKit--------------&gt;Buildkit\n                      |                    --/                                      \n                   OCI Crago Plugin Crate-/                                         \n                      ^                                                             \n                      |                                                             \n                      |                                                             \nUser-----------------&gt; Cargo---------------&gt;OCI Image\n</code></pre></div>",
        "id": 226803353,
        "sender_full_name": "Mateus Amin",
        "timestamp": 1613651771
    },
    {
        "content": "<p><a href=\"https://github.com/gary-ascuy/cargo-rocket-docker\">https://github.com/gary-ascuy/cargo-rocket-docker</a><br>\n<a href=\"https://github.com/denzp/cargo-wharf\">https://github.com/denzp/cargo-wharf</a><br>\n<a href=\"https://github.com/denzp/rust-buildkit\">https://github.com/denzp/rust-buildkit</a></p>",
        "id": 226804607,
        "sender_full_name": "Mateus Amin",
        "timestamp": 1613652503
    },
    {
        "content": "<p>In what form would LLVM have to be involved in this?</p>",
        "id": 226809353,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1613655076
    },
    {
        "content": "<p>It would be nice to grab and use inputs going into the llvm space so the library can be reused in other llvm frontends. I am going to ask for thoughts on the llvm forums. I imagine this may not be feasible depending on how frontends are integrating into the toolchain.</p>",
        "id": 227101964,
        "sender_full_name": "Mateus Amin",
        "timestamp": 1613838306
    }
]