[
    {
        "content": "<p>Hi all, a recent change in <code>ed25519-dalek</code> hilighted the fact that Cargo's semver comparison code doesn't correctly handle prereleases according to how semver states they should act, leading to <a href=\"https://github.com/dalek-cryptography/ed25519-dalek/issues/138\">https://github.com/dalek-cryptography/ed25519-dalek/issues/138</a> -- is there anyone in the team who might be interested in helping me engage with deciding what the \"right\" answer here is?</p>",
        "id": 204522013,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1595319480
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"223910\">@Daniel Silverstone</span> looking tangentially at the issue, and I <em>think</em> it misses pretty critical bit of info  -- what is the constraint in Cargo.toml?</p>",
        "id": 204523418,
        "sender_full_name": "matklad",
        "timestamp": 1595320568
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"133169\">@matklad</span> In this case I think it's <code>^1.0.0-pre.3</code></p>",
        "id": 204523506,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1595320639
    },
    {
        "content": "<p>Which, based on the \"prereleases are incompatible with everything\" would have to be equivalent to \"=1.0.0-pre.3\" if we were properly following semver</p>",
        "id": 204523596,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1595320684
    },
    {
        "content": "<p>Yup confirmed that <code>curve25519-dalek = \"1.0.0-pre.3\"</code> in Cargo.toml would download <code>-pre.4</code>.</p>",
        "id": 204523861,
        "sender_full_name": "matklad",
        "timestamp": 1595320922
    },
    {
        "content": "<p>afaict, the presence of any prerelease indicators is supposed (in semver) to mean that <em>any</em> other version is incompatible.</p>",
        "id": 204524057,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1595321054
    },
    {
        "content": "<p>I think it is more nuanced than that (or can reasonable interpreted as such): pre-release means that semver guarantees are off. That is, by opting into per-releases, you agree that it's your job, as a user of a library, to deal with any incopat fallout</p>",
        "id": 204524404,
        "sender_full_name": "matklad",
        "timestamp": 1595321360
    },
    {
        "content": "<p>Hmm, that's difficult to deal with when you're downstream of such a thing.  In this instance <code>rustup</code> depends on <code>pgp</code> which depends on <code>ed25519-dalek</code> which has now changed incompatibly.  I can't run <code>cargo update</code> without then failing to build a dependency of mine.  I kinda feel like <code>cargo update</code> shouldn't move pins with prereleases in them unless specifically asked to with <code>-p</code>, if we're not going to declare prereleases incompatible-with-everything.</p>",
        "id": 204524731,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1595321578
    },
    {
        "content": "<p>I'm trying to fit to the principle of least surprise.  It's surprising to me that cargo update would result in something which can't build, when semver is being followed by my indirect dependencies.</p>",
        "id": 204524795,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1595321628
    },
    {
        "content": "<p>Yeah, I wonder if the bug here is \"cargo allows publishing crates with dependencies on <code>-pre</code> crates\". Or maybe \"Cargo allows to use <code>-pre</code> crates without opt-in from the top-level crate\". Cargo forbids publishing with <code>= '*'</code> dependencies for similar reasons. </p>\n<p>You can treat <code>pre</code> as semver compatible or semver incompatible (and I think both are correct, as the spec explicitely says that guarantess are off). </p>\n<p>The latter is useful for people who use pre-release versions in production software (b/c they get more guarantees).</p>\n<p>The former is useful to developers of the pre-release crates, because it gives wider testing for a pre-release.</p>",
        "id": 204525251,
        "sender_full_name": "matklad",
        "timestamp": 1595321938
    },
    {
        "content": "<p>Perhaps it should be that cargo shouldn't allow publishing of a crate which doesn't use exact dependencies for anything with a prerelease marker?</p>",
        "id": 204525299,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1595321990
    },
    {
        "content": "<p>So you can depend on it, but you have to use <code>=1.0.0-pre.3</code></p>",
        "id": 204525329,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1595322003
    },
    {
        "content": "<p>I suppose it could be made more general as \"it must be a constrained range\" so as to permit the crate author to say \"it's okay with <code>-pre.3</code> through to <code>-pre.5</code> but then if <code>-pre.6</code> is released, cargo won't automatically pick it up.</p>",
        "id": 204525477,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1595322101
    },
    {
        "content": "<p>That is another option. The drawback here is that mixing two deps which use pre.3 and pre.4 is now impossible, while most of the time you would actually expect pre.3 and pre.4 to be compatible in practice. But for pre versions that might be fine, as there are few pre versions in the crate graph, so probability of conflict is low</p>",
        "id": 204525481,
        "sender_full_name": "matklad",
        "timestamp": 1595322106
    },
    {
        "content": "<p>Remember, prerelease also includes people using <code>-alpha.X</code> or <code>-beta.X</code> as well.  We'd be constraining the use of those partially as a result; but I think over-all it'd be far more sane.  If we're not able to make semver guarantees then we need to protect <em>downstream</em> users of the crate, and the onus should probably be on the crate declaring the dependency.</p>",
        "id": 204525597,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1595322180
    },
    {
        "content": "<p>Would another solution be to make the prerelease number semver lite? If it was <code>-alpha.X.Y</code>? As to me reading the conversation it seems like there’s a desire to express when a prerelease is just a patch release or if there are breaking changes.</p>",
        "id": 204526457,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1595322821
    },
    {
        "content": "<p>I'm not sure we should attempt to place any meaning atop semver.  We already support multi-part prerelease components but don't treat them as anything other than forward compatible.  It's that treatment which needs thinking about.  if we continue to treat them as such then we need to warn (or error) on dependencies which specify/consume such version numbers.  Also I wonder, does Cargo think <code>1.0.1-pre1</code> is compatible with <code>1.0.0</code> ? because by semver's \"no guarantees\" I think it probably should not, since there are no guarantees.</p>",
        "id": 204530041,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1595325733
    },
    {
        "content": "<p>Side Note: Cargo needs to allow publishing a crate that depends on a pre-release crate because rust is broken into so many crates.</p>\n<p>Example: winit (windowing lib) does a pre-release, so glutin (adds a GL context to a winit window) then needs to do a pre-release depending on the winit pre-release.</p>",
        "id": 204543660,
        "sender_full_name": "Lokathor",
        "timestamp": 1595336294
    },
    {
        "content": "<p>The original issue is documented somewhere in the cargo issue tracker</p>",
        "id": 204543769,
        "sender_full_name": "nagisa",
        "timestamp": 1595336349
    },
    {
        "content": "<p>Using <code>=</code> requirements can be challenging, since it requires all crates to agree on exactly which release to use. For a single use crate, that is ok, but when shared it quickly becomes a problem. I think incompatibility between pre-release versions might just be in its nature. </p>\n<p>There's more discussion at <a href=\"https://github.com/rust-lang/cargo/issues/2222\">https://github.com/rust-lang/cargo/issues/2222</a> and <a href=\"https://github.com/rust-lang/cargo/issues/6016\">https://github.com/rust-lang/cargo/issues/6016</a>. There hasn't been much work on what pre-release support actually means, but I believe because there isn't an obvious answer (or at least, a less-painful one than what currently happens).</p>\n<p>Just roughly thinking of some improvements:</p>\n<p><code>cargo update</code> could provide some warnings when transitive dependencies use pre-release versions. I'm not sure how annoying that would be.</p>\n<p>Add an option to <code>cargo update</code> to forbid pre-release versions anywhere in the graph. Or conversely, an option to \"opt-in\" to pre-release versions.</p>\n<p>public/private dependencies could be leveraged to decouple unification of private pre-release versions. For example, if <code>ed25519-dalek</code> is a purely private dependency of <code>pgp</code>, then it could use an <code>=</code> requirement without fear of it causing issues.</p>",
        "id": 204543809,
        "sender_full_name": "Eric Huss",
        "timestamp": 1595336366
    },
    {
        "content": "<p>What about only allowing pre-release dependencies when uploading to <a href=\"http://crate.io\">crate.io</a> when the crate itself is a pre-release version?</p>",
        "id": 204544083,
        "sender_full_name": "bjorn3",
        "timestamp": 1595336479
    },
    {
        "content": "<blockquote>\n<p>cargo update could provide some warnings when transitive dependencies use pre-release versions. I'm not sure how annoying that would be.</p>\n</blockquote>\n<p>If we couple that with some flag/config options to suppress the warning, we'd get the \"leaf crates opts-into pre-releases\" behavior which is theoretically (but not necessary in practice) is the right one.</p>",
        "id": 204544102,
        "sender_full_name": "matklad",
        "timestamp": 1595336490
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"120518\">Eric Huss</span> <a href=\"#narrow/stream/246057-t-cargo/topic/potential.20semver.20related.20issue/near/204543809\">said</a>:</p>\n<blockquote>\n<p>Using <code>=</code> requirements can be challenging, since it requires all crates to agree on exactly which release to use.</p>\n</blockquote>\n<p>Why is that the only possible outcome? What prevents each one pulling in separate incompatible versions, the same as 1.0 and 2.0?</p>",
        "id": 204545323,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1595337151
    },
    {
        "content": "<p>I agree that if the crate is part of a public interface it makes things harder for people to use them together, but that's an existing problem outside of this (and ideally helped by public/private)</p>",
        "id": 204545414,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1595337198
    },
    {
        "content": "<p>I think it increases the risk that you'll have compilation errors or resolver errors due to attempting to mix distinct versions.</p>",
        "id": 204546914,
        "sender_full_name": "Eric Huss",
        "timestamp": 1595338036
    },
    {
        "content": "<p>Only if it's part of the crate's public API, yeah? Otherwise it should make crate resolving _more_ successful as there are less overall constraints.</p>",
        "id": 204547192,
        "sender_full_name": "Jake Goulding",
        "timestamp": 1595338206
    },
    {
        "content": "<p>So my issue is that <code>cargo update</code> in the rustup repo resulted in <code>pgp</code> not compiling.  Not that <code>rustup</code> didn't compile.</p>",
        "id": 204547214,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1595338220
    },
    {
        "content": "<p>yea, only if it is public, or it uses <code>links</code>, or uses global symbols, etc.</p>",
        "id": 204547413,
        "sender_full_name": "Eric Huss",
        "timestamp": 1595338355
    }
]