[
    {
        "content": "<p>PubGrub is a algorithm for doing dependency resolution. It is particularly interesting for its great error messages, and its careful thoughts about algorithmic complexity and modularity. This is a stream for discussion of resources about the algorithm and its relation to the rust ecosystem. It has bean 2.5 years, so no one should expect fast progress. But here are some links I know about. :-)<br>\nI have been interested in it since the first blog post:<br>\n<a href=\"https://medium.com/@nex3/pubgrub-2fb6470504f\">https://medium.com/@nex3/pubgrub-2fb6470504f</a><br>\nThere is also detailed documentation at:<br>\n<a href=\"https://github.com/dart-lang/pub/blob/master/doc/solver.md\">https://github.com/dart-lang/pub/blob/master/doc/solver.md</a><br>\nCargo has a issue I posted about trying to steel the good error messages:<br>\n<a href=\"https://github.com/rust-lang/cargo/issues/5284\">https://github.com/rust-lang/cargo/issues/5284</a><br>\nI also posted some questions on pubs issue:<br>\n<a href=\"https://github.com/dart-lang/pub/issues/2089\">https://github.com/dart-lang/pub/issues/2089</a><br>\nAnd recently <span class=\"user-mention\" data-user-id=\"340766\">@Alex Tokarev</span> pointed out that there is a Elm implementation:<br>\n<a href=\"https://github.com/mpizenberg/elm-pubgrub/tree/dev\">https://github.com/mpizenberg/elm-pubgrub/tree/dev</a></p>",
        "id": 209663193,
        "sender_full_name": "Eh2406",
        "timestamp": 1599751486
    },
    {
        "content": "<p>So I can think of several things that Cargo can already do that the algorithm as described can not:</p>\n<ul>\n<li><code>feature</code> flags. I can conceive of how to add this. but more importantly the Dart implementation has it inspired by how it works in Cargo. It is not documented but, we can figure out what was done there as a starting point.</li>\n<li><code>one per major</code> instead one <code>one per name</code>. PubGrub assumes that anything that matches a dependency will have the same name, and that there is only one version that can be selected per Name. We will need to find a way to relax one of those, as Cargo allows <code>foo=\"1.0\"</code> and <code>foo=\"2.0\"</code> in the same tree. But both assumptions are deeply baked into the algorithm, and we will need to be careful.</li>\n<li><code>links attributes</code> cargo bans two crates with the same <code>links attributes</code> in the same build. (conservatively in the same tree for now.) This can defintly be supported but may have <code>O(n^2)</code> incompatibilities per links. And I don't know how that will affect error messages.</li>\n<li><code>Public&amp;Private</code> dependency ... this is very hard to explain ... and only has limited support in Cargo now. So we will think about it then.</li>\n</ul>",
        "id": 209703713,
        "sender_full_name": "Eh2406",
        "timestamp": 1599769177
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120179\">@Eh2406</span> It <em>should</em> be possible to express <code>links</code> as a special kind of conflict.</p>",
        "id": 209703911,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1599769265
    },
    {
        "content": "<p>You could declare that foo-sys 1.2.3 depends on links:foo == foo-sys-1.2.3 , where every version of links:foo is incompatible with every other version.</p>",
        "id": 209704097,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1599769355
    },
    {
        "content": "<p>Right, that may work. The algorithm assumes that you can quickly get the list of all mutually exclusive versions of a crate (I think). Our current index does support that for crates (there all in one file) but it doesn't support it for all things with the same <code>links:foo</code>. Can we add an alternative to a mutually exclusive set as we find them? We will see as the implementation comes together.</p>",
        "id": 209705340,
        "sender_full_name": "Eh2406",
        "timestamp": 1599770034
    },
    {
        "content": "<p>Are <code>links</code> included in the cargo index, without having to download the crate?</p>",
        "id": 209706402,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1599770615
    },
    {
        "content": "<p>If they have been published in the past few years, yes.</p>",
        "id": 209706534,
        "sender_full_name": "Eh2406",
        "timestamp": 1599770677
    },
    {
        "content": "<p>Ah, hmmm.</p>",
        "id": 209707269,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1599771020
    },
    {
        "content": "<p>So, ignoring the case of old crates where we don't have that information, for crates where we do, we should be able to fill in all the versions of <code>links:foo</code> in advance, by just scanning all the versions of crates we're otherwise considering.</p>",
        "id": 209707344,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1599771066
    },
    {
        "content": "<p>At least, for any crate we're already feeding into the pubgrub implementation.</p>",
        "id": 209707369,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1599771085
    },
    {
        "content": "<p>Both PubGrub and Cargos resolver ask for Crates in a lazy fashion.</p>",
        "id": 209707496,
        "sender_full_name": "Eh2406",
        "timestamp": 1599771153
    },
    {
        "content": "<p>Ah.</p>",
        "id": 209707533,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1599771176
    },
    {
        "content": "<p>Which means it might ask for a given crate and then notice the reference to links:foo so it would ask for links:foo, but we don't know everything about links:foo yet.</p>",
        "id": 209707577,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1599771203
    },
    {
        "content": "<p>exactly.</p>",
        "id": 209707607,
        "sender_full_name": "Eh2406",
        "timestamp": 1599771219
    },
    {
        "content": "<p>Then yeah, we need to find out if the pubgrub algorithm can handle being told about some versions of a package without being told about all versions of a package yet.</p>",
        "id": 209707612,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1599771225
    },
    {
        "content": "<p>Either that or we locally scan the index and create our own reverse index for each <code>links</code>.</p>",
        "id": 209707698,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1599771256
    },
    {
        "content": "<p>(which doesn't seem especially hard, if we have to, but let's avoid it if we can)</p>",
        "id": 209707719,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1599771271
    },
    {
        "content": "<p>I think you may be correct that this will just work when we get there, but it is something we are going to need to add.</p>",
        "id": 209707723,
        "sender_full_name": "Eh2406",
        "timestamp": 1599771273
    },
    {
        "content": "<p>Thinking about it more. The list all versions may only be needed when we have to arbitrarily pick one from it. I.E. \"the only thing you wanted was <code>serde=\"1.0\"</code>. so lets try the newest version.\" If so, and if we can make that part of the API lazy, then the speshal <code>links:foo</code> crate can <code>panic</code> if it gets there. As we should only have <code>\"=\"</code>constraints on the speshal links crates. This may just work. Thanks for the suggestion.</p>",
        "id": 209710222,
        "sender_full_name": "Eh2406",
        "timestamp": 1599772501
    },
    {
        "content": "<p>My most serious attempt to bring the ideas to Cargo floundered on dealing with integrating with the existing structure. My most serious attempt to RIIR suffered from second-system syndrome, I had lots of ideas on how to make it more general/performance so I failed to get started anyware.</p>\n<p>So if I were asked how we should best get started on a new attempt, my 2c is:</p>\n<ul>\n<li>\n<ol>\n<li>get something working by doing as direct a port as is feasible with the language translation. Are the names hard coded as type <code>String</code>, does it require all the index data upfront, does it use <code>clone</code> a lot? All good if it can get tests running.</li>\n</ol>\n</li>\n<li>\n<ol start=\"2\">\n<li>get all of the existing tests ported over from Dart/Elm and get them passing.</li>\n</ol>\n</li>\n<li>\n<ol start=\"3\">\n<li>Clean things up. Let's make the name type generic so it works with a user supplied <code>InternedString</code>. Lets only interact with the Index thu a trate. Profile, Rc/Intern to avoid the Clones. Set up Fuzz testing. Try and make it usable as a library.</li>\n</ol>\n</li>\n<li>\n<ol start=\"4\">\n<li>If at this point we have an example of the algorithm or even better a library that \"just\" does what the base algorithme can do we should be proud! It will be useful for someone interested in porting Pip/Npm/Pub to rust. That is nothing to sneeze at. Publicize this win!</li>\n</ol>\n</li>\n<li>\n<ol start=\"5\">\n<li>Start adding the features that Cargo has that the base algorithme does not have. (discussed above.)</li>\n</ol>\n</li>\n<li>\n<ol start=\"6\">\n<li>Try to get Cargo to use it.</li>\n</ol>\n</li>\n</ul>",
        "id": 210068823,
        "sender_full_name": "Eh2406",
        "timestamp": 1600121142
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120179\">@Eh2406</span> That sounds like a great plan.</p>",
        "id": 210094052,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1600151024
    },
    {
        "content": "<p>Hi, I was just invited here by Jacob and Alex</p>\n<p>I finished (as in usable but not perfect) recently my port of the elm port (in-port-ception) to rust. Here it is: <a href=\"https://github.com/mpizenberg/pubgrub-rs\">https://github.com/mpizenberg/pubgrub-rs</a></p>\n<p>I think that checks a lot of the points above but a lot to do to make it cargo-friendly still. I haven't imported tests from dart. Cloning is used quite a lot in the code because I didn't think that it would have much impact performance-wise and also I don't have any benchmark to verify if it does. But the code is generic regarding packages and versions.</p>\n<p>You can follow the home API doc to have a feel for what it looks like using it as-is: <a href=\"https://docs.rs/pubgrub/0.1.0/pubgrub/\">https://docs.rs/pubgrub/0.1.0/pubgrub/</a>. And deep dive into the code should be easy I think since there is documentation everywhere.</p>",
        "id": 211892176,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1601548695
    },
    {
        "content": "<p>Hi everyone and welcome <span class=\"user-mention\" data-user-id=\"348419\">@Matthieu Pizenberg</span>. I'm excited to get the initial feedback for the library!</p>\n<p>We had some ideas on how some things could be changed, but decided to wait for the feedback since it's not clear whether they would be improvements in the end. I'll post concrete discussion points later: I'd like people to have a fresh look without focusing on specific things first. It should show what looks like a real problem and what does not.</p>\n<p>I think porting more tests from the original testing suite is a worthwhile investment, so until we gather such feedback and prioritize future changes I'm going to do just that :)</p>",
        "id": 211903347,
        "sender_full_name": "Alex Tokarev",
        "timestamp": 1601556282
    },
    {
        "content": "<p>This is amazing work! So much progress! And, a new <del>co conspirator</del> collaborator! Welcome <span class=\"user-mention\" data-user-id=\"348419\">@Matthieu Pizenberg</span>!<br>\nReading the excellent documentation, I love the api so far! I love how everything is bounded by a trate, that will make it easier to test and to adapt to different use cases! (I seem to be exclaiming a lot, I am just excited.)</p>",
        "id": 211911388,
        "sender_full_name": "Eh2406",
        "timestamp": 1601559712
    },
    {
        "content": "<p>I spent some time looking at the code this afternoon. It is looking good. I have some Nits, but nothing important.  I was removing a clone in a function when I realized that the function is not (yet) used.  I think we will want to be careful with HashMaps that have random seeds, from my experience it is hard to diagnose a performance problem that only shows up some of the time. The best way I have found to identify performance problems is to have lots of users :-P but until that comes along Cargo uses proptest to make large indexes to check. It have found numerous  performance problems in Cargo and even a handful of correctness issues. The code lives at <a href=\"https://github.com/rust-lang/cargo/blob/556c236f9ad3ea7e7be0ddb8ba547fabc292e6d4/crates/resolver-tests/src/lib.rs#L751-L886\">https://github.com/rust-lang/cargo/blob/556c236f9ad3ea7e7be0ddb8ba547fabc292e6d4/crates/resolver-tests/src/lib.rs#L751-L886</a>, and I am well started porting it over. :-)</p>",
        "id": 211979535,
        "sender_full_name": "Eh2406",
        "timestamp": 1601588538
    },
    {
        "content": "<p>It's great that you managed to generate registries with enough coherence to have valid set of dependencies! That's one thing I was struggling with when trying to property test the elm version.</p>",
        "id": 212044765,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1601626391
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120179\">@Eh2406</span> You should have received an invitation for the pubgrub-rs repository so that you can easily push on it. For now we settled on using a new branch for doing new stuff, and making a PR to dev when it's ready. Master stays in sync with latest published version  whereas dev has the new development if that's ok with you too.</p>",
        "id": 212055886,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1601633556
    },
    {
        "content": "<p>Thanks for the invite. Don't push to master, good plan.</p>",
        "id": 212069231,
        "sender_full_name": "Eh2406",
        "timestamp": 1601642928
    },
    {
        "content": "<p>Getting a registry working, took a lot of work, and two pages of unreadable code.  I am hoping that I can simplify it thanks to your trates.</p>",
        "id": 212070006,
        "sender_full_name": "Eh2406",
        "timestamp": 1601643313
    },
    {
        "content": "<p>We just received a comment saying that implementing a trait automatically is a bad practice. It is currently done for the Package trait. Does anyone have thoughts on this matter?<br>\n<a href=\"https://github.com/mpizenberg/pubgrub-rs/issues/10\">https://github.com/mpizenberg/pubgrub-rs/issues/10</a></p>",
        "id": 212223848,
        "sender_full_name": "Alex Tokarev",
        "timestamp": 1601818852
    },
    {
        "content": "<p>Hi, just a short message to say that I'll not be very responsive until end of week I think, ton of work for a couple of days</p>",
        "id": 212353199,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1601930120
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"340766\">@Alex Tokarev</span>  and I seem to be excitedly making progress. How do you want us to proceed while you are unavailable? Should we wait  until you get back to merge PRs?</p>",
        "id": 212354074,
        "sender_full_name": "Eh2406",
        "timestamp": 1601930572
    },
    {
        "content": "<p>ahah I can see that, and I'm fairly excited to. A bit too much to be honest ahah so I'm squeezing every time I have reading what you are doing. The problem is I have difficulty staying focused on my post doc stuff because of the excitement ^^.</p>",
        "id": 212456208,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1602003642
    },
    {
        "content": "<p>for the time being if that's ok, I'd like to at least read and respond on each PR, but I certainly will not write code on the repo I think. Also, I haven't discussed that with you yet, but seems you seem quite interested in this, what do you think of transferring to a github organization after v0.2 is published. Like so I could scale back since I was mostly interested in this for elm-test-rs</p>",
        "id": 212456678,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1602003882
    },
    {
        "content": "<p>We won't merge until you comment that you are ok on each one. An org may make sense, but if you want to scale back feel free to delegate responsibilities.</p>",
        "id": 212457389,
        "sender_full_name": "Eh2406",
        "timestamp": 1602004290
    },
    {
        "content": "<p>Thanks for confirmation and offer. I'll definitely delegate more soonish</p>",
        "id": 212457722,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1602004474
    },
    {
        "content": "<p>Does anyone object to opening a stream #t-cargo/pubgrub so we have a place to chat and don't spam cargo with our work on the library?</p>",
        "id": 212462081,
        "sender_full_name": "Eh2406",
        "timestamp": 1602006756
    },
    {
        "content": "<p>the <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> is not for \"object to\" but agree to ahah</p>",
        "id": 212465996,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1602008687
    },
    {
        "content": "<p><a href=\"#narrow/stream/260232-t-cargo.2FPubGrub\">https://rust-lang.zulipchat.com/#narrow/stream/260232-t-cargo.2FPubGrub</a></p>",
        "id": 212470361,
        "sender_full_name": "Eh2406",
        "timestamp": 1602010837
    },
    {
        "content": "<p>Things are proceeding well over in <a class=\"stream\" data-stream-id=\"260232\" href=\"/#narrow/stream/260232-t-cargo.2FPubGrub\">#t-cargo/PubGrub</a> and in <a href=\"https://github.com/mpizenberg/pubgrub-rs\">https://github.com/mpizenberg/pubgrub-rs</a>, but we seem to be outgrowing a personal repo. So it will soon be time for a github org. Eventually, it may be under the control of  the Cargo team. But it is a long way from that happening. So where do we move to? Do we make are own org, or is there one that makes sense for us to join? Is <code>rust-lang-nursery</code> still a thing?</p>",
        "id": 213615358,
        "sender_full_name": "Eh2406",
        "timestamp": 1602883048
    },
    {
        "content": "<p>The nursery is deprecated.</p>",
        "id": 213624570,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1602891235
    },
    {
        "content": "<p>I would suggest creating a dedicated GitHub organization for now, and we can eventually move the repository to rust-lang once cargo incorporates it.</p>",
        "id": 213624612,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1602891258
    },
    {
        "content": "<p>Just wanted to let the <span class=\"user-group-mention\" data-user-group-id=\"3139\">@T-cargo</span> and anyone watch here that we have a new release of the crate and an announcement on <a href=\"https://www.reddit.com/r/rust/comments/jx794b/announcing_pubgrub_v02_a_flexible_version_solver/\">reddit</a>. We also have the first real world use case in this analysis of the elm packages, <a href=\"https://discourse.elm-lang.org/t/solving-dependencies-of-11079-elm-packages-in-less-than-1s/6541\">here</a>. Big thanks to <span class=\"user-mention\" data-user-id=\"348419\">@Matthieu Pizenberg</span> and <span class=\"user-mention\" data-user-id=\"340766\">@Alex Tokarev</span> for all the work and the careful reviews!</p>",
        "id": 217308981,
        "sender_full_name": "Eh2406",
        "timestamp": 1605809591
    },
    {
        "content": "<p>Two updates: <span class=\"user-mention\" data-user-id=\"348419\">@Matthieu Pizenberg</span> is using this to drive the test runner for the Elm track on <a href=\"http://exercism.io\">exercism.io</a>, we are in production. And it looks like our Conference talk proposal was accepted! We will be giving \"Building a flexible dependency solver in Rust\" at <a href=\"https://packaging-con.org/\">PackagingCon</a>.</p>",
        "id": 254565274,
        "sender_full_name": "Eh2406",
        "timestamp": 1632414978
    },
    {
        "content": "<p>Too sad I totally missed PackagingCon.  <span aria-label=\"disappointed\" class=\"emoji emoji-1f61e\" role=\"img\" title=\"disappointed\">:disappointed:</span><br>\nI saw the <a href=\"https://pretalx.com/packagingcon-2021/talk/MXVTEA/\">slide uploaded</a>. Is there any recording for the talk? Thanks!</p>",
        "id": 261775912,
        "sender_full_name": "Weihang Lo",
        "timestamp": 1637151263
    },
    {
        "content": "<p><a href=\"https://youtu.be/Q20uZNSFxXo?t=10385\">https://youtu.be/Q20uZNSFxXo?t=10385</a><br>\nI don't know for how much longer but for now that link works.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"Q20uZNSFxXo\" href=\"https://youtu.be/Q20uZNSFxXo?t=10385\"><img src=\"https://uploads.zulipusercontent.net/31fe5abde81dc4f03973b45d1e48f3b2ba2d26f8/68747470733a2f2f692e7974696d672e636f6d2f76692f513230755a4e534678586f2f64656661756c742e6a7067\"></a></div>",
        "id": 261798864,
        "sender_full_name": "Eh2406",
        "timestamp": 1637162454
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"245964\">@Weihang Lo</span>  and as of today, there is a dedicated youtube video: <a href=\"https://youtu.be/XyJpYFnl18U\">https://youtu.be/XyJpYFnl18U</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"XyJpYFnl18U\" href=\"https://youtu.be/XyJpYFnl18U\"><img src=\"https://uploads.zulipusercontent.net/b3c9590364638b680100738295699a4e7ebc4813/68747470733a2f2f692e7974696d672e636f6d2f76692f58794a7059466e6c3138552f64656661756c742e6a7067\"></a></div>",
        "id": 262525642,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1637707947
    }
]