[
    {
        "content": "<p>I've started an RFC for adding authentication to private cargo registries, and I'm hoping for some initial feedback before posting it as an official RFC.</p>\n<p>Specifically, I'm interested in what people think of attempting to auto-detect when authentication is required (via receiving HTTP 401) as described in the Alternatives section vs the explicit configuration option.</p>\n<p>I have a prototype implementation where this is working well combined with the http-registry feature.</p>\n<p><a href=\"https://github.com/arlosi/rfcs/blob/always-auth/text/0000-always-auth.md\">https://github.com/arlosi/rfcs/blob/always-auth/text/0000-always-auth.md</a></p>",
        "id": 238156798,
        "sender_full_name": "Arlo Siemsen",
        "timestamp": 1620658886
    },
    {
        "content": "<p>not on the cargo team, but on the <a href=\"http://crates.io\">crates.io</a> team</p>",
        "id": 238157610,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1620659179
    },
    {
        "content": "<p>I'm wondering... is there any rationale for having the configuration being on the user side instead of the index side?</p>",
        "id": 238157653,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1620659202
    },
    {
        "content": "<p>like having <code>\"authenticate_all_api_requests\": true</code> in <code>config.json</code></p>",
        "id": 238157715,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1620659231
    },
    {
        "content": "<p>When combined with the approved HTTP-registry RFC, the <code>config.json</code> would be in the index (which we also want to secure).</p>",
        "id": 238157877,
        "sender_full_name": "Arlo Siemsen",
        "timestamp": 1620659293
    },
    {
        "content": "<p>If you set <code>net.git-fetch-with-cli</code> to true, direct (password and ssh) authentication is possible. If using ssh you have to specify the url as <code>ssh://git@github.com/org/index-repo.git</code> though and not as <code>git@github.com:org/index-repo.git</code>. Without <code>net.git-fetch-with-cli</code> you need to use either ssh-agent or git's <code>credential.helper</code>.</p>",
        "id": 238169035,
        "sender_full_name": "bjorn3",
        "timestamp": 1620663236
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"270929\">@Arlo Siemsen</span></p>",
        "id": 238169633,
        "sender_full_name": "bjorn3",
        "timestamp": 1620663406
    },
    {
        "content": "<p>If <code>net.git-fetch-with-cli =true</code>, then requests to the index will be authenticated with git when git is used as the transport. But when we're fetching the index over http via the <a href=\"https://github.com/rust-lang/rfcs/blob/master/text/2789-sparse-index.md\">sparse index</a> feature, there is currently no way to do authentication.</p>",
        "id": 238170701,
        "sender_full_name": "Arlo Siemsen",
        "timestamp": 1620663812
    },
    {
        "content": "<p>@bjorn3 The idea proposed in this RFC, combined with the sparse_index RFC, would allow a private registry to be implemented using only HTTP (no git), and would only have one form of authentication (the token), rather than the token (for API) + git (for index) + temp credentials encoded in the download URL. I believe this would make it significantly easier to implement private cargo registry servers.</p>",
        "id": 238172861,
        "sender_full_name": "Arlo Siemsen",
        "timestamp": 1620664676
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"270929\">@Arlo Siemsen</span> is there any information on <code>config.json</code> that would need to be private?</p>",
        "id": 238174826,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1620665427
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"121055\">@Pietro Albini</span>  Making <code>config.json</code> public would confirm the registry exists and expose the download URL, but that would probably be okay.</p>",
        "id": 238176319,
        "sender_full_name": "Arlo Siemsen",
        "timestamp": 1620666030
    },
    {
        "content": "<p>the reason I'm asking is that on the <a href=\"http://crates.io\">crates.io</a> side I'd like to <em>prevent</em> users from setting the \"send creds\" option on the client side :)</p>",
        "id": 238176413,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1620666066
    },
    {
        "content": "<p>One nit so far: Artifactory also supports Cargo <a href=\"https://www.jfrog.com/confluence/display/JFROG/Cargo+Registry\">https://www.jfrog.com/confluence/display/JFROG/Cargo+Registry</a></p>",
        "id": 238182146,
        "sender_full_name": "Eh2406",
        "timestamp": 1620668327
    },
    {
        "content": "<p>I do not yet feel qualified to design security related code. Latter this year I will be talking with some experts to be prepared to help with this topic. I do not at all mind people getting the conversation started! My feedback (and checkmark) will have to weight. Sorry.</p>",
        "id": 238184129,
        "sender_full_name": "Eh2406",
        "timestamp": 1620669102
    },
    {
        "content": "<p>Thanks for taking a look <span class=\"user-mention\" data-user-id=\"120179\">@Eh2406</span>. Artifactory added support after I wrote this up. I'll make an update. </p>\n<p>I've been talking with the Azure Artifacts team internally here at Microsoft to make a plan around adding Rust support. We'd like to avoid implementing the git-based registry if possible. An authenticated HTTP-based registry would integrate much better.</p>\n<p>Is there a way I could participate in the implementation discussions? I'd like to help :)</p>",
        "id": 238189399,
        "sender_full_name": "Arlo Siemsen",
        "timestamp": 1620671098
    },
    {
        "content": "<p>The best summery of the work planed for the HTTP-based registry is at <a href=\"https://github.com/rust-lang/cargo/pull/8890#issuecomment-822025708\">https://github.com/rust-lang/cargo/pull/8890#issuecomment-822025708</a><br>\nOn the authentication side, Lets try to get all the people with expertise talking. An RFC seam like a good next step.<br>\nMy new job is at Amazon, and the experts I want to talk to are the CodeArtifact team. They have  made authentication work for lots of languages, and should have opinions on how not to do it. I am shore it is the same with the Azure Artifacts team.<br>\nFor both the HTTP-based and authentication efferts, none of the work will be done in private. But I will try to remember to ping you in particular.</p>",
        "id": 238195805,
        "sender_full_name": "Eh2406",
        "timestamp": 1620673697
    },
    {
        "content": "<p>I'd also like to be pinged for the infra/crates.io side</p>",
        "id": 238199854,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1620675597
    },
    {
        "content": "<p>(I felt bad about delaying your work.) One of the people I wanted to talk to was available to talk with me today.</p>\n<blockquote>\n<p>is there any information on <code>config.json</code> that would need to be private?</p>\n</blockquote>\n<blockquote>\n<p>Making <code>config.json</code> public would confirm the registry exists and expose the download URL, but that would probably be okay.</p>\n</blockquote>\n<p>From that conversation. The existence of a registry can be private. The protocol we come up with must allow <code>config.json</code> to return 401, if authentication is missing.</p>\n<p>He also pointed out that we need to be careful about what authentication Cargo sends if the server sends a redirect.</p>",
        "id": 238353823,
        "sender_full_name": "Eh2406",
        "timestamp": 1620755187
    },
    {
        "content": "<p>Just remembered this one. He recommended that Cargo refuse to send creds when the url is unsecured HTTP.</p>",
        "id": 238481128,
        "sender_full_name": "Eh2406",
        "timestamp": 1620829130
    },
    {
        "content": "<p>That seems like a really good idea.</p>",
        "id": 238501669,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1620836030
    },
    {
        "content": "<p>Requiring HTTPS before sending credentials makes sense.</p>",
        "id": 238501697,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1620836041
    },
    {
        "content": "<p>eh2406 sent me here: i just implemented a working change to cargo which lets it work with artifactory's crate support over https with tokens. I wasn't in love with several things and was expecting to have to change some things, but looking at it, I feel like some of this deserves rearchitecture and while I had some thoughts, I'm not sure I'm up for a whole big thing. (I'm waiting for our legal department to approve the outgoing source before I upload. It's a couple of dozen lines or so, should be pretty coherent, but I agree with doing an RFC to _at least_ decide what config names we support going forward).</p>",
        "id": 239264395,
        "sender_full_name": "J. R. Pascucci",
        "timestamp": 1621348639
    },
    {
        "content": "<p>I guess my current gut reaction comparing what I wrote to reading the threads is that a limited and forward-compatible change is to add a configuration in credentials which has a list of header attributes (or use something like a template that can be filled in with a credential). That solves this problem without blocking the way forward for other, more desirable, solutions.</p>",
        "id": 239265314,
        "sender_full_name": "J. R. Pascucci",
        "timestamp": 1621348925
    },
    {
        "content": "<blockquote>\n<p>From that conversation. The existence of a registry can be private. The protocol we come up with must allow config.json to return 401, if authentication is missing.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"120179\">@Eh2406</span> Thanks for starting the discussions on your side (and apologies for the delay in getting back to you).  After talking with the folks here as well, we also agree the existence of the registry needs to be private. So we cannot use config.json. The RFC I wrote up does allow that (since the configuration is all local). Also agree that we should limit it to HTTPS only and avoid authentication on redirects. I can add that to the RFC.</p>\n<p><span class=\"user-mention\" data-user-id=\"413254\">@J. R. Pascucci</span>  Do you think we need more than the <code>Authorization: </code> header? The \"token\" is just the value of the Authorization header, and would support Bearer, Basic, or other authorization kinds.</p>\n<p>I also have a simple change to Cargo that implements most of the RFC on top of the prototype http-index work by kornelski. I can share that if it would be helpful.</p>",
        "id": 239459811,
        "sender_full_name": "Arlo Siemsen",
        "timestamp": 1621443423
    },
    {
        "content": "<p>For my purposes, answering that exact question: no. Except to say that it _does_ need to be triggerable/overridable via config or credentials file for my use case, instead of triggerable from the repo api itself (if that was in your proposal, I don't remember who wrote what). IMO, the more configurable (with reasonable defaults) the better. </p>\n<p>For instance, there is a jfrog-api-token mechanism that other people might want to use, and the moral equivalent on other sorts of platforms, and for future-proofing for better creds, since we can just get arbitrary data via the credential-process now.</p>\n<p>Among my concerns are </p>\n<ul>\n<li>In these parts of it, cargo has gotten into a situation where you can only override like half of half of the potential behaviors, and the other half are kind of hard coded, leading to divergent behavior like this, between registry api and download.</li>\n<li>I was trying to figure out how to make the necessary changes even more useful for the work put into it: the other thought I had was doing some kind of templated thing instead of hard-coded header handling, where you could put multiple \"kinds\" of credentials from the credential-process or creds file for different operations, but that feels a bit like overkill, although it fixes the problem now and is flexible enough in the future.</li>\n<li>\n<ul>\n<li>This is security-theoretically better, IMO, since most mechanisms have methods to log user of a particular kind of credential request, so if I have an automated CI script that usually does reads, but suddenly it starts asking for publish, that might be a security triggering item.</li>\n</ul>\n</li>\n<li>\n<p>I think there's some duplicate code and missing architectural glue - since you can override some behavior and not others, if you're going to suport private repositories, you need to do it in a way that puts the default on equal footing as the alternates, leading to a object heirarchy of alternate registries (again, overkill, but that's the sense of where it could go with more coherent refactoring)<br>\nThat missing glue is, I suggest, the source of why it's got this sort of blindspot of dealing with 'download' separately from the indices today - if everything all consistent, it would be fine, but they aren't, and this, IMO, was a big, gaping hole in functionality.</p>\n</li>\n</ul>",
        "id": 239464603,
        "sender_full_name": "J. R. Pascucci",
        "timestamp": 1621445283
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"413254\">J. R. Pascucci</span> <a href=\"#narrow/stream/246057-t-cargo/topic/registry.20authentication/near/239464603\">said</a>:</p>\n<blockquote>\n<p>if that was in your proposal, I don't remember who wrote what.</p>\n</blockquote>\n<p>Yes, my proposal is to configure via local cargo config. You can see a link to the pre-RFC at the top of the thread.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"413254\">J. R. Pascucci</span> <a href=\"#narrow/stream/246057-t-cargo/topic/registry.20authentication/near/239464603\">said</a>:</p>\n<blockquote>\n<p>That missing glue is, I suggest, the source of why it's got this sort of blindspot of dealing with 'download' separately from the indices today - if everything all consistent, it would be fine, but they aren't, and this, IMO, was a big, gaping hole in functionality.</p>\n</blockquote>\n<p>I think the main reason we have the inconstancy is because we're using <code>git</code> for the indicies. Using HTTP for everything (via the sparse index RFC) will help resolve this.</p>",
        "id": 240504605,
        "sender_full_name": "Arlo Siemsen",
        "timestamp": 1622137292
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120179\">@Eh2406</span> I added a section to the pre-RFC about redirects and <code>https</code>. Do you have any other concerns?</p>\n<p><a href=\"https://github.com/arlosi/rfcs/blob/always-auth/text/0000-always-auth.md\">https://github.com/arlosi/rfcs/blob/always-auth/text/0000-always-auth.md</a></p>",
        "id": 240505642,
        "sender_full_name": "Arlo Siemsen",
        "timestamp": 1622137732
    },
    {
        "content": "<p>I don't see the update. But I do not have anything that should block you moving on to a bigger discussion. Like a Pre-Rfc post on internals.<br>\nI think in the cores of time there <em>will</em> be requests for finer grained controls. So if things are going to grow into being a wall of settings, then I want them to live in <code>config.toml</code>. The one thing that can't live in there is how to get the <code>config.toml</code>. I personally like the auto discovery variation. But someone is going to want to have a setting to skip the round trip, so putting that in <code>[registries]</code> makes sense.<br>\nI will be continuing to have conversations with security experts about this, but having something public to point at will be helpful. Thank you.</p>",
        "id": 240511161,
        "sender_full_name": "Eh2406",
        "timestamp": 1622140355
    },
    {
        "content": "<p>Sounds good. I'll move to a pre-rfc post later today.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"120179\">Eh2406</span> <a href=\"#narrow/stream/246057-t-cargo/topic/registry.20authentication/near/240511161\">said</a>:</p>\n<blockquote>\n<p>I personally like the auto discovery variation. But someone is going to want to have a setting to skip the round trip, so putting that in <code>[registries]</code> makes sense.</p>\n</blockquote>\n<p>We could do something in <code>[registries]</code> like <code>auth=publish|auto|always</code>, where <code>publish</code> would work how cargo does today (only send the token for publish/yank), <code>auto</code> would first attempt to fetch <code>config.json</code> without the token, then attempt with the token if it gets HTTP 401, or <code>always</code> which would always send the token. The default would be <code>auto</code>. <br>\nThe built-in config for <a href=\"http://crates.io\">crates.io</a> could be configured to <code>never</code> to address <span class=\"user-mention\" data-user-id=\"121055\">@Pietro Albini</span>  concern about preventing the token from being sent to <a href=\"http://crates.io\">crates.io</a></p>",
        "id": 240516223,
        "sender_full_name": "Arlo Siemsen",
        "timestamp": 1622142539
    },
    {
        "content": "<blockquote>\n<p>I think in the cores of time there will be requests for finer grained controls.</p>\n</blockquote>\n<p>For example Git based protocols will want to be able to demand the auth for downloads. (<span class=\"user-mention\" data-user-id=\"413254\">@J. R. Pascucci</span> that is what you want yes?) And there is no reason for that to live in <code>[registries]</code> where a user could get it wrong. So that should be a setting in <code>config.json</code>. IMO</p>",
        "id": 240518056,
        "sender_full_name": "Eh2406",
        "timestamp": 1622143342
    },
    {
        "content": "<p>I created an internals topic: <a href=\"https://internals.rust-lang.org/t/pre-rfc-cargo-alternative-registry-authentication/14794\">https://internals.rust-lang.org/t/pre-rfc-cargo-alternative-registry-authentication/14794</a></p>",
        "id": 240631787,
        "sender_full_name": "Arlo Siemsen",
        "timestamp": 1622221033
    },
    {
        "content": "<p>Thanks for posting the RFC! I will try to get some workmates to take a look at it!</p>",
        "id": 242795722,
        "sender_full_name": "Eh2406",
        "timestamp": 1623789354
    },
    {
        "content": "<p>Thanks! For anyone else coming here looking for the RFC PR: <a href=\"https://github.com/rust-lang/rfcs/pull/3139\">https://github.com/rust-lang/rfcs/pull/3139</a></p>",
        "id": 242941996,
        "sender_full_name": "Arlo Siemsen",
        "timestamp": 1623876940
    }
]