[
    {
        "content": "<p>Hey folks, I was hoping I'd be able to get a semantic hash of a Cargo project, at least one that encompasses the Rust dependencies. Originally I thought hashing the contents of <code>Cargo.lock</code> would be sufficient, but it looks like if we use path dependencies, changing the contents of said path dependency would not influence the hash of the <code>Cargo.lock</code> - is there an easy way I can get some hash of a Cargo Rust project that would identify the source tree of the project as well as all its dependencies?</p>",
        "id": 210683861,
        "sender_full_name": "Adelbert",
        "timestamp": 1600633816
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"344504\">@Adelbert</span> Cargo itself definitely has that information. You're effectively looking for a hash that changes whenever Cargo would choose to rebuild?</p>",
        "id": 210689620,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1600642852
    },
    {
        "content": "<p>ah yes! i did not actually think about it that way but yeah, since Cargo can detect when there is a chance in the path dependency as well</p>",
        "id": 210690134,
        "sender_full_name": "Adelbert",
        "timestamp": 1600643738
    },
    {
        "content": "<p>i think the tricky bit here is if Cargo itself exposes a library. I found <code>cargo-toml</code> but that seems to just be about parsing</p>",
        "id": 210690316,
        "sender_full_name": "Adelbert",
        "timestamp": 1600644111
    },
    {
        "content": "<p>Though there is also the additional requirement that I want to compute a hash that would be unique to the state that Cargo is using to determine if it needs to rebuild</p>",
        "id": 210690396,
        "sender_full_name": "Adelbert",
        "timestamp": 1600644219
    },
    {
        "content": "<p>Cargo uses timestamps to detect source file changes, not hashes. <a href=\"https://github.com/rust-lang/rust/issues/75594\">rust-lang/rust#75594</a> and <a href=\"https://github.com/rust-lang/cargo/issues/8623\">rust-lang/cargo#8623</a> will make it possible to use a hash for source files. For now you can look at the dep-info files (<code>.d</code>) and hash all mentioned files.</p>",
        "id": 210714519,
        "sender_full_name": "bjorn3",
        "timestamp": 1600678043
    }
]