[
    {
        "content": "<p>Should we reject most <a href=\"https://github.com/rust-lang/cargo/issues?q=is%3Aissue+is%3Aopen+api+label%3AA-cargo-api\">cargo-api issues</a></p>\n<p>We've talked before about how the intended API is the cargo command, rather than the crate.  I can see keeping some issues open around splitting out crates (blocked on nested workspaces) since there are some gray areas but I feel like we could just reject issues around exposing functionality and the ease of use.</p>",
        "id": 277172456,
        "sender_full_name": "Ed Page",
        "timestamp": 1648658447
    },
    {
        "content": "<p>I do kind of worry about the whole \"the command is the API\" stance, since having to shell out left right and center can get pretty expensive, especially on platforms where exec'ing is costly. And even when it isn't, all those extra re-parses of Rustup and Cargo configuration do add up. Not that I have a better suggestion, just wanted to register the concern.</p>",
        "id": 277174925,
        "sender_full_name": "Jon Gjengset",
        "timestamp": 1648659363
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120054\">@Jon Gjengset</span> That's valid, and I don't think anyone is saying we don't <em>want</em> an API, just that we don't have time to maintain one.</p>",
        "id": 277183641,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1648663212
    },
    {
        "content": "<p>I think it'd be appropriate to make sure they're labeled appropriately (so that they can get reconsidered later) and close them.</p>",
        "id": 277183737,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1648663243
    },
    {
        "content": "<p>Yea, I agree with Josh here.  In many cases, a user's experience will be much better if tools use the CLI. It handles rustup, avoids build issues, avoids the treadmill of updates, etc.  But that doesn't mean we will <em>prevent</em> people from using the library. It will continue to be published for the foreseeable future.</p>\n<p>As for the specific issues that are currently tagged, most of them seem worthy to keep open.  I'd maybe close a few of them, though.</p>",
        "id": 277202441,
        "sender_full_name": "Eric Huss",
        "timestamp": 1648673514
    },
    {
        "content": "<p>FWIW, the stance rustdoc has had for forever is \"if you want to use rustdoc as an API, fork the crate or use --output-format json\"</p>",
        "id": 277206442,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1648675777
    },
    {
        "content": "<p>to the extent that the only public function is <code>main()</code> (plus a couple things called by <code>error-index-generator</code>)</p>",
        "id": 277206510,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1648675805
    },
    {
        "content": "<p>I'd also say that if the CLI is the only API that means there is pressure to make the CLI do everything that people might want out of an API, which is probably not good for the CLI's UX for other users. I think having a high quality data dump (like Rustdoc's json) is a good idea in general, but this has not worked out very well in the past, and also takes time to maintain.</p>",
        "id": 277695089,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1649059438
    },
    {
        "content": "<p>Having an API also often leads to better modularity of design. In combination with making Cargo more modular by factoring out crates, it seems like a public API would almost happen 'for free' (though of course, the stability contract means there is more maintenance burden).</p>",
        "id": 277695247,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1649059534
    }
]