[
    {
        "content": "<p>Hey all! I wanted to quickly check in on the topic of non-master default branches. I know that in <a href=\"https://github.com/rust-lang/cargo/pull/8364\">https://github.com/rust-lang/cargo/pull/8364</a> y'all added support for this, but then there were some other issues after that (I think?). Do folks have a general idea about the current user story around (a) maintainers renaming branches and (b) crate users when the crate renames branches? AIUI this only affects git deps. It would also be nice to write this up and publish it somehow so community members can benefit from it.</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"120518\">@Eric Huss</span> <span class=\"user-mention\" data-user-id=\"116015\">@Alex Crichton</span></p>",
        "id": 235240421,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1618862778
    },
    {
        "content": "<p>this change was enabled in <a href=\"https://github.com/rust-lang/cargo/pull/9133\">https://github.com/rust-lang/cargo/pull/9133</a> and is currently in beta I believe,  so it should all ride to stable soon.</p>\n<p>I haven't investigated GitHub's branch renaming feature so I don't know how that affects things here. Otherwise once this support hits stable then users can change their default branch and git dependencies which don't reference any branch will automatically use the new branch name. And yeah this only affects git deps</p>",
        "id": 235241280,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1618863122
    },
    {
        "content": "<p>The change will be noted in the main release notes (<a href=\"https://github.com/rust-lang/rust/issues/84183\">#84183</a>) and we can suggest that it be included in the blog post (not sure who is writing it this time).</p>",
        "id": 235241686,
        "sender_full_name": "Eric Huss",
        "timestamp": 1618863274
    },
    {
        "content": "<p>Good call, thanks! Yeah it would be amazing to include a blurb of</p>\n<ul>\n<li>How does this affect me if I'm a maintainer and want to change my branch? \"You can change your branch if you'd like and it should all Just Work, except for consumers who have the master branch explicitly noted as git deps\"</li>\n<li>How does this affect me if I'm a library user? \"Things will continue to work, just keep an eye out for any deps specified with <code>{git = ..., branch = master}</code>, in case someone renames them.</li>\n</ul>",
        "id": 235247218,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1618865793
    },
    {
        "content": "<p>in the main blog post</p>",
        "id": 235247230,
        "sender_full_name": "Manish Goregaokar",
        "timestamp": 1618865797
    },
    {
        "content": "<p>Hey! I'm writing the post this cycle, and I've made a note to include this information- thanks!</p>",
        "id": 235255358,
        "sender_full_name": "simulacrum",
        "timestamp": 1618868969
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> I think there'd also be value in linking to <a href=\"https://github.com/github/renaming\">https://github.com/github/renaming</a> in those notes, to help people know how to rename their branches.</p>",
        "id": 235287739,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1618894795
    },
    {
        "content": "<p>And it might also be useful to link to an explanation of why we're doing this, such as the one on <a href=\"https://inclusivenaming.org/\">https://inclusivenaming.org/</a> , but I don't know if Rust wants to link there without also being a member.</p>",
        "id": 235287864,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1618894842
    },
    {
        "content": "<p>As a note, we decided in today's Cargo meeting to revert this changing of defaults on the current beta branch in <a href=\"https://github.com/rust-lang/cargo/pull/9383\">https://github.com/rust-lang/cargo/pull/9383</a>. This is due to some of the breakage listed there and giving me some more time to investigate it.</p>",
        "id": 235409409,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1618950503
    },
    {
        "content": "<p>This means that Rust 1.53 will be the first with the new branch defaults</p>",
        "id": 235409433,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1618950516
    },
    {
        "content": "<p>Thanks for the update!</p>",
        "id": 235409459,
        "sender_full_name": "simulacrum",
        "timestamp": 1618950528
    }
]