[
    {
        "content": "<p><a href=\"https://github.com/rust-lang/cargo/issues/8582\">https://github.com/rust-lang/cargo/issues/8582</a> is about support glob pattern for args such as <code>--pacakge</code> and <code>--exclude</code>. I have already done a minimal proof-of-concept (also commented in that issue) and want to know if this feature is acceptable. In addition, I want to expand this feature a bit further. Could it be possible and worthy to support <code>CompileFilter</code> level glob patterns? That will make things like <code>cargo test --test \"some-test-*\"</code> become possible. I am happy to discuss and help.</p>",
        "id": 210022468,
        "sender_full_name": "Weihang Lo",
        "timestamp": 1600097625
    },
    {
        "content": "<p>It does seem useful. There's a little more discussion about using globs for target filters in <a href=\"https://github.com/rust-lang/cargo/issues/6454\">https://github.com/rust-lang/cargo/issues/6454</a>. Some people want a way to run \"integration tests but not unit tests\" (though I'm not sure why), and something like <code>--tests=*</code> would address that. </p>\n<p>But I'm a little concerned about the problems with shell quoting using <code>*</code>.  Offhand I don't have any alternate suggestions, though.  Maybe just mentioning that in the documentation would be enough?</p>",
        "id": 210040820,
        "sender_full_name": "Eric Huss",
        "timestamp": 1600106211
    },
    {
        "content": "<p>That's right. IIRC the only way to disable shell expansion is to turn off it in the shell settings. I guess we need to emphasize this behavior in the documentation.<br>\nFor implementations, I am plan to implement a version that support workspace package filter first, and then do the target filters part. Shall these two parts  be done in the same period or release?</p>",
        "id": 210151586,
        "sender_full_name": "Weihang Lo",
        "timestamp": 1600186600
    },
    {
        "content": "<p>I've just created a pull request for this feature <a href=\"https://github.com/rust-lang/cargo/pull/8752\">https://github.com/rust-lang/cargo/pull/8752</a>. Hope this would help.</p>",
        "id": 212232299,
        "sender_full_name": "Weihang Lo",
        "timestamp": 1601832554
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120518\">@Eric Huss</span> In case you miss it, I’ve updated the PR based on the discussion. You can review it at your own pace 😄</p>",
        "id": 213300490,
        "sender_full_name": "Weihang Lo",
        "timestamp": 1602687170
    }
]