[
    {
        "content": "<p>I just wanted to post about this in relation to <a href=\"#narrow/stream/213817-t-lang/topic/asm!.20and.20backends\">#**t-lang**: asm! and backends</a>. <br>\nThat came on such short notice because I actually missed the original FCP (I believe it happened early-mid december, and I had exams at the time, so I didn't have time to check the lists from triage agendas for any ones I might want to raise issues on at the time). </p>\n<p>I was wondering if there was a way that \"generally interested parties\" including myself and possibly other implementors (but not necessarily exclusively) could recieve notifications whenever a T-lang FCP or proposed FCP starts, especially one with a disposition to stabilze (though disposition-merge would be helpful as well) or otherwise \"immutable\" statuses, which might help to avoid similar issues in the future.</p>",
        "id": 271825994,
        "sender_full_name": "Connor Horman",
        "timestamp": 1644845599
    },
    {
        "content": "<p>They should all be listed in This week in rust, at least</p>",
        "id": 271828092,
        "sender_full_name": "simulacrum",
        "timestamp": 1644846681
    },
    {
        "content": "<p>That may be easier, but I'm thinking more of when I don't have time to seek out the list (such as during exam season).<br>\n<del>Makes it easier to complain when I otherwise have no time to do so.</del></p>",
        "id": 271834197,
        "sender_full_name": "Connor Horman",
        "timestamp": 1644849457
    },
    {
        "content": "<p>maybe rfcbot could have a \"rfcbot stakeholder\" command that lets someone say they're invested in a particular proposal?</p>",
        "id": 271875584,
        "sender_full_name": "pnkfelix",
        "timestamp": 1644866627
    },
    {
        "content": "<p>i.e. a fine-grained opt-in to specific topics?</p>",
        "id": 271875660,
        "sender_full_name": "pnkfelix",
        "timestamp": 1644866647
    },
    {
        "content": "<p>Perhaps. That would be useful here if there were also broad opt-ins, so someone could say \"I'd like to be considered a stakeholder in any T-lang proposal\"</p>",
        "id": 271875791,
        "sender_full_name": "Connor Horman",
        "timestamp": 1644866714
    },
    {
        "content": "<p>Sounds like a lot of noise on threads -- but I could easily imagine triagebot having support for sending a PM to users on Zulip in some kind of ad-hoc subscription system, once we migrate to that</p>",
        "id": 271875856,
        "sender_full_name": "simulacrum",
        "timestamp": 1644866738
    },
    {
        "content": "<p>It could probably do it all in one message per significant stage (IE. one message on the RFC, one message on the tracking issue, one message on the stabilization PR, etc.). Being mentioned would subscribe that person to the thread until they chose to unsubscribe.</p>",
        "id": 271876461,
        "sender_full_name": "Connor Horman",
        "timestamp": 1644866985
    },
    {
        "content": "<p>Like, when an RFC opens (or PFCPs - and this could be included in the \"Member xyz has proposed to merge this\"), or when a tracking issue opens, or when a stabilization PR is filed, rfcbot or whichever shows up with a message like </p>\n<blockquote>\n<p>Mentioning Stakeholders: a b c ... x y z</p>\n</blockquote>\n<p>There's probably also a way to hide that message without disrupting the mentions, to avoid the list getting too long.</p>",
        "id": 271877217,
        "sender_full_name": "Connor Horman",
        "timestamp": 1644867300
    },
    {
        "content": "<p>GitHub has a limit on 50 mentions per comment, though it's probably a ways off from hitting it</p>",
        "id": 271877622,
        "sender_full_name": "simulacrum",
        "timestamp": 1644867453
    },
    {
        "content": "<p>But yeah, something like that is in theory possible.</p>",
        "id": 271877649,
        "sender_full_name": "simulacrum",
        "timestamp": 1644867466
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116122\">simulacrum</span> <a href=\"#narrow/stream/196563-t-lang.2Fmeta/topic/Pings.20on.20T-lang.20FCPs.2FPFCPs/near/271877622\">said</a>:</p>\n<blockquote>\n<p>GitHub has a limit on 50 mentions per comment, though it's probably a ways off from hitting it</p>\n</blockquote>\n<p>Hmmm... A potential problem (although I don't see this being a practical issue - I would assume  the majority of blanket \"any proposals\" stakeholders would be implementors, and as much as I'd love to see it, I doubt there will be anywhere near that many implementations of rust)</p>",
        "id": 271878319,
        "sender_full_name": "Connor Horman",
        "timestamp": 1644867738
    },
    {
        "content": "<p>I definitely recommend TWiR for this.  The FCP is 10 days to give time for things to be found -- including by weekly stuff like TWiR.</p>\n<p>You can also find them on <a href=\"https://rfcbot.rs/\">https://rfcbot.rs/</a></p>\n<p>That said, now that we have bots talking to zulip (like the MCP one), it might be nice to have a bot-posts-only stream (or maybe one per team) for p-FCPs, FCP starts, and FCP completes.</p>",
        "id": 271885970,
        "sender_full_name": "scottmcm",
        "timestamp": 1644871657
    },
    {
        "content": "<p>Yeah, this is why I said that once it's in triagebot it's easy for the bot to post here - I'd rather not duplicate and/or extract the zulip code from triagebot</p>",
        "id": 271895134,
        "sender_full_name": "simulacrum",
        "timestamp": 1644875847
    },
    {
        "content": "<p>You could subscribe to GitHub issues for the repo, then filter the mails.</p>",
        "id": 271908204,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1644883743
    }
]