[
    {
        "content": "<p>Hi. I wrote a blog post about why I think <code>dealloc</code> has a flawed API (specifically taking a <code>Layout</code> argument). <code>AllocRef</code> inherits the same flaws, too. <a href=\"https://shift.click/blog/on-dealloc/\">https://shift.click/blog/on-dealloc/</a></p>\n<p>The summary of my argument is that: The prior <code>Layout</code> is rarely needed for dealloc/realloc in the underlying allocators, and is easily shimmed when it is. Requiring the layout complicates unsafe code, and introduces a completely new source of undefined behavior (IMO any time that happens it really needs to justify itself, rather than the inverse). It also prevents certain things that rust code might reasonably want to do.</p>\n<p>That said, I know I've probably missed the boat here. I did look around though, and was not really able to find discussions on it at all (I probably would not have shared this post if I were able to).  It pretty clearly a design wart to me, and always makes me sweat when I'm unable to use identical code for computing layouts in alloc &amp; dealloc. That said, I can also tell there's been a lot of work spent formally defining what this parameter means (in terms of \"fit\"ting), and people get attached to things that get that kind of attention... So yeah IDK. Anyway, better shared than not probably.</p>",
        "id": 200554081,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1591886853
    },
    {
        "content": "<p>I agree that passing the Layout to dealloc is probably a poor design.</p>",
        "id": 200567484,
        "sender_full_name": "Lokathor",
        "timestamp": 1591892339
    },
    {
        "content": "<p>from the RFC: <a href=\"https://github.com/pnkfelix/rfcs/blob/kind-allocator-api/text/0000-kinds-of-allocators.md#why-not-just-freeptr-for-deallocation\">https://github.com/pnkfelix/rfcs/blob/kind-allocator-api/text/0000-kinds-of-allocators.md#why-not-just-freeptr-for-deallocation</a></p>",
        "id": 200583016,
        "sender_full_name": "pnkfelix",
        "timestamp": 1591898715
    },
    {
        "content": "<p>basically (from my point of view): jemalloc provided a dealloc method that took the layout info, and that avoided a tiny bit of overhead</p>",
        "id": 200583211,
        "sender_full_name": "pnkfelix",
        "timestamp": 1591898787
    },
    {
        "content": "<p>Please go ahead and demonstrate how to make <code>dealloc</code> in the global allocator on Windows work without the <code>Layout</code> parameter.</p>",
        "id": 200589646,
        "sender_full_name": "Peter Rabbit",
        "timestamp": 1591901777
    },
    {
        "content": "<p><a href=\"https://github.com/rust-lang/rust/blob/50c0192c64241d723066add22c53d472e2b9cba9/src/libstd/sys/windows/alloc.rs#L41-L51\">https://github.com/rust-lang/rust/blob/50c0192c64241d723066add22c53d472e2b9cba9/src/libstd/sys/windows/alloc.rs#L41-L51</a></p>",
        "id": 200589727,
        "sender_full_name": "Peter Rabbit",
        "timestamp": 1591901824
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"125267\">@Peter Rabbit</span> does the approach i listed at the bottom there not work?</p>",
        "id": 200589729,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1591901825
    },
    {
        "content": "<p>it should</p>",
        "id": 200589755,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1591901836
    },
    {
        "content": "<p>That does have the unfortunate consequence of making all allocations using that system bigger, and your code as written also does not work when the alignment is higher than the size of <code>AllocInfo</code>.</p>",
        "id": 200589989,
        "sender_full_name": "Peter Rabbit",
        "timestamp": 1591901974
    },
    {
        "content": "<p><code>let result_ptr = orig_ptr.add(offset);</code> does not preserve the alignment requirements of the allocation.</p>",
        "id": 200590708,
        "sender_full_name": "Peter Rabbit",
        "timestamp": 1591902330
    },
    {
        "content": "<p>Basically the rationale is that in 99% of cases (Box and Vec) the language already knows what the allocation size is, so it is redundant to have the allocator keep track of it too.</p>",
        "id": 200597727,
        "sender_full_name": "Amanieu",
        "timestamp": 1591905511
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"125267\">@Peter Rabbit</span> the alignment being correct is the point of <code>Layout::extend</code>, which I use: <a href=\"https://doc.rust-lang.org/nightly/std/alloc/struct.Layout.html#method.extend\">https://doc.rust-lang.org/nightly/std/alloc/struct.Layout.html#method.extend</a></p>",
        "id": 200604760,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1591908886
    },
    {
        "content": "<p><code>Layout::extend</code> is the correct way to grow a layout, but it introduces several runtime checks and should be avoided when possible. As already mentioned in most cases the size is known at compile time but the compiler isn't necessarily able to optimize out <code>extend</code>. Also this slows down compile times and always require more space to be allocated than needed. Especially as aligned extending requires additional space to fulfill all alignments (size (usize), align(usize), data)</p>",
        "id": 200605539,
        "sender_full_name": "Tim Diekmann",
        "timestamp": 1591909290
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"209168\">Thom Chiovoloni</span> <a href=\"#narrow/stream/197181-t-libs.2Fwg-allocators/topic/dealloc.20and.20layout/near/200604760\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"125267\">Peter Rabbit</span> the alignment being correct is the point of <code>Layout::extend</code>, which I use: <a href=\"https://doc.rust-lang.org/nightly/std/alloc/struct.Layout.html#method.extend\">https://doc.rust-lang.org/nightly/std/alloc/struct.Layout.html#method.extend</a></p>\n</blockquote>\n<p>Ah I see. In that case what it is doing is similar to what the Windows system allocator already does for overaligned allocations. So your proposed method <em>does</em> work when you specifically want an allocator that lets you forget what layout you used originally. It's just a bad idea to use as a global allocator due to the extra space overhead incurred on every single allocation, given that 99.9% of the time the layout information is encoded in the type system and trivially recomputed at drop time.</p>",
        "id": 200605916,
        "sender_full_name": "Peter Rabbit",
        "timestamp": 1591909455
    },
    {
        "content": "<p>Sure, an API only taking a pointer on <code>dealloc</code> is more simple, but inefficient. As allocators is a very low level API, I'm strongly against removing <code>Layout</code> from <code>dealloc</code></p>",
        "id": 200605967,
        "sender_full_name": "Tim Diekmann",
        "timestamp": 1591909492
    },
    {
        "content": "<p>It's inefficient for the allocators that don't already store it. A lot of them do, (most IME). From a performance standpoint, the current API prevents code from being able take advantage of optimizations that are possible by not having to provide the exact layout -- for example, being able to reuse an allocation rather than perform a dealloc and alloc pair.</p>",
        "id": 200607036,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1591910000
    },
    {
        "content": "<p>It like the only real benefit is slightly improved performance with a few allocators (yes, including the system allocator on windows, but IIRC this has other reasons that users who care about allocation perf are likely to want to switch in practice). That doesn't feel like enough to justify it.</p>",
        "id": 200607445,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1591910203
    },
    {
        "content": "<p>But, that said I didn't really expect to convince anybody here. I don't really enjoy arguing (which is why I don't participate much in lang design), but felt I should make my point.</p>",
        "id": 200607537,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1591910248
    },
    {
        "content": "<p>What if we added an API to allocators which embedded the layout in allocations specifically for use cases where the layout can't be tracked, but it would be specialized for allocators that don't <em>need</em> the layout on drop to not store extra data. That way it would not affect the 99.9% use case, and when it was used it would be efficient on allocators that support layout free dealloc.</p>",
        "id": 200610420,
        "sender_full_name": "Peter Rabbit",
        "timestamp": 1591911613
    },
    {
        "content": "<p>How such an API would look like without some compiler magic?</p>",
        "id": 200612622,
        "sender_full_name": "Tim Diekmann",
        "timestamp": 1591912833
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209168\">@Thom Chiovoloni</span> Thank you for writing this up, though!</p>",
        "id": 200612776,
        "sender_full_name": "Tim Diekmann",
        "timestamp": 1591912918
    },
    {
        "content": "<p>I think a new method could be added with a default implementation that would actually allocate space for Layout+the actual request, but different allocator implementations could override it to not have to do that, like how <code>GlobalAlloc::realloc</code> is provided but most allocators override it.  (And similarly a method could exist that would read through the pointer to get the layout by default and then deallocate that, with that overridden for the malloc/free-allocator.)</p>\n<p>It's certainly true that most existing allocators store the size, but I assume that's largely due to them wanting to work with C.  From the peanut gallery, I'd definitely like Rust to be able to provide a platform to potentially make ones that are faster by not having to look up the size.</p>",
        "id": 202384501,
        "sender_full_name": "scottmcm",
        "timestamp": 1593477566
    },
    {
        "content": "<p>I don't really think it's actually potentially faster to not store the size. It might be (very) slightly more memory efficient, but in practice I think you'll always have to store a size in most allocators, since you often want to have extra space available for some realloc requests. That is, the size you return might not be the size that was asked for. The <code>MemoryBlock</code> API even reflects this fact.</p>",
        "id": 202461026,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1593534638
    },
    {
        "content": "<p>For the Windows heap allocator it has nothing to do with not storing the size. In fact Windows stores the precise size down to the byte and will tell you if you ask. Rather the issue is it can't do allocations with an alignment greater than the default alignment. The only way to make that compatible with not needing the layout at free time is to overallocate <em>all</em> allocations to have space for the header that stores the actual pointer to free.</p>",
        "id": 202492859,
        "sender_full_name": "Peter Rabbit",
        "timestamp": 1593550169
    },
    {
        "content": "<p>That's exactly why I didn't mention the alignment. I was responding to the comment that \"I'd definitely like Rust to be able to provide a platform to potentially make ones that are faster by not having to look up the size.\"</p>",
        "id": 202501456,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1593554924
    },
    {
        "content": "<p>I'd probably argue that the fact jemalloc offers <code>sdallocx</code> is a good argument for there being benefit in passing the size</p>",
        "id": 202821389,
        "sender_full_name": "Christopher Durham",
        "timestamp": 1593794492
    },
    {
        "content": "<p>That's a real-world example of an allocator allowing (but not requiring) giving the allocation size on deallocation</p>",
        "id": 202821511,
        "sender_full_name": "Christopher Durham",
        "timestamp": 1593794606
    },
    {
        "content": "<p>Maybe the \"only\" benefit in general is less allocated size, but when that's for every single allocation, that has a significant impact on performance due to cache locality, memory pressure, and related factors</p>",
        "id": 202821588,
        "sender_full_name": "Christopher Durham",
        "timestamp": 1593794667
    }
]