[
    {
        "content": "<p>Hello, while trying to use ra_hir, I found that many types returned from public methods are not exported publicly.<br>\nFor example, an enum <code>ra_hir::expr::Expr</code> which can be obtained from e.g. <code>function.body(db).exprs()</code> but can't be named from outside and thus can't be <code>match</code>ed. Is this restriction intended? I don't have an idea of the difference of what is exported vs what is not.</p>",
        "id": 160775033,
        "sender_full_name": "pcpthm",
        "timestamp": 1552566779
    },
    {
        "content": "<p>It's just that we haven't thought about HIR API a lot.</p>",
        "id": 160775198,
        "sender_full_name": "matklad",
        "timestamp": 1552566940
    },
    {
        "content": "<p>Currently, the only client of HIR is <code>ra_ide_api</code>, so hir <em>tries</em> to provide a nice API (see code_model_api), but this is done on best effort basis.</p>",
        "id": 160775281,
        "sender_full_name": "matklad",
        "timestamp": 1552567002
    },
    {
        "content": "<p>I think, long term, hir will become the \"systems boundary\" between \"compiler guts\" and \"tools\", but that's not yet the case. Really, we should maybe try to split hir into separate crates soon...</p>",
        "id": 160775406,
        "sender_full_name": "matklad",
        "timestamp": 1552567096
    },
    {
        "content": "<p>So, if something is missing, feel free to add it!</p>",
        "id": 160775461,
        "sender_full_name": "matklad",
        "timestamp": 1552567140
    },
    {
        "content": "<p>So only <code>code_model_api</code> module is what meant to be exposed?</p>",
        "id": 160775591,
        "sender_full_name": "pcpthm",
        "timestamp": 1552567234
    },
    {
        "content": "<p>roughtly, yeah. Currently, code_model exports only top-level items, it doesn't export item bodies, but that's oversight. It would be cool to figure out the nice API for things like expressions. The current <code>hir::Expr</code> is a representation convenient for implementation, I am not sure it's a good API as well</p>",
        "id": 160775907,
        "sender_full_name": "matklad",
        "timestamp": 1552567476
    },
    {
        "content": "<p>For example, I think for the public API we might want to bundle <code>hir::Expr</code> and the corresponding function together, so that you don't have to do deal with <code>Body</code> maps at all, and instead can just call methods on expr</p>",
        "id": 160775969,
        "sender_full_name": "matklad",
        "timestamp": 1552567543
    },
    {
        "content": "<p>Or perhaps the body approach is good, but should be made more general</p>",
        "id": 160776037,
        "sender_full_name": "matklad",
        "timestamp": 1552567578
    },
    {
        "content": "<p>I understand. Thank you! I'm not sure about API either. Probably I can do some thinking.</p>",
        "id": 160776078,
        "sender_full_name": "pcpthm",
        "timestamp": 1552567619
    },
    {
        "content": "<p>I mean, currently you need to ask resolver specifically for funciton bodies (or for generics). I think this can be abstracted away.</p>",
        "id": 160776082,
        "sender_full_name": "matklad",
        "timestamp": 1552567622
    }
]