[
    {
        "content": "<p>I just realized a big mistake I made when rewriting the algo::diff function. The generated diff is now all over the place when something has been inserted or deleted due to those changes offsetting the nodes. As in an insert in a node causes all nodes beyond that point(including the inserted node) to be marked as replacements so diffing is anything but minimal now. I just realized that while trying to integrate my recent changes into the auto import cursor fix branch because the cursor now jumps even further instead of not jumping at all.</p>",
        "id": 214446649,
        "sender_full_name": "Lukas Wirth",
        "timestamp": 1603569889
    },
    {
        "content": "<p>One solution I could think of is to check if the current node we are looking at is at the same position in the other tree or a next_sibling of the node at that position which would allow to do proper judgement about whether this was an insertion or not but this feels like causing runtime complexity to skyrocket I think?</p>",
        "id": 214446753,
        "sender_full_name": "Lukas Wirth",
        "timestamp": 1603569994
    },
    {
        "content": "<p>I wouldn't worry too much about runtime complexity</p>",
        "id": 214558914,
        "sender_full_name": "matklad",
        "timestamp": 1603709622
    },
    {
        "content": "<p>Stuff is mostly small, etc.</p>",
        "id": 214558921,
        "sender_full_name": "matklad",
        "timestamp": 1603709629
    },
    {
        "content": "<p>I would worry a lot about implementation complexity -- diff-ing is not the prettiest code there is, and it's already a lot of it. It's not inconceivable that there's some order-of-magnitude better way to handle this :-) The current diffing was explicitly written as the simplest thing I can come up with in n minutes, I wish we used something more principled.</p>",
        "id": 214559065,
        "sender_full_name": "matklad",
        "timestamp": 1603709728
    },
    {
        "content": "<p>I see, I did look around a bit for proper node/ast based diff algorithms but I only found a few things that were too complex for me atm <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 214577408,
        "sender_full_name": "Lukas Wirth",
        "timestamp": 1603721226
    },
    {
        "content": "<p>I would make another PR that does the look-ahead in algo::diff to properly find insertions if that is alright then because that is the only blocker(after merging the SyntaxRewriter changes) left for the auto-import cursor jumping</p>",
        "id": 214577493,
        "sender_full_name": "Lukas Wirth",
        "timestamp": 1603721273
    }
]