[
    {
        "content": "<p>At work we are working with two repositories where we have crates not at the root of our repository. </p>\n<p>The first one is a full Rust project that contains libraries and multiple embedded firmwares for different devices. Ideally we would have everything as a workspace, but Cargo does not support workspaces with multiple targets yet (<a href=\"https://github.com/rust-lang/cargo/issues/9406\">https://github.com/rust-lang/cargo/issues/9406</a>). So we have a workspace for all the libraries and then each firmware is a separate crate in a sub-directory.</p>\n<p>The second project is a C embedded firmware where we started to rewrite some parts in Rust. So somewhere in the directory structures you find some Rust crates.</p>\n<p>At the moment in each editor (vscode, vim, ...) we have to specify in a different config file where rust-analyzer can find the crates. Otherwise it doesn't pick them up. So I was wondering if there was a way for rust-analyzer to automatically pick them up without requiring a specific configuration file per editor. If not automatically maybe there is or could be a universal rust-analyzer.toml config file?</p>\n<p>Anyway this is just wishful thinking. But I'm curious to see if this has already been thought about, if it is technically feasible/pratical. And what the downsides would be. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 260273291,
        "sender_full_name": "azerupi",
        "timestamp": 1636034536
    },
    {
        "content": "<p>Yeah, there were some thoughts about this. The current thinking is that we do want this to be in some kind of config file, so that opening a project gives you a deterministic view of what's there (find usages always returns the same set of results) and that we don't have to crawls the whole repo for Cargo.tomls. </p>\n<p>The next fix within this model is to <em>detect</em> that you are viewing a file not in the project model, and suggest \"add this to config file\" on the editor's side.</p>",
        "id": 260273815,
        "sender_full_name": "matklad",
        "timestamp": 1636034774
    },
    {
        "content": "<p>For your use-case, can you put all the crates in the same workspace? Basically, create a CArgo.toml at the root of the repo, which just lists all the rust crates in its memebers?</p>",
        "id": 260273874,
        "sender_full_name": "matklad",
        "timestamp": 1636034812
    },
    {
        "content": "<p><a href=\"https://github.com/rust-analyzer/rust-analyzer/issues/6113\">https://github.com/rust-analyzer/rust-analyzer/issues/6113</a></p>",
        "id": 260273881,
        "sender_full_name": "Florian Diebold",
        "timestamp": 1636034817
    },
    {
        "content": "<p>Great to hear!</p>\n<blockquote>\n<p>The next fix within this model is to detect that you are viewing a file not in the project model, and suggest \"add this to config file\" on the editor's side.</p>\n</blockquote>\n<p>Is this something manageable or does it require some substantial changes? Does the machinery to automatically add project settings from rust-analyzer already exist?  </p>\n<blockquote>\n<p>For your use-case, can you put all the crates in the same workspace? Basically, create a CArgo.toml at the root of the repo, which just lists all the rust crates in its memebers?</p>\n</blockquote>\n<p>For one of the projects this is not possible because half of the crates (the libs) can run on any target but the other half (the firmwares) need to compile for ARM micro controllers. So if I put them all in the same workspace cargo complains because it doesn't pick up the .cargo/ config of the specific crates anymore.</p>\n<p>For the other it might be possible. In that one we have a cargo workspace three directories down. Maybe we can have a root Cargo.toml that points to the deeper workspace.</p>",
        "id": 260275470,
        "sender_full_name": "azerupi",
        "timestamp": 1636035513
    },
    {
        "content": "<blockquote>\n<p>The next fix within this model is to detect that you are viewing a file not in the project model, and suggest \"add this to config file\" on the editor's side.</p>\n</blockquote>\n<p>could we, when we detect that you are viewing a file not in the project model, <em>temporarily</em> analyze it as if it had been added already, and only require adding to the config file to make it permanent?</p>",
        "id": 260275975,
        "sender_full_name": "Florian Diebold",
        "timestamp": 1636035748
    },
    {
        "content": "<p>Yeah... I like that!</p>\n<p>Basically, we'll get into the \"yello state\", saying that we've discovered some projects on the fly, but that they are not in the config .</p>",
        "id": 260276081,
        "sender_full_name": "matklad",
        "timestamp": 1636035811
    },
    {
        "content": "<blockquote>\n<p>could we, when we detect that you are viewing a file not in the project model, temporarily analyze it as if it had been added already, and only require adding to the config file to make it permanent?</p>\n</blockquote>\n<p>When you say <em>temporarily analyze</em> you mean find the corresponding Cargo.toml by going up the directory tree and then analyze that crate automatically? Yes, that would be a great new feature!</p>\n<p>Do you think the required changes would be accessible to someone new to the codebase (maybe with some mentoring?)</p>",
        "id": 260279426,
        "sender_full_name": "azerupi",
        "timestamp": 1636037122
    },
    {
        "content": "<p>I'd say that's going to be a bit tricky for the first issue. The scope here is rather limited, you won't need to understand salsa, compilers or all that stuff. But the logic is rather tricky. </p>\n<p>The relevant entry point is probably <a href=\"https://github.com/rust-analyzer/rust-analyzer/blob/master/crates/rust-analyzer/src/reload.rs\">https://github.com/rust-analyzer/rust-analyzer/blob/master/crates/rust-analyzer/src/reload.rs</a> -- this is the code that does \"project loading\" thing</p>",
        "id": 260313297,
        "sender_full_name": "matklad",
        "timestamp": 1636050163
    }
]