[
    {
        "content": "<p>Hey all, I was curious what thoughts and/or plans y'all had around the <a href=\"https://microsoft.github.io/debug-adapter-protocol/\">Debug Adapter Protocol</a> (if any). I don't believe Rust-Analyzer currently supports it, but it feels closely related, so I figured I'd ask (:</p>",
        "id": 269113234,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1643034645
    },
    {
        "content": "<p>(also keen to hear if this is the first time folks are hearing about it, or if y'all don't know of any plans -- mostly trying to understand what the current thinking is)</p>",
        "id": 269113335,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1643034715
    },
    {
        "content": "<p>First time hearing of that, so assuming r-a used that. This would be a way for r-a to talk with the debugger?</p>",
        "id": 269114072,
        "sender_full_name": "Lukas Wirth",
        "timestamp": 1643035064
    },
    {
        "content": "<p>so far I would have said it's outside the scope of RA</p>",
        "id": 269114208,
        "sender_full_name": "Florian Diebold",
        "timestamp": 1643035111
    },
    {
        "content": "<p>interesting - it sounds like folks here haven't really been making plans on what to do with DAP</p>",
        "id": 269114744,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1643035336
    },
    {
        "content": "<p>I guess to share why I'm asking: the DAP protocol is a sibling to the LSP protocol, which allows integrating with things like debuggers, profilers, and more.</p>",
        "id": 269114913,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1643035407
    },
    {
        "content": "<p>Right now the debugger experience for Rust is usable, but not yet mind-blowingly good. Something I've been wondering about is if we spoke the DAP protocol, on the server side we could gradually start providing the functionality it provides.</p>",
        "id": 269115728,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1643035744
    },
    {
        "content": "<p>Which includes debugger support (which maybe we could extend / improve on?), but as I said also profiling, and even REPL support.</p>",
        "id": 269115794,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1643035782
    },
    {
        "content": "<p>The tie-in to Rust-Analyzer would be ease of packaging; it'd be amazing if the first time a user opens a <code>.rs</code> file, VS Code auto suggests: \"do you want to install the 'Rust' extension\", and once it completes everything is done and ready.</p>",
        "id": 269115994,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1643035863
    },
    {
        "content": "<p>But if there are no plans to integrate Rust-Analyzer with the DAP protocol, experiments should probably start outside of the RA codebase.</p>",
        "id": 269116077,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1643035909
    },
    {
        "content": "<p>Anywayyyyy; that's my two half-formed thoughts haha.</p>",
        "id": 269116163,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1643035942
    },
    {
        "content": "<p>This sounds more related to something like priroda</p>",
        "id": 269240247,
        "sender_full_name": "Daniel Mcnab",
        "timestamp": 1643108350
    },
    {
        "content": "<p>I think the folks working on Headcrap considere it on their roadmap? Doesn't really matter for now though, since the Headcrab project is stalled.</p>",
        "id": 269257236,
        "sender_full_name": "Olivier FAURE",
        "timestamp": 1643117878
    }
]