[
    {
        "content": "<p>Hi all, a bit of a meta-question.</p>\n<p>If I have a big mess of heavily generic code for which rust-analyzer isn't correctly inferring types, it is acceptable to create a GitHub issue whose repro instructions are basically just \"go download this big mess of code from here\" ?</p>\n<p>I've done this a few times already, but I'm not sure if it's annoying to the team to get things that aren't minimal repros.</p>",
        "id": 228612668,
        "sender_full_name": "Brennan Vincent",
        "timestamp": 1614785942
    },
    {
        "content": "<p>well, it's going to make it more likely that your bug will get looked at if you have a small repro, but any actual repro is already helpful ;)</p>",
        "id": 228612790,
        "sender_full_name": "Florian Diebold",
        "timestamp": 1614785995
    },
    {
        "content": "<p>The biggest risk is that someone from the r-a team spends time figuring out what is going wrong, and then determines it is a dupe of a known issue</p>",
        "id": 228613069,
        "sender_full_name": "Brennan Vincent",
        "timestamp": 1614786070
    },
    {
        "content": "<p>it can be really helpful to try to minimize the repro though, you can often remove large swathes of dependencies and code. keep in mind that the repro doesn't need to _work_. you can remove lots of code and replace most function bodies by <code>loop {}</code></p>",
        "id": 228613124,
        "sender_full_name": "Florian Diebold",
        "timestamp": 1614786087
    },
    {
        "content": "<p>That is a good point.</p>",
        "id": 228613201,
        "sender_full_name": "Brennan Vincent",
        "timestamp": 1614786115
    },
    {
        "content": "<p>Commenting out deps in Cargo.toml and module declarations is also a good start</p>",
        "id": 228613393,
        "sender_full_name": "matklad",
        "timestamp": 1614786173
    },
    {
        "content": "<p>but you could also post your big repro first, maybe I or someone else will immediately recognize it as a known problem. If it's involving lots of traits etc. that's unlikely though</p>",
        "id": 228613503,
        "sender_full_name": "Florian Diebold",
        "timestamp": 1614786206
    },
    {
        "content": "<p>I wonder if we could create an LSP record/replay feature</p>",
        "id": 228663648,
        "sender_full_name": "Jeremy Kolb",
        "timestamp": 1614803822
    },
    {
        "content": "<p>We can already log the LSP messages and we could presumably replay them to a new server instance.</p>",
        "id": 228665819,
        "sender_full_name": "Laurențiu",
        "timestamp": 1614804667
    },
    {
        "content": "<p>This question became irrelevant in this case, since I was indeed able to come up with a simple repro: <a href=\"https://github.com/rust-analyzer/rust-analyzer/issues/7864\">https://github.com/rust-analyzer/rust-analyzer/issues/7864</a></p>\n<p>But it is good to know the expectation for the future :)</p>",
        "id": 228667757,
        "sender_full_name": "Brennan Vincent",
        "timestamp": 1614805398
    }
]