[
    {
        "content": "<p>Hi, recently I worked (more like.. _still working on_) an issue in rust_analyzer, and I think it is not that far from landing, but the process would have been easier with a bit more of docs. There are <em>lots</em> of thing I need to use to solve what I'm working on but that I simply can't just figure out what's their intended meaning/usage/etc. Is there any plan on expanding docs coverage? I would love to help in writing such docs simply because doing so would allow me to understand the code base, and then of course, it would help other new-to-ra developers willing to do stuff. Of course, this would need to be made with a good amount of guidance. Thought?</p>",
        "id": 187848851,
        "sender_full_name": "divma",
        "timestamp": 1581362385
    },
    {
        "content": "<p>PRs welcome!</p>",
        "id": 187849145,
        "sender_full_name": "Jeremy Kolb",
        "timestamp": 1581362561
    },
    {
        "content": "<p>In general, we are pretty bad with docs. </p>\n<p>THe geneneral idea is to maintain module-level docs and the top-level achitecture.md</p>",
        "id": 187854040,
        "sender_full_name": "matklad",
        "timestamp": 1581365948
    },
    {
        "content": "<p>Function level docs unfortunatelly usually get obsoleted pretty quickly :(</p>",
        "id": 187854053,
        "sender_full_name": "matklad",
        "timestamp": 1581365965
    },
    {
        "content": "<p>In general, it's a good idea to send a PR with docs if it took you some time to understand smth</p>",
        "id": 187854080,
        "sender_full_name": "matklad",
        "timestamp": 1581365989
    },
    {
        "content": "<p>that's a bit sad to hear, but good to know. I still think there is \"improvement opportunity \" wrt to documenting concepts that seem to appear in various places  and that would benefit from a small doc comment. That being said, i'll send a PR whenever I find  places in which that's the case</p>",
        "id": 187861174,
        "sender_full_name": "divma",
        "timestamp": 1581370739
    }
]