[
    {
        "content": "<p>Hey everyone, I had a look at <a href=\"https://github.com/rust-analyzer/rust-analyzer/issues/9591\">https://github.com/rust-analyzer/rust-analyzer/issues/9591</a> and would like to work on it. While thinking about the process I have a couple of doubts I want to get clarified:</p>\n<ul>\n<li>How will the assist get invoked? Issue mentions selection, but I have no idea if its possible, most other assists seem to use cursor position as the reference. If it possible, is there some guide? If not, where do we invoke it from(maybe from the struct/func def)?</li>\n<li>On what node types can we invoke it? struct and function?</li>\n<li>Lets say we are doing it for a struct, as mentioned in issue, will it mean taking all impl blocks of that struct(even from different files)?</li>\n</ul>",
        "id": 245946848,
        "sender_full_name": "Fenil Jain",
        "timestamp": 1626261876
    },
    {
        "content": "<p>\"Extract type alias\" uses the current selection</p>",
        "id": 245946994,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1626261983
    },
    {
        "content": "<p>the new assist should work on any collection of items, I think</p>",
        "id": 245947044,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1626262020
    },
    {
        "content": "<p>Hey, what could be the best way to rename a given struct/function/enum, etc. over all instances, I was trying to do it with to_def finding refs, and then trying to replace, but it seems to be a lot of work, I guessed I will confirm once.</p>",
        "id": 247849291,
        "sender_full_name": "Fenil Jain",
        "timestamp": 1627809148
    },
    {
        "content": "<p>Yes, going with <code>to_def</code> and then finding references seems like the correct approach for this</p>",
        "id": 247851234,
        "sender_full_name": "Lukas Wirth",
        "timestamp": 1627812199
    },
    {
        "content": "<p>Hey, what could be the best way to resolving imports in this case. I would have to move/retain/duplicate imports according to the content selected for extraction in new module, so there could be references I would have to shift to new module, or keep in both, new module and container module. Any reference I could be guided to?</p>",
        "id": 248592159,
        "sender_full_name": "Fenil Jain",
        "timestamp": 1628244610
    },
    {
        "content": "<p>Hmm, you probably want to do usage searches of all the items in your selection</p>",
        "id": 248594993,
        "sender_full_name": "Lukas Wirth",
        "timestamp": 1628246045
    },
    {
        "content": "<p>So basically you want to go through all NameRefs in your selection, turn them to hir nodes via <code>NameRefClass::classify</code>, then do <a href=\"https://github.com/rust-analyzer/rust-analyzer/blob/master/crates/ide_db/src/search.rs#L307\">usage searches</a> on them with the file as a scope, that way you can check if you find imports in the current file, as well as whether this name ref is used outside of your selection</p>",
        "id": 248595147,
        "sender_full_name": "Lukas Wirth",
        "timestamp": 1628246172
    },
    {
        "content": "<p>Limiting the search to your file cna be done with <a href=\"https://github.com/rust-analyzer/rust-analyzer/blob/master/crates/ide_db/src/search.rs#L334-L336\">https://github.com/rust-analyzer/rust-analyzer/blob/master/crates/ide_db/src/search.rs#L334-L336</a></p>",
        "id": 248595167,
        "sender_full_name": "Lukas Wirth",
        "timestamp": 1628246193
    },
    {
        "content": "<p>Similar thing can be applied to <code>Name</code>s since you would move those definitions you want to know what paths to fix up</p>",
        "id": 248595189,
        "sender_full_name": "Lukas Wirth",
        "timestamp": 1628246218
    }
]