[
    {
        "content": "<p>I have a project <code>foo</code> that has several local library crates it depends on, living in <code>foo/components/bar</code>. When I open <code>foo</code> in vscode, I get errors for <code>foo</code> and go to definition on types from <code>bar</code> takes me into the <code>bar</code> sources as expected, and I also get type information and go to definition in the <code>bar</code> sources as expected, but for some reason all errors are suppressed, and I have to use <code>cargo check</code> to see them. Opening <code>bar</code> in its own workspace makes the errors show up. I could have sworn this worked a few months ago, so maybe some option has appeared in the meantime? (A few months ago I was also periodically getting errors deep in <code>std</code> or other basic dependencies due to some fancy nightly-only macro, so perhaps the issue I'm hitting is a side effect of the fix for that.)</p>",
        "id": 251491719,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1630464729
    },
    {
        "content": "<p>yeah, I've also noticed errors disappearing yesterday, looks like I broke the error mapping code again :(</p>",
        "id": 251545438,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1630497429
    },
    {
        "content": "<p>Just ran into this in rust-analyzer itself, it would be great to find a small reproduction of this problem</p>",
        "id": 251584544,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1630512245
    },
    {
        "content": "<p>looks like the problem is spurious</p>",
        "id": 251589552,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1630514103
    },
    {
        "content": "<p>meaning you still need a reproducer, or it's not a bug?</p>",
        "id": 251589783,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1630514197
    },
    {
        "content": "<p>there's a bug somewhere for sure, but I can't even repro on the rust-analyzer commit that I had the issue on</p>",
        "id": 251589910,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1630514253
    }
]