[
    {
        "content": "<p>Since we now have pretty good support for attributes we could consider re-enabling expansion of <code>#[test]</code> and <code>#[bench]</code>, reason being that runnables need some special casing due to this and it is unfortunately quite inconsistent.<br>\nInconsistent being due to us ignoring <code>#[test]</code> but actually resolving and expanding  proper paths like<code>#[::core::prelude::v1::test]</code>, where <code>#[tokio::test]</code> emits fully qualified test attributes, but <code>#[rstest]</code> emitting just <code>#[test]</code> attributes, making the experience of runnables a bit wonky. Always expanding the test attribute would help tackle this, at the expense of using more memory unfortunately due to basically duplicating test functions into their expansion.</p>",
        "id": 261625958,
        "sender_full_name": "Lukas Wirth",
        "timestamp": 1637061136
    },
    {
        "content": "<p>Then again expanding these at all is kind of pointless to us all together but I don't think we can currenctly \"accept\" any path to the test attribute and ignore it without throwing unresolved attribute diagnostics to the user as the current ignoring of just <code>#[test]</code> is hardcoded to just that identifier being alone(which technically is wrong since you can overwrite the prelude's import of it).</p>",
        "id": 261626082,
        "sender_full_name": "Lukas Wirth",
        "timestamp": 1637061223
    },
    {
        "content": "<p><code>#[test]</code> is a <code>#[rustc_builtin_macro]</code>, so couldn't we make that check accurate by putting it in nameres?</p>",
        "id": 261642256,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1637070427
    },
    {
        "content": "<p>Mmh ye actually we should be able to ignore it in nameres, will take another look. (On that note technically our derive collection is wrong as well as we only look for the <code>derive</code> ident when collecting)</p>",
        "id": 261643420,
        "sender_full_name": "Lukas Wirth",
        "timestamp": 1637070895
    }
]