[
    {
        "content": "<p>Currently sysroot crates have hard-coded dependencies on other sysroot crates, but in reality they can also depend on almost arbitrary <a href=\"http://crates.io\">crates.io</a> crates, and we currently miss those. This can break stuff, for example <code>std::os::unix</code> isn't resolved correctly because the module declaration is produced by <code>cfg_if!</code>. (I'm pretty amazed that the current solution has held up so well!)</p>\n<p>I think the correct way to fix this is to start using <code>cargo metadata</code> output, just like we do for user workspaces. The problem with that is that it means we might perform network requests and block for a while when the index is being updated. I think it also means that cargo will create <code>Cargo.lock</code> inside the <code>.rustup</code> toolchain in use, which is not ideal (but required when we only want to pay the startup cost once).</p>\n<p>One other thing that came to mind: The rust-src component ships Cargo.lock, so technically no index update like that is necessary. The problem is that it's not located in the right place, and the workspace it was generated for (the whole rust-lang/rust) is not available. We might be able to generate the libstd part of the workspace and reuse the lockfile though, but that means dealing with temp files etc.</p>\n<p>Any ideas / Things I'm missing?</p>",
        "id": 210671082,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1600614913
    },
    {
        "content": "<p><a href=\"https://github.com/rust-lang/rust/pull/76533\">https://github.com/rust-lang/rust/pull/76533</a> would be ideal</p>",
        "id": 210671160,
        "sender_full_name": "matklad",
        "timestamp": 1600615059
    },
    {
        "content": "<p>Ah yeah, that might help. Then we could just ship <code>library/Cargo.toml</code> alongside the lockfile.</p>",
        "id": 210671227,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1600615154
    },
    {
        "content": "<p>It turns out that you can totally reuse the global Cargo.lock inside libstd (Cargo will delete all unused entries, but still uses the others).</p>\n<p>Only problem is that it has to be copied into the libstd sources, so we'd end up editing the rust-src component.</p>",
        "id": 213825401,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1603131698
    }
]