[
    {
        "content": "<p>Hey all.</p>\n<p>I just noticed emilk posted an  issue about rapier &amp; vscode &amp; rust-analyzer. I'm interested in getting this working, or at least debugging it some.</p>\n<p><a href=\"https://github.com/rust-analyzer/rust-analyzer/issues/7715\">https://github.com/rust-analyzer/rust-analyzer/issues/7715</a></p>\n<p>I am having trouble working out where to look to find the code paths that are triggered (or more likely not)</p>",
        "id": 243230691,
        "sender_full_name": "rezuralos rezurally",
        "timestamp": 1624080547
    },
    {
        "content": "<p>I would recommend trying to create a more minimal version of the same project structure to hopefully reproduce it</p>",
        "id": 243233221,
        "sender_full_name": "Florian Diebold",
        "timestamp": 1624085224
    },
    {
        "content": "<p>So the point at where rust-analyzer registers a dependency is where I believe this problem lies. I will get a minimal reproduction happening, hopefully someone can point out where the code is that currently assumes (in this case) that the file to open is src/lib.rs, when it is actually ../../src/lib.rs, as indicated by the cargo.toml</p>",
        "id": 243268242,
        "sender_full_name": "rezuralos rezurally",
        "timestamp": 1624135453
    },
    {
        "content": "<p>we should be getting this info from cargo</p>",
        "id": 243269980,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1624138165
    },
    {
        "content": "<p>It appears to be registered correctly (path is correct).</p>",
        "id": 243274996,
        "sender_full_name": "rezuralos rezurally",
        "timestamp": 1624146044
    },
    {
        "content": "<p>SO, I'm still working on it, but It's in the server setup code that I think the problem is.... so some people will already know how terrifying, soul destroying and plain frustrating it is. I'll at least get some better debug outputs (with file names) from a run, debugging hasnt really helped as everything is indexed by id &amp; hidden in inscrutable hashtables etc..</p>",
        "id": 243289410,
        "sender_full_name": "rezuralos rezurally",
        "timestamp": 1624170809
    },
    {
        "content": "<p>Probably also found some bugs that affect debugging the server on start (doing the RA_WAIT_DBG thing causes issues with version checking hanging indefinately &amp; probably timing out..)</p>",
        "id": 243289457,
        "sender_full_name": "rezuralos rezurally",
        "timestamp": 1624170894
    }
]