[
    {
        "content": "<p>I am interested in working on an IntelliJ Platform plugin for Rust Analyzer. Are there any resources on which how I can start doing so? As in, are there any things that I have to do before implementing the plugin? (I have already created the project and is willing to work with you guys to get Rust Analyzer support on IntelliJ Platform because Rust Analyzer is amazing!)</p>",
        "id": 242502072,
        "sender_full_name": "HTGAzureX1212.",
        "timestamp": 1623579566
    },
    {
        "content": "<p><a href=\"https://github.com/gtache/intellij-lsp\">https://github.com/gtache/intellij-lsp</a> might be a starting point, although I don't know whether it would be a good starting point.</p>",
        "id": 242502137,
        "sender_full_name": "matklad",
        "timestamp": 1623579653
    },
    {
        "content": "<p>I have had a look at it - it currently uses RLS. And it is written in Scala - I plan to write it using Kotlin instead. I will have a look - also the fact that it has been stopped for a while due to the pandemic - it might be a good time for a Rust Analyzer plugin for the IntelliJ Platform. IntelliJ Rust is <em>good enough</em> for the most part IMO, but there are various things that Rust Analyzer can do but not IntelliJ Rust.</p>",
        "id": 242502216,
        "sender_full_name": "HTGAzureX1212.",
        "timestamp": 1623579771
    },
    {
        "content": "<p>If I were solving this problem in the abstract, I'd build two things:</p>\n<ul>\n<li>First, an vscode-language-server-node analogue: a library that adapts LSP concepts to the underlying editor (IntelliJ)</li>\n<li>Second, a rust-specific library using this plugin</li>\n</ul>\n<p>In terms of how to actually do this properly, <a href=\"https://github.com/JetBrains/intellij-plugins/tree/master/Dart\">https://github.com/JetBrains/intellij-plugins/tree/master/Dart</a> (dart plugin) would be the right place to learn from</p>",
        "id": 242502235,
        "sender_full_name": "matklad",
        "timestamp": 1623579832
    },
    {
        "content": "<p>Thank you! I will have a look. <span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span></p>",
        "id": 242502328,
        "sender_full_name": "HTGAzureX1212.",
        "timestamp": 1623579932
    },
    {
        "content": "<p>I will also probably branch off rust-analyzer for the addition for the Rust Analyzer IntelliJ Platform plugin. Thanks!</p>",
        "id": 242502386,
        "sender_full_name": "HTGAzureX1212.",
        "timestamp": 1623580004
    },
    {
        "content": "<p>Solving this problem concretely in the most useful way is a tough exercise in system's design -- obviously, JetBrains at some point might or might not add first class LSP support to the platform. </p>\n<p>With this in mind, to keep the work maximally useful in the long-run, I'd keep an eye at the following exit strategies:</p>\n<ul>\n<li>salvaging editor-independent LSP integration (ie, producing a JVM library which can be used in eclipse)</li>\n<li>looking at the integration with IntelliJ Rust as the end-goal</li>\n<li>looking at the graduating into official LSP client for the intellij platform</li>\n</ul>",
        "id": 242502455,
        "sender_full_name": "matklad",
        "timestamp": 1623580097
    },
    {
        "content": "<p>Alright!</p>",
        "id": 242502616,
        "sender_full_name": "HTGAzureX1212.",
        "timestamp": 1623580229
    }
]