[
    {
        "content": "<p>Heya! - It's a bit early in the planning, but Microsoft will be hosting a company-wide internal hackathon in October. As part of the effort we'd like to direct folks towards improving Rust tooling, which very much includes Rust-Analyzer. Folks will have three days to work on projects they want to, and we figured a good number of folks might be interested in improving the tools they use daily - they just need a bit of guidance.</p>\n<p>It's still pretty early in the planning, but I wanted to check in early to see how folks would feel about this.</p>",
        "id": 249100001,
        "sender_full_name": "Yoshua Wuyts",
        "timestamp": 1628685131
    },
    {
        "content": "<p>Most of what this means for RA is that we'd want to compile a list of things of things that folks can work on (for example: new assists, improvements to existing assists, protocol things that might be useful, etc.), and a likelihood that during those three days the number of incoming PRs might be higher than usual.</p>\n<p><span class=\"user-mention\" data-user-id=\"224872\">@rylev</span> and I would handle all the planning for this otherwise, and would be around for the full duration of it to help out.</p>",
        "id": 249100481,
        "sender_full_name": "Yoshua Wuyts",
        "timestamp": 1628685399
    },
    {
        "content": "<p>Keen to hear what folks think of this!</p>",
        "id": 249100510,
        "sender_full_name": "Yoshua Wuyts",
        "timestamp": 1628685421
    },
    {
        "content": "<p>Just for some extra context, folks inside of Microsoft get to choose whatever they work on, so there's no guarantee anyone will pick up RA as a project to work on, but we thought it would be good to see if we could get some people to contribute to such a great open source project in the Rust ecosystem.</p>",
        "id": 249100949,
        "sender_full_name": "rylev",
        "timestamp": 1628685695
    },
    {
        "content": "<p>Sounds good!</p>",
        "id": 249103448,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1628686949
    },
    {
        "content": "<p>For the record, registration is already open for those internally wishing to participate; see your email, or go to <a href=\"https://aka.ms/hackbox\">HackBox</a> to register.</p>\n<p>If you're running a project on Rust-Analyzer or a related component, please post your HackBox link here to attract potential contributors, since HackBox's project discovery UI isn't great for particular topics.</p>",
        "id": 249177951,
        "sender_full_name": "Zoey",
        "timestamp": 1628720969
    },
    {
        "content": "<p>Heya! The Microsoft hackathon is next week. There's a fair number of folks within Microsoft who've signed up, but many haven't declared a project yet. We were wondering if folks know of any medium-sized issues that could be fun for someone to take on?</p>",
        "id": 256421843,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1633531033
    },
    {
        "content": "<p>I'm looking at the <a href=\"https://github.com/rust-analyzer/rust-analyzer/issues?q=is%3Aopen+label%3AS-actionable+label%3AA-assists+\">list of <code>S-Actionable</code> + <code>A-assists</code></a>. Perhaps this could be a good spot to direct folks to?</p>",
        "id": 256422336,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1633531213
    },
    {
        "content": "<p>yeah, also <code>good first issue</code></p>",
        "id": 256423607,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1633531725
    },
    {
        "content": "<p>ahh, yes of course! :D</p>",
        "id": 256424558,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1633532059
    },
    {
        "content": "<p>A few ideas/wishes that not necessarily medium-sized, but might be fun:</p>\n<ul>\n<li>\n<p>improve closure syntax completions: <br>\n    * now, when you write something like <code>.map(|a| &lt;|&gt;)</code>, you have to mess a lot with <code>|</code> — they are not added automatically, not closed automatically, when there are some complex params instead of <code>a</code> (tuples, for instance), it becomes a pain to destucture this all without confusing the brackets<br>\n    * <code>.map(function&lt;|&gt;)</code> will now result in <code>.map(function())</code> always while there are plenty of cases when it could be <code>.map(function)</code> or <code>.map(|a| function(a))</code>, but completed automatically for you </p>\n</li>\n<li>\n<p>support \"live\" files addition to the workspace: currently, we are allowing to _start_ VSCode with a single arbitrary rust file outside any workspace and it will get some IDE features. But there's no way to support more than one or just add a standalone file into an open workspace to get some IDE features in it. Here's why: <a href=\"https://github.com/rust-analyzer/rust-analyzer/pull/8955#issuecomment-916119471\">https://github.com/rust-analyzer/rust-analyzer/pull/8955#issuecomment-916119471</a></p>\n</li>\n<li>\n<p>move the inlay hints LSP support further: there's an unfortunately stalled PR <a href=\"https://github.com/microsoft/language-server-protocol/pull/1249\">https://github.com/microsoft/language-server-protocol/pull/1249</a> (most probably more than one) and great confusion for many people on \"why does TypeScript have it in VSCode but Rust does not?\" topic. And a great push towards the feature adoption in our codebase. </p>\n</li>\n<li>\n<p>support \"compose Cargo task to run for a workspace\" task: given a certain workspace, add an action that allows to input characters, which are fuzzily matched against all possible <code>cargo</code> command outputs with options, something like this:<br>\n<a href=\"/user_uploads/4715/bbCaC91VSmVUlGHQGkwc157Q/image.png\">image.png</a>ijr.png<br>\nThe point is to create a run configuration out of this to allow the VSCode to rerun the command with a single shortcut which is super useful for cases like \"quickly compose a cargo clippy command to test this module and run it N times\".</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/4715/bbCaC91VSmVUlGHQGkwc157Q/image.png\" title=\"image.png\"><img src=\"/user_uploads/4715/bbCaC91VSmVUlGHQGkwc157Q/image.png\"></a></div></li>\n</ul>",
        "id": 256425726,
        "sender_full_name": "Kirill Bulatov",
        "timestamp": 1633532436
    },
    {
        "content": "<p>Yay, thanks! -- that sounds like there's a lot of things we can direct folks to!</p>",
        "id": 256425924,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1633532510
    },
    {
        "content": "<p>/me now needs to summarize all of this for our internal hackathon messaging</p>",
        "id": 256426035,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1633532537
    },
    {
        "content": "<p>:D</p>",
        "id": 256426067,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1633532547
    },
    {
        "content": "<p>Another one that might be small, but somewhat tricky to find the actual issue: </p>\n<p>We now have a decent <code>mod &lt;|&gt;</code> support: we actually check if there's anything on the FS that's not yet added and suggest it.<br>\nBut </p>\n<ul>\n<li>it all breaks with any letter added afterwards <code>mod a&lt;|&gt;</code> will not give you anything, even if there are suitable files on the disk</li>\n<li>when you type <code>mod &lt;|&gt;</code>, no completion is actually proposed, you have to force it with cmd/ctrl + space which hurts the feature's discoverability abysmally <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></li>\n</ul>",
        "id": 256426731,
        "sender_full_name": "Kirill Bulatov",
        "timestamp": 1633532805
    },
    {
        "content": "<p>Oh, and my recent top-1, almost ready to take a vacation for trying implementing it myself: give me a stacktrace explorer, some input where I paste the whole trace shebang and get another panel with \"verbose\" regions of the stacktrace folded and project-source-related parts highlighted and navigating to the code.</p>\n<p>Intellij Rust analogue details: <a href=\"https://github.com/intellij-rust/intellij-rust/issues/4442\">https://github.com/intellij-rust/intellij-rust/issues/4442</a></p>",
        "id": 256427609,
        "sender_full_name": "Kirill Bulatov",
        "timestamp": 1633533111
    },
    {
        "content": "<blockquote>\n<p>.map(function&lt;|&gt;) will now result in .map(function()) always while there are plenty of cases when it could be .map(function) or .map(|a| function(a)), but completed automatically for you </p>\n</blockquote>\n<p>Is a real point when using <code>bevy</code>, fwiw. In bevy, we don't want the second case, but the first version would be incredibly useful to have.</p>",
        "id": 256456974,
        "sender_full_name": "Daniel Mcnab",
        "timestamp": 1633543678
    },
    {
        "content": "<p>Hackathon will be starting tomorrow! -- we've got 11 hackers signed up so far!</p>",
        "id": 257069524,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1633961373
    },
    {
        "content": "<p>Shared all the info from this thread with them, and made general \"getting started\" guides and shared links to various resources (including this Zulip). It's very likely some folks will find their way here with questions, and hop into the issue tracker.</p>\n<p>We've recommended folks that if they want to work on an issue, they comment on it, and hopefully they can be assigned to it.</p>",
        "id": 257069929,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1633961539
    },
    {
        "content": "<p>The way things are looking, it should all be easy and folks will hopefully be able to get a bunch of PRs in (for many this will be their first RA contribution!) But in case anything does come up, don't hesitate to ping/DM me or <span class=\"user-mention\" data-user-id=\"224872\">@rylev</span>!</p>",
        "id": 257070319,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1633961743
    },
    {
        "content": "<p>Hello all! I'm participating in the MSFT internal hackathon and am thrilled to be here!</p>",
        "id": 257128500,
        "sender_full_name": "Nell Shamrell-Harrington",
        "timestamp": 1633994941
    },
    {
        "content": "<p>Hey all, the Microsoft hackathon has just about wrapped up. Thank you for all your help in helping folks contribute to Rust-Analyzer. It's been a great success, and not in a small part thanks to y'all! <span aria-label=\"purple heart\" class=\"emoji emoji-1f49c\" role=\"img\" title=\"purple heart\">:purple_heart:</span></p>",
        "id": 257765936,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1634332452
    },
    {
        "content": "<p>Was great to see some extra activity <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>",
        "id": 257767544,
        "sender_full_name": "Lukas Wirth",
        "timestamp": 1634333239
    }
]