[
    {
        "content": "<p>Hey, according to <a href=\"https://github.com/rust-lang/team/blob/master/teams/wg-rls-2.toml\">https://github.com/rust-lang/team/blob/master/teams/wg-rls-2.toml</a>, I am a formal lead of wg-rls.2.0. One of the responsibilities there is reporting to t-compiler.</p>\n<p>I wounder if anyone wants to get this title and resposibility? :)</p>",
        "id": 227800482,
        "sender_full_name": "matklad",
        "timestamp": 1614272473
    },
    {
        "content": "<p>(if there are no takers, I can of course do the job)</p>",
        "id": 227800572,
        "sender_full_name": "matklad",
        "timestamp": 1614272506
    },
    {
        "content": "<p>Depending on the responsibilities I might be interested <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 227807500,
        "sender_full_name": "Lukas Wirth",
        "timestamp": 1614275087
    },
    {
        "content": "<p>Responsibilities are a good question )</p>\n<p>So far, as I was a de-facto lead, we weren't super strict about what it actually means to be the lead. I actually do think this is the right approach: if you have a closed set of responsibilites, you have a tendency to grind those responsibilities, instead of fixing  everything that is  broken.</p>\n<p>So,  yeah, I think wg-rls2.0-lead means the following:</p>\n<ul>\n<li>dedicating significant amount of head space to thinking and caring about \"creating the uncompromisingly perfect dev experience for Rust\"</li>\n<li>\"transferring\"  the resulting system of values to the wider community of folks working on the project</li>\n<li>having the \"big picture\" in mind</li>\n<li>picking the \"leftover\" work and otherwise, fixing anything that's broken and isn't being fixed by somebody else.</li>\n<li>and important bit of \"leftover\" work is coordination: changelogs, wg check-ins, etc</li>\n</ul>\n<p>Notably, \"understanding how every bit of code works\" isn't on the list: I've never understood our type inference or proc macro expansion code, for example.</p>",
        "id": 227904516,
        "sender_full_name": "matklad",
        "timestamp": 1614332938
    },
    {
        "content": "<p>I'm certainly interested, but I'm not too sure I'm cut out for all of that I think <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 228048436,
        "sender_full_name": "Lukas Wirth",
        "timestamp": 1614420955
    }
]