[
    {
        "content": "<p>I've just made a summary of the first two phases that matklad drew. Please let me know if you see any mistakes or if it is just wrong. </p>\n<p><strong>text (base_db)</strong></p>\n<p>Stores the raw text (lexeme and tokens in a database). This is the result of the lexer.</p>\n<p><strong>Capabilities</strong>: You can search for tokens and reconstruct the raw source file that you parsed with this.  </p>\n<p><strong>Note</strong>: Unlike Some parsers, it stores the whitespace too. The position/span of a node is not explicit in this representation. So with rast, we see <a href=\"mailto:WHITESPACE@120..121\">WHITESPACE@120..121</a> . This can be derived from iterating through all of the nodes on this layer and using their lengths.  </p>\n<p><strong>CST (syntax)  </strong></p>\n<p>This is the result of the parser. It span information here is relative. So for example <a href=\"mailto:WHITESPACE@120..121\">WHITESPACE@120..121</a> is the span of a whitespace node, but it is relative to all of the other nodes. Therefore, if we insert a whitespace into the file, the CST will be invalidated, but the base_db will not since in the base_db the position is implicit; based on the length of each node.</p>\n<p><strong>Capabilities</strong>: There are no new capabilities with this AFAICT. You can search for Expressions and do all of the regular operations you can do on an AST.  </p>\n<p><strong>Note</strong>: Since this gets invalidated on every keystroke, it should be very quick to build. It is more or less an inconvenience structure that we only need to build per the file that is open.</p>",
        "id": 219612751,
        "sender_full_name": "kev",
        "timestamp": 1607697427
    },
    {
        "content": "<p>The text query is really just the raw file text, unparsed and unlexed</p>",
        "id": 219613184,
        "sender_full_name": "Jonas Schievink  [he/him]",
        "timestamp": 1607697612
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"211727\">Jonas Schievink</span> <a href=\"#narrow/stream/185405-t-compiler.2Fwg-rls-2.2E0/topic/parsing.20in.20r-a/near/219613184\">said</a>:</p>\n<blockquote>\n<p>The text query is really just the raw file text, unparsed and unlexed</p>\n</blockquote>\n<p>Oh I see, thanks for correcting. I thought that this section was about GreenNodes and not salsa</p>",
        "id": 219613836,
        "sender_full_name": "kev",
        "timestamp": 1607697906
    }
]