[
    {
        "content": "<p>One more thing related to the <a href=\"https://github.com/rust-analyzer/rust-analyzer/issues/2180\" target=\"_blank\" title=\"https://github.com/rust-analyzer/rust-analyzer/issues/2180\">https://github.com/rust-analyzer/rust-analyzer/issues/2180</a> implementation I would like to discuss.</p>\n<p>There can be multiple items with the same name to import  in the project, so we need to provide some kind of a dialogue for a user with all possible import options (that's what intellij-rust does now) and the ability to proceed the action with the user selection.</p>\n<p>Is there anything in RA I can use for that?<br>\nIf not, IMO it makes sense to make it possible before implementing the auto import functionality and I would appreciate any guidance.</p>",
        "id": 184436691,
        "sender_full_name": "Kirill Bulatov",
        "timestamp": 1577654365
    },
    {
        "content": "<p>Now, we don't but we badly need this for many assists. I am not sure if this can be implemented via the LSP</p>",
        "id": 184437804,
        "sender_full_name": "matklad",
        "timestamp": 1577656371
    },
    {
        "content": "<blockquote>\n<p>I am not sure if this can be implemented via the LSP</p>\n</blockquote>\n<p>That sounds a bit sad, especially for auto import case where false-positive rate is really high, I don't think we can go far with inserting the very first import we get from the action.</p>\n<p>Should we reconsider the approach to auto import then and make it something else but an action?<br>\nWe have some way to interact with VS Code UI at least, since there's <code>Show Syntax Tree</code> functionality that is able to open an external window.</p>\n<p>I wish I knew any place to ask LSP-related guys about that functionality, that would be so much better direction to move forward.</p>",
        "id": 184438317,
        "sender_full_name": "Kirill Bulatov",
        "timestamp": 1577657329
    },
    {
        "content": "<blockquote>\n<p>I wish I knew any place to ask LSP-related guys about that functionality, that would be so much better direction to move forward.</p>\n</blockquote>\n<p>THe best way is to just re-check how LSP speck says actions should work, and if we can use them. At worst, we  can do what run configurations do: hand-crafted cleint-side option picker</p>",
        "id": 184438648,
        "sender_full_name": "matklad",
        "timestamp": 1577657967
    },
    {
        "content": "<blockquote>\n<p>At worst, we can do what run configurations do: hand-crafted cleint-side option picker</p>\n</blockquote>\n<p>I've looked through the spec and so far it looks like this is the only way we can do it currently: we need to register a custom command and do the magic there.</p>",
        "id": 184467355,
        "sender_full_name": "Kirill Bulatov",
        "timestamp": 1577706166
    },
    {
        "content": "<p>IIRC, it's possible to return a command name &amp; args from an action, so I think our intentions should return smth like this:</p>\n<div class=\"codehilite\"><pre><span></span>{\n  &quot;command&quot;: &quot;ra-lsp.choose-action&quot;,\n  &quot;args&quot;: [[[&quot;import foo&quot;, SOurceChange1], [&quot;import bar&quot;, SOurceChange1]]]\n}\n</pre></div>",
        "id": 184470008,
        "sender_full_name": "matklad",
        "timestamp": 1577709684
    },
    {
        "content": "<p>Yep, that's what I was planning to do either.<br>\nI'll come up with something later.</p>",
        "id": 184472469,
        "sender_full_name": "Kirill Bulatov",
        "timestamp": 1577712544
    },
    {
        "content": "<p>I think I've found a way to do this without any extra commands created: <a href=\"https://github.com/rust-analyzer/rust-analyzer/pull/2716\" target=\"_blank\" title=\"https://github.com/rust-analyzer/rust-analyzer/pull/2716\">https://github.com/rust-analyzer/rust-analyzer/pull/2716</a></p>\n<p>The only issue with this PR is that the CI fails to run the tests and does not show me the logs.<br>\n<code>cargo test</code> passes for me locally, so I have no idea what's wrong.</p>",
        "id": 184566070,
        "sender_full_name": "Kirill Bulatov",
        "timestamp": 1577826545
    }
]