[
    {
        "content": "<p>Hey, so I feel we are suffering from a review bandwidth deficit. I want to help with this, by documenting more of the \"internal invariants\" and \"how to do review\" stuff. </p>\n<p>I am putting info here: <a href=\"https://github.com/rust-analyzer/rust-analyzer/pull/4703\">https://github.com/rust-analyzer/rust-analyzer/pull/4703</a></p>",
        "id": 199466887,
        "sender_full_name": "matklad",
        "timestamp": 1591089527
    },
    {
        "content": "<p>Question: how do folks feel about reviewers pushing commits directly to the PR branch (allow edits from maintainers)?</p>\n<p>I've noticed that the way I do thorough review is by checking out the code locally, and testing if my suggestions compile. So, in a sense, I first apply suggestions locally, and then write it again, as the comment on the PR. </p>\n<p>I wonder if it makes sense to just directly push the suggestsions (preserving the same \"motivation\" part I would to GH comment to explain <em>why</em> this change is a good idea in my options)</p>",
        "id": 200082800,
        "sender_full_name": "matklad",
        "timestamp": 1591614290
    },
    {
        "content": "<p>LGTM</p>",
        "id": 200086442,
        "sender_full_name": "vsrs",
        "timestamp": 1591617002
    },
    {
        "content": "<p>I think it should be allowed but would also say that I've learned a lot of rust from you telling me my PRs are wrong and having to type it all out myself :)</p>",
        "id": 200095537,
        "sender_full_name": "Jeremy Kolb",
        "timestamp": 1591622216
    },
    {
        "content": "<p>Yeah, I guess, that's the main question -- would pedagogical value of reading someone else's commit be comparable to typing the stuff yourself...</p>",
        "id": 200100104,
        "sender_full_name": "matklad",
        "timestamp": 1591624461
    },
    {
        "content": "<p>When you type something yourself, you are forced to consciously think about it. When you read a commit you might just skim it without paying too much attention to the actual changes.</p>",
        "id": 200101626,
        "sender_full_name": "bjorn3",
        "timestamp": 1591625115
    },
    {
        "content": "<p>I'd go for code snippet suggestions in PR itself. Pushing directly to PR branch you don't leave space for objections</p>",
        "id": 200311870,
        "sender_full_name": "std::Veetaha",
        "timestamp": 1591753367
    },
    {
        "content": "<p>Code snippets are nice but I find that I'm tempted to make suggestions without testing them</p>",
        "id": 200311942,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1591753498
    },
    {
        "content": "<p>which I guess could be good pedagogically <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span> but also means I could suggest something that fundamentally doesn't work</p>",
        "id": 200311953,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1591753520
    }
]