[
    {
        "content": "<p>hi</p>",
        "id": 159814259,
        "sender_full_name": "matklad",
        "timestamp": 1551560034
    },
    {
        "content": "<p>hi! <br>\nOkay so digging into this genericparams thing. I think we need to improve the id we return in <code>Resolution::GenericParam(u32)</code>because it returns the index at _some_ unknown scope. which seems not what we want</p>",
        "id": 159868730,
        "sender_full_name": "John Renner",
        "timestamp": 1551653766
    },
    {
        "content": "<p>Hm, I think keeping it just <code>u32</code> should be fine, <em>but</em> we need to change the <code>Resolver</code> to return the generic scope as well</p>",
        "id": 159892984,
        "sender_full_name": "matklad",
        "timestamp": 1551685070
    },
    {
        "content": "<p>Like, the <code>ExprId</code> is also just an <code>u32</code>, but the resolver has a <code>body</code> method whihc returns the relevant scope</p>",
        "id": 159893040,
        "sender_full_name": "matklad",
        "timestamp": 1551685103
    },
    {
        "content": "<p>so, we can add <code>.generics</code> method to resolver, which adds info about generics</p>",
        "id": 159893046,
        "sender_full_name": "matklad",
        "timestamp": 1551685127
    },
    {
        "content": "<p>That makes sense. I'll get cracking on that. Just a question, while we're at it, why not make body and generics part of the <code>Resolution::{LocalBinding, Generic}</code>. It seems odd that they methods are so linked to the specific resolver states, but not exposed that way.</p>",
        "id": 160253452,
        "sender_full_name": "John Renner",
        "timestamp": 1552006598
    },
    {
        "content": "<p>That won't work automatically: you'll have to add lifetime parameters or add Arcs.... But in general this seems like a good idea: keep <code>LocalBindint</code> <em>private</em> to the hir crate and make a higher-level API on top of that for IDEs, sort-of like stuff in <code>code_model</code> works</p>",
        "id": 160268838,
        "sender_full_name": "matklad",
        "timestamp": 1552029020
    },
    {
        "content": "<p>hm, I think if we use code-model pattern exactly, we'll get something like this</p>",
        "id": 160268843,
        "sender_full_name": "matklad",
        "timestamp": 1552029053
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span>pub struct LocalBinding {\n    pat: PatId\n}\n\nimpl LocalBinding {\n     pub fn syntax(self, resolver: &amp;Resolver) -&gt; TreeArc&lt;SyntaxPtr&gt; {\n        resolver.body.source_map().pat_synax(self.id)\n     }\n}\n\nimpl Resolver {\n   /*private*/ fn body()....\n}\n</pre></div>",
        "id": 160268909,
        "sender_full_name": "matklad",
        "timestamp": 1552029213
    },
    {
        "content": "<p>That's a bit better, but it still has this property that you need to call <code>LocalBinding::syntax</code> with the same <code>Resolver</code> that produced it, otherwise you could get nonsense results.</p>",
        "id": 160321874,
        "sender_full_name": "John Renner",
        "timestamp": 1552076280
    },
    {
        "content": "<p>Though on further reflection, I'm not sure exactly what we could do better. Maybe debug asserts that they match? but anyway this is a bit of a rabbit-hole. I think the code-model pattern makes a good deal of sense</p>",
        "id": 160324917,
        "sender_full_name": "John Renner",
        "timestamp": 1552078627
    },
    {
        "content": "<p>Okay more digging leads me to think that generalizing Body and BodySourceMap structure may be beneficial here, because ultimately the types all work the same way, they're just constructed differently on a per item basis. Is the underlying id for PatId, ExprId, ImplId, etc. guaranteed to be unique? That is, could we unify them with a <code>EntityId</code>or some such thing so that we could store them in a single map? Cuz then we could provide methods to query for the specific <code>ast::</code> node you're looking for.</p>",
        "id": 160333695,
        "sender_full_name": "John Renner",
        "timestamp": 1552085346
    },
    {
        "content": "<p>I think that long-term we do want to generalize this source-map pattern, but I am not sure it's best to do it right now. I think haven't got enough experience using them, so we are at risk of extracting a wrong abstraction .</p>\n<p>Similarly, I feel uneasy about generic <code>EntityId</code> : it is possible, but we'll lose some type-safety that way. I would lean towards a type-safe trait-based solution, like <code>AstItemDef</code></p>",
        "id": 160371184,
        "sender_full_name": "matklad",
        "timestamp": 1552144320
    }
]