[
    {
        "content": "<p>I'm pretty sure this is nontrivial, but does anyone have a good intuition about how hard it would be to save out the salsa db to some binary format in order to make starting ra faster? My thought was that you save the db + vfs contents, and then do a diff on startup to detect changes from disk and apply them to the vfs.</p>\n<p>Also open to comments like \"This is completely misguided because X\"</p>",
        "id": 250642098,
        "sender_full_name": "Josh Kuhn",
        "timestamp": 1629908120
    },
    {
        "content": "<p>I guess you've seen <a href=\"https://github.com/rust-analyzer/rust-analyzer/issues/4712\">https://github.com/rust-analyzer/rust-analyzer/issues/4712</a>?</p>",
        "id": 250642412,
        "sender_full_name": "Laurențiu",
        "timestamp": 1629908242
    },
    {
        "content": "<p>I don't think there's been any work in that direction, so the answer is probably \"we're not sure yet\"</p>",
        "id": 250642565,
        "sender_full_name": "Laurențiu",
        "timestamp": 1629908298
    },
    {
        "content": "<p>In parcitular, see <a href=\"https://github.com/rust-analyzer/rust-analyzer/issues/4712#issuecomment-899411567\">https://github.com/rust-analyzer/rust-analyzer/issues/4712#issuecomment-899411567</a> -- I think the best way to approach this is by not adding caching to the DB, but allowing the build system to supply ra with some sort of precompiled artifacts.</p>",
        "id": 250642712,
        "sender_full_name": "matklad",
        "timestamp": 1629908363
    },
    {
        "content": "<p>Practically, I'd expect the biggest shoudt term win would be from salsa parallelisation</p>",
        "id": 250642772,
        "sender_full_name": "matklad",
        "timestamp": 1629908388
    },
    {
        "content": "<p>Doh. I just searched zulip, I should have searched github too.<br>\nOk, but this is exactly the kind of context I was hoping for. Thanks</p>",
        "id": 250642988,
        "sender_full_name": "Josh Kuhn",
        "timestamp": 1629908473
    },
    {
        "content": "<p>But we can't get out of the build system a lot of the things we want in the IDE</p>",
        "id": 250643135,
        "sender_full_name": "Laurențiu",
        "timestamp": 1629908549
    },
    {
        "content": "<p>I mean, build system can run <code>rust-analyzer</code> with some special flags. I guess, by build system I mean \"that which computes some data on a different machine and downloads it locally\", I am eyeing the discributed case in particular. We shouldn't make cache local to machine</p>",
        "id": 250643448,
        "sender_full_name": "matklad",
        "timestamp": 1629908662
    },
    {
        "content": "<p>It sounds like a big can of worms. Sure, we could get stuff out of <code>rlib</code>s, but between <code>#[cfg]</code>, non-published code and not being necessarily easy to add stuff to <code>rustc</code>, that's pretty far away.</p>",
        "id": 250644165,
        "sender_full_name": "Laurențiu",
        "timestamp": 1629909056
    },
    {
        "content": "<p>In the meanwhile, if we could dump (store?) the <code>salsa</code> database to disk, that would help with both load times and memory usage on large workspaces, with only some intrusive <code>salsa</code> changes and having to double-check that nothing has changed while we weren't running.</p>",
        "id": 250644419,
        "sender_full_name": "Laurențiu",
        "timestamp": 1629909186
    },
    {
        "content": "<p>We won't be using <code>rustc</code>, we would be using <code>rust-analyzer</code>. Silimarly, we won't be using rlibs, but ra-specific format. But what we will do is allowing to, eg, distribute \"prealanized\" caches for <a href=\"http://crates.io\">crates.io</a> crates and such.</p>",
        "id": 250644437,
        "sender_full_name": "matklad",
        "timestamp": 1629909196
    },
    {
        "content": "<p>Not to say that it's easy :)</p>",
        "id": 250644484,
        "sender_full_name": "matklad",
        "timestamp": 1629909220
    },
    {
        "content": "<p>If we can upload analysis info to <a href=\"http://crates.io\">crates.io</a> we could also store it locally, so that's a logical first step in that direction</p>",
        "id": 250644581,
        "sender_full_name": "Laurențiu",
        "timestamp": 1629909253
    }
]