[
    {
        "content": "<p>So I decided to give VScode + RA a try and it felt really great compared to VSCode + RLS for <code>rustc</code> but there was an issue which made RA unusable...</p>\n<p>...You see I used a Windows 10 laptop for VSCode + RA but the files I edit are on a mapped network share through samba on an Ubuntu Server. </p>\n<p>Strangely, when I use RA on VSCode with this setup the files become unreachable on VSCode but also via File Explorer on Windows itself. If I then close VSCode the issue disappears and I can use the mapped share again through File Explorer.</p>\n<p>This setup has worked fine using VSCode + the RLS extension...</p>\n<p>Maybe this is a latency issue and RA is maybe constantly checking files? But it seems strange that this should be an issue since the server is in the local network and connected with 1gbps cat6.. maybe it's a samba issue? I'm trying to install RA on VSCode remote to see if I can get rid of the issue that way...</p>",
        "id": 169746256,
        "sender_full_name": "centril",
        "timestamp": 1562377802
    },
    {
        "content": "<p>So I tried sshfs instead and the issue just went away seemingly</p>",
        "id": 169748003,
        "sender_full_name": "centril",
        "timestamp": 1562380858
    },
    {
        "content": "<p>So this might be a samba issue indeed</p>",
        "id": 169748010,
        "sender_full_name": "centril",
        "timestamp": 1562380877
    },
    {
        "content": "<p>It seems like notify falls back to polling on samba: <a href=\"https://github.com/passcod/notify/issues/64\" target=\"_blank\" title=\"https://github.com/passcod/notify/issues/64\">https://github.com/passcod/notify/issues/64</a></p>",
        "id": 169752987,
        "sender_full_name": "matklad",
        "timestamp": 1562390835
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"133169\">@matklad</span> ah; should I/you file an issue somewhere (RA repo, notify... (tho you know the notify stuff better))</p>",
        "id": 169766621,
        "sender_full_name": "centril",
        "timestamp": 1562418528
    },
    {
        "content": "<p>I'd say the issue won't be too actionable, because we are in the \"we'll rewrite this anyway soon\" state. I think we need to wait and see how notify story unfolds: they are in the process of big rewrite which might completely change the set of bugs</p>",
        "id": 169769320,
        "sender_full_name": "matklad",
        "timestamp": 1562423555
    },
    {
        "content": "<p>Ah; I'll use sshfs for now then <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 169773451,
        "sender_full_name": "centril",
        "timestamp": 1562431012
    }
]