[
    {
        "content": "<p>(Maybe here?) Given there's a lot going on with VSCode is there a place where people can discuss vscode rust issues and solutions and what the status quo is?<br>\nThat is RA + ecosystem of extensions that (could) work with it.</p>",
        "id": 188479811,
        "sender_full_name": "Giles Cope",
        "timestamp": 1582052096
    },
    {
        "content": "<p>For example the rust test explorer extension seems in need of friends to help out issues on it. The debug button says implement me when you click it.</p>",
        "id": 188480029,
        "sender_full_name": "Giles Cope",
        "timestamp": 1582052223
    },
    {
        "content": "<p>I think the code in rust test lens extension probably is what's needed in this case.</p>",
        "id": 188480071,
        "sender_full_name": "Giles Cope",
        "timestamp": 1582052260
    },
    {
        "content": "<p>Anyway I figured I probably am not alone in trying to engineer a best of class IDE experience for rust using VSCode, so I thought I'd find some friends going on the same journey.</p>",
        "id": 188480164,
        "sender_full_name": "Giles Cope",
        "timestamp": 1582052334
    },
    {
        "content": "<p>You can see what I've been piecing together - in vscode there's a rust-in-peace extension bundle that tries to pull some of the threads together.</p>",
        "id": 188480415,
        "sender_full_name": "Giles Cope",
        "timestamp": 1582052488
    },
    {
        "content": "<p>I am new to using rust-analyzer on vscode, but I noticed it is not detecting crates that are in my computer, any crate marked with <code>crate = {\"../path/to/crate\"}</code> result in an error. Is there a way to enable detection of paths by rust-analyzer on vscode or is this a bug?</p>",
        "id": 188805003,
        "sender_full_name": "Charles Chege",
        "timestamp": 1582356925
    },
    {
        "content": "<p>I think it's a limitation of the current implementation. If should work if you use a cargo workspace and place those crates inside it.</p>",
        "id": 188809952,
        "sender_full_name": "Laurențiu",
        "timestamp": 1582365577
    }
]