[
    {
        "content": "<p>Hi all, after reading about the current Cast Of Characters, I'm wondering if there's room for another character.  working name:  Tony the thread user</p>\n<p>This character is based heavily on my own personal experiences.  </p>\n<p>Tony is an experienced developer (using rust and other languages), and is most comfortable using OS threads for any asynchronous or concurrent programming tasks.  In particular, he likes using rust for this, as the Send/Sync types plus the built-in channels and mutexes make it very easy to write correct concurrent code.  <br>\nThis is working well for Tony, but Tony is wondering if there are any advantages to switching to an \"async\" programming model.  Would writing in async be more efficient or elegant, or make is easier to integrate with 3rd party async libraries?  In general, code readability and maintenance are more important to Tony than runtime performance.</p>\n<p>This character is most closely aligned with the already existing character of Barbara (except that Tony doesn't have the async experience that Barbara does)</p>\n<p>The types of projects that Tony might work on are things like:  an interactive application that needs to wait for input from a user's keyboard, wait for events from the network, wait for timers, etc (all of which can happen concurrently)</p>",
        "id": 231028430,
        "sender_full_name": "Andrew Chin (eminence)",
        "timestamp": 1616163147
    },
    {
        "content": "<p>My story also wasn't compatible with Barbara already having async experience, but I just ended up writing my story as if it took place when Barbara was first getting started with async.</p>",
        "id": 231028820,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1616163327
    },
    {
        "content": "<p>Ah, good thought.  Perhaps I should have attached my comment to your PR</p>",
        "id": 231029740,
        "sender_full_name": "Andrew Chin (eminence)",
        "timestamp": 1616163679
    },
    {
        "content": "<p>We can start with Barbara and go from there. This could be interesting for this as well: <a href=\"https://github.com/rust-lang/wg-async-foundations/issues/58\">https://github.com/rust-lang/wg-async-foundations/issues/58</a></p>",
        "id": 231030881,
        "sender_full_name": "rylev",
        "timestamp": 1616164111
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222286\">@Andrew Chin</span> in <a href=\"https://github.com/rust-lang/wg-async-foundations/issues/58#issuecomment-802881393\">this comment</a>, I proposed adding some 'non-async projects' (and adding a FAQ about how Shiny Future ideas affect them)</p>",
        "id": 231056399,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1616173464
    },
    {
        "content": "<p>the characters are not about what people are building, they're about the languages people know and the experiences they bring to bear</p>",
        "id": 231056465,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1616173492
    },
    {
        "content": "<p>Indeed.  I didn't mean for this hypothetic new character to be defined by their projects.  I was defining this \"Tony\" character has someone who has experiences with thread-based concurrent processing, but don't know if/how to transition to async for concurrent processing.    As @rylev and <span class=\"user-mention\" data-user-id=\"398861\">@Frederik Baetens</span> have said, perhaps this character is simply a variation on Barbara</p>",
        "id": 231057059,
        "sender_full_name": "Andrew Chin (eminence)",
        "timestamp": 1616173718
    },
    {
        "content": "<p>Yeah, I think that's ok</p>",
        "id": 231057288,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1616173809
    },
    {
        "content": "<p>Let's try it anyway</p>",
        "id": 231057295,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1616173812
    }
]