[
    {
        "content": "<p>At the moment the compiler encodes the <code>file:line</code> of <code>.await</code>s in debuginfo as  DW_AT_decl_file/ DW_AT_decl_line attributes of the DW_TAG_member representing the corresponding generator state. However, so far I found no way to actually access this information in a debugger. The extension APIs of GDB, LLDB, and WinDbg don't seem to expose this. <span class=\"user-mention\" data-user-id=\"116883\">@tmandry</span>, do you know if this is actively used somewhere?</p>\n<p>It would be really nice to be able to see where in the code a given async fn is suspended :)</p>",
        "id": 275372810,
        "sender_full_name": "mw",
        "timestamp": 1647351081
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"124287\">@mw</span> I don't know of anywhere it's actively used. I was hoping to have this prototyped in the fuchsia debugger but it never happened</p>",
        "id": 275609962,
        "sender_full_name": "tmandry",
        "timestamp": 1647496246
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"116883\">@tmandry</span>!</p>\n<p>I'm wondering how to best make this info available in all debuggers. How it's done currently looks like a clean solution to me -- but that doesn't help us if we can't get at the information <code>:)</code></p>\n<p>The simplest way to do it might be to add an artificial field to the state struct description, the name of which encodes the info. </p>\n<p>Another way would be to add an artifical type definition that has such a field for each state. That might be better because otherwise that weird artificial field would show up when looking at generators in the debugger. The only potential problem I see with that is that the linker or some other step would prune that debuginfo because it thinks it's unused. I'll experiment with that.</p>",
        "id": 275628030,
        "sender_full_name": "mw",
        "timestamp": 1647510779
    },
    {
        "content": "<p>The artificial type approach sounds good. You could link to it with an artificial field from the original type to prevent it from being pruned. That field would still show up but it would be a mundane name like <code>_dbginfo</code> instead of a bunch of gobbledegook</p>",
        "id": 275686321,
        "sender_full_name": "tmandry",
        "timestamp": 1647534826
    },
    {
        "content": "<p>and you could potentially hide the field with plugins</p>",
        "id": 275686455,
        "sender_full_name": "tmandry",
        "timestamp": 1647534845
    }
]