[
    {
        "content": "<p>OK, I did some investigation (<a href=\"https://github.com/rust-lang/rust/issues/57017#issuecomment-540023781\" target=\"_blank\" title=\"https://github.com/rust-lang/rust/issues/57017#issuecomment-540023781\">comment</a>) into what it would take to get more precise \"auto traits\" for generators. The short version is that it is non-trivial to do. </p>\n<p>A couple of thoughts:</p>\n<ul>\n<li>I'm tempted to create a fresh \"tracking issue\" for this problem and to start closing existing issues like <a href=\"https://github.com/rust-lang/rust/issues/57017\" target=\"_blank\" title=\"https://github.com/rust-lang/rust/issues/57017\">#57017</a>, while collecting their examples. I just find it annoying when the issue for a fairly general problem begins with a discussion of narrow specifics.</li>\n<li>I feel like we should be collecting notes about how generators are implemented and in particular the queries they invoke and when, as it currently requires a kind of \"deep dive\" into the code. The goal would be to be drafting a rustc-guide chapter, in short, but also to help visualize new designs. To me this feels like prime material for a \"async-foundations\" tracking repository. I am tempted to create one. It's a bit of a ret-con but that's ok.</li>\n<li>It's not going to be <em>trivial</em> to first build the MIR. It doesn't strike me as <em>impossible</em> though, it'll just require some careful thought -- for example, we might be able to build the MIR for internal generators before completing the outer function if we reshuffle the current setup somewhat.</li>\n</ul>",
        "id": 177718753,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1570631245
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"125294\">@Aaron Hill</span> -- do you think we could schedule a time next week to sync chat about your plans? I'd like to understand better what you have in mind! I see you've been doing a lot here</p>",
        "id": 179078018,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1572029124
    },
    {
        "content": "<p>( Maybe we can also loop in <span class=\"user-mention\" data-user-id=\"116466\">@Zoxc</span> )</p>",
        "id": 179078159,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1572029213
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> Sorry - looks like this was another message that I missed. Let me know when a good time would be for you.</p>",
        "id": 179093808,
        "sender_full_name": "Aaron Hill",
        "timestamp": 1572041877
    },
    {
        "content": "<p>I would also like to be looped in, it seems to me that Ralf, eddyb et. al should also be</p>",
        "id": 179127280,
        "sender_full_name": "centril",
        "timestamp": 1572098745
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"125294\">@Aaron Hill</span> </p>\n<blockquote>\n<p>Sorry - looks like this was another message that I missed. Let me know when a good time would be for you.</p>\n</blockquote>\n<p>A good question! I was going to suggest maybe tomorrow morning (boston time), but I had some last minute meetings get scheduled, so I'm not sure how available I am then. There might be time on Friday, but maybe it's easiest if I just create a doodle.</p>",
        "id": 179351803,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1572369440
    },
    {
        "content": "<p>A doodle sounds good to me. I'll be available Friday afternoon</p>",
        "id": 179352550,
        "sender_full_name": "Aaron Hill",
        "timestamp": 1572369945
    }
]