[
    {
        "content": "<p>I was just reading some of the <a href=\"https://cs.github.com/rust-lang/rust/blob/e646f3d2a9541952310778288854943678738ea9/compiler/rustc_mir_transform/src/generator.rs?q=locals_live_across_suspend_points++#L512\">generator MIR generation code</a> and I noticed we have a concept of movable generators. Does anyone have an example of how to make a non-movable generator?</p>",
        "id": 272193644,
        "sender_full_name": "eholk",
        "timestamp": 1645053605
    },
    {
        "content": "<p>Apparently all <code>async fn</code>s make a movable generator, which is odd to me given that in order to poll the generator you have to pin it first, making it not movable.</p>",
        "id": 272193680,
        "sender_full_name": "eholk",
        "timestamp": 1645053649
    },
    {
        "content": "<p>Oh, I would have imagined it to be the other way around: <code>async fn</code> are generators which are allowed not to be <code>Unpin</code>, and thus have local borrows cross <code>yield</code> / <code>await</code> points, thus acting like a <code>static |_| ...</code> generator. And a generator without the <code>static</code> would not allow borrows to cross <code>yield</code> points, since in order to be moveable it would have to be <code>Unpin</code>.</p>",
        "id": 272196199,
        "sender_full_name": "Daniel Henry-Mantilla",
        "timestamp": 1645055584
    },
    {
        "content": "<p>Oh, maybe movable in the context of MIR generation is sort of dual to what I'm thinking. In MIR generation, I guess movable means \"we've determined this is safe to move\" which means \"this generator doesn't have any borrows that cross await points.\"</p>",
        "id": 272197648,
        "sender_full_name": "eholk",
        "timestamp": 1645056556
    },
    {
        "content": "<p>I think the actual problem is that <code>MaybeBorrowedLocals</code> is too coarse. The logic I linked there seems correct (you have to consider borrows because there might be live borrows because the generator is not movable), but it seems like <code>MaybeBorrowedLocals</code> is considering too many things borrowed.</p>",
        "id": 272198154,
        "sender_full_name": "eholk",
        "timestamp": 1645056955
    }
]