[
    {
        "content": "<p>I'm curious how possible it is to create a single-threaded runtime and what the options are there. <code>Waker</code> requires being <code>Send</code> and <code>Sync</code> which seems to have some knock-on effects on what a task has to look like in terms of synchronization. I'm interested in using Rust where I want the safety of ownership and the ergonomics of async/await but without the cost of sync primitives. Any ideas/experiences?</p>",
        "id": 210130785,
        "sender_full_name": "Ahmed Charles",
        "timestamp": 1600177414
    },
    {
        "content": "<p>Sorry for late reply. I've been thinking about this problem too. You are correct that Waker is Send and Sync and thus must use sync primitives and a notification mechanism if it is to be woken up by another thread. You can still write a true single-threaded executor without it, but then the waker can't be safely transferred to another thread.</p>\n<p>Theoretically you could make a hybrid model where you use a thread id to invoke a fast path, and the more expensive path when on a different thread. However, you still have to pay the price of atomics in Arc::clone when the waker is cloned.</p>",
        "id": 213347222,
        "sender_full_name": "Didrik Nordstrom",
        "timestamp": 1602708103
    },
    {
        "content": "<p>Another option is to panic if called from a different thread, if you want to build confidence that none of the futures on your path are leaking the waker to another thread.</p>",
        "id": 213347687,
        "sender_full_name": "Didrik Nordstrom",
        "timestamp": 1602708174
    },
    {
        "content": "<p>A third option that I've considered is to write a single-threaded version of <code>std</code> where you replace atomic::* with regular non-atomic operations, as well as panic in <code>thread::spawn</code>. That way you could reuse a lot of the eco-system without rewriting all the !Send types (there are a lot of them and many don't have !Send equivalents).</p>",
        "id": 213347926,
        "sender_full_name": "Didrik Nordstrom",
        "timestamp": 1602708321
    },
    {
        "content": "<p>There was a workaround provided in the waker RFC, and it uses a thread_local with slots. Not sure what the performance is at with that.</p>",
        "id": 213349888,
        "sender_full_name": "Lucio Franco",
        "timestamp": 1602709167
    },
    {
        "content": "<p>raw thread locals are generally pretty fast, you calculate their address using an offset from a register whose value is different in each thread.</p>",
        "id": 213378345,
        "sender_full_name": "tmandry",
        "timestamp": 1602734431
    },
    {
        "content": "<p>(this is probably quite architecture specific, but that's how it works on x64 and I think arm64)</p>",
        "id": 213378357,
        "sender_full_name": "tmandry",
        "timestamp": 1602734454
    },
    {
        "content": "<p>I think I commented back on the original RFC about this topic, and about lots of the possibilities that <span class=\"user-mention\" data-user-id=\"137147\">@Didrik Nordstrom</span> mentions here.<br>\nI'm too lazy to look it up right now. But afaik there were some issues with those fast-path, and the \"workaround\" didn't really work.</p>\n<p>A rough remembering I have is that something didn't work because we really required 2 pointers (1 for the task ID and one for something else - maybe the pointer to the executor or a thread ID?), while the <code>Waker</code> only allows to store a single one. Plus something else.<br>\nI would have to think about it again, but right now I deprioritized it and live with the what we have.</p>\n<blockquote>\n<p>A third option that I've considered is to write a single-threaded version of std where you replace atomic::* with regular non-atomic operations, as well as panic in thread::spawn.</p>\n</blockquote>\n<p>Sounds like Webassembly :) But now even that is getting threads.<br>\nAnyway, going that route will be rather painful because you will lose most of the ecosystem. And not only the async one, but also the general Rust one which typically assumes <code>std</code> and threads are available.</p>",
        "id": 214012425,
        "sender_full_name": "Matthias247",
        "timestamp": 1603262038
    },
    {
        "content": "<p>Ok, that as the RFC: <a href=\"https://github.com/rust-lang/rfcs/blob/master/text/2592-futures.md#rationale-drawbacks-and-alternatives-to-the-wakeup-design-waker\">https://github.com/rust-lang/rfcs/blob/master/text/2592-futures.md#rationale-drawbacks-and-alternatives-to-the-wakeup-design-waker</a></p>\n<p>Something on top of my head: This will work, but require a global executor. If you want more than one instance (e.g. just for testing), you run into some additional challenges. Now you need to identify the executor instance. You could try to use the pointer in the <code>Waker</code> for that, but that means the access of that information needs to be thread-safe. E.g. if the <code>Waker</code> holds a reference count to the executor, then this one again needs to be atomic, since the <code>Waker</code> could be sent at any time to a different thread. This is something we wanted to avoid.</p>\n<p>I think another idea that as in the room was to store a mixture of a task ID and a global executor ID in the <code>Waker</code>. <br>\nBut now generating those IDs without conflicts is a new challenge.</p>",
        "id": 214012946,
        "sender_full_name": "Matthias247",
        "timestamp": 1603262617
    },
    {
        "content": "<p>Is there a library that actually implements this sort of runtime?</p>",
        "id": 214675756,
        "sender_full_name": "Ahmed Charles",
        "timestamp": 1603790378
    }
]