[
    {
        "content": "<p>Does anyone have a writeup about the issues we face when attempting to implement async scopes today? I've seen folks assert that: \"unless we can disallow futures from being cancelled, async scopes cannot be implemetned\", and \"it's unlikely we can have multi-threaded scopes at all, only single-threaded scopes\". This comes up relatively frequently, and though I trust that these assertions are well-informed, I do not feel it's well-documented yet.</p>\n<p>I'd like to better understand which challenges people see, and explainers of how they work. I was wondering if anyone has / is planning to expand on this. It doesn't need to be long, but without it I find it difficult to meaningfully engage in any conversation that covers async scopes.</p>\n<p>If nobody's planning has / is planning to write about it, I'd be happy to volunteer. But because it sounds like others have thought this through already, I figured I'd ask first.</p>",
        "id": 272106960,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1645013086
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> was looking at this, he probably has a half-written blog post draft :-)</p>",
        "id": 272107086,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1645013165
    },
    {
        "content": "<p>Neat! -- oh, also happy to proof read any early drafts if that's helpful for folks</p>",
        "id": 272107294,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1645013294
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"211722\">@Yoshua Wuyts [he/they]</span> Not sure if it's completely related, but there's ongoing discussion on scoped threads and some problems related to the enclosing scope lifetime (and maybe that's what happens also for async scopes). There's this comment by <span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> on the details <a href=\"https://github.com/rust-lang/rust/issues/93203#issuecomment-1040720703\">https://github.com/rust-lang/rust/issues/93203#issuecomment-1040720703</a></p>",
        "id": 272111587,
        "sender_full_name": "pachi",
        "timestamp": 1645016074
    },
    {
        "content": "<p>Thanks, yes that definitely seems useful!</p>",
        "id": 272111695,
        "sender_full_name": "Yoshua Wuyts [he/they]",
        "timestamp": 1645016159
    },
    {
        "content": "<p>I don't have a half-written blog post but I will write one! I've definitely thought a lot about it</p>",
        "id": 272289525,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1645117381
    },
    {
        "content": "<p>Oh I would be extremely interested in this as well, I am in the \"unless we can disallow futures from being cancelled, async scopes cannot be implemetned\" camp but I could be wrong</p>",
        "id": 272293644,
        "sender_full_name": "Gus Wynn",
        "timestamp": 1645118862
    },
    {
        "content": "<p>No summary, but <a href=\"https://github.com/tokio-rs/tokio/issues/1879\">https://github.com/tokio-rs/tokio/issues/1879</a> was the initial exploration of async scopes, which yielded the knowledge that they are not possible with borrowing anything from the parent task at the moment - and even are not without challenges without allowing to borrow - which is why this never landed anywhere.</p>",
        "id": 272563684,
        "sender_full_name": "Matthias247",
        "timestamp": 1645329637
    }
]