[
    {
        "content": "<p>But in general, a processor that can e.g. run v2 code <strong>may</strong> sigill on higher feature levels, it's not guaranteed for or against. In explicit SIMD code you can safely (well, <code>unsafe</code>, actually...) assume it will in fact hit something that causes a sigill though.</p>",
        "id": 277551702,
        "sender_full_name": "Jubilee",
        "timestamp": 1648933646
    },
    {
        "content": "<p>It also should be noted: compiler flags are essentially like <code>unsafe</code> code. This goes double for ones that alter the ISA features in play. They allow rustc to emit code that is actually architecturally UB to run on your computer. Rust is not responsible for what you do with that binary, only for making sure the binary itself is correct.</p>",
        "id": 277551929,
        "sender_full_name": "Jubilee",
        "timestamp": 1648933879
    },
    {
        "content": "<p>there's an unfortunate 7% gap in the Steam Hardware Survey where folks have AVX but not AVX2 (though it goes down every so often)</p>",
        "id": 277580360,
        "sender_full_name": "Lokathor",
        "timestamp": 1648965610
    },
    {
        "content": "<p>What's the main difference between them?  A quick scan suggests AVX is more floating point, AVX2 is more integers?</p>",
        "id": 277581237,
        "sender_full_name": "scottmcm",
        "timestamp": 1648966121
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"125270\">scottmcm</span> <a href=\"#narrow/stream/257879-project-portable-simd/topic/-Ctarget-cpu.20and.20such/near/277581237\">said</a>:</p>\n<blockquote>\n<p>What's the main difference between them?  A quick scan suggests AVX is more floating point, AVX2 is more integers?</p>\n</blockquote>\n<p>AVX introduces the VEX encoding scheme, 256-bit vectors, and partial permutes.<br>\nAVX2 introduces what are called \"lane-crossing\" shuffles.</p>\n<p>That is, AVX instructions tend to rearrange data in a way that looks like \"two SSE2 registers side to side\", whereas only AVX2 has the \"swizzle everything mostly freely\" instructions.</p>",
        "id": 277590435,
        "sender_full_name": "Jubilee",
        "timestamp": 1648971326
    }
]