[
    {
        "content": "<p>Vector permutations seem to be where arches go all-out in having very specific versions of these, for instance PowerISA's dynamic byte permutation:</p>\n<blockquote>\n<p>Version 3.0 B Power ISA™<br>\n6.8.4<br>\nVector Permute Instruction<br>\nThe Vector Permute instruction allows any byte in two source Vector Registers to be copied to any byte in the target Vector Register. The bytes in a third source Vector Register specify from which byte in the first two source Vector Registers the  corresponding  target  byte  is  to  be  copied.  The  contents  of  the  third  source  Vector  Register are sometimes referred to as the “permute control vector”.</p>\n</blockquote>",
        "id": 212598357,
        "sender_full_name": "Jubilee",
        "timestamp": 1602094721
    },
    {
        "content": "<p>And Neon's TBL/TBX accepting 1-4 vectors and an index:</p>\n<blockquote>\n<p>VTBL, VTBX: Table and Table Extend</p>\n<p>VTBL constructs a new vector from a table of vectors and an index vector. It is a byte-wise table lookup operation.</p>\n<p>The table consists of one to four adjacent D registers. Each byte in the index vector is used to index a byte in the table of vectors. The indexed value is inserted into the result vector at the position corresponding to the location of the original index in the index vector.</p>\n</blockquote>\n<p><a href=\"/user_uploads/4715/aY_GysqA8ENtLi_p4J44Ngow/tbl.png\">tbl.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/4715/aY_GysqA8ENtLi_p4J44Ngow/tbl.png\" title=\"tbl.png\"><img src=\"/user_uploads/4715/aY_GysqA8ENtLi_p4J44Ngow/tbl.png\"></a></div>",
        "id": 212599100,
        "sender_full_name": "Jubilee",
        "timestamp": 1602095073
    },
    {
        "content": "<p>yeah. AMD tried to add that kind of powerful permute (<code>vpperm</code>) instruction in (what would have been) SSE5. it was supported (part of the XOP isa) for a while but intel never implemented it so they gave up it's not in new AMD chips</p>",
        "id": 212601115,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1602095986
    },
    {
        "content": "<p>alas. RIP SSE5.</p>",
        "id": 212601258,
        "sender_full_name": "Jubilee",
        "timestamp": 1602096046
    },
    {
        "content": "<p>I think MIPS has a permute like that too</p>",
        "id": 212601377,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1602096111
    },
    {
        "content": "<p>that said i think this sort of operation fits pretty well for leveraging the compiler at least.</p>",
        "id": 212601525,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1602096172
    },
    {
        "content": "<p>s390x has the same permute as PowerISA/Altivec</p>",
        "id": 212685406,
        "sender_full_name": "Jonathan Bradbury",
        "timestamp": 1602162209
    },
    {
        "content": "<p>Oh cool! I didn't actually know that s390x has a vector ISA. Is it just part of the core ISA, and not a distinct feature?</p>",
        "id": 212728831,
        "sender_full_name": "Jubilee",
        "timestamp": 1602180582
    },
    {
        "content": "<p>It is now part of the base ISA as of z13.  Back in the 90's there was an old optional vector processor on the mainframe but that was more traditional Cray like vectors.   The latest z15 ISA documentation can be obtained here: <a href=\"http://publibfp.dhe.ibm.com/epubs/pdf/a227832c.pdf\">http://publibfp.dhe.ibm.com/epubs/pdf/a227832c.pdf</a>   (See chapters 21-25)</p>",
        "id": 213940140,
        "sender_full_name": "Jonathan Bradbury",
        "timestamp": 1603209592
    }
]