[
    {
        "content": "<p>So I can't find it right now but I noticed someone say something while I was skimming the Internet for things, saying something like \"well, that ARM intrinsic that manipulates an int32x4_t doesn't have a repr equivalent to int32_t[4], it has a repr equivalent to whatever such a thing looks like after being dropped on the stack by the vector instruction.\" My first response was \"well, that's nonsense.\"</p>\n<p>But then I thought about it and I could see... kinda? Where such a concern might come from. So, I... highly doubt this is an actual concern even in C code, or even when manipulating the machine with assembly, but I figured I'd ask, since sometimes the answer is \"yes\"... does anyone think that dumping an i32x4 on the stack will be inconsistently represented across machines, or that we will have any kind of other issue in this regard?</p>",
        "id": 213621333,
        "sender_full_name": "Jubilee",
        "timestamp": 1602887695
    },
    {
        "content": "<p>The layout is consistent among a particular architecture, if that's what you mean.  The size is known but the alignment is varying between architectures</p>",
        "id": 213621750,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1602888056
    },
    {
        "content": "<p>LLVM allows (and even recommends in some cases) using bitcast between vectors and arrays</p>",
        "id": 213621777,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1602888103
    },
    {
        "content": "<p>Alright, so bitcasts are fine, and there might be some weird alignment clause that is specifically why repr_simd has that caveat.</p>",
        "id": 213621876,
        "sender_full_name": "Jubilee",
        "timestamp": 1602888199
    },
    {
        "content": "<p>Yep. It also has implications on calling convention</p>",
        "id": 213622014,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1602888320
    },
    {
        "content": "<p>But that's rust specific and I don't know much about that</p>",
        "id": 213622041,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1602888350
    },
    {
        "content": "<p>Mhm.<br>\nBut this does suggest that a naive way to write an SVE-like vector [128bitVector; N] also would have no layout problems, ne? It just needs repr_simd to handle the alignment properly.</p>",
        "id": 213622131,
        "sender_full_name": "Jubilee",
        "timestamp": 1602888414
    },
    {
        "content": "<p>I'm not sure if you can still bitcast it since it's not a sized type, but yeah I would expect it to otherwise act as though it has a particular layout, you just don't know what the layout is at compile time</p>",
        "id": 213622268,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1602888545
    },
    {
        "content": "<p>I definitely think it would be valid to represent it as a slice of arrays</p>",
        "id": 213622303,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1602888581
    },
    {
        "content": "<p>(or slice of i32x4s if that makes sense for some reason?)</p>",
        "id": 213622369,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1602888611
    },
    {
        "content": "<p>OK, cool. It sounds like we might bump into a few oddities here and there but will be overall fine.</p>",
        "id": 213622427,
        "sender_full_name": "Jubilee",
        "timestamp": 1602888673
    },
    {
        "content": "<p>Yeah, I actually think an API for scalable vectors probably isn't too bad</p>",
        "id": 213622459,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1602888710
    },
    {
        "content": "<p>And I think we're good for fixed size. We're already transmuting them in a few places</p>",
        "id": 213622538,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1602888749
    },
    {
        "content": "<p>\"SIMD vectors don't have a specific alignment but can be reliably bitcast\" probably should go in our guide.</p>",
        "id": 213623081,
        "sender_full_name": "Jubilee",
        "timestamp": 1602889278
    },
    {
        "content": "<p>Agreed. More specifically they have a specific alignment but it depends on architecture (and maybe target feature?)</p>",
        "id": 213623165,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1602889383
    },
    {
        "content": "<p>I think just architecture but I'm not positive</p>",
        "id": 213623177,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1602889415
    },
    {
        "content": "<p>\"SIMD vectors have a non-portable alignment :^)\"</p>",
        "id": 213623190,
        "sender_full_name": "Jubilee",
        "timestamp": 1602889434
    },
    {
        "content": "<p>Exactly. I think it's probably perfectly fine to use align_of (I think??)</p>",
        "id": 213623379,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1602889628
    },
    {
        "content": "<p>clearly we should totally suggest that and update the guide when someone breaks their code on that. :^)</p>",
        "id": 213623519,
        "sender_full_name": "Jubilee",
        "timestamp": 1602889791
    },
    {
        "content": "<p>Saying that the layout is always a newtype over an array with potentially-higher alignment makes good sense to me <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 213625198,
        "sender_full_name": "scottmcm",
        "timestamp": 1602892185
    },
    {
        "content": "<p>Could even be <code>AsRef&lt;T&gt;</code>, potentially</p>",
        "id": 213625262,
        "sender_full_name": "scottmcm",
        "timestamp": 1602892225
    },
    {
        "content": "<p>(And safe-transmute will give it <code>TransmuteInto</code> and <code>TransmuteFrom</code> arrays, presumably.)</p>",
        "id": 213625273,
        "sender_full_name": "scottmcm",
        "timestamp": 1602892263
    },
    {
        "content": "<p>specifically, intel vectors are generally aligned to <code>size_of::&lt;VectorType&gt;()</code> while ARM vectors are generally aligned to something <em>less than</em> that value.</p>",
        "id": 213625655,
        "sender_full_name": "Lokathor",
        "timestamp": 1602892797
    },
    {
        "content": "<p>I think that, for consistency, we should make the portable data always have the full align value</p>",
        "id": 213625738,
        "sender_full_name": "Lokathor",
        "timestamp": 1602892878
    },
    {
        "content": "<p>I don't know if repr(simd) currently allows that or not</p>",
        "id": 213625752,
        "sender_full_name": "Lokathor",
        "timestamp": 1602892903
    },
    {
        "content": "<p>That may have weird and unnecessary consequences regarding the larger 512 bit or dynamically sized types, so for now we can coast with the parametric alignment.</p>",
        "id": 213626465,
        "sender_full_name": "Jubilee",
        "timestamp": 1602893937
    },
    {
        "content": "<p>( It does seem desirable tho'. )</p>",
        "id": 213626526,
        "sender_full_name": "Jubilee",
        "timestamp": 1602894007
    },
    {
        "content": "<p>I think a big advantage of the portable stuff would be that it's safe, so it's not obvious to me that the consistent alignment would be particularly important.</p>",
        "id": 213626534,
        "sender_full_name": "scottmcm",
        "timestamp": 1602894051
    },
    {
        "content": "<p>I could also imagine that people might use bigger-than-actually-exist vectors, where going all the way to full alignment would be a waste.</p>",
        "id": 213626678,
        "sender_full_name": "scottmcm",
        "timestamp": 1602894288
    },
    {
        "content": "<p>Or ones with a length of 7.</p>\n<p>I predict the biggest use case for unsafe code with our API is literally \"so, now I want the machine vector back so I can optimize this thing with this one function on Intel\" and in that case they'll be fine since they already know what they want, and mem::align_of seems sound as a starting point.</p>",
        "id": 213626746,
        "sender_full_name": "Jubilee",
        "timestamp": 1602894386
    },
    {
        "content": "<p>Hmm, interesting.  That would mean it should be fully-aligned (up to 512 bits) on intel so that dynamic checks for big vector support could still use it.</p>",
        "id": 213626994,
        "sender_full_name": "scottmcm",
        "timestamp": 1602894749
    },
    {
        "content": "<p>So my desire for the larger alignment is that, i think that an ideal is for the size and alignment to be the same on all platforms. Some platforms have 32-bit integers as align2, but we still don't offer variable alignment int32 in rust. I view this as similar</p>",
        "id": 213629042,
        "sender_full_name": "Lokathor",
        "timestamp": 1602897903
    },
    {
        "content": "<p>that said, it's not strictly necessary, people can use align_of and so on if they must</p>",
        "id": 213629051,
        "sender_full_name": "Lokathor",
        "timestamp": 1602897922
    }
]