[
    {
        "content": "<p>Hello and welcome to <code>std::simd</code>!<br>\nThe main working repo is at <a href=\"https://github.com/rust-lang/stdsimd\">https://github.com/rust-lang/stdsimd</a>, please check it out!</p>\n<p>Zulip is a bit weird. People seem to think there's a super-proper place for things because there are streams and topics. But it's not infinitely nested, and a topic is the last division of meaning. As long as you've made a reasonable effort to find a spot for what you want to talk about, and we're not in the middle of a meeting right then and there, it's fine to make new topics for anything. </p>\n<p>That's why I made this topic: because people sometimes feel awkward about making new topics, especially for introducing themselves, so I figured I'd have one where I explicitly grant permission. You can feel free to introduce yourself in this topic, in <a class=\"stream\" data-stream-id=\"122652\" href=\"/#narrow/stream/122652-new-members\">#new members</a>, or in a new topic, and ask any questions you want wherever seems appropriate.</p>",
        "id": 212120226,
        "sender_full_name": "Jubilee",
        "timestamp": 1601668189
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"344196\">@Jakub Duchniewicz</span> :^)</p>",
        "id": 212120393,
        "sender_full_name": "Jubilee",
        "timestamp": 1601668297
    },
    {
        "content": "<p>Hi, my main area of knowledge is in s390x vector (SIMD) architecture.  For now I am just planning on lurking to see where the design goes.</p>",
        "id": 212677295,
        "sender_full_name": "Jonathan Bradbury",
        "timestamp": 1602157832
    },
    {
        "content": "<p>Hello Jon! Cool! I didn't know that s390x had a vector ISA <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> though it makes sense that it would, being a mainframe and all.</p>",
        "id": 212726659,
        "sender_full_name": "Jubilee",
        "timestamp": 1602179618
    },
    {
        "content": "<p>Hello everyone! I have some SIMD knowledge because once upon a time I made a small proof of concept of implementing some of ispc IR transformation to the Julia IR. I'm really interested in the rust approach and I would like to help, but I'm not sure how! (I have some rust experience, mostly used it for some toy projects on my own and helped with some inner source rust libraries at work)</p>",
        "id": 233283196,
        "sender_full_name": "Marco Concetto Rudilosso",
        "timestamp": 1617697484
    },
    {
        "content": "<p>I've also used packed_simd in a small project I did to pretty much search for characters in a string for fun</p>",
        "id": 233284134,
        "sender_full_name": "Marco Concetto Rudilosso",
        "timestamp": 1617697894
    },
    {
        "content": "<p>Hello!</p>",
        "id": 233401351,
        "sender_full_name": "Jubilee",
        "timestamp": 1617748510
    },
    {
        "content": "<p>Given that our goal has been implementing a Portable SIMD API, until recently we've been mostly trying to figure out what Rust currently <strong>does</strong> for SIMD even when using machine types and work out a first draft API that offers a reasonable abstraction over that.</p>",
        "id": 233735244,
        "sender_full_name": "Jubilee",
        "timestamp": 1617918062
    },
    {
        "content": "<p>Hello all!<br>\nI'm a newish Rust programmer with a Julia background from Mexico. I haven't made time recently to dive back into the project but hope to contribute in the future as well. <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> Big hugs to y'all, great community and hope to be back soon.</p>",
        "id": 233857718,
        "sender_full_name": "Miguel Raz Guzmán Macedo",
        "timestamp": 1617987887
    }
]