[
    {
        "content": "<p>I have been directly approached by Rustaceans who have avowed that they have not much experience with SIMD (implicitly: intrinsics) but <em>are</em> comfortable with Rust and have been informed they are excited about the prospect of portable SIMD types in Rust, so this is probably actually pretty important to get on sooner rather than later.</p>",
        "id": 212788063,
        "sender_full_name": "Jubilee",
        "timestamp": 1602225539
    },
    {
        "content": "<p>You mean like the guide to using/understanding SIMD operations as a whole?</p>",
        "id": 212788259,
        "sender_full_name": "Jakub Duchniewicz",
        "timestamp": 1602225737
    },
    {
        "content": "<p>Or just Rust-SIMD</p>",
        "id": 212788264,
        "sender_full_name": "Jakub Duchniewicz",
        "timestamp": 1602225751
    },
    {
        "content": "<p>there's the start of a guide, but i wasn't sure where to go from there. <span class=\"user-mention\" data-user-id=\"281757\">@Jubilee</span> if people have approached you, then you should ask them what they want to know about :P</p>",
        "id": 212792365,
        "sender_full_name": "Lokathor",
        "timestamp": 1602229496
    },
    {
        "content": "<p>...I don't know if I will get a good answer! But perhaps that uh, makes sense, as a glaringly obvious course of action!</p>",
        "id": 212793530,
        "sender_full_name": "Jubilee",
        "timestamp": 1602230346
    },
    {
        "content": "<p>( that my last two braincells apparently failed to spark the idea to do themselves. &lt;_&lt; )<br>\nWELL</p>",
        "id": 212794104,
        "sender_full_name": "Jubilee",
        "timestamp": 1602230647
    },
    {
        "content": "<p>I'd be interested in a guide :)<br>\nCurrently the only \"guide\" i saw is intel's docs which requires you to guess what will be the name of the function you might need, search for it, read the docs, realize it's not exactly that and keep fuzz searching. (and then hope you did some transmute correct, and try to figure out why the throughput went down)</p>\n<p>Anyway, any kind of rust driven SIMD guide sounds awesome :)</p>",
        "id": 212981253,
        "sender_full_name": "Elichai Turkel",
        "timestamp": 1602449646
    },
    {
        "content": "<p>i can definitely help on one, i also think loka is a good technical writer and we can probably get him to do help too. i think it's early before we hammer the API out though</p>",
        "id": 212981271,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1602449723
    },
    {
        "content": "<p>Lokathor took a first swing at it, indeed!<br>\nAt this early stage I'm more concerned about concept modeling.</p>",
        "id": 213048758,
        "sender_full_name": "Jubilee",
        "timestamp": 1602514558
    },
    {
        "content": "<p>Is the idea to have a reference where you enter a type signature and get visualization of the portable intrinsics that match? (Intel's fuzzy search has been pretty good for me, but largely because I know enough of the mnemonics in the subset of instructions I care about, and type-based search would still be nice.)</p>",
        "id": 213650152,
        "sender_full_name": "Jed",
        "timestamp": 1602938560
    }
]