[
    {
        "content": "<p>So in aarch64 and x86_64, we have real deal IEEE754 floating point numbers afaik. However, in other machines, we don't have such a guarantee, and LLVM implifies a highly... peculiar semantics regarding NaNs, and even on those two platforms there are some oddities that can crop up. I believe investigating and recommending an answer on how to deal with this will be a key concern for this group, because floating point and SIMD go together very closely, and that like const-eval we may wish to give floating point its own feature flag (done for const fns in <a href=\"https://github.com/rust-lang/rust/issues/77122\">#77122</a>).</p>",
        "id": 211297055,
        "sender_full_name": "Jubilee",
        "timestamp": 1601059115
    },
    {
        "content": "<p>Is this behavior any different than scalar floats?</p>",
        "id": 211328339,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1601075860
    },
    {
        "content": "<p>Platforms with double-extended precision scalar floats generally do not have double-extended precision SIMD floats, so yes. And Rust already uses double-extended precision scalar floats in some places (this may or may not be intentional).</p>\n<p>And platforms without double-extended precision scalar floats may, in their SIMD float, implicitly flush subnormal floats to zero, while having IEEE754 compliant scalar float registers.</p>",
        "id": 211339117,
        "sender_full_name": "Jubilee",
        "timestamp": 1601089998
    },
    {
        "content": "<p>aarch64 is basically the only one I am aware of that does not have an <em>opportunity</em> to experience \"quirks\" like these, though x86_64 usually doesn't because LLVM tells it to behave and it mostly does.</p>",
        "id": 211339188,
        "sender_full_name": "Jubilee",
        "timestamp": 1601090151
    },
    {
        "content": "<div class=\"message_inline_image\"><a href=\"https://pbs.twimg.com/media/D36Y3DzXsAMHbuu.jpg\"><img src=\"https://pbs.twimg.com/media/D36Y3DzXsAMHbuu.jpg\"></a></div>",
        "id": 211339243,
        "sender_full_name": "Lokathor",
        "timestamp": 1601090211
    },
    {
        "content": "<p>I haven't ever seen LLVM do anything weird to floats that are part of vectors, and I think I'd have noticed since <code>__m128</code> is basically treated as a bag of bits by intels APIs — this includes NaNs, as all the mask values are NaNs.</p>\n<blockquote>\n<p>LLVM implifies a highly... peculiar semantics regarding NaNs, </p>\n</blockquote>\n<p>i also think it turned out that this was a llvm bug, which has been fixed: <a href=\"https://bugs.llvm.org/show_bug.cgi?id=43907\">https://bugs.llvm.org/show_bug.cgi?id=43907</a>. I suspect they'd fix other similar issues if they were pointed out in sufficient detail.</p>",
        "id": 212419777,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1601987383
    },
    {
        "content": "<blockquote>\n<p>However, in other machines, we don't have such a guarantee</p>\n</blockquote>\n<p>So, assuming you mean for vectors (and aren't talking about e.g. x87) — which platforms are you referring to here? I'm not exactly surprised by this, but I think it would be worth knowing about. Most common targets do — intel (sse/avx), arm (neon), ppc (altivec), mips (msa), wasm (i think) ... — these all at least <em>claim</em> to be IEEE754 compliant for f32xN vectors.</p>\n<p>I imagine something like hexagon (or other DSPs, future potential GPU targets, etc) might not? That said, implementing software fp to get ieee754-compliance on these targets for the sake of ieee754 compat would be a large amount of work for a result that i firmly believe absolutely noone wants.</p>\n<p>I think the bigger issue for those targets is that i don't know if we can really implement e.g. transcendental functions if we can't assume at least <em>some level</em> of ieee754 compatibility — doing these typically requires some bit-juggling.</p>",
        "id": 212423709,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1601989320
    },
    {
        "content": "<p>So, re: ARM, aarch64 does not have this problem. <strong>But</strong> ARMv7 Neon is known to flush subnormal floats on vector registers. And yes, subnormal float handling is part of ieee754.</p>\n<p>I have observed oddities regarding MIPS float handling, especially with respect to NaNs, but I haven't pinpointed all the issues there yet.<br>\nI am not sure about the state of PowerPC float handling, but I have adopted a slightly more conservative \"the jury is out!\" stance. <code>ppc64le</code> seems well-behaved, but I am less confident about other PowerPC targets.<br>\nWASM is... IEEE754<strong>ish</strong>, and the NaN thing is basically where the jury is out, if memory serves. As in, yes, WASM handles NaNs in a particular fashion that may not be IEEE754 compliant.<br>\nLike, to be clear, the problem is more \"everyone is 98% compliant, and that last 2% of noncompliance is stuff we need to be on our toes for.\"</p>",
        "id": 212485817,
        "sender_full_name": "Jubilee",
        "timestamp": 1602018440
    },
    {
        "content": "<p>I think we should be able to do bitwhacking on most platforms, but I think we need to basically write tests for our bitwhacking assumptions, especially since this will also overlap with endianness concerns.</p>",
        "id": 212486361,
        "sender_full_name": "Jubilee",
        "timestamp": 1602018672
    },
    {
        "content": "<p>Yeah, bit hacking floats is exactly what you <em>can't</em> quite do in all cases on i586, for example.</p>",
        "id": 212489988,
        "sender_full_name": "Lokathor",
        "timestamp": 1602020685
    },
    {
        "content": "<blockquote>\n<p>But ARMv7 Neon is known to flush subnormal floats on vector registers. And yes, subnormal float handling is part of ieee754.</p>\n</blockquote>\n<p>ah, yeah, so I had forgotten that ARM has subnormal flushing on by default, this isn't a big problem though (as i talk about later).</p>\n<blockquote>\n<p>I have observed oddities regarding MIPS float handling, especially with respect to NaNs, but I haven't pinpointed all the issues there yet.</p>\n</blockquote>\n<p>Ah right, MIPS flips the bitwise representation of sNaN and qNaN. E.g. the most significant bit in the mantissa indicates a qNaN everywhere else, but an sNaN for MIPS (I think sparc does this too? someone who is basically irrelevant now also does).</p>\n<p>I think other than that they're fine? But it does need to be handled.</p>\n<blockquote>\n<p>I am not sure about the state of PowerPC float handling, but I have adopted a slightly more conservative \"the jury is out!\" stance. ppc64le seems well-behaved, but I am less confident about other PowerPC targets.</p>\n</blockquote>\n<p>I used to do a lot of stuff on PPC and remember its floats being well behaved with the notable exception that their <code>long double</code> is absolutely buckwild (it's just two f64s that you must together to get the real value. the number of distinct representations of, say, 0.0, that this gives you is left as an exercise <span aria-label=\"stuck out tongue\" class=\"emoji emoji-1f61b\" role=\"img\" title=\"stuck out tongue\">:stuck_out_tongue:</span>).</p>\n<p>Anyway, <code>long double</code> doesn't matter to us, but I will never pass up a chance to complain about it (and IIRC it doesn't even have hardware support so who knows why it's the way it is)</p>\n<blockquote>\n<p>WASM is... IEEE754ish, and the NaN thing is basically where the jury is out, if memory serves. As in, yes, WASM handles NaNs in a particular fashion that may not be IEEE754 compliant.</p>\n</blockquote>\n<p>Yeah, so IEEE754 has the notion of non-canonical encodings of a float. For binary32 and binary64, to be strictly compliant, all representations are supposed to be canonical. Historically, the cases of non-canonical floats that I know of were</p>\n<ol>\n<li>decimal floats but nobody uses these. (not important)</li>\n<li>x87's f80 weird pseudo-subnormals. (not important)</li>\n<li>platforms that have subnormal flushing to zero enabled (if you the subnormals as non-canonical representations of zero it works perfectly), which is relevant because of ARM.</li>\n</ol>\n<p>It looks like (I haven't actually compared it exactly, just skimmed) that wasm just treats all nans as non-canonical versions of some canonical nan, and canonicalizes at the exact same times that ieee754 says to canonicalize.</p>\n<p>These all seem pretty fine and easy to handle.</p>\n<blockquote>\n<p>but I think we need to basically write tests for our bitwhacking assumptions, especially since this will also overlap with endianness concerns.</p>\n</blockquote>\n<p>Yes, this all definitely falls into the camp of \"untested code is probably broken\".</p>",
        "id": 212491228,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1602021476
    },
    {
        "content": "<p>Oh and yes... there is something that I only understood recently.<br>\nARMv7 and ARMv8 32-bit ISAs are not completely compatible, and I don't think it's juuust a superset? ARMv8 docs I've seen mention \"removing cruft\" <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span>  Likewise, I am not sure how much Neon is just a superset on ARMv8, I think it's more like the SSE -&gt; SSE2 difference, where some things have different semantics, which is quite obviously the case for Neon since floats have different handling. I am hoping that it's not \"ARMv8 Neon does not support all ARMv7 Neon instructions\" but uh...</p>",
        "id": 212494232,
        "sender_full_name": "Jubilee",
        "timestamp": 1602023515
    },
    {
        "content": "<p>On s390x the binary floating point ISA is fully IEEE754 compliant.  Full support of subnormals, and support for binary32, binary64, and binary128 in 128b registers.  The data format in registers is the IEEE binary interchange format so you can do bit tweaking operations on floating point data.</p>",
        "id": 212678470,
        "sender_full_name": "Jonathan Bradbury",
        "timestamp": 1602158584
    },
    {
        "content": "<p>Ooh, Thom found this:<br>\n<span class=\"user-mention silent\" data-user-id=\"209168\">Thom Chiovoloni</span> <a href=\"#narrow/stream/187780-t-compiler.2Fwg-llvm/topic/Floating-point.20operations.20are.20non-deterministic/near/212675532\">said</a>:</p>\n<blockquote>\n<p>I came across <a href=\"https://github.com/WebAssembly/design/blob/master/Rationale.md#nan-bit-pattern-nondeterminism\">https://github.com/WebAssembly/design/blob/master/Rationale.md#nan-bit-pattern-nondeterminism</a> (and Also see <a href=\"https://github.com/WebAssembly/design/blob/master/Nondeterminism.md\">https://github.com/WebAssembly/design/blob/master/Nondeterminism.md</a>) which is interesting.</p>\n<blockquote>\n<p>IEEE 754-2008 6.2 says that instructions returning a NaN should return one of their input NaNs. In WebAssembly, implementations may do this, however they are not required to. Since IEEE 754-2008 states this as a \"should\" (as opposed to a \"shall\"), it isn't a requirement for IEEE 754-2008 conformance.</p>\n</blockquote>\n<p>This answers a lot of questions for <a href=\"https://github.com/rust-lang/rust/issues/73328\">https://github.com/rust-lang/rust/issues/73328</a></p>\n<p>Specifcally the way it wors is: Certain instructions are not guaranteed to preserve the payload bitpattern (in practice you can't rely on this portably so it seems fine that not to guarantee anything). Specifically:</p>\n<ul>\n<li>\n<p>the instructions fsqrt, fceil, ffloor, ftrunc, fnearest, fadd, fsub, fmul, fdiv, fmin, fmax, promote (<code>f32 as f64</code>) and demote (<code>f64 as f32</code>): : do not preserve the payload or sign bits for non-canonical nans, and do not preserve the sign bit for canonical nans (where \"do not preserve means \"set to a nondeterministic value\").</p>\n</li>\n<li>\n<p>the instructions fneg, fabs, and fcopysign (e.g. \"sign bit operations\" according to ieee754) fully preserve nan payload, and only modify the sign bit if expected for the operation, and introduce no nondeterminsim. (this is actually a hard requirement of IEEE754 so it's not surprising if they're going with the \"technically compliant\" argument lol)</p>\n</li>\n</ul>\n<p>All other operations, such as copying values around, loading/storing them to memory, roundtripping arbitrary bitpatterns (including the patterns of noncanonical nans) through float values, using them as args, returning them from functions... these should all preserve sign and payload of nans.</p>\n<p>As I mentioned before you can't portably rely on what happens to these NaN payloads if you do math on them, so I don't think what's there is a big deal if this is followed. My big concern was mostly that that last set of things wouldn't work.</p>\n</blockquote>\n<p>This helps a lot... kinda. :V</p>",
        "id": 212731646,
        "sender_full_name": "Jubilee",
        "timestamp": 1602181976
    },
    {
        "content": "<p>yeah, i was following up on my statement that</p>\n<blockquote>\n<p>It looks like (I haven't actually compared it exactly, just skimmed) that wasm just treats all nans as non-canonical versions of some canonical nan, and canonicalizes at the exact same times that ieee754 says to canonicalize.</p>\n</blockquote>\n<p>So, this ended up being not true. I had been thrown off a bit by wasm's use of the term \"canonical\" for certain NaNs, but it's not referring to the same thing.</p>\n<p>What wasm does is pretty similar (it <em>does</em> happen at the same times when ieee754 would canonicalize), but instead of collapsing to a single value, it instead states that certain bits in the float have become non-determinstic.</p>\n<p>(note: I'm not 100% certain but I suspect they're wrong that an implementation that can produce non-deterministic results is still fully compliant, but I have to study the ieee754 spec more closely to be sure...)</p>\n<p>Ultimately I think it requires a bit more though on what this means for our public API/guarantees, but in practice I'm not that worried, mostly because these things do all happen to at the same time canonicalization happens, which we already knew we'd have to worry about a little.</p>",
        "id": 212733928,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1602183118
    },
    {
        "content": "<p>Anyway, it's neither here nor there, but once I have done more reading and such, I think I might end up reaching out to them for some clarification on this, because (as ralf pointed out in one of the threads somewhere), this actually inhibits optimizations that allowed when targetting wasm (since many of them will become value-changing), which feels very much unintentional given their design rationale.</p>",
        "id": 212734468,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1602183399
    },
    {
        "content": "<p><a href=\"https://github.com/Lokathor/wide/pull/67#issuecomment-706761224\">https://github.com/Lokathor/wide/pull/67#issuecomment-706761224</a> Not SIMD-specific but a float issue and I am LOVIN' IT.</p>",
        "id": 213053772,
        "sender_full_name": "Jubilee",
        "timestamp": 1602516960
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209168\">@Thom Chiovoloni</span> Also, thank you for being so informative re: floats! No, really.<br>\nYou seemed slightly concerned about telling me something I might already know, so I just want to say that while yes, I will harrumph slightly if you tell me something I <em>completely</em> already know at some point, but it's completely fine to cover a subject completely as part of explaining something new (to me) and retread a bit of material in doing so. Especially if I have gotten it visibly inarguably incorrect! You aren't required to know the exact state of knowledge in my brain.</p>",
        "id": 213067311,
        "sender_full_name": "Jubilee",
        "timestamp": 1602524746
    },
    {
        "content": "<p>Ooh apparently that was guilty of rounding then truncating.</p>",
        "id": 213067597,
        "sender_full_name": "Jubilee",
        "timestamp": 1602524891
    },
    {
        "content": "<p>yeah, my bad on the code review there</p>",
        "id": 213068366,
        "sender_full_name": "Lokathor",
        "timestamp": 1602525370
    },
    {
        "content": "<p>It's a complex enough topic that \"inarguably incorrect\" is rarely the status — It's not at all impossible that I'm wrong (I was before about NaN on wasm), and I want to make sure that it's not a situation where you were aware of the thing I'm saying, and deliberately demonstrating a counterexample, or whatever. But also people have different sensitives around this, and I didn't want you to feel like I was mansplaining — especially given the above, where it's possible you were already aware of what I'm saying. But... in general it's also just how I am. Yay social anxiety.</p>",
        "id": 213068380,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1602525381
    },
    {
        "content": "<p>I know hardly anything about ieee 754 beyond the bare minimum so I give you permission to explain even extremely simple things to me <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 213068646,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1602525591
    },
    {
        "content": "<p>That's also why I'm Explicitly Granting Permission, because I know what social anxiety is like! I also have in fact been someone who has been sensitive about this in the past, so I know what that's like too? But I am much, much more chill about most things now, and more interested in learning than anything. I am not going to do something silly like promise I will never go \"huff!\" at something you say, but if I do I will attempt to directly resolve the problem... not, like, swear a grudge on you forever or something.</p>\n<p>The concern where I was obviously a bit confused was about reading ARM asm, which technically \"isn't\" about floating point at all.</p>",
        "id": 213069971,
        "sender_full_name": "Jubilee",
        "timestamp": 1602526453
    },
    {
        "content": "<p>Have been reading The Standard.</p>",
        "id": 213959921,
        "sender_full_name": "Jubilee",
        "timestamp": 1603218145
    },
    {
        "content": "<p>IEEE754-2019 in particular.</p>",
        "id": 213959976,
        "sender_full_name": "Jubilee",
        "timestamp": 1603218172
    },
    {
        "content": "<p>it's a good standard</p>",
        "id": 213966554,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1603221183
    },
    {
        "content": "<p>I believe Rust will need some updates to its float implementation period, but I have to start drafting the relevant tests to be sure.</p>",
        "id": 213967059,
        "sender_full_name": "Jubilee",
        "timestamp": 1603221451
    },
    {
        "content": "<p>Yeah, I think we violate a few \"shall\" terms.</p>",
        "id": 214255900,
        "sender_full_name": "Jubilee",
        "timestamp": 1603405831
    },
    {
        "content": "<p>Specifically at one of the most underloved intersections of the compiler: fmt and float.</p>",
        "id": 214255928,
        "sender_full_name": "Jubilee",
        "timestamp": 1603405859
    },
    {
        "content": "<p>confirmed. drafting tests as I go.</p>",
        "id": 214461954,
        "sender_full_name": "Jubilee",
        "timestamp": 1603591180
    },
    {
        "content": "<p><a href=\"https://github.com/rust-lang/rust/pull/78618\">https://github.com/rust-lang/rust/pull/78618</a><br>\n<a href=\"/user_uploads/4715/QHzPQ52Kqypgg3LzMCWpTE0f/Elmo-Flames-Meme.png\">Elmo-Flames-Meme.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/4715/QHzPQ52Kqypgg3LzMCWpTE0f/Elmo-Flames-Meme.png\" title=\"Elmo-Flames-Meme.png\"><img src=\"/user_uploads/4715/QHzPQ52Kqypgg3LzMCWpTE0f/Elmo-Flames-Meme.png\"></a></div>",
        "id": 215219920,
        "sender_full_name": "Jubilee",
        "timestamp": 1604192852
    },
    {
        "content": "<p>:3c</p>",
        "id": 215230198,
        "sender_full_name": "Lokathor",
        "timestamp": 1604212189
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> on <code>-0</code>. It looks like that’s how .NET formats them too</p>",
        "id": 215234166,
        "sender_full_name": "Ashley Mannix",
        "timestamp": 1604220308
    },
    {
        "content": "<p>what's the connection to .NET?</p>",
        "id": 215248702,
        "sender_full_name": "oliver",
        "timestamp": 1604244279
    },
    {
        "content": "<p>Actually, .NET Framework used 0.0, and .NET Core uses -0.0!</p>",
        "id": 215256931,
        "sender_full_name": "Jubilee",
        "timestamp": 1604256965
    },
    {
        "content": "<p>I presume there is no connection being made other than observing how other languages do it. So it's worth noting that C# considered this a bug and fixed it. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 215256943,
        "sender_full_name": "Jubilee",
        "timestamp": 1604256988
    },
    {
        "content": "<p>in Julia I get </p>\n<div class=\"codehilite\" data-code-language=\"Julia\"><pre><span></span><code><span class=\"n\">Vec</span><span class=\"p\">{</span><span class=\"mi\">2</span><span class=\"p\">,</span><span class=\"kt\">Float64</span><span class=\"p\">}((</span><span class=\"o\">-</span><span class=\"mi\">0</span><span class=\"p\">,</span><span class=\"o\">-</span><span class=\"mf\">0.0</span><span class=\"p\">))</span>\n<span class=\"o\">&lt;</span><span class=\"mi\">2</span> <span class=\"n\">x</span> <span class=\"kt\">Float64</span><span class=\"o\">&gt;</span><span class=\"p\">[</span><span class=\"mf\">0.0</span><span class=\"p\">,</span> <span class=\"o\">-</span><span class=\"mf\">0.0</span><span class=\"p\">]</span>\n</code></pre></div>\n<div class=\"codehilite\" data-code-language=\"Julia\"><pre><span></span><code><span class=\"n\">Vec</span><span class=\"p\">{</span><span class=\"mi\">2</span><span class=\"p\">,</span><span class=\"kt\">Int64</span><span class=\"p\">}((</span><span class=\"o\">-</span><span class=\"mi\">0</span><span class=\"p\">,</span><span class=\"o\">-</span><span class=\"mf\">0.0</span><span class=\"p\">))</span>\n<span class=\"o\">&lt;</span><span class=\"mi\">2</span> <span class=\"n\">x</span> <span class=\"kt\">Int64</span><span class=\"o\">&gt;</span><span class=\"p\">[</span><span class=\"mi\">0</span><span class=\"p\">,</span> <span class=\"mi\">0</span><span class=\"p\">]</span>\n</code></pre></div>",
        "id": 215261608,
        "sender_full_name": "oliver",
        "timestamp": 1604263600
    },
    {
        "content": "<p>I don't know Julia, but I assume -0 is an integer literal, which is why it doesn't keep the sign?</p>",
        "id": 215261649,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1604263682
    },
    {
        "content": "<p>that's correct</p>",
        "id": 215261700,
        "sender_full_name": "oliver",
        "timestamp": 1604263741
    },
    {
        "content": "<p>there's some documentation here: <a href=\"https://juliapackages.com/p/simd\">https://juliapackages.com/p/simd</a></p>",
        "id": 215261761,
        "sender_full_name": "oliver",
        "timestamp": 1604263823
    },
    {
        "content": "<p>Sorry, yep that was it <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span> I also wasn’t aware .NET Framework printed <code>0.0</code>!</p>",
        "id": 215262094,
        "sender_full_name": "Ashley Mannix",
        "timestamp": 1604264438
    },
    {
        "content": "<p>Yeah, it is something that surfaced while auditing a <em>lot</em> of different languages for how they print floats.</p>",
        "id": 215263792,
        "sender_full_name": "Jubilee",
        "timestamp": 1604267148
    }
]