[
    {
        "content": "<p>So, this project is obviously related to const generics, including min_const_generics, but I was also thinking about how const generics are proceeding relative to the project as a whole, and this post.<br>\n<a href=\"https://without.boats/blog/shipping-const-generics/\">https://without.boats/blog/shipping-const-generics/</a><br>\nBasically, \"in order to ship, we decided to ship an early minimal phase.\" And then there was an <em>explosion of interest</em>, including help, the moment people could latch on to \"oh, this is a real thing.\" I think that, especially in order to achieve the goals of stabilizing something in 2021, we should think about that as a possible target: everything can hit nightly basically as soon as we're ready, obviously, but we might want to allow ourselves to stabilize portable SIMD types progressively, rather than an all-at-once. Even stabilizing <em>literally just</em> u8x16 would be a big win since that lets people write SIMD-accelerated UTF8 processing, though obviously we should probably set our sights a <em>little</em> higher than that.</p>",
        "id": 210795889,
        "sender_full_name": "Jubilee",
        "timestamp": 1600720323
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281757\">@Jubilee</span> Absolutely! I think we’re lucky we can easily slice up the API any way we want to stabilize it in piecemeal but useful chunks</p>",
        "id": 210800611,
        "sender_full_name": "Ashley Mannix",
        "timestamp": 1600722658
    },
    {
        "content": "<p>Having a minimal subset of this is fairly trivial. Because SIMD is basically \"math, but (probably) faster\" we can stabilize even individual methods at a time once the initial types are set.</p>\n<p>The one thing we <em>can't</em> do (with current stabilization mechanisms) is stabilize both a type and a trait but <em>not</em> the specific impls of that trait.</p>",
        "id": 210802736,
        "sender_full_name": "Lokathor",
        "timestamp": 1600723839
    },
    {
        "content": "<p>And we'll <em>probably</em> want some new traits as part of this API, though they wouldn't go in the initial set of things.</p>",
        "id": 210802849,
        "sender_full_name": "Lokathor",
        "timestamp": 1600723904
    },
    {
        "content": "<p>So if we stabilize a trait, and a type, the impl of that trait for that type is autostable, correct? But if either is unstable, then the impl is unstable.</p>",
        "id": 210803169,
        "sender_full_name": "Jubilee",
        "timestamp": 1600724062
    },
    {
        "content": "<p>correct</p>",
        "id": 210803232,
        "sender_full_name": "Lokathor",
        "timestamp": 1600724101
    },
    {
        "content": "<p>My thoughts are that it may not make sense to stabilize these traits (depending on the trait, of course) until all of the types are stabilized.  The first thing that comes to mind is that whatever is appropriate for integers may not necessarily be appropriate for floating-point</p>",
        "id": 210803700,
        "sender_full_name": "Caleb Zulawski",
        "timestamp": 1600724392
    },
    {
        "content": "<p>Yeah, probably integer types and floating types would each have mostly similar traits that are still distinct, to best capture their operations. The exact design is sorta far out there. I think the main detail within the next few months is just the idea that \"this project will involve some new traits at some point\".</p>",
        "id": 210804636,
        "sender_full_name": "Lokathor",
        "timestamp": 1600724886
    },
    {
        "content": "<p>Should probably make a thread just for talking about OH GOD FLOATS. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> The cross-platform issues with them are... fun!</p>",
        "id": 210804698,
        "sender_full_name": "Jubilee",
        "timestamp": 1600724934
    },
    {
        "content": "<p>Actually if you just ignore i586... neon and sse both behave reasonably well and reasonably similar. :P</p>",
        "id": 210804838,
        "sender_full_name": "Lokathor",
        "timestamp": 1600725005
    },
    {
        "content": "<p>on aarch64! ARMv7 Neon works differently than aarch64 Neon _just_ for floats.</p>",
        "id": 210804911,
        "sender_full_name": "Jubilee",
        "timestamp": 1600725061
    },
    {
        "content": "<p>blast, i'll have to keep <em>two</em> raspberry pis available to work with I suppose.</p>",
        "id": 210805056,
        "sender_full_name": "Lokathor",
        "timestamp": 1600725156
    },
    {
        "content": "<p>Not really, 64-bit ARM systems can run 32-bit binaries.</p>",
        "id": 210805529,
        "sender_full_name": "Amanieu",
        "timestamp": 1600725464
    },
    {
        "content": "<p>wow you have a pre-Raspi 3?</p>",
        "id": 210805536,
        "sender_full_name": "Jubilee",
        "timestamp": 1600725468
    },
    {
        "content": "<p>that doesn't mean that they emulate the float flushing behavior. OH GOD WE HAVE TO FIND OUT <span aria-label=\"shock\" class=\"emoji emoji-1f628\" role=\"img\" title=\"shock\">:shock:</span></p>",
        "id": 210805609,
        "sender_full_name": "Jubilee",
        "timestamp": 1600725499
    },
    {
        "content": "<p>They do.</p>",
        "id": 210805626,
        "sender_full_name": "Amanieu",
        "timestamp": 1600725511
    },
    {
        "content": "<p>oh, well...<br>\n...<br>\nI mean, that does make things simpler.</p>",
        "id": 210805658,
        "sender_full_name": "Jubilee",
        "timestamp": 1600725533
    },
    {
        "content": "<p>Specifically, ARMv7 SIMD instructions will: 1) ignore the rounding mode in the FPSCR and assume round-to-nearest. 2) Flush denormals to zero. 3) Not propagate NaN payloads (it returns a default NaN instead).</p>",
        "id": 210805805,
        "sender_full_name": "Amanieu",
        "timestamp": 1600725647
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"143274\">@Amanieu</span> when i tried to cross-compile and run arm32 on my arm64 rpi the other day things went bad (missing files or whatever), but i'll PM you or something sometime if i try again.</p>",
        "id": 210805814,
        "sender_full_name": "Lokathor",
        "timestamp": 1600725659
    },
    {
        "content": "<p>Drop a <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> reaction if you’re here</p>",
        "id": 210805853,
        "sender_full_name": "Ashley Mannix",
        "timestamp": 1600725682
    },
    {
        "content": "<p>Use static linking to avoid issues. Or get an arm32 chroot.</p>",
        "id": 210805876,
        "sender_full_name": "Amanieu",
        "timestamp": 1600725697
    }
]