[
    {
        "content": "<p>Given that this is now a project group, and work can officially start, I'm going to use this opportunity to bring back up the major questions of the feature, and the updates from the MCP process.<br>\nA previous consolidation of the discussions for this can be found on <a href=\"https://hackmd.io/@wSaA8OrrSQ2SlegMvA6e6A/S1VwlyCRD\">this hackmd</a>.  <br>\nSyntax:</p>\n<ul>\n<li>The syntax question is still open, which the major options being: Having No syntax, using a sigil, and using a keyword. Pros and cons of each are detailed in the above hackmd and can be discussed furhter<br>\n     *  A keyword may be the most obvious, but, except for reusing the existing <code>box</code> keyword, it would require reversing a new one in a new edition, which locks the feature out of at least 2015 and 2018 editions, possibly 2021 as well (if anyone has insight as to whether or not it would be viable to reserve a keyword for 2021 edition, that may be helpful). Additionally, the obvious keyword \"<code>deref</code>\" is presumably a non-starter, as it is the name of a stdlib trait method (and of the trait that Deref Patterns works with)</li>\n<li>Some combination of the above options (in particular, no sigil/keyword in a subset of cases, and requiring one in all others) is also an option</li>\n</ul>\n<p>Soundness and Exhaustiveness:</p>\n<ul>\n<li>Allowing arbitrary, user-defined, Deref and DerefMut implementations would require that deref patterns be treated as non-exhaustive for soundness purposes. In preliminary discussions of the feature were: to not make deref patterns exhaustive, to limit only to standard library types, and to define a new unsafe trait <code>DerefPure</code>, which provides a necessary contract for soundness of exhaustive pattern matching.</li>\n<li>For this project, the lang team has instructed that <code>DerefPure</code> <em>not</em> be persued, and that deref patterns will be limited to a subset of standard library types. The project will determine and propose a set of rules for standard library types that participate in deref patterns, and will propose an initial list of standard library types, subject to T-lang and T-libs approval. </li>\n</ul>\n<p><span class=\"user-mention\" data-user-id=\"245339\">@Nadrieril</span>, I believe you previously expressed interest in participating in the MCP and Project Group. Are you still interested in working on this?</p>",
        "id": 229527472,
        "sender_full_name": "Connor Horman",
        "timestamp": 1615314293
    },
    {
        "content": "<p>Note that we didn't rule out all future possibility of allowing this for user types; we're just suggesting that the <em>initial</em> version should focus on standard types.</p>",
        "id": 229528533,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1615314690
    },
    {
        "content": "<p>Also, FWIW, I think \"no sigil for literals, sigil for non-literals\" should be a contender as well. I'd expect literals to be a <em>very</em> common case of this, and they're also the case where a sigil provides the least value.</p>",
        "id": 229529074,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1615314877
    },
    {
        "content": "<p><code>deref</code> as the keyword has some nice symmetry with the <code>ref</code> keyword. the overlap with <code>.deref()</code> is unfortunate, but there's no technical reason why a keyword couldn't be contextual rather than reserved.</p>",
        "id": 229534218,
        "sender_full_name": "bstrie",
        "timestamp": 1615316875
    },
    {
        "content": "<p>more generally I'm in favor of a keyword rather than a sigil, for reasons that are probably out of scope for this proposal. to elaborate, I like the idea of being able to use the chosen keyword in non-pattern contexts as a replacement for <code>*</code>, whose prefix nature gets awkward with method chaining; in the same way that <code>.await</code> is postfix, we could have a <code>.deref</code> postfix keyword for this use case. of course, this isn't exactly urgent, since you can technically do <code>.deref()</code> today already in method chains :P</p>",
        "id": 229534633,
        "sender_full_name": "bstrie",
        "timestamp": 1615317008
    },
    {
        "content": "<p>Isn't there a potential ambiguity? I don't know off the top of my head.</p>",
        "id": 229534867,
        "sender_full_name": "Connor Horman",
        "timestamp": 1615317106
    },
    {
        "content": "<p>I still want to help out if I can, but I can't commit to anything sadly :/</p>",
        "id": 229535260,
        "sender_full_name": "Nadrieril",
        "timestamp": 1615317242
    },
    {
        "content": "<p>ambiguity with regard to having the keyword be contextual rather than reserved? I don't think it's an insurmountable challenge, but it would take some care. the good news is that most method and function calls are illegal in pattern context, so the actual <code>Deref::deref</code> would remain unambiguous to parse. the only problem I would foresee is if someone wrote something like <code>enum Foo { deref(i32, i32) }</code>, in which case a pattern like <code>deref (4, 4)</code> would be syntactically ambiguous. the same thing applies to tuple structs like <code>struct deref(i32, i32)</code>. you would want a rule where users are forbidden from defining enum variants or tuple structs named <code>deref</code>. other than that, you would disambiguate on whether you're in pattern or expression context. that said, if there's a better keyword, that would be easier to implement :)</p>",
        "id": 229536392,
        "sender_full_name": "bstrie",
        "timestamp": 1615317611
    },
    {
        "content": "<p>In any case, it would most likely require an edition boundary.</p>",
        "id": 229537541,
        "sender_full_name": "Connor Horman",
        "timestamp": 1615318000
    },
    {
        "content": "<p>true, but that's the case for any new keyword</p>",
        "id": 229537711,
        "sender_full_name": "bstrie",
        "timestamp": 1615318048
    },
    {
        "content": "<p>The problem is that it would delay deref patterns to 2024 edition, unless the proposal for the reservation can be drafted, submitted as an RFC, and fcp merged before whatever deadline exists for edition 2021. I don't know that doing such would be reasonable.</p>",
        "id": 229538209,
        "sender_full_name": "Connor Horman",
        "timestamp": 1615318213
    },
    {
        "content": "<p>well, keywords can be provisionally reserved long before their RFCs are accepted; the 2018 edition reserved <code>async</code> and <code>await</code>, which didn't have accepted RFCs at the time of the edition. given that this RFC is a successor to <code>box</code> patterns, I think it's clear that this is something that's generally desirable and doesn't really need to do much work to justify itself. so <em>if</em> a keyword for this can be decided upon relatively soon, I don't think it would be too much of a stretch to ask that it be reserved long before your proposal is finalized</p>",
        "id": 229538812,
        "sender_full_name": "bstrie",
        "timestamp": 1615318414
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256342\">@bstrie</span> We have a policy now (developed largely because of the problems from those keywords) against reserving keywords before we have a concrete feature proposal on the table.</p>",
        "id": 229539355,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1615318580
    },
    {
        "content": "<p>how about <code>chase</code>? dereferencing is often called \"pointer chasing\", so it avoids having to invent new terminology. it's also short, unabbreviated, relatively unlikely to be used as an identifier in existing code</p>",
        "id": 229539658,
        "sender_full_name": "bstrie",
        "timestamp": 1615318679
    },
    {
        "content": "<p>Making up new keywords doesn't seem very helpful - it won't fix the ambiguity and it means people are less likely to recognize it</p>",
        "id": 229539835,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1615318731
    },
    {
        "content": "<p>I think deref is better than chase for that reason</p>",
        "id": 229539879,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1615318752
    },
    {
        "content": "<p>it does fix the ambiguity in a sense: we can make the keyword reserved rather than contextual, which we can't do for <code>deref</code> because that would break std</p>",
        "id": 229539920,
        "sender_full_name": "bstrie",
        "timestamp": 1615318773
    },
    {
        "content": "<p>(technically you <em>could</em> make <code>deref</code> a reserved keyword if you deprecated-and-renamed <code>Deref::deref</code> to something else, and then introduced the <code>deref</code> keyword only on edition X, and then made it a compiler error to access <code>Deref::deref</code> on edition X (using mechanisms akin to what <a href=\"https://github.com/rust-lang/rfcs/pull/3088\">this RFC</a> proposes), but this would be both highly disruptive and take years to achieve.)</p>",
        "id": 229540700,
        "sender_full_name": "bstrie",
        "timestamp": 1615319106
    },
    {
        "content": "<p>(Being able to implement things as <code>k#deref</code> in nightly to be able to avoid these conversations for a while is one of advantages I put in the draft <a href=\"https://github.com/scottmcm/rfcs/blob/never-preemptively-reserve-keywords/text/0000-raw-keywords.md#motivation\">https://github.com/scottmcm/rfcs/blob/never-preemptively-reserve-keywords/text/0000-raw-keywords.md#motivation</a> )</p>",
        "id": 229541342,
        "sender_full_name": "scottmcm",
        "timestamp": 1615319342
    },
    {
        "content": "<p>Keyword or sigil, it would be great to preserve the pattern/expression duality in some way- <code>box</code> patterns+expressions do this, <code>&amp;</code> patterns+expressions do this, but <code>ref</code> is a binding mode (i.e. only applies to identifiers) with no expression analog.</p>\n<p>The tricky thing here, as I see it, is there is not one single expression counterpart-  <code>Box::new</code>, <code>Rc::new</code>, <code>&amp;</code>, etc. are all individual cases that \"add\" a deref-able thing that a deref pattern would match. (TBH, if <code>ref</code> didn't already exist, this would make it a good candidate here!)</p>",
        "id": 229558593,
        "sender_full_name": "rpjohnst",
        "timestamp": 1615325884
    },
    {
        "content": "<p>Another form of consistency that would be good to preserve is interaction with default binding modes. That is, in the main \"by-move\" \"2015-compatible\" mode, indirections should be considered part of the scrutinee's structure and represented in the pattern (i.e. using the keyword/sigil), and they should disappear from patterns in precisely the same way- by switching default binding modes.</p>\n<p>(IMO \"no sigil for literals, sigil for non-literals\" breaks this, because literal-vs-not is a subtly different distinction than the one currently used for switching binding modes.)</p>",
        "id": 229559123,
        "sender_full_name": "rpjohnst",
        "timestamp": 1615326155
    },
    {
        "content": "<p>with regard to preserving the pattern/expression duality, is having a counterpart in expression position for this still desirable? indeed one of the original goals of the <code>box</code> keyword would be that you could construct <code>Box</code>, <code>Rc</code>, etc. with <code>box foo</code>, but it feels like the idea of having a generic \"smart pointer constructor\" keyword has been long since abandoned.</p>",
        "id": 229569727,
        "sender_full_name": "bstrie",
        "timestamp": 1615329817
    },
    {
        "content": "<p>I'm less interested in actually <em>having</em> a generic smart pointer constructor, and more interested in making the deref pattern fit the duality. So e.g. \"deref\" feels \"backwards\" here because a \"deref\" isn't part of the structure of anything, while \"box\" or \"&amp;\" or \"ref\" (in an alternative timeline at least) feel like they follow the same rules as other patterns.</p>",
        "id": 229571297,
        "sender_full_name": "rpjohnst",
        "timestamp": 1615330560
    },
    {
        "content": "<p>sure, if we're just thinking about keywords here then a verb like \"deref\" would be a bad choice; you'd want to represent this concept with a noun like <code>ptr</code> or something</p>",
        "id": 229575596,
        "sender_full_name": "bstrie",
        "timestamp": 1615332686
    },
    {
        "content": "<p>A thought: it's already idiomatic to invoke autoderef by adding an extra <code>&amp;</code> (like <code>foo(&amp;some_box)</code> where <code>fn foo(x: Box&lt;T&gt;)</code>), and further <code>&amp;</code> is already the sigil that you can elide with default binding modes, so maybe <code>&amp;</code> itself would be a good general-purpose deref pattern?</p>",
        "id": 229575968,
        "sender_full_name": "rpjohnst",
        "timestamp": 1615332862
    },
    {
        "content": "<p>that's mentioned as one of the options in the proposal, I'm still unsure how I feel about it</p>",
        "id": 229576039,
        "sender_full_name": "bstrie",
        "timestamp": 1615332899
    },
    {
        "content": "<p>it still feels kinda... backwards. which is to say, if you actually had <code>box &lt;pattern&gt;</code>, you might prefer to make it work with references (what are they if not smart pointers?) and use that to replace <code>&amp;&lt;pattern&gt;</code></p>",
        "id": 229576357,
        "sender_full_name": "bstrie",
        "timestamp": 1615333035
    },
    {
        "content": "<p>but overall it's not the worst idea</p>",
        "id": 229576518,
        "sender_full_name": "bstrie",
        "timestamp": 1615333136
    },
    {
        "content": "<p>To me, something like <code>match some_string { &amp;SOME_STR =&gt; ... }</code> seems backwards; if you were going to apply <code>&amp;</code> to something, it'd be <code>some_string</code> not <code>SOME_STR</code>.</p>",
        "id": 229583284,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1615337279
    },
    {
        "content": "<p>Why? some_string is a struct, not a reference.</p>",
        "id": 229587428,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1615340033
    },
    {
        "content": "<p>The case of <code>str</code>ings is a bit weirder in that we never have true <code>str</code>s <code>const</code>ants nor patterns (we only have <code>&amp;str</code>s).<br>\nShould we have: <code>const SOME_STR: str = *\"…\";</code>, then we could write:</p>\n<div class=\"codehilite\" data-code-language=\"Rust\"><pre><span></span><code><span class=\"k\">if</span><span class=\"w\"> </span><span class=\"fm\">matches!</span><span class=\"p\">(</span><span class=\"o\">*</span><span class=\"s\">\"hi\"</span><span class=\"p\">,</span><span class=\"w\"> </span><span class=\"n\">SOME_STR</span><span class=\"w\"> </span><span class=\"o\">|</span><span class=\"w\"> </span><span class=\"o\">*</span><span class=\"s\">\"foo\"</span><span class=\"p\">)</span><span class=\"w\"> </span><span class=\"p\">{</span><span class=\"w\"></span>\n<span class=\"c1\">// and thus:</span>\n<span class=\"k\">if</span><span class=\"w\"> </span><span class=\"fm\">matches!</span><span class=\"p\">(</span><span class=\"s\">\"hi\"</span><span class=\"p\">,</span><span class=\"w\"> </span><span class=\"o\">&amp;</span><span class=\"n\">SOME_STR</span><span class=\"w\"> </span><span class=\"o\">|</span><span class=\"w\"> </span><span class=\"o\">&amp;*</span><span class=\"s\">\"foo\"</span><span class=\"p\">)</span><span class=\"w\"> </span><span class=\"p\">{</span><span class=\"w\"></span>\n</code></pre></div>\n<ul>\n<li>Where <code>*</code> would be the generalization of <code>ref</code> for \"arbitrary expressions\" <span class=\"user-mention\" data-user-id=\"117495\">@rpjohnst</span> was talking about (although I won't personally be naming that \"<code>ref</code>\").</li>\n</ul>\n<p>At that point matching a <code>&amp;str</code> scrutinee leads to <code>&amp;*&lt;pattern of type &amp;str&gt;</code> being the most explicit syntax, and needing to write that for <code>String</code> would, at the cost of some sigil noise, lead to the most consistent logic / mental model:</p>\n<div class=\"codehilite\" data-code-language=\"Rust\"><pre><span></span><code><span class=\"fm\">matches!</span><span class=\"p\">(</span><span class=\"n\">some_string</span><span class=\"p\">,</span><span class=\"w\"> </span><span class=\"o\">&amp;*</span><span class=\"s\">\"foo\"</span><span class=\"p\">)</span><span class=\"w\"></span>\n</code></pre></div>\n<ul>\n<li>Aside: the noise here comes from <code>\"…\"</code> in Rust carrying an implicit <code>&amp;</code> (and since we were talking about parallel universes: one with <code>&amp;\"string literals\"</code> could have been interesting… and noisy <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span> ).</li>\n</ul>\n<p>The sigil noise can then be solved with our good old match ergonomics: <strong>deref patterns shouldn't be incompatible with those</strong>, it's just that having a sigil / keyword becomes especially <em>necessary</em> when <em>binding</em> values, while remaining <em>optional</em> for those who would want extra explicit indirection syntax.</p>\n<ul>\n<li>Example of a binding: <code>match get_string() { &amp;*(s @ (\"foo\" | \"bar\")) =&gt; … }</code></li>\n</ul>\n<p>This whole thing may look weird but, again, it's the most <em>consistent</em> model:</p>\n<div class=\"codehilite\" data-code-language=\"Rust\"><pre><span></span><code><span class=\"k\">match</span><span class=\"w\"> </span><span class=\"n\">get_string</span><span class=\"p\">()</span><span class=\"w\"> </span><span class=\"p\">{</span><span class=\"w\"> </span><span class=\"o\">&amp;*</span><span class=\"p\">(</span><span class=\"n\">s</span><span class=\"w\"> </span><span class=\"o\">@</span><span class=\"w\"> </span><span class=\"p\">(</span><span class=\"s\">\"foo\"</span><span class=\"w\"> </span><span class=\"o\">|</span><span class=\"w\"> </span><span class=\"s\">\"bar\"</span><span class=\"p\">))</span><span class=\"w\"> </span><span class=\"o\">=&gt;</span><span class=\"w\"></span>\n<span class=\"c1\">// move the `&amp;` from rhs pattern to lhs scrutinee (`*`):</span>\n<span class=\"k\">match</span><span class=\"w\"> </span><span class=\"o\">*</span><span class=\"n\">get_string</span><span class=\"p\">()</span><span class=\"w\"> </span><span class=\"p\">{</span><span class=\"w\"> </span><span class=\"o\">*</span><span class=\"p\">(</span><span class=\"n\">s</span><span class=\"w\"> </span><span class=\"o\">@</span><span class=\"w\"> </span><span class=\"p\">(</span><span class=\"s\">\"foo\"</span><span class=\"w\"> </span><span class=\"o\">|</span><span class=\"w\"> </span><span class=\"s\">\"bar\"</span><span class=\"p\">))</span><span class=\"w\"> </span><span class=\"o\">=&gt;</span><span class=\"w\"></span>\n<span class=\"c1\">// move the `*` from rhs pattern to lhs scrutinee (`&amp;` or `&amp;mut` based on further usage):</span>\n<span class=\"k\">match</span><span class=\"w\"> </span><span class=\"o\">&amp;*</span><span class=\"n\">get_string</span><span class=\"p\">()</span><span class=\"w\"> </span><span class=\"p\">{</span><span class=\"w\"> </span><span class=\"n\">s</span><span class=\"w\"> </span><span class=\"o\">@</span><span class=\"w\"> </span><span class=\"p\">(</span><span class=\"s\">\"foo\"</span><span class=\"w\"> </span><span class=\"o\">|</span><span class=\"w\"> </span><span class=\"s\">\"bar\"</span><span class=\"p\">)</span><span class=\"w\"> </span><span class=\"o\">=&gt;</span><span class=\"w\"></span>\n</code></pre></div>\n<p><span class=\"user-mention\" data-user-id=\"239881\">@Josh Triplett</span> in the case of <code>String</code> we may have been used to just putting a single <code>&amp;</code> on scrutinee position and let auto-<code>Deref</code> take care of the actual magic:<br>\nshould we be using only one sigil in ParallelUniverseRust, we'd be writing:</p>\n<div class=\"codehilite\" data-code-language=\"Rust\"><pre><span></span><code><span class=\"k\">match</span><span class=\"w\"> </span><span class=\"o\">*</span><span class=\"n\">s</span><span class=\"w\"> </span><span class=\"p\">{</span><span class=\"w\"> </span><span class=\"s\">\"foo\"</span><span class=\"w\"> </span><span class=\"c1\">// compare against a read-dereference of our `String` (or `&amp;str`, it doesn't matter)</span>\n</code></pre></div>\n<hr>\n<p>And obviously feel free to imagine these examples with <code>box</code> or <code>k#deref</code> instead of <code>&amp;</code>:</p>\n<div class=\"codehilite\" data-code-language=\"Rust\"><pre><span></span><code><span class=\"k\">match</span><span class=\"w\"> </span><span class=\"n\">get_string</span><span class=\"p\">()</span><span class=\"w\"> </span><span class=\"p\">{</span><span class=\"w\"> </span><span class=\"k\">box</span><span class=\"w\"> </span><span class=\"o\">*</span><span class=\"p\">(</span><span class=\"n\">s</span><span class=\"w\"> </span><span class=\"o\">@</span><span class=\"w\"> </span><span class=\"p\">(</span><span class=\"s\">\"foo\"</span><span class=\"w\"> </span><span class=\"o\">|</span><span class=\"w\"> </span><span class=\"s\">\"bar\"</span><span class=\"p\">))</span><span class=\"w\"> </span><span class=\"o\">=&gt;</span><span class=\"w\"></span>\n<span class=\"k\">match</span><span class=\"w\"> </span><span class=\"n\">get_string</span><span class=\"p\">()</span><span class=\"w\"> </span><span class=\"p\">{</span><span class=\"w\"> </span><span class=\"n\">deref</span><span class=\"w\"> </span><span class=\"o\">*</span><span class=\"p\">(</span><span class=\"n\">s</span><span class=\"w\"> </span><span class=\"o\">@</span><span class=\"w\"> </span><span class=\"p\">(</span><span class=\"s\">\"foo\"</span><span class=\"w\"> </span><span class=\"o\">|</span><span class=\"w\"> </span><span class=\"s\">\"bar\"</span><span class=\"p\">))</span><span class=\"w\"> </span><span class=\"o\">=&gt;</span><span class=\"w\"></span>\n</code></pre></div>",
        "id": 229589425,
        "sender_full_name": "Daniel Henry-Mantilla",
        "timestamp": 1615341448
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"239881\">Josh Triplett</span> <a href=\"#narrow/stream/281601-project-deref-patterns/topic/Deref.20Patterns.20(but.20now.20a.20project.20group)/near/229583284\">said</a>:</p>\n<blockquote>\n<p>To me, something like <code>match some_string { &amp;SOME_STR =&gt; ... }</code> seems backwards; if you were going to apply <code>&amp;</code> to something, it'd be <code>some_string</code> not <code>SOME_STR</code>.</p>\n</blockquote>\n<p>This immediately brings to mind the <code>IntoIterator</code> impls for things like <code>&amp;Vec&lt;T&gt;</code> vs <code>Vec&lt;T&gt;</code>, but i'm not sure i really understand why this makes sense. <code>&amp;some_string</code> having type <code>&amp;String</code> means the pattern would be doing <em>two</em> derefs, one old-style and one new-style, wouldn't it? what's the purpose of the extra old-style deref?</p>",
        "id": 229596889,
        "sender_full_name": "rpjohnst",
        "timestamp": 1615347115
    }
]