[
    {
        "content": "<p>Another idea for handling the exhaustiveness issue, when we use a deref pattern, generate an implicit wildcard branch which panics (unless there is an explicit one). E.g.,</p>\n<div class=\"codehilite\"><pre><span></span><code>fn proposed(a: Option&lt;Rc&lt;bool&gt;&gt;) {\n    match a.as_ref() {\n        Some(&amp;true) =&gt; {}\n        Some(&amp;false) =&gt; {}\n        // This is considered reachable code by the compiler, and if it were absent, would be implicitly generated.\n        Some(&amp;_) =&gt; unreachable!(),\n        None =&gt; {}\n    }\n}\n</code></pre></div>",
        "id": 244991893,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1625541462
    },
    {
        "content": "<p>AIUI, this solution is ergonomic (no _ boilerplate) and sound (no ub, worst case scenario in the case of non-idempotent deref is that we panic, no ub).</p>",
        "id": 244991966,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1625541547
    },
    {
        "content": "<p>I.e., deref should be idempotent, but if it is not, then we panic. I think this is an acceptable level of safety for operator overloading, somewhat like indexing having an implicit panic on out of bounds access (though completely different too :-) )</p>",
        "id": 244992065,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1625541709
    },
    {
        "content": "<p>Perhaps this could work for user-defined derefs in the future, though, for stdlib types it doesn't need to happen. That may only be an argument for an optimization, though,</p>",
        "id": 245019424,
        "sender_full_name": "Connor Horman",
        "timestamp": 1625566943
    },
    {
        "content": "<p>I think it would be nice to have a rule that should work in the general case so that we don't need to rely on the limitation to std for correctness, only to limit the blast radius of the feature. Otherwise, we are not getting the experience we would need in order to expand the feature later.</p>",
        "id": 245107169,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1625611032
    },
    {
        "content": "<p>Also, the less we need to rely on a hardcoded list the better, IMO, seems like that is just technical debt waiting to happen</p>",
        "id": 245107264,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1625611092
    }
]