[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"224872\">rylev</span> <a href=\"#narrow/stream/268952-edition-2021/topic/'Manual.20crater.20run'.20results/near/244439161\">said</a>:</p>\n<blockquote>\n<p>What is this trying to tell me? This looks as if I had updated to a new version of proc-macro2 and it removed the feature <code>default</code>, but that's not what's happening.</p>\n</blockquote>\n<p>@rylev can you make any suggestions on how to make it clearer?  It should have printed this full text which includes an explanation:</p>\n<blockquote>\n<p>Switching to Edition 2021 will enable the use of the version 2 feature resolver in Cargo.<br>\nThis may cause dependencies to resolve with a different set of features.<br>\nMore information about the resolver changes may be found at <a href=\"https://doc.rust-lang.org/cargo/reference/features.html#feature-resolver-version-2\">https://doc.rust-lang.org/cargo/reference/features.html#feature-resolver-version-2</a><br>\nThe following differences were detected with the current configuration:</p>\n<p>proc-macro2 v1.0.27 removed features <code>default</code></p>\n</blockquote>\n<p>In other words, when switching to the 2021 edition, your project will remove the \"default\" feature when building proc-macro2 (as compared to 2018).</p>\n<p>Would longer text be more helpful? Maybe something like:</p>\n<blockquote>\n<p>After updating to 2021, the following dependencies and features will change:</p>\n<p>The dependency <code>proc-macro2 v1.0.27</code> will be built without the feature(s) <code>default</code>.</p>\n</blockquote>",
        "id": 244583083,
        "sender_full_name": "Eric Huss",
        "timestamp": 1625152616
    },
    {
        "content": "<p>even just a simple dash or colon would already help. <code>thing removed default</code> reads like <code>thing</code> removed it. <code>thing: removed default</code> is already a bit better. but yeah, maybe <code>features no longer enabled: 'default'</code> or something would be better.</p>",
        "id": 244584009,
        "sender_full_name": "Mara",
        "timestamp": 1625152967
    },
    {
        "content": "<p>it's all about removals right? maybe just a line before that mentions the removal:</p>\n<div class=\"codehilite\"><pre><span></span><code>The following features will no longer enabled:\n\nfor `proc-macro2` v1.0.27: `default`\nfor `example` v1.0.0: `blåhaj`, `rosahaj`, `pumpkin`\n</code></pre></div>",
        "id": 244584737,
        "sender_full_name": "Mara",
        "timestamp": 1625153260
    },
    {
        "content": "<p>I like the removals only proposal:</p>\n<div class=\"codehilite\"><pre><span></span><code>When building the following dependencies, the given features will no longer be used:\n\nfor `proc-macro2` v1.0.27: `default`\nfor `example` v1.0.0: `blåhaj`, `rosahaj`, `pumpkin`\n</code></pre></div>",
        "id": 244586941,
        "sender_full_name": "rylev",
        "timestamp": 1625154147
    },
    {
        "content": "<p>Also \"This may cause dependencies to resolve with a different set of features.\" might be a bit jargony and could possibly be improved. How about \"This may cause dependencies which previously were built with some features enabled to build with a different set of features\"</p>",
        "id": 244587063,
        "sender_full_name": "rylev",
        "timestamp": 1625154219
    },
    {
        "content": "<p>it's only ever features that are no longer enabled. not features that are newly enabled. so that makes it easier to explain.</p>",
        "id": 244587476,
        "sender_full_name": "Mara",
        "timestamp": 1625154378
    },
    {
        "content": "<p>\"This may cause some dependencies to be built with fewer features enabled than previously. This may cause some dependencies to fail to build because they were depending on a feature which no longer gets applied. \"</p>",
        "id": 244587883,
        "sender_full_name": "rylev",
        "timestamp": 1625154543
    },
    {
        "content": "<p>We may want to explicitly say what to do in the case of a dependency no longer building due to a feature no longer being enabled.</p>",
        "id": 244588112,
        "sender_full_name": "rylev",
        "timestamp": 1625154630
    }
]