[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120518\">@Eric Huss</span> What's the situation right now with the <code>resolver = \"2\"</code> default for edition 2021 in workspaces? Does a workspace automatically use resolver 2 if all members are edition 2021? Or does it need to be manually activated?</p>",
        "id": 236170317,
        "sender_full_name": "Mara",
        "timestamp": 1619442608
    },
    {
        "content": "<p>In a <em>virtual</em> workspace, it needs to be manually activated. In a non-virtual workspace, it uses the edition of the top-level package. </p>\n<p>Cargo currently doesn't have a way to set the default edition for a virtual workspace. That is blocked on <a href=\"https://github.com/rust-lang/rfcs/blob/master/text/2906-cargo-workspace-deduplicate.md\">RFC 2906</a>. Someone was working on that, but it seems to have stalled. It's also a little complicated since that RFC does not have implicit defaults. There is also <a href=\"https://github.com/rust-lang/cargo/issues/5784\">issue 5784</a> tracking this. I do not know when or if more progress will be made on RFC 2906, but I suspect it may not be stabilized for the 2021 launch. I think it can be incorporated anytime afterwards, though, since it is an explicit opt-in.</p>",
        "id": 236180902,
        "sender_full_name": "Eric Huss",
        "timestamp": 1619446482
    },
    {
        "content": "<p>I assume some automatic behaviour depending on the edition of the members couldn't work?</p>\n<p>What happens with <code>cargo fix --edition</code> in a (virtual) workspace?</p>",
        "id": 236181548,
        "sender_full_name": "Mara",
        "timestamp": 1619446723
    },
    {
        "content": "<p>We generally try to avoid having implicit behavior based on package member definitions. It can cause confusion when new members are added (like with path dependencies).</p>\n<p><code>cargo fix --edition</code> will migrate every member to its next edition.  This won't affect the resolver, and it won't run the resolver-change notification.</p>",
        "id": 236182238,
        "sender_full_name": "Eric Huss",
        "timestamp": 1619446955
    },
    {
        "content": "<p>but running <code>cargo fix --edition</code> for a single (non-workspace) crate does upgrade the resolver? or does it add <code>resolver = \"1\"</code>?</p>",
        "id": 236182546,
        "sender_full_name": "Mara",
        "timestamp": 1619447073
    },
    {
        "content": "<p><code>cargo fix --edition</code> doesn't modify <code>Cargo.toml</code>, so it is up to the user to make changes. The only thing <code>carog fix --edition</code> does is print some warnings if the new resolver changes the features of anything.</p>\n<p>If, after running <code>fix</code>, they add <code>edition = \"2021\"</code>, then it will start using the new resolver.</p>",
        "id": 236185439,
        "sender_full_name": "Eric Huss",
        "timestamp": 1619448102
    },
    {
        "content": "<p>ah, right. that clarifies things. thank you</p>",
        "id": 236185761,
        "sender_full_name": "Mara",
        "timestamp": 1619448211
    },
    {
        "content": "<p>then i guess we'll just need to mention that they might want to add <code>resolver = \"2\"</code> in the same documentation that also explains adding <code>edition = \"2021\"</code> after <code>cargo fix --edition</code>.</p>",
        "id": 236185878,
        "sender_full_name": "Mara",
        "timestamp": 1619448248
    }
]