[
    {
        "content": "<p>Hey folks -- we're coming up on the time we have to decide which things are still candidates for the edition and which are not. The plan was to require an RFC or formal decision by April 1st, which is just a few days away. Here are the \"at risk\" items and (I think) the immediate action needed for each one:</p>\n<ul>\n<li><code>k#</code> keywords -- this needs an open RFC. <span class=\"user-mention\" data-user-id=\"125270\">@scottmcm</span>, we were also thinking that maybe it'd be nice to open a different RFC, one that just reserves <code>[a-zA-Z_]+#</code> and <code>[a-zA-Z_]+\"foo\"</code> for future use. We could then introduce <code>k#foo</code> keywords at any point as a separate RFC. The idea is that we may well want to reserve space for future things. Similarly, there are proposals for various kinds of strings and we want to reserve space for this. This feels different (to me) than reserving a grab bag of keywords, it's reserving the space to make extensions.</li>\n<li>Rustdoc lint names -- based on what I saw from <span class=\"user-mention\" data-user-id=\"232545\">@Joshua Nelson</span> it looks like we decided not to do this for the edition, which is fine.</li>\n<li>Range types -- afaik, there is no RFC, and there remains some serious question about whether this makes sense to move forward. <span class=\"user-mention\" data-user-id=\"243558\">@Steven Fackler</span> as the chief proponent, it seems like what is needed is a kind of write-up explaining the options and making the case for why one would prefer one or the other, or at least an updated RFC, so that the folks on lang/libs can have a join meeting or something to come to consensus. I like the framing of \"you should prefer X if you value Y over Z\", and give that argument for both cases. That I think can help folks to decide. It may be that this won't happen for 2021 and we should be thinking about what that might mean. </li>\n<li><code>IntoIter from [T; N]</code> -- I need to investigate here, though I think this will ultimately not be tied to an edition, because it's hard to use editions for trait-related things.</li>\n</ul>",
        "id": 232320240,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1617045283
    },
    {
        "content": "<p>Re: range types, I'm unfortunately not sure I'll have the time to drive it forward. Happy to chat with someone who's interesting in taking over, or it may just not make it into 2021.</p>",
        "id": 232320456,
        "sender_full_name": "Steven Fackler",
        "timestamp": 1617045386
    },
    {
        "content": "<p>Well I added a paragraph and pushed the <code>k#</code> RFC: <a href=\"https://github.com/rust-lang/rfcs/pull/3098\">https://github.com/rust-lang/rfcs/pull/3098</a></p>",
        "id": 232336102,
        "sender_full_name": "scottmcm",
        "timestamp": 1617052078
    },
    {
        "content": "<p>Both k# significance and [a-z]# reserving can be RFCs done at the same time.</p>",
        "id": 232343931,
        "sender_full_name": "isHavvy",
        "timestamp": 1617055720
    }
]