[
    {
        "content": "<p>The \"edition\" labels on <code>rust-lang/rust</code> are a bit confusing to me.  There doesn't appear to be a generic <code>A-editions</code> label.  Would anyone object if I create one?  Or, would you prefer more focused labels like <code>A-edition-2021</code>?  Or even more focused like <code>A-edition-2021-lints</code>, <code>A-edition-2021-docs</code>, etc?   Or both general and specific labels?</p>",
        "id": 231344037,
        "sender_full_name": "Eric Huss",
        "timestamp": 1616431433
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120518\">@Eric Huss</span> we have a project board. you can attach issues to that. but if you also want a label, i'd prefer something with <code>2021</code> (but not more specific)</p>",
        "id": 231351620,
        "sender_full_name": "Mara",
        "timestamp": 1616434182
    },
    {
        "content": "<p>ah hmm</p>",
        "id": 231494275,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1616514847
    },
    {
        "content": "<p>I was wondering recently how to label things for editions</p>",
        "id": 231494287,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1616514853
    },
    {
        "content": "<p>perhaps the answer is that we should be using the project board for tracking things for this edition</p>",
        "id": 231494338,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1616514869
    },
    {
        "content": "<p>and have some more generic label for like \"<a href=\"http://edition.next\">edition.next</a>\"?</p>",
        "id": 231494354,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1616514878
    },
    {
        "content": "<p>we haven't really reconciled the project board with our spreadsheet, I think I might like it if we did</p>",
        "id": 231494383,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1616514890
    },
    {
        "content": "<p>I'm not sure I would feel comfortable editing the project board.  Also, there's no column for \"bugs\".  Do you want me (and others) to edit it?</p>\n<p>Also, the project board is not easy to find, and I imagine very few people know of its existence.</p>",
        "id": 231513063,
        "sender_full_name": "Eric Huss",
        "timestamp": 1616521615
    },
    {
        "content": "<p>yeah we should porbably restructure te board a bit. originally i wanted to track the proposals there, and whether they were accepted. but now the actual implementation work and open bugs are more relevant</p>",
        "id": 231513501,
        "sender_full_name": "Mara",
        "timestamp": 1616521773
    },
    {
        "content": "<p>I have seen places where it would be useful to be able tag an issue with \"edition wishlist\", without trying to imply that it should belong to a <em>specific</em> edition. also useful for things that were considered for a specific edition but are being postponed</p>",
        "id": 231529158,
        "sender_full_name": "bstrie",
        "timestamp": 1616527584
    },
    {
        "content": "<p>this would make edition planning easier in general; if people in 2019 had an idea for an issue that should be considered for the next edition, there did not exist any tag to indicate that, and so planning for the 2021 edition seems like it had to start from scratch by considering all possible issues</p>",
        "id": 231529367,
        "sender_full_name": "bstrie",
        "timestamp": 1616527644
    },
    {
        "content": "<p>there was/is the <code>lang-team-202x-edition</code> label for that purpose</p>",
        "id": 231531770,
        "sender_full_name": "Mara",
        "timestamp": 1616528556
    },
    {
        "content": "<p>I suspect we should rename it</p>",
        "id": 231649574,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1616598311
    }
]