[
    {
        "content": "<p><a href=\"https://github.com/rust-lang/rust/issues/83160\">#83160</a> deprecated these derives, but it was mentioned that they couldn't be removed from the prelude. There's no reason that can't be done in an edition — should we?</p>",
        "id": 246402267,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626646997
    },
    {
        "content": "<p>I'd be for doing it someday, although if you mean doing it for this year's edition it might be a bit late. crater runs have already happened, plans have already been announced, etc. bring it up with the libs-api team, perhaps?</p>",
        "id": 246402963,
        "sender_full_name": "bstrie",
        "timestamp": 1626648296
    },
    {
        "content": "<p>and if it doesn't happen for this year then file an issue in the rust repo and tag it with \"lang-team-202x-edition\", which is apparently the wishlist label for editions ATM</p>",
        "id": 246402980,
        "sender_full_name": "bstrie",
        "timestamp": 1626648343
    },
    {
        "content": "<p>Yeah, I know it's late which is why I asked. Creating an issue for the future seems reasonable.</p>",
        "id": 246403037,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626648462
    },
    {
        "content": "<p>It's not clear to me what we gain by removing it -- they're already deprecated and (largely) unused; the surface area in terms of syntax/name is also not really desirable/interesting. So in the spirit of keeping away from changes that don't meaningfully improve language experience (but do create extra things to think about), which IIRC is one of the principles we set out, it feels like we may not want to do this.</p>",
        "id": 246403184,
        "sender_full_name": "simulacrum",
        "timestamp": 1626648685
    },
    {
        "content": "<p>for any other item I might agree, but in this particular case these items were IIRC only ever exposed to stable by accident, as a regrettable oversight of Rust 1.0. they've always been undocumented and essentially unsupported</p>",
        "id": 246403555,
        "sender_full_name": "bstrie",
        "timestamp": 1626649265
    },
    {
        "content": "<p>Sure, I mean, I don't think that really changes my perspective though -- there's still a <em>little</em> overhead, and we really should still document any such transition.</p>",
        "id": 246403605,
        "sender_full_name": "simulacrum",
        "timestamp": 1626649335
    },
    {
        "content": "<p>I'll even go so far as to say that I wouldn't even expect the machinery that supports them to exist in the compiler forever, on any edition: <a href=\"https://github.com/rust-lang/rust/issues/40177\">https://github.com/rust-lang/rust/issues/40177</a></p>",
        "id": 246403917,
        "sender_full_name": "bstrie",
        "timestamp": 1626649813
    },
    {
        "content": "<p>That's a good point. It having <em>never</em> been actually exposed in docs since 1.0 and it being effectively a compiler internal, it seems reasonable that it should be able to be removed in its entirety at some point.</p>",
        "id": 246403936,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626649921
    },
    {
        "content": "<p>but that's a much larger and long-term proposal than removing it from the prelude, and probably better discussed elsewhere</p>",
        "id": 246403972,
        "sender_full_name": "bstrie",
        "timestamp": 1626649925
    },
    {
        "content": "<p>and yes, I think people will be reluctant to endorse it for this year, but hopefully with better discipline about curating a wishlist label we can be better organized for the next edition (e.g. I totally would've submitted <a href=\"https://github.com/rust-lang/rust/issues/86921\">https://github.com/rust-lang/rust/issues/86921</a> if I had remembered in time)</p>",
        "id": 246403991,
        "sender_full_name": "bstrie",
        "timestamp": 1626650028
    },
    {
        "content": "<p>Semi off topic, but I'd prefer informal edition work were ongoing rather than pushed into the year of the edition. A 2024 edition could exist instantly for three years without issue.</p>",
        "id": 246404048,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626650109
    },
    {
        "content": "<p>sure, and maybe that's something to think about once this edition is out the door. I think the 2018 edition was so brutal that everyone was burned out in the aftermath and nobody had the will to consider getting a head start on 2021</p>",
        "id": 246404164,
        "sender_full_name": "bstrie",
        "timestamp": 1626650301
    },
    {
        "content": "<p>Probably worth creating an IRLO thread. I'll do that later <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 246404168,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626650338
    },
    {
        "content": "<p>This thread was before the deprecation, but apparently <code>Encodable</code> was previously removed entirely, so there is precedent. <a href=\"https://internals.rust-lang.org/t/what-is-rustc-decodable-encodable-and-why-is-it-stable/13744/2?u=jhpratt\">https://internals.rust-lang.org/t/what-is-rustc-decodable-encodable-and-why-is-it-stable/13744/2?u=jhpratt</a></p>",
        "id": 246404569,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626651032
    },
    {
        "content": "<p>It's the expectation (and I believe impl wise the case) that edition next <em>is</em> already a thing</p>",
        "id": 246405802,
        "sender_full_name": "simulacrum",
        "timestamp": 1626653258
    },
    {
        "content": "<p>Yeah I just meant actually creating 2024 unstably far sooner than we did 2021. So that small things like this could be discussed and potentially land, leaving the \"real\" work for later.</p>",
        "id": 246405912,
        "sender_full_name": "Jacob Pratt",
        "timestamp": 1626653420
    },
    {
        "content": "<p>I mean that it is essentially already created, 2021 has basically \"branched\" or whatever metaphor from edition next already</p>",
        "id": 246406249,
        "sender_full_name": "simulacrum",
        "timestamp": 1626654020
    }
]