[
    {
        "content": "<p>I noticed <a href=\"https://github.com/rust-lang/rust/issues/15702#issuecomment-463238298\">https://github.com/rust-lang/rust/issues/15702#issuecomment-463238298</a> today, and while it seems far too late to consider it for this edition, it also seems like the kind of thing that would be good to remember for the next one (or not — I have no strong opinion about this particular change, just that it seems to have been forgotten).</p>\n<p>More broadly, it might be good to keep a list somewhere of changes we'd like to make, but that requires/benefits from an edition boundary, so that they can be reviewed when considering changes to make for that edition.</p>\n<p>(Sorry if this has been brought up before, I only passively track this stream)</p>",
        "id": 243281928,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1624157094
    },
    {
        "content": "<p>In the past I have been directed to the \"lang-team-202x-edition\" label: <a href=\"https://github.com/rust-lang/rust/labels/lang-team-202x-edition\">https://github.com/rust-lang/rust/labels/lang-team-202x-edition</a></p>",
        "id": 243308636,
        "sender_full_name": "bstrie",
        "timestamp": 1624204322
    },
    {
        "content": "<p>if that truly is intended to be the \"consider this for a future edition\" label, then I would propose renaming it to something more general, so as to not suggest that only that only lang-related changes could go there (e.g. edition prelude changes are libs-related). maybe something like \"C-future-edition\"</p>",
        "id": 243308810,
        "sender_full_name": "bstrie",
        "timestamp": 1624204522
    },
    {
        "content": "<p>It used to be called <code>vNext</code>, did it not? Now it does seem to have been renamed to what <span class=\"user-mention\" data-user-id=\"256342\">@bstrie</span> says</p>",
        "id": 243317202,
        "sender_full_name": "Daniel Henry-Mantilla",
        "timestamp": 1624216800
    }
]