[
    {
        "content": "<p>some ideas of how to run this process async ...</p>",
        "id": 199921049,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1591384000
    },
    {
        "content": "<h1>Async process</h1>\n<ol>\n<li>The agenda is created as soon as we finish our thursday's weekly meeting.</li>\n<li>unprioritized issues: a Zulip topic is created requesting prioritization when an issue is labelled with <code>I-prioritize</code>. Regressions and I-sound issues that do not <code>requires-nightly</code> are automatizally tagged with <code>I-prioritize</code>.</li>\n<li>stable/beta nominations, i-nominated and prs-waiting-on-team: a Zulip topic is created requesting addition of these items to the agenda.</li>\n<li>once we do all this some things from the triagebot script could be removed </li>\n<li>we probably want the script to integrate with triagebot<br>\n  5.1. we could run <code>@triagebot prioritization pendings</code> on wednesdays mornings and have that figuring out what's pending an opening issues or bumping existing ones to notify us what we need to do<br>\n  5.2. we could run <code>@triagebot prioritization agenda</code> and have that dumping out the agenda. I'm not 100% sure about this we are going to be filling the agenda as we go. So maybe it's more appropriate to have stuff like <code>@triagebot prioritization agenda issues-of-note</code>, <code>@triagebot prioritization agenda nominations</code> and things like that so the script could dump parts of the agenda we need to update.</li>\n</ol>",
        "id": 199921068,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1591384014
    },
    {
        "content": "<p>left this in <a href=\"https://hackmd.io/WJ0G17DHTHGgv0OW9I2PxA?view#Async-process-proposal\">Async process</a></p>",
        "id": 199938754,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1591394323
    },
    {
        "content": "<p>have added an extra step there</p>",
        "id": 199938768,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1591394329
    }
]