[
    {
        "content": "<p>Hello! I'm a new contributor to the project, though I have been categorizing some issues for the past few days. Is there a way I could help with prioritization?</p>",
        "id": 241664221,
        "sender_full_name": "inquisitivecrystal",
        "timestamp": 1622940980
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"417924\">@inquisitivecrystal</span> thanks for showing up :)</p>\n<p>We receive alerts for issues in need of a priority evaluation (<code>P-critical</code>, <code>P-high</code>, etc.) in this zulip stream: <a class=\"stream\" data-stream-id=\"245100\" href=\"/#narrow/stream/245100-t-compiler.2Fwg-prioritization.2Falerts\">#t-compiler/wg-prioritization/alerts</a> </p>\n<p>Usually it's a async process, people check issues during the week and suggest their evaluation. Sometimes it's rather clear what the issue looks like, sometimes there is some bouncing back and forth of ideas to clarify the context (which I like most because we get insights from knowledgeable people).</p>\n<p>I personally try to explicit my train of thoughts on why I think an issue might be of medium, high or else priority. This had the advantage to be a little more didactical for newcomers, though it's perfectly fine to say \"I don't have the right context to label this issue but I <em>think</em> this could be this or that\". Everyone is here also to learn from  skilled experts :-)</p>\n<p>Generally on Wednesdays/Thursdays I sum up everything and draft the <code>T-compiler</code> (as in \"team compiler\") agenda with everything that will be discussed in the Triage Meeting (weekly cadence, happening on Thursdays 12 ET / 16 UTC). Example, last week's agenda:<br>\n<a href=\"https://hackmd.io/wCIbJPBKSxKeScnuh3dr2Q\">https://hackmd.io/wCIbJPBKSxKeScnuh3dr2Q</a></p>\n<p>T-compiler meetings happen here: <a class=\"stream\" data-stream-id=\"238009\" href=\"/#narrow/stream/238009-t-compiler.2Fmeetings\">#t-compiler/meetings</a> (feel free to jump in and follow the chat if you want, it's really interesting). Meeting last 1h and are usually quite packed, so the team try to stick to the agenda and defer further threads of discussions to an async Zulip thread.</p>\n<p>Occasionally we also \"massage\" the issue adding or removing other labels as needed, there's some tribal knowledge on how to do this that it's hard to clearly document and probably better learned by doing.</p>\n<p>Speaking of docs, our reference is:<br>\n<a href=\"https://forge.rust-lang.org/compiler/prioritization/procedure.html\">https://forge.rust-lang.org/compiler/prioritization/procedure.html</a></p>\n<p>if you've read this so far, congrats! :-)</p>\n<p>So <strong>what can you do</strong>?  if you want you can participate in the issue evaluation procedure happening on <a class=\"stream\" data-stream-id=\"245100\" href=\"/#narrow/stream/245100-t-compiler.2Fwg-prioritization.2Falerts\">#t-compiler/wg-prioritization/alerts</a>; the more, the merrier.</p>\n<p>Feel free to ask any question that pops up in your mind!<br>\n(sorry for the wall of text, didnt have time to make it shorter - <em>citation neeeded</em>)</p>",
        "id": 241751050,
        "sender_full_name": "apiraino",
        "timestamp": 1623058759
    },
    {
        "content": "<p>-- Blaise Pascal</p>",
        "id": 241751342,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1623058928
    },
    {
        "content": "<p>Thanks! That explanation was really good and helpful! I don't mind walls of text, I tend to be a walls of text sort of person myself.</p>",
        "id": 241852367,
        "sender_full_name": "inquisitivecrystal",
        "timestamp": 1623107030
    },
    {
        "content": "<p>I don't have any questions right now, but I'm sure I will over time!</p>",
        "id": 241852422,
        "sender_full_name": "inquisitivecrystal",
        "timestamp": 1623107045
    }
]