[
    {
        "content": "<p>hello <span class=\"user-group-mention\" data-user-group-id=\"2403\">@WG-prioritization</span> !</p>\n<p>Yesterday I was reviewing the Compiler team agenda with Santiago, this is something that is going on since a couple of weeks - he's mentoring me every week so I can help him on this task (you will probably have noticed that I'm getting more and more active in this stream).</p>\n<p>I think that we have <a href=\"https://forge.rust-lang.org/compiler/prioritization.html\">good documentation</a> of our workflow (thanks to those that took the time to write it down) but we also discussed that there are things that cannot be strictly defined in a bullet list. It's a kind of \"tribal knowledge\" that levels up the experience in doing anything. The kind of thing that forge the judgement skills.</p>\n<p>So if on the one hand we kept these \"operational chats\" out of band to avoid polluting this stream, we also thought that all that is then lost. I am the only recipient of something that could be beneficial to others. Especially now that we are publishing a call for contributors, so I expect new faces to show up.</p>\n<p>So, long story short, we want to find a way to keep more stuff in the open in a way that is not bothering anyone, but fully accessible and interactive at the same time. I think this will slightly add a bit of overhead, but we hope that it will have a positive outcome. In any case it's an experiment, so we'll see where it goes :-)</p>\n<p>We are of course open to suggestions and comments, we are exploring this space all together.</p>\n<p>My proposal: having one clearly recognizable topic in this stream that people can either mute, follow or jump in as they wish. In that stream Santiago and I will write whatever operational stuff that is not relevant to a) specific prioritization github issues (there's the substream <code>/alerts</code> for that) and b) things that deserve their own specific Zulip topic.</p>\n<p>sorry for the long rant - I am bad at summarizing :)</p>",
        "id": 209614791,
        "sender_full_name": "apiraino",
        "timestamp": 1599730212
    },
    {
        "content": "<p>Super good idea!</p>",
        "id": 209619525,
        "sender_full_name": "o0Ignition0o - Jeremy Lempereur",
        "timestamp": 1599733242
    }
]