[
    {
        "content": "<p>One issue we have is that when an issue is renamed after prioritization is requested, further alerts from triagebot (e.g., when the prioritization request is removed or the issue is closed) get sent to a new topic. What do you all think about removing the issue title from the topic and instead putting it in the first message from triagebot? The only downside I see is it might make scanning the list of topics more difficult, but then again, with duplicate topics floating around, it's not exactly easy the way it is now either.</p>",
        "id": 267661540,
        "sender_full_name": "Noah Lev",
        "timestamp": 1641943422
    },
    {
        "content": "<p>I'm happy to send a PR to do this if people are on board. Also, we can always revert back to the current behavior if we don't like the new version.</p>",
        "id": 267661610,
        "sender_full_name": "Noah Lev",
        "timestamp": 1641943446
    },
    {
        "content": "<p>I was thinking about this earlier. I think there's a better solution.</p>",
        "id": 267662210,
        "sender_full_name": "inquisitivecrystal",
        "timestamp": 1641943819
    },
    {
        "content": "<p>Why can't we just have triagebot do <a href=\"#narrow/stream/243200-t-lang.2Fmajor-changes/topic/Interoperability.20With.20C.2B.2B.20Destruction.20Order.20lang-team.23135/near/267623094\">this</a> for alerts the same way it does for MCPs?</p>",
        "id": 267662310,
        "sender_full_name": "inquisitivecrystal",
        "timestamp": 1641943894
    },
    {
        "content": "<p>Funnily enough, I'm actually the one that implemented that feature ;)</p>\n<p>The only reason I didn't suggest it here is because IIRC it ended up causing some issues with MCPs. But it actually might work better for wg-prioritization's alerts.</p>",
        "id": 267664353,
        "sender_full_name": "Noah Lev",
        "timestamp": 1641945399
    },
    {
        "content": "<p>I like the idea of a message about the issue being renamed, and its zulip topic as well <span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span></p>",
        "id": 267697702,
        "sender_full_name": "apiraino",
        "timestamp": 1641978375
    },
    {
        "content": "<p>Doesn't \"renaming\" a topic just create another topic without the history from the previous one and people can still reply to the previous topic?</p>",
        "id": 268039694,
        "sender_full_name": "fee1-dead",
        "timestamp": 1642178746
    },
    {
        "content": "<p>You have to rename the first message in the topic for the whole history to be moved</p>",
        "id": 268067043,
        "sender_full_name": "Noah Lev",
        "timestamp": 1642191626
    },
    {
        "content": "<p>That's what makes the feature difficult</p>",
        "id": 268067066,
        "sender_full_name": "Noah Lev",
        "timestamp": 1642191636
    }
]