[
    {
        "content": "<p>(Just thinking aloud, feel free to join)</p>",
        "id": 191716008,
        "sender_full_name": "CreepySkeleton",
        "timestamp": 1585127334
    },
    {
        "content": "<p>I doubt that attracting extra attention to certain functions will fix the situation unless it's based on statically significant data, which we don't have.</p>\n<p>A FAQ (this is essentially what <span class=\"user-mention\" data-user-id=\"254853\">@pksunkara</span> proposes), in order to be useful, needs to focus reader's  attention on the minority of topics that are asked most, leaving everything else out of sight. </p>\n<p>To identify these commonly asked topics, we would need to gather significant number of help requests/complaints. So far, we've only had 10 or so. And they are fairly broad; I recall <code>conflicts</code>, <code>requires</code>, <code>raw</code>, <code>groups</code>, <code>aliases</code>, yadda, yadda. We don't have the data to write a useful FAQ at this point.</p>",
        "id": 191716452,
        "sender_full_name": "CreepySkeleton",
        "timestamp": 1585127600
    },
    {
        "content": "<p>Alternative proposal: encourage users to help each other with simple questions (like, what do I use to express \"any of those, but not others?\"). I think we should aggressively advertise the gitter chat.</p>",
        "id": 191716756,
        "sender_full_name": "CreepySkeleton",
        "timestamp": 1585127763
    },
    {
        "content": "<p>And only if the community haven't come up with anything satisfying, tell them to go to the issue tracker. This should significantly reduce the load for maintainers.</p>",
        "id": 191716870,
        "sender_full_name": "CreepySkeleton",
        "timestamp": 1585127845
    },
    {
        "content": "<p>Of course, this doesn't' mean that the doc is perfect and needs no improvement.</p>",
        "id": 191717056,
        "sender_full_name": "CreepySkeleton",
        "timestamp": 1585127951
    },
    {
        "content": "<p>I mean, the documentation is <em>mostly</em> fine, it's just there's a lot of it. Users, as <span class=\"user-mention\" data-user-id=\"131358\">@spacekookie</span> pointed out,  get drowned in it.</p>",
        "id": 191717239,
        "sender_full_name": "CreepySkeleton",
        "timestamp": 1585128052
    },
    {
        "content": "<p>We need... well , ideally, we would need a <em>concise</em> list of... pointers?</p>",
        "id": 191717586,
        "sender_full_name": "CreepySkeleton",
        "timestamp": 1585128232
    },
    {
        "content": "<p>It's like, we've already had a road, now we need waymarks.</p>",
        "id": 191717824,
        "sender_full_name": "CreepySkeleton",
        "timestamp": 1585128367
    },
    {
        "content": "<p>Any ideas?</p>",
        "id": 191717847,
        "sender_full_name": "CreepySkeleton",
        "timestamp": 1585128377
    },
    {
        "content": "<p>Also, the point of many of our user being newbies.</p>",
        "id": 191717894,
        "sender_full_name": "CreepySkeleton",
        "timestamp": 1585128409
    },
    {
        "content": "<p>Maybe some sort of book describing the process of an application creation.</p>",
        "id": 191718204,
        "sender_full_name": "CreepySkeleton",
        "timestamp": 1585128573
    },
    {
        "content": "<p>It should touch on most requested (except, as I said, we don't really know what those are) <code>conflicts</code>, <code>subcommand</code>, <code>alisaes</code>, <code>requirements</code>. Anything else?</p>",
        "id": 191718404,
        "sender_full_name": "CreepySkeleton",
        "timestamp": 1585128654
    },
    {
        "content": "<p>I think we should do both, add a minimal FAQ and encourage users to participate in community chat</p>",
        "id": 191889348,
        "sender_full_name": "pksunkara",
        "timestamp": 1585231725
    },
    {
        "content": "<p>So I think an FAQ is a really good idea, and we should look through the docs that already exist and see how they can be made easier to navigate. I feel like maybe reducing the README down to a minimal example that people can just copy and paste in most situations, and then moving stuff into a docs folder tree (or wiki) might be a good idea.</p>\n<p>I for one usually end up looking for the same three things that are kinda buried in the hay stack</p>",
        "id": 192261272,
        "sender_full_name": "spacekookie",
        "timestamp": 1585577705
    },
    {
        "content": "<p>Or well...markdown stack :P</p>",
        "id": 192261293,
        "sender_full_name": "spacekookie",
        "timestamp": 1585577714
    },
    {
        "content": "<p>Shortening the README? Yes please. It's so long and looks so close to a documentation that some (I repeat, not enough data to make actual claims here) people confuse it with the actual documentation/examples.</p>",
        "id": 192262787,
        "sender_full_name": "CreepySkeleton",
        "timestamp": 1585578383
    },
    {
        "content": "<p>We can write a FAQ based on experience of our own, and then correct it as the we receive feedback.</p>",
        "id": 192262981,
        "sender_full_name": "CreepySkeleton",
        "timestamp": 1585578479
    },
    {
        "content": "<blockquote>\n<p>I for one usually end up looking for the same three things</p>\n</blockquote>\n<p>Those being?</p>",
        "id": 192263073,
        "sender_full_name": "CreepySkeleton",
        "timestamp": 1585578506
    },
    {
        "content": "<p>I am currently talking to someone about activating the discussions feature for our github repo. Hopefully that might help.</p>",
        "id": 192328301,
        "sender_full_name": "pksunkara",
        "timestamp": 1585609441
    }
]