[
    {
        "content": "<p>Where can I help?  Its been a while since I've been involved in WG-CLI due to life but my company is giving me time to contribute to the Rust community and I want to take advantage of it to see clap3 released.</p>\n<p>I've been digging into the pinned issues and its not quite clear what the next steps are</p>\n<ul>\n<li>There are some <a href=\"https://github.com/clap-rs/clap/issues/2164\">renames</a>.  How decided are we on these?  For any place with question marks, what is the process for deciding?  Should I just make a decision and create a PR to discuss it there?</li>\n<li>For <a href=\"https://github.com/clap-rs/clap/issues/1104\">enums</a>, there was a blog post on this being implemented a long time ago, so I'm unsure where this is at now</li>\n<li>For <a href=\"https://github.com/clap-rs/clap/issues/1041\">lifetimes</a>, it seems we are now down to just <code>'help</code> which sounds like was the goal.  I did mention in it that <code>kstring</code> is an alternative.</li>\n<li>For <a href=\"https://github.com/clap-rs/clap/issues/950\">lib blitz</a>, there aren't any problems identified.  Are we still needing to do the audit and open  issues?</li>\n<li>For <a href=\"https://github.com/clap-rs/clap/issues/1661\">custom derive</a>, it looks like this is pre-structopt.  How much is still relevant?</li>\n<li>For <a href=\"https://github.com/clap-rs/clap/issues/1037\">the rest of the 3.x tracking issue</a>, there aren't associated tasks and its unclear what is expected.</li>\n</ul>",
        "id": 245042114,
        "sender_full_name": "Ed Page",
        "timestamp": 1625579948
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"254853\">@pksunkara</span> I'm assuming you are the current maintainer; any direction you can give for where I can help?</p>",
        "id": 245322136,
        "sender_full_name": "Ed Page",
        "timestamp": 1625755010
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"424212\">@Ed Page</span> Thanks, I am looking forward to your help. I am treating the <a href=\"https://github.com/clap-rs/clap/milestone/76\">3.0 milestone</a> as the single source of truth for all the remaining work in clap. The 3.x tracking issue was the original roadmap which I want to tick stuff off too so that I didn't miss anything.</p>\n<p>I was in the middle of fixing \"Remove inherent global settings\" which is last item that needs to be done from the <code>beta</code> milestone of that tracking issue. But then, I realised that I needed to do a settings audit and gotten bogged down in it.</p>\n<hr>\n<ul>\n<li>For <code>lifetimes</code>, after our recent conversation I have moved it <code>4.0</code>. I would definitely love to give it a try and see what happens just before releasing 3.0 but to be honest, I feel like it's low priority.</li>\n<li>For <code>lib blitz</code>, we still need to do an audit and I want to do it after all the feature work has been done</li>\n<li>For <code>custom derive</code>, the issue is open because we don't have docs for those derives yet. All the feature work has been done. (There are quite a few other issues which deal purely with documentation and I definitely planned to tackle these after the settings audit).</li>\n<li>For <code>enums</code>, I honestly don't have much context about that issue and will need to talk to Kevin to understand what his original intentions were. Which is why I was holding it for to be the last of the feature work.</li>\n<li>For <code>renames</code>, feel free to write a comment there proposing any renames you would like. <code>?</code> means I haven't come up with a good name yet. I will be extending that list as part of my settings audit. I created that issue because I wanted people to discuss them and propose alternatives if they want to.</li>\n</ul>\n<hr>\n<p><a href=\"https://github.com/clap-rs/clap/issues/2005\">enum subcommand</a> is the next issue I wanted to tackle after the current work. I am not completely happy with the design proposed in that issue, so feel free to come up with a better design. Once that is done, I wanted to tackle <a href=\"https://github.com/clap-rs/clap/issues/1772\">vec types in derive</a> which is a very interesting feature to work on.</p>\n<p>I would greatly appreciate if you could spearhead those 2 issues. What do you think?</p>",
        "id": 245394949,
        "sender_full_name": "pksunkara",
        "timestamp": 1625799330
    },
    {
        "content": "<p>Sure! I'll start tackling them tomorrow!  Feel free to assign them to me.</p>\n<p>I didn't look for the milestone because of the pinned issues.  Maybe we should unpin them and/or have the 3.x tracking issue link out to the 3.0 milestone?</p>",
        "id": 245395090,
        "sender_full_name": "Ed Page",
        "timestamp": 1625799509
    },
    {
        "content": "<p>Thanks. Added reference to milestone in the 3.0 tracking issue.</p>",
        "id": 245395467,
        "sender_full_name": "pksunkara",
        "timestamp": 1625799896
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"424212\">@Ed Page</span> Thanks for working on this!</p>",
        "id": 245467687,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1625849435
    },
    {
        "content": "<p>Hey, I currently have covid. Taking a bit of rest. Will get back to all of your issue comments by the end of the week.</p>",
        "id": 246545830,
        "sender_full_name": "pksunkara",
        "timestamp": 1626757973
    },
    {
        "content": "<p>Hope you get better soon!  Worry more about that then getting back to me.</p>",
        "id": 246586557,
        "sender_full_name": "Ed Page",
        "timestamp": 1626789118
    },
    {
        "content": "<p>Hope you get better soon! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 246619703,
        "sender_full_name": "Donough Liu",
        "timestamp": 1626800526
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"254853\">@pksunkara</span> seeing you active, I take it you've recovered?</p>",
        "id": 247212226,
        "sender_full_name": "Ed Page",
        "timestamp": 1627310779
    },
    {
        "content": "<p>Yeah, replied to some of the stuff. Will catch up with the rest.</p>",
        "id": 247255269,
        "sender_full_name": "pksunkara",
        "timestamp": 1627330317
    },
    {
        "content": "<p>Glad you are doing well!</p>",
        "id": 247268560,
        "sender_full_name": "Ed Page",
        "timestamp": 1627336306
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"424212\">@Ed Page</span> Just want to make sure that you understand what I am talking about in reference to <a href=\"https://github.com/clap-rs/clap/pull/2677#discussion_r687194929\">this comment</a>. I felt like there was a bit of miscommunication in there.</p>",
        "id": 249289730,
        "sender_full_name": "pksunkara",
        "timestamp": 1628800597
    },
    {
        "content": "<p>Ok, so not a should panic test but a test for that the error condition hits even when the flag is set to true</p>",
        "id": 249290073,
        "sender_full_name": "Ed Page",
        "timestamp": 1628800793
    },
    {
        "content": "<p>(haven't had a chance to dig into he rest of the comments today; been doing some bug fixing on cargo-release)</p>",
        "id": 249290145,
        "sender_full_name": "Ed Page",
        "timestamp": 1628800825
    },
    {
        "content": "<p>Yup</p>",
        "id": 249310113,
        "sender_full_name": "pksunkara",
        "timestamp": 1628815302
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"424212\">@Ed Page</span> Do you think you can finish <a href=\"https://github.com/clap-rs/clap/pull/2677\">https://github.com/clap-rs/clap/pull/2677</a> in the next few days?</p>",
        "id": 249688600,
        "sender_full_name": "pksunkara",
        "timestamp": 1629186981
    },
    {
        "content": "<p>Yes, getting back to clap now after getting some other projects out of the way</p>",
        "id": 249738556,
        "sender_full_name": "Ed Page",
        "timestamp": 1629215509
    },
    {
        "content": "<p>Np. Also want to let you know that I am reading all your comments on issues tagged as 4.0 but unless I really want to reply, I am not focusing on them at all for now. It's for when 3.0 is stable.</p>",
        "id": 249822844,
        "sender_full_name": "pksunkara",
        "timestamp": 1629276868
    }
]