[
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"119031\">@Esteban Küber</span> and other <span class=\"user-group-mention\" data-user-group-id=\"1187\">@WG-diagnostics</span> folks:</p>\n<p>Did you all see the <a href=\"https://elm-lang.org/news/the-syntax-cliff\" target=\"_blank\" title=\"https://elm-lang.org/news/the-syntax-cliff\">new elm post</a> about syntax errors? Some cool stuff in there. One thing I particularly found interesting was this:</p>\n<blockquote>\n<p>So language designers never hear about this problem. I only understood its magnitude once elm/error-message-catalog got going. That repo solicits confusing error messages in hopes of finding ways to improve. I think projects like that legitimize the idea that \"error messages should be better\" such that I started hearing from a broader range of people. (Not just the very non-random sample of users that participate online!)</p>\n</blockquote>\n<p>I wonder if there are steps we can take to help encourage people to report confusing error messages. We already get enough, so maybe we don't need to do any new work here -- and I'm not sure if a dedicated repo is what we need -- maybe an issue template or something? Not sure. Anyway I thought it was cool!</p>\n<p>(hat tip <span class=\"user-mention\" data-user-id=\"203289\">@boats</span>, who sent it to me)</p>",
        "id": 178753368,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1571749581
    },
    {
        "content": "<p>I feel like we've been doing these syntax oriented errors for a while now :)</p>",
        "id": 178753417,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1571749637
    },
    {
        "content": "<p>That's a awesome post. There's always room to do more, but I think we already (and by we, I mean <span class=\"user-mention\" data-user-id=\"119031\">@Esteban Küber</span> mostly) do a pretty good job at encouraging people to report confusing error messages and trying to improve them.</p>",
        "id": 178753588,
        "sender_full_name": "davidtwco",
        "timestamp": 1571749772
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> I read the post earlier; some points:</p>\n<ol>\n<li>We already get a lot of these reports; we track them with <code>D-newcomer</code>, <code>D-confusing</code>, etc.</li>\n<li>We need to balance the happy path of the parser (the actual grammar of the language) with the amount of code required to do recovery and how invasive such recovery is. If an error message can be isolated into a dedicated method then fine, but I'm wary if it is not and requires tracking a lot of state.</li>\n<li>We need to balance these long error messages which may be good for newcomers with inflating how quickly an error message can be read for intermediate and regular users. Longer diagnostics should be activated with <code>--teach</code></li>\n<li>I think we already offer good, actionable, and often <code>MachineApplicable</code> suggestions. I'm not a fan of the anthropomorphization of the compiler, it doesn't make errors more actionable and just increases wordiness</li>\n</ol>",
        "id": 178753944,
        "sender_full_name": "centril",
        "timestamp": 1571750014
    },
    {
        "content": "<blockquote>\n<p>I feel like we've been doing these syntax oriented errors for a while now <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>\n</blockquote>\n<p>Yes, the majority of the code in the parser is probably for such errors.</p>",
        "id": 178754021,
        "sender_full_name": "centril",
        "timestamp": 1571750050
    },
    {
        "content": "<blockquote>\n<p>[...] I think projects like that legitimize the idea that \"error messages should be better\" [...]</p>\n</blockquote>\n<p>I think that's already an idea we back, but as aforementioned, diagnostics have a cost, and we should be cognizant of the bugs they introduce (ICEs, deviations from the actual grammar) and the difficulty of reading the code.</p>",
        "id": 178754377,
        "sender_full_name": "centril",
        "timestamp": 1571750281
    },
    {
        "content": "<p>1) regarding style, were a bit more terse and less friendly in the copy we choose to use, but we're friendlier than other compilers out there. I feel we strike a good middle point<br>\n2) We should probably resuscitate --teach as a concept. I've spent a lot of time trying to add info to the existing default errors, but there's so much more we could mention with teach.<br>\n3) There's a lot of code for diagnostics in the compiler already. We effectively support a superset of the language. But as we get increasingly more user friendly, it's getting harder to stay with no impact to the performance of the happy path.<br>\n4) We do have a bias towards people with some level of experience writing code. Catering to absolute newcomers would probably be best served by the teach flag and possibly a more aggressive culling of errors.</p>",
        "id": 178807639,
        "sender_full_name": "Esteban Küber",
        "timestamp": 1571785880
    },
    {
        "content": "<p>I prefer the terser error messages — the paragraph of text works when you just have one error, but not 10</p>",
        "id": 178813519,
        "sender_full_name": "varkor",
        "timestamp": 1571792251
    }
]