[
    {
        "content": "<p>Hi! I am taking a look at improving a diagnostic that currently produces a suggestion to import a private/not-accessible item (which doesn't work on its own), issue <a href=\"https://github.com/rust-lang/rust/issues/50923\">#50923</a>.<br>\nI'm wondering whether it would generally be considered preferable to keep the invalid suggestion, but add some additional text to the effect that the visibility also needs to change, or stop making the concrete edit suggestion and instead only point out that the private item exists and could be used as a <code>note:</code>?</p>",
        "id": 252335089,
        "sender_full_name": "spaarmann",
        "timestamp": 1631033264
    },
    {
        "content": "<p>(I also want to have a go at producing a correct/valid suggestion when possible instead, but as this is my first contribution to the compiler and I don't know if I'll actually manage that, I figured it's better to start small and at least make a bit of progress on the issue)</p>",
        "id": 252335299,
        "sender_full_name": "spaarmann",
        "timestamp": 1631033346
    },
    {
        "content": "<p>What ideally would happen is that for private but crate local items would get the import suggestion and a suggestion to make them importable, while items from other crates would get a note saying \"you want this but you can't import it because it's private\"</p>",
        "id": 252504977,
        "sender_full_name": "Esteban Küber",
        "timestamp": 1631123972
    },
    {
        "content": "<p>The first will be enough for most projects, and the second gives context</p>",
        "id": 252505029,
        "sender_full_name": "Esteban Küber",
        "timestamp": 1631123994
    },
    {
        "content": "<p>But as you state, ideally we would look for a public path that can be used instead, but even with that, we have to handle the non-importable case.</p>",
        "id": 252505194,
        "sender_full_name": "Esteban Küber",
        "timestamp": 1631124029
    },
    {
        "content": "<p>Thanks, that makes sense. I should definitely be able to add an extra <code>help:</code> or so that points out you'd need to first make the item importable for crate-local things; and I'll probably try producing an actual suggestion for doing so too.</p>",
        "id": 252660456,
        "sender_full_name": "spaarmann",
        "timestamp": 1631207169
    }
]