[
    {
        "content": "<p>It's nice to add lint that checks if newly-added diagnostic messages follow <a href=\"https://rustc-dev-guide.rust-lang.org/diagnostics.html#diagnostic-output-style-guide\">some conventions</a>, but I guess it's hard to get the lint implemented because there are a bunch of helper functions/methods that produce diag messages.<br>\nAlternatively, we can add a script that iterates through all <code>.stderr</code> files and check if the conventions are practiced, and run it on CI or something.<br>\nDo you think it's worth adding the lint or the script?<br>\ncc: <span class=\"user-mention\" data-user-id=\"119031\">@Esteban K端ber</span></p>",
        "id": 254821310,
        "sender_full_name": "Hirochika Matsumoto",
        "timestamp": 1632558800
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"331617\">@Hirochika Matsumoto</span> that's an excellent idea. I think we could make start with some small checks first, like making sure we don't start messages with upper case and things like that and build up from there. What do you think?</p>",
        "id": 254825996,
        "sender_full_name": "Esteban K端ber",
        "timestamp": 1632563546
    },
    {
        "content": "<p>The script idea also helps and I would like to make it clear when spans overlap so that have some way of revising them to try to avoid that. That could be integrated into the test machinery that checks the //~ annotations</p>",
        "id": 254826052,
        "sender_full_name": "Esteban K端ber",
        "timestamp": 1632563639
    },
    {
        "content": "<blockquote>\n<p>I think we could make start with some small checks first, like making sure we don't start messages with upper case and things like that and build up from there. What do you think?</p>\n</blockquote>\n<p>Can't agree more. I gonna make a small PoC with the latter (a script) approach tomorrow and see how it goes. With the former approach it's hard to support clippy I presumed.</p>\n<blockquote>\n<p>That could be integrated into the test machinery that checks the //~ annotations</p>\n</blockquote>\n<p>That's interesting. I'll ask you for some advice on the integration once the PoC is done.</p>",
        "id": 254853053,
        "sender_full_name": "Hirochika Matsumoto",
        "timestamp": 1632588343
    },
    {
        "content": "<p>PoC's here: <a href=\"https://github.com/hkmatsumoto/diaglint\">https://github.com/hkmatsumoto/diaglint</a></p>",
        "id": 254943903,
        "sender_full_name": "Hirochika Matsumoto",
        "timestamp": 1632674096
    },
    {
        "content": "<p>I'll take a look at it tomorrow</p>",
        "id": 254954510,
        "sender_full_name": "Esteban K端ber",
        "timestamp": 1632683685
    },
    {
        "content": "<p>We also tried to do this in Clippy and found that writing a internal lint in Clippy was not viable. So Clippy has a test, that checks the <code>stderr</code> outputs: <a href=\"https://github.com/rust-lang/rust-clippy/blob/master/tests/lint_message_convention.rs\">https://github.com/rust-lang/rust-clippy/blob/master/tests/lint_message_convention.rs</a></p>",
        "id": 255177524,
        "sender_full_name": "flip1995",
        "timestamp": 1632816252
    }
]