[
    {
        "content": "<p>Hello, in Clippy we've discussed some ways how we can get more early feedback and maybe reduce the false positive rate for new lints. One problem, is that sometimes new lints are only available on nightly for one week until the beta branch is created. It is still possible to address some issues with backports, but ideally, we would like to increase the time that new lints stay on nightly to get more feedback from users. It was suggested to add nightly lints which behave like normal lints on nightly, but are allow-by-default on beta and stable.</p>",
        "id": 272393640,
        "sender_full_name": "xFrednet",
        "timestamp": 1645186115
    },
    {
        "content": "<p>Is that something that could potentially be implemented in rustc?</p>",
        "id": 272393684,
        "sender_full_name": "xFrednet",
        "timestamp": 1645186151
    },
    {
        "content": "<p>cc: <span class=\"user-mention\" data-user-id=\"264664\">@flip1995</span> <span class=\"user-mention\" data-user-id=\"360405\">@Cameron Steffen</span></p>",
        "id": 272393711,
        "sender_full_name": "xFrednet",
        "timestamp": 1645186178
    },
    {
        "content": "<p>As a possible way to implement this, I would think of adding a <code>is_nightly</code>/<code>is_unstable</code> field to the <code>Lint</code> struct and during lint emission to check that field  and check if the current toolchain is the nightly toolchain.</p>\n<p>Another question that is still not really answered is how to deal with <code>allow</code>/... attributes of those nightly lints on a stable/beta toolchain. Mostly this is because Clippy is really limited in what it can do here. I think this could also be handled better and more flexible in rustc.</p>",
        "id": 272394442,
        "sender_full_name": "flip1995",
        "timestamp": 1645186713
    },
    {
        "content": "<p>As an alternative we may be able to reuse the <code>feature_gate</code> field of the <code>Lint</code> struct and gate Clippy lints under a <code>clippy_nightly</code> feature or similar and then enable this feature through the <code>clippy-driver</code> if we're in a nightly build. But I'm not sure if that is technically possible in Clippy. This also feels a bit hacky to me.</p>",
        "id": 272394695,
        "sender_full_name": "flip1995",
        "timestamp": 1645186883
    },
    {
        "content": "<p>Implementing it is pretty easy, I think. I'm worried about the likelihood of beta promotion failure as a result of divergence in clippy (or rustc tests)</p>",
        "id": 272397107,
        "sender_full_name": "simulacrum",
        "timestamp": 1645188442
    },
    {
        "content": "<p>We can try and mitigate that of course, but it's not atypical for this kind of thing to end up going somewhat poorly :)</p>",
        "id": 272397211,
        "sender_full_name": "simulacrum",
        "timestamp": 1645188485
    },
    {
        "content": "<p>I think a big question is how these lints should behave on stable. If we only change the lint level depending on if they are nightly or not, then tests should remain working as usual as long as we have <code>#[deny(lint_name)]</code> in the file. Otherwise, it might require some more hackery</p>",
        "id": 272413139,
        "sender_full_name": "xFrednet",
        "timestamp": 1645197056
    },
    {
        "content": "<p>If nobody is apposed to that idea, I'd be happy to work on that. I already build two prototypes in Clippy which are a bit hacky. First, I'll wait some more to give everyone the opportunity or answer :)</p>",
        "id": 272413328,
        "sender_full_name": "xFrednet",
        "timestamp": 1645197141
    },
    {
        "content": "<blockquote>\n<p>I'm worried about the likelihood of beta promotion failure as a result of divergence in clippy (or rustc tests)</p>\n</blockquote>\n<p>If we introduce nightly lints in Clippy, this is of concern either way, I think. So we'll have to deal with it anyway, regardless if we implement support for nightly lints in rustc directly or in Clippy. </p>\n<p>But yeah, that wasn't on the list of concerns I had about this. Thanks for pointing it out! :)</p>",
        "id": 272413595,
        "sender_full_name": "flip1995",
        "timestamp": 1645197296
    }
]