[
    {
        "content": "<p>Where is the information for features such as <code>staged_api</code> and <code>rustc_private</code><br>\ngenerated such that it renders in the unstable book?</p>",
        "id": 212182509,
        "sender_full_name": "oliver",
        "timestamp": 1601747722
    },
    {
        "content": "<p>Those aren't documented in the unstable book, so I'm a bit confused by the question.  If you mean the stubs, they are in <code>src/tools/unstable-book-gen</code>. If you mean, where you would put documentation to appear in the unstable book, that is <code>src/doc/unstable-book</code>.  But those specific attributes are documented in <a href=\"https://rustc-dev-guide.rust-lang.org/stability.html\">https://rustc-dev-guide.rust-lang.org/stability.html</a>.</p>",
        "id": 212182902,
        "sender_full_name": "Eric Huss",
        "timestamp": 1601748260
    },
    {
        "content": "<p>Hidden in plain sight, thanks!</p>",
        "id": 212183300,
        "sender_full_name": "oliver",
        "timestamp": 1601748729
    },
    {
        "content": "<p>Is there value in documenting some of these features which are defaulting to the<br>\ngeneric output?</p>",
        "id": 212184769,
        "sender_full_name": "oliver",
        "timestamp": 1601750816
    },
    {
        "content": "<p>Like the stub pages?  It depends on the feature.  If it just has a link to the tracking issue, and the tracking issue contains enough documentation, there probably isn't a strong reason to add anything.  If it's just a new API in the standard lib, the docs are in the standard lib (and should be relatively easy to find via the tracking issue).  If there aren't any docs in the tracking issue, then it probably should be added either in the tracking issue or in the unstable book.  If it is the \"internal only\" stub, I would like to at least see <em>something</em> (a link to the relevant section of the rustc-dev-guide, or a brief description, or a link to the code if it is documented there).</p>",
        "id": 212185525,
        "sender_full_name": "Eric Huss",
        "timestamp": 1601752021
    }
]