[
    {
        "content": "<p>The Nomicon is not the Reference, but parts of it are certainly related, and the Nomicon, too, probably needs some love... would it make sense to treat them together to an extend?</p>",
        "id": 197785117,
        "sender_full_name": "RalfJ",
        "timestamp": 1589619128
    },
    {
        "content": "<p>Also I am looking for a reviewer for <a href=\"https://github.com/rust-lang/nomicon/pull/218\">this PR</a> :D</p>",
        "id": 197785123,
        "sender_full_name": "RalfJ",
        "timestamp": 1589619137
    },
    {
        "content": "<p>It seems reasonable to treat them together to some degree, but I don't know what that actually means.  Like attracting qualified reviewers?  Syncing and migrating content?  Setting up team permissions for the repos?</p>",
        "id": 197799241,
        "sender_full_name": "Eric Huss",
        "timestamp": 1589640888
    },
    {
        "content": "<p>well, I figured people qualified to review reference PRs are likely also qualified to review nomicon PRs</p>",
        "id": 197805743,
        "sender_full_name": "RalfJ",
        "timestamp": 1589649946
    },
    {
        "content": "<p>so if there is a reference WG like this stream makes it sound, maybe I mean that the Nomicon should be put into the \"jurisdiction\" of the reference WG</p>",
        "id": 197805789,
        "sender_full_name": "RalfJ",
        "timestamp": 1589649983
    },
    {
        "content": "<blockquote>\n<p>well, I figured people qualified to review reference PRs are likely also qualified to review nomicon PRs</p>\n</blockquote>\n<p>I wouldn't say that in general.  I don't feel qualified to review nomicon PRs (or most of the reference for that matter).  But I do feel comfortable reviewing many things in the reference (lexer, grammar, attributes, \"easy\" things, style, formatting, etc.).  I suspect the number of people who can accurately review nomicon-level topics is very small.</p>\n<p>(BTW, I did look at your PR, and it looks good to me, but I don't really know if it is correct, so I can't help much.)</p>",
        "id": 197808558,
        "sender_full_name": "Eric Huss",
        "timestamp": 1589654040
    },
    {
        "content": "<p>hm fair... I have only looked at or edited the parts of the references that are about unsafe code and the like, which is a lot like the nomicon in terms of required reviewer expertise. but the reference is broader than that.</p>",
        "id": 197837936,
        "sender_full_name": "RalfJ",
        "timestamp": 1589704740
    }
]