[
    {
        "content": "<p>I'd like to propose having an audio meeting about the Reference. At a minimum, I'd like to have @ehuss attend, but also anybody else who wishes too.</p>",
        "id": 223580147,
        "sender_full_name": "isHavvy",
        "timestamp": 1611268124
    },
    {
        "content": "<p>I can probably do an audio meeting. I'm in Pacific US timezone.  Do you have a specific agenda?</p>",
        "id": 223654481,
        "sender_full_name": "Eric Huss",
        "timestamp": 1611328733
    },
    {
        "content": "<p>I'm Mountain US time zone and would listen in if it fit my schedule</p>",
        "id": 223675353,
        "sender_full_name": "Lokathor",
        "timestamp": 1611337934
    },
    {
        "content": "<p>I'm also pacific standard time, though I tend to get up after noon / have an ever shifting work schedule. I do have some topics in mind, but I haven't written them down. They're things I feel would make quick progress discussing it. I'll write them down in a couple minutes though.</p>\n<p>Currently I'm completely off Monday through Wednesday and Friday next week if there's a good time/date for you on one of them.</p>",
        "id": 223719919,
        "sender_full_name": "isHavvy",
        "timestamp": 1611361415
    },
    {
        "content": "<p>The things I'd like to discuss:</p>\n<ul>\n<li>Pros and cons to switching to one sentence is one line.</li>\n<li>A discussion on what layout actually is and what has layout.</li>\n<li>Usage of \"place operand\".</li>\n<li>Express my gratitude.</li>\n</ul>",
        "id": 223721206,
        "sender_full_name": "isHavvy",
        "timestamp": 1611362568
    },
    {
        "content": "<p>Mondays are the only daytime segment I have free, so let's do that if <span class=\"user-mention\" data-user-id=\"120518\">@Eric Huss</span> (and any others) can also do Monday</p>",
        "id": 223725962,
        "sender_full_name": "Lokathor",
        "timestamp": 1611367868
    },
    {
        "content": "<p>Any time on Monday is fine with me.</p>",
        "id": 223753521,
        "sender_full_name": "Eric Huss",
        "timestamp": 1611413918
    },
    {
        "content": "<p>Alright. Let's say 1PM? Also, we need a platform that supports voice. I'd say Discord, but we don't have a voice channel on the Rust server, so what work's for y'all?</p>",
        "id": 223768095,
        "sender_full_name": "isHavvy",
        "timestamp": 1611429658
    },
    {
        "content": "<p>1pm pacific?</p>",
        "id": 223773719,
        "sender_full_name": "Lokathor",
        "timestamp": 1611433794
    },
    {
        "content": "<p>hangouts or a discord server is fine. there are voice channels in the community server that are usually free</p>",
        "id": 223773789,
        "sender_full_name": "Lokathor",
        "timestamp": 1611433846
    },
    {
        "content": "<p>1pm is good.  I don't have much of an opinion on what to use.</p>",
        "id": 223830382,
        "sender_full_name": "Eric Huss",
        "timestamp": 1611516202
    },
    {
        "content": "<p>I'm not sure how to contact the people who run the official Rust discord and we're all on the unofficial one, so we might as well use that one. I'll post an invite in here as well for anybody else who wants to listen who might not be in that one.</p>",
        "id": 223858531,
        "sender_full_name": "isHavvy",
        "timestamp": 1611554672
    },
    {
        "content": "<p><a href=\"https://discord.gg/rwetEadT\">Invite link for the community discord</a></p>",
        "id": 223955865,
        "sender_full_name": "isHavvy",
        "timestamp": 1611606842
    },
    {
        "content": "<p>My notes from the meeting:</p>\n<p>Layout:</p>\n<p>Move to memory model;<br>\nIdentity holes in what is described;<br>\nDescribe in terms of memory and not just types.<br>\nType representation attributes should still be on the layout page.</p>\n<p>Place operand: Good to use;</p>\n<p>Grammar: Explicitly document the ambiguity of expressions;</p>\n<p>Attributes:</p>\n<p>They're the only documentation we have on it.<br>\nFigure out where they're allowed but useless.</p>\n<p>Boolean:</p>\n<p>Describe the behavior of operators on the type chapter; link to this behavior<br>\non the operators page. There's a weird part where the operator traits are impled<br>\nin the library and not in the language.</p>\n<p>Normative:</p>\n<p>People really really want us to have even a single normative statement. Would<br>\nneed the lang team to sign off on this. It's hard because it's hard to verify<br>\nthat it's correct. Other languages references aren't always specified great<br>\neither.</p>\n<p>Quality:</p>\n<p>Ultimately, the want for normativeness seems to be a want for assurance of quality.<br>\nIt's hard to state whether a page is missing something, but some pages are<br>\nobviously missing quality. Perhaps we can leave comments stating that we believe<br>\nthey are of the standard for the Reference.</p>",
        "id": 223968275,
        "sender_full_name": "isHavvy",
        "timestamp": 1611612346
    },
    {
        "content": "<p>If you feel I missed anything of substance, it was hard to write and talk at the same time. It's also not in temporal order.</p>",
        "id": 223968609,
        "sender_full_name": "isHavvy",
        "timestamp": 1611612436
    },
    {
        "content": "<p>I'd say that normative is different from quality.</p>",
        "id": 223978129,
        "sender_full_name": "Lokathor",
        "timestamp": 1611617609
    },
    {
        "content": "<p>Currently, the compiler overrides the reference. if the reference says something that the compiler doesn't do, basically the reference is wrong</p>",
        "id": 223978208,
        "sender_full_name": "Lokathor",
        "timestamp": 1611617650
    },
    {
        "content": "<p>(or maybe there's a bug, whatever, i don't care)</p>",
        "id": 223978240,
        "sender_full_name": "Lokathor",
        "timestamp": 1611617670
    },
    {
        "content": "<p>however, when there's a normative statement somewhere, then that takes priority, and the compiler becomes the thing that's wrong</p>",
        "id": 223978275,
        "sender_full_name": "Lokathor",
        "timestamp": 1611617693
    },
    {
        "content": "<blockquote>\n<p>however, when there's a normative statement somewhere, then that takes priority, and the compiler becomes the thing that's wrong</p>\n</blockquote>\n<p>Indeed, and it gives other implementors something they can use, rather than trying to figure out every edge case in rust{,c} themselves.</p>",
        "id": 223982265,
        "sender_full_name": "Connor Horman",
        "timestamp": 1611620695
    }
]