[
    {
        "content": "<p>I was wondering if it would help if people could commit to a regular time for discussing and reviewing reference PRs, perhaps something like 30 minutes a week? This could either be synchronous or asynchronous. I am overwhelmed with reviews across all my projects, and just realized its been almost 3 weeks since I looked at some of these PRs. Many are stuck waiting for more knowledgeable people to look at. Some are stuck for various other reasons.</p>\n<p>Some that could use help:</p>\n<p><a href=\"https://github.com/rust-lang/reference/pull/834\">https://github.com/rust-lang/reference/pull/834</a> — Waiting for t-lang to decide if a commitment of usize/isize is at least 16-bits is a reasonable assertion.</p>\n<p><a href=\"https://github.com/rust-lang/reference/pull/841\">https://github.com/rust-lang/reference/pull/841</a> — Monomorphization and statics. Seems reasonable, but I do not know if this is always true.</p>\n<p><a href=\"https://github.com/rust-lang/reference/pull/837\">https://github.com/rust-lang/reference/pull/837</a> — Could use another opinion on the exact wording.</p>\n<p><a href=\"https://github.com/rust-lang/reference/pull/843\">https://github.com/rust-lang/reference/pull/843</a> — Needs review by someone more knowledgeable than me.</p>\n<p>(or really, any of the 27 open PRs)</p>",
        "id": 203140035,
        "sender_full_name": "Eric Huss",
        "timestamp": 1594146098
    },
    {
        "content": "<blockquote>\n<p>Monomorphization and statics. Seems reasonable, but I do not know if this is always true.</p>\n</blockquote>\n<p>Statics can <strong>never</strong> be generic. It is impossible to guarantee for generic things that they are not duplicated across codegen units/crates and statics are not allowed to be duplicated.</p>",
        "id": 203140343,
        "sender_full_name": "bjorn3",
        "timestamp": 1594146250
    },
    {
        "content": "<blockquote>\n<p>Waiting for t-lang to decide if a commitment of usize/isize is at least 16-bits is a reasonable assertion.</p>\n</blockquote>\n<p>A system with 8bit pointers is basically unusable for anything more high-level than assembly.</p>",
        "id": 203140830,
        "sender_full_name": "bjorn3",
        "timestamp": 1594146490
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"133247\">@bjorn3</span> regarding statics, do you think it makes sense to explicitly state (as the PR does) that even in a generic item, statics are never duplicated?  I never really considered it, but I can see how there is a bit of ambiguity.  I guess what I'm asking, are you agreeing with the PR?  Or are you saying it is redundant?</p>",
        "id": 203141829,
        "sender_full_name": "Eric Huss",
        "timestamp": 1594147005
    },
    {
        "content": "<p>I don't think it is redundant to state that statics are never duplicated.</p>",
        "id": 203142124,
        "sender_full_name": "bjorn3",
        "timestamp": 1594147178
    },
    {
        "content": "<p>It could say that because of this statics defined in a generic scope are pulled out of it to prevent monomorphization from duplication them. (or something like that)</p>",
        "id": 203142247,
        "sender_full_name": "bjorn3",
        "timestamp": 1594147233
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120518\">@Eric Huss</span> What's the process for reviewing? Would it be appropriate for someone on the lang team to r+ something on the reference (does it use bors?), or should (and can) we use rfcbot to gauge consensus, or should we just leave a review?</p>",
        "id": 203143415,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1594147777
    },
    {
        "content": "<p>Also, I would be <em>happy</em> to see wg-reference reviews in either a triage meeting or design meeting. Perhaps we could use one of the upcoming design meeting slots (e.g. July 15) to process some of the backlog?</p>",
        "id": 203143576,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1594147827
    },
    {
        "content": "<p>The process historically has been wg-grammar members would review and merge. There is no bors.  Do you have write access to the repo?  If not, I'd like to fix that.  I'd prefer to use bors and give all of t-lang permission, but that will require help from infra.  As for consensus building, there hasn't been anything formal (except for extremely rare cases like <a href=\"https://github.com/rust-lang/rust/issues/71033\">https://github.com/rust-lang/rust/issues/71033</a>).  Maybe rfcbot would be a good idea?  I'm reluctant to add more process, though.  </p>\n<p>For now, just doing normal GitHub reviews should be fine.  If you can't click merge, I can do that until we fix permissions (unless I am the author).</p>",
        "id": 203146998,
        "sender_full_name": "Eric Huss",
        "timestamp": 1594149211
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120518\">@Eric Huss</span> I wasn't looking to request any change to the process; I was just asking what the process is. :)</p>",
        "id": 203195643,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1594152077
    },
    {
        "content": "<p>And it appears that everyone on the lang team has admin permissions on that repo.</p>",
        "id": 203195812,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1594152169
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"120518\">@Eric Huss</span> hmm so -- one thing I can do is to adjust our lang team sync</p>",
        "id": 205169326,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1595884607
    },
    {
        "content": "<p>in particular I don't think our current searches will find issues from the reference repo</p>",
        "id": 205169344,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1595884620
    },
    {
        "content": "<p>so e.g. we can't handle nominations</p>",
        "id": 205169383,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1595884645
    },
    {
        "content": "<p>also, if you want to assign PRs to me, I will do my best to review them, though I'm currently on a bit of a bender due to various short term obligations</p>",
        "id": 205169411,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1595884671
    }
]