[
    {
        "content": "<p>In the Introduction Rust reference (<a href=\"https://doc.rust-lang.org/reference/introduction.html\">https://doc.rust-lang.org/reference/introduction.html</a>) under the heading \"What The Reference is Not\" beginning sentence of the final paragraph says: \"Finally, this book is not normative.\". However the last paragraph under the heading \"Contributing\" says: \"We also want the reference to be as normative as possible, so if you see anything that is wrong or is non-normative but not specifically called out,....\". These two statements seems to be contradicting in nature. If it states upfront that the book is \"non-normative\" , why would it be expected that issues raised when non-normative things aren't called out. Or do I miss something  ? Thanks in advance.</p>",
        "id": 240185586,
        "sender_full_name": "Sateesh",
        "timestamp": 1621948770
    },
    {
        "content": "<p>I've been thinking about that language</p>",
        "id": 240186627,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1621949225
    },
    {
        "content": "<p>I think a better way to say it might be that the rust reference is a \"work in progress\"</p>",
        "id": 240186654,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1621949236
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> does it makes sense to open an issue for  this. Either of these  sentences can be rephrased for clarity.</p>",
        "id": 240189003,
        "sender_full_name": "Sateesh",
        "timestamp": 1621950210
    },
    {
        "content": "<p>I'd like to hear what others folks think first )</p>",
        "id": 240193510,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1621952019
    },
    {
        "content": "<p>My take though is that the Rust reference is a WIP, and in the event of a discrepancy between it and the compiler, RFCs, etc, we should work to reconcile them, but the correct answer could be any of one of those (or none). The lang team is there to work through that.</p>",
        "id": 240193679,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1621952080
    },
    {
        "content": "<p>Yea, I agree with Niko.  I think maybe some clarifications would be:</p>\n<blockquote>\n<p>...is <em>currently</em> not normative.</p>\n</blockquote>\n<p>and the second part:</p>\n<blockquote>\n<p>We also want the reference to be up to a level of quality where it can eventually be considered normative. If you see anything this is wrong or incomplete, please also file an issue.</p>\n</blockquote>\n<p>I'm not exactly sure if that is the right way to phrase it, since the reference is so far from being a full specification that it isn't really clear if that is the end goal.  Like an eventual formalism might look completely different.  But the current track is that it strives to be a full and correct description of the language. I feel like sometimes people get hung up on the word \"normative\", and I would be fine just removing it.</p>",
        "id": 240197580,
        "sender_full_name": "Eric Huss",
        "timestamp": 1621953616
    },
    {
        "content": "<p>Yeah may be removing the word \"normative\" is a better choice. I have just started with Rust and started looking around the reference. The dictionary definition <a href=\"https://www.merriam-webster.com/dictionary/normative\">https://www.merriam-webster.com/dictionary/normative</a> lists three definitions and the contradiction in the statements in the two sections confused me about in what usage sense \"normative\" is mentioned in the documentation. Thanks for all your work and I hope I am not being overtly pedantic, if so sorry for that.</p>",
        "id": 240199364,
        "sender_full_name": "Sateesh",
        "timestamp": 1621954344
    },
    {
        "content": "<p>No, not overly pedantic at all, the feedback is very much appreciated!  I agree it is a little confusing, and it would be good to make it a little clearer.</p>",
        "id": 240199815,
        "sender_full_name": "Eric Huss",
        "timestamp": 1621954515
    }
]