[
    {
        "content": "<p>It was requested that I update the reference for stabilizing <code>#[derive(Default)]</code> on <code>enum</code>s. Where should this go? There's <a href=\"https://doc.rust-lang.org/nightly/reference/attributes/derive.html\">a brief bit on derives</a>, but nothing more closely tied to the behavior of built-in derives. Should I just add a subsection on the linked page?</p>",
        "id": 274460175,
        "sender_full_name": "Jacob Pratt 🇺🇦",
        "timestamp": 1646688358
    },
    {
        "content": "<p>Yeah. Having at least a list of the built-in derives would be nice. I wouldn't try documenting too much about them in the initial PR since it'd probably be contested how much we want to document about each one, but if you feel like, you could try fleshing out information about said list in a second PR.</p>",
        "id": 274501340,
        "sender_full_name": "isHavvy",
        "timestamp": 1646720465
    },
    {
        "content": "<p>Relatedly, that page should probably talk about derive helper macros from the usage standpoint as well.</p>",
        "id": 274501353,
        "sender_full_name": "isHavvy",
        "timestamp": 1646720514
    },
    {
        "content": "<p>While I do think these should be mentioned in the reference, I'm tempted to say that the primary documentation should be in the standard library docs, attached to the trait.</p>",
        "id": 274502482,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646721668
    },
    {
        "content": "<p>For instance, the <code>derive(Default)</code> docs could live at <a href=\"https://doc.rust-lang.org/std/default/trait.Default.html\">https://doc.rust-lang.org/std/default/trait.Default.html</a> (which they already seem to in part).</p>",
        "id": 274502501,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1646721697
    },
    {
        "content": "<p>That sounds reasonable. I'll make a mention of it in the <code>Default</code> docs as part of the stabilization PR.</p>",
        "id": 274505036,
        "sender_full_name": "Jacob Pratt 🇺🇦",
        "timestamp": 1646724249
    },
    {
        "content": "<p>I would lean towards just keeping it in the <code>std</code> docs for <code>Default</code>.   I see it as akin to a proc-macro provided by the standard library (although, implemented a bit differently).</p>",
        "id": 274586678,
        "sender_full_name": "Eric Huss",
        "timestamp": 1646765137
    }
]