[
    {
        "content": "<p>Hi, this is DH who translated Rust survey of the last and this years to Korean.</p>\n<p>In the list of languages in the question asking language fluency , in the \"Demographics\" section, Korean, for instance, is not included. I added Korean to the top of the list last year while being afraid of confusing the result aggregation (since one who do it may be confused by the different ordering of languages). This year I put Korean right before \"etc.\" item.</p>\n<p>If I were one answering the survey with a translation to one's mother tongue, I'd expect my mother tongue to be in the list. So I think it would be better to add all the languages with a translation of the survey to the list. Or we may set a rule for translators that one's target language should be placed at the top or end of the list.</p>\n<p>What do you think?</p>",
        "id": 182319073,
        "sender_full_name": "DH",
        "timestamp": 1575268227
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"252308\">@DH</span> you do have a great point :)<br>\nIf time allows to further edit the master form, I'd vote to update all translations to reflect this change: add the form language as first language of that list.<br>\nHowever I'm not sure what happens when putting different labels on the first item of that list. Is the results correctly aggregated or do we end up with a lot of \"first item choice\" (actually corresponding to the value of the first item in the master form)?<br>\nhope I could explain what I mean :-)</p>",
        "id": 182325658,
        "sender_full_name": "apiraino",
        "timestamp": 1575277113
    },
    {
        "content": "<p>I believe the intent is to publish the survey today, so I don't know if there's time to change master survey, and update the other surveys. Not that your point isn't valid, whether the translations can add extra item, I think that's up to <span class=\"user-mention\" data-user-id=\"250246\">@Jasun Carr</span> I don't know if this affects the results of the survey.</p>",
        "id": 182327060,
        "sender_full_name": "XAMPPRocky",
        "timestamp": 1575278490
    },
    {
        "content": "<p>It's ok not to immediately remedy the situation. It would be good enough if we can reflect such a consideration to the next survey.</p>",
        "id": 182328699,
        "sender_full_name": "DH",
        "timestamp": 1575279742
    },
    {
        "content": "<p>we should definitely be taking some notes for next year</p>",
        "id": 182344500,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1575293285
    },
    {
        "content": "<p>that sounds good <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 182344823,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1575293515
    },
    {
        "content": "<p><a href=\"https://docs.google.com/document/d/1hUJ_76ufq_5-qlBftgEgpa8EHXpznklAk-pdRryS1mM/edit?usp=sharing\" target=\"_blank\" title=\"https://docs.google.com/document/d/1hUJ_76ufq_5-qlBftgEgpa8EHXpznklAk-pdRryS1mM/edit?usp=sharing\">https://docs.google.com/document/d/1hUJ_76ufq_5-qlBftgEgpa8EHXpznklAk-pdRryS1mM/edit?usp=sharing</a></p>",
        "id": 182344908,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1575293543
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"252308\">@DH</span> can you add your thoughts there?</p>",
        "id": 182344923,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1575293551
    },
    {
        "content": "<p>just changed the link to Google docs so we keep a copy on the Survey Drive directory</p>",
        "id": 182347191,
        "sender_full_name": "Santiago Pastorino",
        "timestamp": 1575295019
    },
    {
        "content": "<p>k</p>",
        "id": 182347331,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1575295105
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116266\">@Santiago Pastorino</span> I'll leave some note there shortly.</p>",
        "id": 182407770,
        "sender_full_name": "DH",
        "timestamp": 1575336401
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"252308\">@DH</span> Well, that's an embarrassing oversight... Go ahead and leave Korean as an option in the Korean translation (it won't negatively effect the survey results) and let's definitely add an item on the changes/notes for next year to make sure that all translated languages are included in the language list.</p>",
        "id": 182462527,
        "sender_full_name": "Jasun Carr",
        "timestamp": 1575388432
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"250246\">@Jasun Carr</span> Korean is already at the bottom of the choices this year, right before the Google Forms generated last item ('other' in English? Google Forms show me that in Korean to me). Thanks for confirming that it's ok to add Korean to the choices from your professional perspective.</p>",
        "id": 182504018,
        "sender_full_name": "DH",
        "timestamp": 1575412242
    }
]