[
    {
        "content": "<p>Like last year, there are several Chinese-specific questions in the Simplified Chinese version of survey. I'm thinking about what's the best way to communicate the result of this part. Some of the questions may be useful for the Rust team and the global community to better understand the Chinese community as well as the difficulties Chinese developers face, others may be mostly interesting to Chinese community itself.</p>\n<p>Do you think it would be useful to include some of the results in the survey post?</p>\n<p>The questions I have this year includes:<br>\nHow do you communicate with other Chinese Rust developers?<br>\nHow hard do you think it is for you to read and understand English development material? (1~10)<br>\nIf there are both English and Chinese materials, which one would you prefer to use?<br>\nWhat materials would help you use Rust better if they have Chinese translation?<br>\nAre you living in mainland China?<br>\nDo you have network accessibility issue when trying to use Rust-related programs or access documents? And which services?<br>\nHow do you resolve such accessibility issues?<br>\nAre you interested in helping Rust community to coordinate the Chinese community or document translation?</p>\n<p>Also Chinese-specific version of some global questions:<br>\nIf there is a Rust conference in China, would you be interested in joining?<br>\nAre you interested in joining a Rust conference overseas?</p>",
        "id": 183637213,
        "sender_full_name": "Xidorn Quan",
        "timestamp": 1576580008
    },
    {
        "content": "<p>I'm definitely interested in knowing the answers, <span class=\"user-mention\" data-user-id=\"250949\">@Xidorn Quan</span></p>",
        "id": 183650784,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1576591521
    },
    {
        "content": "<p>I'm not sure what I would put in the post specifically, though I think it'd be reasonable to have a \"special section\" on Chinese results</p>",
        "id": 183650818,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1576591543
    }
]