[
    {
        "content": "<p>I also reworked the <a href=\"https://nikomatsakis.github.io/wg-async-foundations/vision/status_quo.html\">status quo</a> section and removed the \"story outlines\" I had in there as placeholders. The only store now is <a href=\"https://nikomatsakis.github.io/wg-async-foundations/vision/status_quo/grace_deploys_her_service.html\">Grace deploys her service</a>, but I'm wondering about that one -- I wanted to split it into two, one where she deveops her service (or maybe mutiple...) and one where she deploys it and hits problems in production.</p>",
        "id": 229894653,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615484868
    },
    {
        "content": "<p>For example, as written, the story begins</p>\n<blockquote>\n<p>To meet throughput requirements, Grace has already decided to use a thread-per-core model and minimize cross-thread communication. She explores available ecosystem options and finds no option that gets her exactly what she is looking for out of the box. However, she can use Tokio with minimal configuration to achieve her architecture.</p>\n</blockquote>\n<p>There seem to be lots of interesting details to be specified here. Like, how did she research the options? What configuration <em>does</em> it require for tokio to do what she wanted? How easy was it for her to figure <em>that</em> out?</p>\n<p>Similarly, I imagine that developing her service she hit a lot of well-known toe-stubs and challenges. <span class=\"user-mention\" data-user-id=\"243965\">@Sean McArthur</span>, you've been looking into writing some about those, right?</p>",
        "id": 229894863,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615484945
    },
    {
        "content": "<p>Part of my motivation here is that I am working on a blog post and I wanted to cite more than one story :)</p>",
        "id": 229894886,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615484958
    },
    {
        "content": "<p>but I want them to be from Grace</p>",
        "id": 229894896,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615484964
    },
    {
        "content": "<p>I guess it doesn't matter too much for the blog post, I can just cite one example</p>",
        "id": 229894912,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615484973
    },
    {
        "content": "<p>(hmm, I just noticed that the FAQ structure doesn't permit one to link to specific questions... I wonder if I should move to section headings instead of a bullet point list)</p>",
        "id": 229895029,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615485006
    }
]