[
    {
        "content": "<p>Hi! I have some experience with other languages, and with rust, and have never done any async programming. I guess I'd fall mostly into Alan or Barbara (since I already know rust) But I feel like not knowing async or not makes a big difference to how one experiences stepping into the rust Async ecosystem. For example, if Alan has async experience in dart or js, he might find it easier to get started with async in Rust.</p>\n<p>I feel that Rust being my first introduction to async has had a significant impact on my experience with async in Rust, so I was wondering if that's something that the characters could be further differentiated by.</p>",
        "id": 230923943,
        "sender_full_name": "Frederik Baetens",
        "timestamp": 1616095657
    },
    {
        "content": "<p>This is a really interesting question: how much does experience in async programming models from other languages make in learning Rust async? Certainly having experience thinking in abstract terms about async/await can help one wrap their heads around Rust's model, but Rust's model is also different than most other async models (e.g., there is no global runtime that automatically drives futures to completion like there is in JS or C#). I guess the question is does it make a big enough difference for this to justify another character. Perhaps as we write more stories, we might be in a better position to answer this question.</p>",
        "id": 230992749,
        "sender_full_name": "rylev",
        "timestamp": 1616144514
    },
    {
        "content": "<p>Hmm, interesting, i'd like to wait until we have a story that can't be told for Barbara-- it seems like we can tell some stories about \"barbara as she was first learning Rust\" if we have to</p>",
        "id": 231055771,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1616173256
    },
    {
        "content": "<p>I'm just trying to keep total number of characters to 4</p>",
        "id": 231055799,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1616173265
    },
    {
        "content": "<p>FWIW I think we should stick to the 4 characters until it's painfully obvious that we need a 5th</p>",
        "id": 231055896,
        "sender_full_name": "rylev",
        "timestamp": 1616173304
    }
]