[
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"248777\">@Bhargav Voleti</span> -- you <a href=\"https://github.com/rust-lang/wg-async-foundations/pull/27#issuecomment-784356140\">commented</a> on the PR about ways to improve the startup developer persona:</p>\n<blockquote>\n<p>One thing that I feel could be improved is that \"startup developer\" persona. There's a lot of engineers working on services which are not giant orgs, and neither are they working in smaller startups building a single product. Either the \"startup developer\" persona should change to \"service engineer\" or there should be a separate persona. The concerns for both are fairly similar I think, in that they want to be able to deploy a rust based web service. Therefore, I think the \"startup persona\" should be expanded to include this.</p>\n</blockquote>\n<p>Can you say a bit more? If their concerns are similar, then I think we likely don't need multiple characters. I meant for Alan to represent people who want to build something in Rust, but where performance only has to be \"good enough\", where ergonomics perhaps matter more.</p>\n<p>I think another good example of people that might fit this persona are the engineers at 1Password, based on what they've told me anyway (I should add notes on that conversation to the repo).</p>",
        "id": 228416109,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614694639
    },
    {
        "content": "<p>I'm a bit torn: I like the characters having plenty of detail, but I don't want to have so much detail that they can't represent classes of people with similar concerns.</p>",
        "id": 228416178,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614694671
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> what I was trying to with is the current character is bit constrained by the choice of specific technologies and scenarios mentioned. The problems that a JS dev might be solving at a startup might be the same one as someone at a team in a larger company might be. I think I agree with you that we want them to have a single character for a class of people. And to that end, I think just talking about the problem that they are trying to solve would be helpful.</p>\n<p>For example, with Niklaus, Barbara and even Grace to a certain extent, the problem is forefront. I think if we change Alan's introduction to something along the lines of \"Alan is a full stack developer who has been solving problems for customers across many companies...\" would allow for a broader range of people to be able to \"connect\" with the character I suppose.</p>",
        "id": 228468288,
        "sender_full_name": "Bhargav Voleti",
        "timestamp": 1614712544
    },
    {
        "content": "<p>that would be good</p>",
        "id": 228468700,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614712699
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"248777\">@Bhargav Voleti</span> do you want to take a stab at rewriting that bio?</p>",
        "id": 228469464,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614713015
    },
    {
        "content": "<p>Yeah, I'll try and update it by tomorrow.</p>",
        "id": 228469493,
        "sender_full_name": "Bhargav Voleti",
        "timestamp": 1614713034
    },
    {
        "content": "<p>nice!</p>",
        "id": 228469512,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614713041
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"248777\">@Bhargav Voleti</span> this might solve another problem</p>",
        "id": 228474627,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614714987
    },
    {
        "content": "<p>I've been wondering where webassembly fits in</p>",
        "id": 228474634,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614714991
    },
    {
        "content": "<p>I'd rather not add a 5th character if we can avoid it</p>",
        "id": 228474652,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614715001
    },
    {
        "content": "<p>I'm not convinced it's necessary</p>",
        "id": 228474673,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614715006
    },
    {
        "content": "<p>I think Alan might be a good fit there? He could be experimenting with some web assembly applications :)</p>",
        "id": 228474694,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614715019
    },
    {
        "content": "<p>Same, but you could argue that webassembly had different facets. On one hand it can fit into the frontend development ecosystem, but on the other it's also being used for running backend services and sandboxes.</p>",
        "id": 228474805,
        "sender_full_name": "Bhargav Voleti",
        "timestamp": 1614715053
    },
    {
        "content": "<p>Yeah, I was thinking that maybe some of those other applications would fit fine for Grace</p>",
        "id": 228474862,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614715081
    },
    {
        "content": "<p>I think ideally the characters would be about people's incoming knowledge</p>",
        "id": 228474964,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614715098
    },
    {
        "content": "<p>I think we can talk about webassembly for both characters as it is applicable in both situations. They could be knowledgeable about webassembly even before coming to Rust, so I think it's fair to talk about it.</p>",
        "id": 228476241,
        "sender_full_name": "Bhargav Voleti",
        "timestamp": 1614715538
    },
    {
        "content": "<p>I agree, it doesn't feel like a new character is needed here to me.</p>",
        "id": 228484541,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614718784
    },
    {
        "content": "<p>Yeah, instead we could talk about webassembly in existing character stories where it might fit.</p>",
        "id": 228486445,
        "sender_full_name": "Bhargav Voleti",
        "timestamp": 1614719468
    },
    {
        "content": "<p>So -- <span class=\"user-mention\" data-user-id=\"248777\">@Bhargav Voleti</span> or others -- I was just thinking that it may be worth considering a character with a Java background</p>",
        "id": 228562936,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614764643
    },
    {
        "content": "<p>I'm not sure if that really changes anything</p>",
        "id": 228562984,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614764654
    },
    {
        "content": "<p>but it might :)</p>",
        "id": 228562999,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614764663
    },
    {
        "content": "<p>It occurs to me that a possible character is essentially \"Grace's team members\". Grace fits the tech lead who will investigate, experiment, and try to pick the best <em>technical</em> solution. And her team members are kinda \"stuck\" with her decision. They don't need to chose competing technologies, but need to learn whatever tech was chosen, and then probably write the bulk of the actual product using it.</p>",
        "id": 228680659,
        "sender_full_name": "Sean McArthur",
        "timestamp": 1614810677
    },
    {
        "content": "<p>I've wondered about that, <span class=\"user-mention\" data-user-id=\"243965\">@Sean McArthur</span> -- I think an important question to ask ourselves is where it changes things</p>",
        "id": 228702703,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614822821
    },
    {
        "content": "<p>maybe we can look as we write their stories for those places where Grace's background (or anyone's background) is crucial</p>",
        "id": 228702727,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614822836
    },
    {
        "content": "<p>as an example-- in the <a href=\"https://hackmd.io/K6oq7c9cQQC3LZvwVulDiA?edit\">story that <span class=\"user-mention\" data-user-id=\"224941\">@Carl Lerche</span> and I were working on</a>, Grace knows how to find the socket addresses for  stuck connections using various operating system tools:</p>\n<blockquote>\n<p>She realizes that she doesn't have any tooling that can give her insight into what's going on. She starts to add lots of logging, attempting to tie log entries to specific connections. Using an operating system tool, she is able to identify the socket addresses for the hung connections, so she also includes the socket addresses in each log message. She can then grep the logs to find those that are associated with the hung connections. Of course, the logs only tell her what the connection managed to do successfully, they don't tell her why it stopped -- so she has to keep going back and adding more logs until she can narrow down the exact call that hangs.</p>\n</blockquote>\n<p>I feel like more novice users might not have that knowledge.</p>",
        "id": 228703023,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614822999
    },
    {
        "content": "<p>Hmm I realize that Alan's background story includes IoT:</p>\n<blockquote>\n<p>Alan was recently hired at <code>fido.io</code>, a pioneering dog-food delivery business that uses a combination of deep learning and [IoT] to select the optimum dog food for your pet's health.</p>\n</blockquote>",
        "id": 228785220,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614869609
    },
    {
        "content": "<p>that was mostly me trying to be funny but could be a lead-in for embedded ;) but it's not really important I guess, it doesn't cover the full range of embedded devs somehow</p>",
        "id": 228785293,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614869637
    },
    {
        "content": "<p>I'm working on an update here</p>",
        "id": 228829912,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614884287
    },
    {
        "content": "<p>revamped pr, still have to put more energy into laying out the schedule etc</p>",
        "id": 228831188,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614884757
    },
    {
        "content": "<p><a href=\"https://github.com/rust-lang/wg-async-foundations/pull/28\">https://github.com/rust-lang/wg-async-foundations/pull/28</a></p>",
        "id": 228831190,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614884758
    },
    {
        "content": "<p>merged for now</p>",
        "id": 228845362,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614889957
    },
    {
        "content": "<p>btw <span class=\"user-mention\" data-user-id=\"248777\">@Bhargav Voleti</span> I went ahead and incorporated some of your suggestions into Alan as I was making other changes, would love to <a href=\"https://rust-lang.github.io/wg-async-foundations/vision/characters.html#alan-the-full-stack-developer\">hear what you think now</a></p>",
        "id": 229014039,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1614973869
    },
    {
        "content": "<p>I got some persona from people: over-comer of vendors shortcomings, fixer of broken stuff, explainer to people, info-sec leader, NOP sled operator</p>",
        "id": 229127480,
        "sender_full_name": "oliver",
        "timestamp": 1615063384
    },
    {
        "content": "<p>I've been thinking about how the characters are defined and talked it over with some folks and I think I've got a new proposal that I'm a lot happier with</p>",
        "id": 229214700,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615148159
    },
    {
        "content": "<p>The idea is to separate the characters from specific projects -- they can even have multiple bios</p>",
        "id": 229214751,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615148170
    },
    {
        "content": "<p>They should really represent specific priorities and interests</p>",
        "id": 229214767,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615148184
    },
    {
        "content": "<p>after some iteration, I've landed on this rough division:</p>",
        "id": 229214809,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615148266
    },
    {
        "content": "<ul>\n<li><strong>Alan</strong>: the experienced \"full stack\" developer, new to Rust<br>\n    * <strong>Top priority</strong>: performance -- that's what he is not getting out of the languages he's using now<br>\n    * <strong>Expectations</strong>: easy to use, strong ecosystem, great tooling</li>\n<li><strong>Grace</strong>: the systems programming expert, new to Rust<br>\n    * <strong>Top priority</strong>: memory safety -- that's what she is not getting from C/C++<br>\n    * <strong>Expectations</strong>: able to do all the things she's used to from C/C++</li>\n<li><strong>Niklaus</strong>: new programmer, coming from an unconventional background<br>\n    * <strong>Top priority</strong>: accessibility -- he hasn't done much programming, can get frustrated easily, or blames his own lack of knowledge when he should be blaming poor tools<br>\n    * <strong>Expectations</strong>: community -- the community enabled him to have early success, and he is excited to have it support him and him grow more</li>\n<li><strong>Barbara</strong>: the experienced Rust engineer<br>\n    * <strong>Top priority</strong>: overall productivity and long-term maintenance -- she loves Rust, and wants to see it extended to new areas; she has an existing code base to maintain<br>\n    * <strong>Expectations</strong>: elegance and craftsmanship, fits well with Rust</li>\n</ul>",
        "id": 229214820,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615148278
    },
    {
        "content": "<p>I'm writing up some narrative versions of these too</p>",
        "id": 229214878,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615148301
    },
    {
        "content": "<p>e.g.,</p>\n<h3>Niklaus: new programmer, coming from an unconventional background</h3>\n<p>He's always been interested in programming but doesn't have experience with it. He's been working as a tech writer and decided to dip his toe in by opening PRs to immprove the documentation for one of the libraries he was playing with. The feedback was positive so he fixed a small bug. He's now considering getting involved in a deeper way.</p>",
        "id": 229214881,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615148308
    },
    {
        "content": "<p>I think this also covers <span class=\"user-mention\" data-user-id=\"243965\">@Sean McArthur</span>'s point that should be thinking also about experienced folks maintaining existing code bases (Barbara)</p>",
        "id": 229214907,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615148340
    },
    {
        "content": "<p>(In case it wasn't obvious, I'm curious to hear what people think of this =)</p>",
        "id": 229342106,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615225169
    },
    {
        "content": "<p>Maybe I missed it but do we have some character for the type of person that comes from managed memory languages (like java and python) and are learning rust to get into systems programming? So unlike grace doesn't totally understand the benefit of memory safety. I guess Alan fits this but he seems like he is pretty broad.</p>",
        "id": 229346003,
        "sender_full_name": "Lucio Franco",
        "timestamp": 1615226759
    },
    {
        "content": "<p>I wonder if the typical \"Alan\"'s top priority is really perf. It could be correctness.</p>",
        "id": 229350563,
        "sender_full_name": "Jeremiah Senkpiel",
        "timestamp": 1615228493
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"319552\">@Jeremiah Senkpiel</span> I was wondering about that too. I think it's a bit of both</p>",
        "id": 229371239,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615236613
    },
    {
        "content": "<p>I was reading the <a href=\"https://www.rust-lang.org/static/pdfs/Rust-Tilde-Whitepaper.pdf\">tilde white paper</a> from the webpage and I think this is the Alan I was thinking of</p>",
        "id": 229371294,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615236634
    },
    {
        "content": "<p>he's definitely coming to Rust for performance/memory use, but memory safety is what's making that appealing; the TCO from C++ didn't compute before</p>",
        "id": 229371336,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615236658
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"207781\">@Lucio Franco</span> I imagined Alan as coming from memory safe languages; I did list Java for Grace though since I think a lot of folks fit that profile too (and work in a mix of both, potentially).</p>",
        "id": 229371626,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615236781
    },
    {
        "content": "<p>I do also feel ok with having multiple bios, potentially.</p>",
        "id": 229371725,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615236828
    },
    {
        "content": "<p>Maybe my team is more like the 'Alan' character than I initially thought</p>",
        "id": 229371755,
        "sender_full_name": "Jeremiah Senkpiel",
        "timestamp": 1615236843
    },
    {
        "content": "<p>The Alan character also changed a bit</p>",
        "id": 229371938,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615236924
    },
    {
        "content": "<p>But that's good to hear :)</p>",
        "id": 229371984,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615236947
    },
    {
        "content": "<p>I guess I want to hear if people see themselves (or their teams) in those characters and, if not, why not.</p>",
        "id": 229372001,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615236956
    },
    {
        "content": "<p>I see myself as kind of Grace-become-Barbara</p>",
        "id": 229372068,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615236969
    },
    {
        "content": "<p>probably most of us on this channel are Barbara by now, in the sense of having a lot of rust experience :)</p>",
        "id": 229372101,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615236985
    },
    {
        "content": "<p>We're all from memory-safe-at-runtime-aside-from-null languages, care about correctness and performance, but also need things to be approachable to non-Rust developers. I guess I'm becoming the Barbara character at this point too, though.</p>",
        "id": 229372537,
        "sender_full_name": "Jeremiah Senkpiel",
        "timestamp": 1615237190
    },
    {
        "content": "<p>I'm totally not sure whether any of you are Barbara, at least not the after the modification I've PRed. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 229459835,
        "sender_full_name": "Daniel Egger",
        "timestamp": 1615288407
    },
    {
        "content": "<p><a href=\"https://github.com/rust-lang/wg-async-foundations/pull/32\">https://github.com/rust-lang/wg-async-foundations/pull/32</a></p>",
        "id": 229484763,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615300004
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"392749\">@Daniel Egger</span> I'll check that out! I just pushed a PR with my changes, I'll have to see how to merge those!</p>",
        "id": 229484791,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615300018
    },
    {
        "content": "<p>Uhm, so Grace is the new Barbara? I'm starting to get confused. :D</p>",
        "id": 229485065,
        "sender_full_name": "Daniel Egger",
        "timestamp": 1615300139
    },
    {
        "content": "<p>Grace envied Barbara and plotted to take her place <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 229485658,
        "sender_full_name": "oliver",
        "timestamp": 1615300363
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"392749\">@Daniel Egger</span> Yes, I mixed it up =)</p>",
        "id": 229497970,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615305107
    },
    {
        "content": "<p>I separated out <em>applications</em> from backgrounds, expectations, priorities</p>",
        "id": 229498058,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615305132
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"392749\">@Daniel Egger</span> is it ok if I just copy-and-paste some of your story into my PR?</p>",
        "id": 229545336,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615320815
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116009\">nikomatsakis</span> <a href=\"#narrow/stream/187312-wg-async-foundations/topic/characters/near/229545336\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"392749\">Daniel Egger</span> is it ok if I just copy-and-paste some of your story into my PR?</p>\n</blockquote>\n<p>Sure, please use it however you please. Glad you found something to like.</p>",
        "id": 229545484,
        "sender_full_name": "Daniel Egger",
        "timestamp": 1615320864
    },
    {
        "content": "<p>I think I will put some into Grace</p>",
        "id": 229545515,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615320877
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116883\">@tmandry</span> do you happen to be around? I want to merge <a href=\"https://github.com/rust-lang/wg-async-foundations/issues/32\">rust-lang/wg-async-foundations#32</a> and I just wanted a quick check-in with you if you were around</p>",
        "id": 229555874,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615324752
    },
    {
        "content": "<p>taking a quick look</p>",
        "id": 229556244,
        "sender_full_name": "tmandry",
        "timestamp": 1615324900
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> lgtm, definitely seems like an improvement</p>",
        "id": 229557218,
        "sender_full_name": "tmandry",
        "timestamp": 1615325337
    },
    {
        "content": "<p>I hear more and more about kotlin</p>",
        "id": 229936198,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615500491
    },
    {
        "content": "<p>I think Alan can have a third variant as a kotlin user</p>",
        "id": 229936226,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615500500
    },
    {
        "content": "<p>I'm wondering a bit about Go -- I'm not sure where Go fits in this taxonomy. I guess it's Alan.</p>",
        "id": 229936305,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615500527
    },
    {
        "content": "<p>Kotlin is another flavor of \"better Java\", it's a JVM language, so many similarities. It did however get special async <code>coroutine</code> language support that seems to be pretty nice, dunno how much that would influence someone as they learn async Rust.</p>",
        "id": 229939489,
        "sender_full_name": "Sean McArthur",
        "timestamp": 1615501533
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"243965\">@Sean McArthur</span> yeah, that was roughly what I was thinking of. I can definitely say that people like the scoped coroutine support in Kotlin and that it's worth looking at for inspiration</p>",
        "id": 230009048,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615546210
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116009\">@nikomatsakis</span> To be honest: I'm looking at inspiration from that for &gt; 1 year, have sunk a couple of hundred hours of private time into this, and I'm feeling like nobody is interested whenever mentioning it. The topic was mentioned both here as  well as on tokio extensively (there's thousands of lines of docs, proposals  and code). Seeing that it \"might be worth looking into\" is a bit disappointing, because it confirms my feeling that something doesn't really work well with the contribution model.</p>",
        "id": 230071969,
        "sender_full_name": "Matthias247",
        "timestamp": 1615571844
    },
    {
        "content": "<p>Why are we looking for imaginative characters if even real characters have challenges carrying the message over?</p>",
        "id": 230072039,
        "sender_full_name": "Matthias247",
        "timestamp": 1615571874
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"204219\">@Matthias247</span> I don't believe I wrote \"might be worth looking into\"</p>",
        "id": 230074694,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615573002
    },
    {
        "content": "<p>I would very much like to talk to you about it :)</p>",
        "id": 230074711,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615573009
    },
    {
        "content": "<p>(I was considering trying to draft a shiny future in this direction, and I had wanted to reach out to you about it, in fact, since I remember you mentioning it earlier)</p>",
        "id": 230079096,
        "sender_full_name": "nikomatsakis",
        "timestamp": 1615574997
    }
]