[
    {
        "content": "<p>The topic might seem just a random mix of words, but it summarizes a big problem while using DMA in embedded. And since DMA is pretty much the number one method of writing async code in embedded, I wanted to highlight this pain point here.</p>\n<p>A good summary of the problem could be the blog from boats about io_uring. Which describes the problem safe rust has with completion based APIs. However, the solution described by boats isn't very fit for embedded, because most of the times alloc isn't an option.</p>\n<p>A possible solution would be some kind of Leak auto trait, which has been discussed before but I wanted to bring it up again with a light in embedded async (and embedded DMA usage in general).</p>",
        "id": 243936503,
        "sender_full_name": "Thales Fragoso",
        "timestamp": 1624637186
    },
    {
        "content": "<p>The solution we have used for now is to mark the constructor of drivers unsafe with the safety requirement that the user must not leak any futures that borrows it. Which isn't hard in practice but it's a very contrived requirement</p>",
        "id": 243936670,
        "sender_full_name": "Thales Fragoso",
        "timestamp": 1624637261
    },
    {
        "content": "<p>And also prevents a fully safe API.</p>\n<p>I would be curious to hear some opinions on the problem and possible solutions.</p>\n<p>We also experimented with <code>&amp;'static mut</code> buffers, but they are very unergonomic and hard to work with due to the move semantics</p>",
        "id": 243936850,
        "sender_full_name": "Thales Fragoso",
        "timestamp": 1624637349
    },
    {
        "content": "<p>It also plays badly with traits, requiring full GATs, instead of just \"lifetime GAT\"</p>",
        "id": 243936945,
        "sender_full_name": "Thales Fragoso",
        "timestamp": 1624637400
    },
    {
        "content": "<p>To support both &amp;'static mut buffers and <code>Box</code>, etc</p>",
        "id": 243937052,
        "sender_full_name": "Thales Fragoso",
        "timestamp": 1624637430
    },
    {
        "content": "<p>Hm, I was going to say that cancelling DMA operation is an option in many cases, but then I realised it depends on the device on the other end.</p>",
        "id": 243939428,
        "sender_full_name": "nagisa",
        "timestamp": 1624638647
    },
    {
        "content": "<p>Or does it. You need to have some way to reset communication and abort a command you've been sending in order to correctly support situations where your firmware resets the mcu out of the blue (e.g. because of a crash of some sort).</p>",
        "id": 243939517,
        "sender_full_name": "nagisa",
        "timestamp": 1624638699
    },
    {
        "content": "<p>Cancelling the DMA itself isn't the problem, the problem is that you have to do that on drop, which isn't guaranteed to run</p>",
        "id": 243940185,
        "sender_full_name": "Thales Fragoso",
        "timestamp": 1624639064
    },
    {
        "content": "<p>The user can forger the transfer, which will clear the borrow on the buffer</p>",
        "id": 243941026,
        "sender_full_name": "Thales Fragoso",
        "timestamp": 1624639504
    },
    {
        "content": "<p>ah missed that detail.</p>",
        "id": 243943704,
        "sender_full_name": "nagisa",
        "timestamp": 1624640879
    },
    {
        "content": "<p>Cancelling DMA operations is asynchronous, or can it be done synchronous?</p>",
        "id": 243944965,
        "sender_full_name": "Matthias247",
        "timestamp": 1624641517
    },
    {
        "content": "<p>If it's async - yes, the problem is fundamentally the same as with all other completion based APIs</p>",
        "id": 243945012,
        "sender_full_name": "Matthias247",
        "timestamp": 1624641538
    },
    {
        "content": "<p>It usually doesn't take too much, so you probably can still do it blocking</p>",
        "id": 243948327,
        "sender_full_name": "Thales Fragoso",
        "timestamp": 1624643327
    },
    {
        "content": "<p>So on what you can do today:</p>\n<ul>\n<li>Do synchronous cancellation (which might block the foreground task more than necessary?)</li>\n<li>Start an async cancellation, but let the task continue to run. Then only when the resource is accessed next time wait for it to get free (e.g. using an async mutex or semaphore)</li>\n</ul>",
        "id": 243952890,
        "sender_full_name": "Matthias247",
        "timestamp": 1624645652
    },
    {
        "content": "<p>The problem is that I can't cancel if the user forgets the future/transfer</p>",
        "id": 243953207,
        "sender_full_name": "Thales Fragoso",
        "timestamp": 1624645809
    },
    {
        "content": "<p>For the future:</p>\n<ul>\n<li>There had been a proposal about offering run-to-completion async fns,  which could model that <a href=\"#narrow/stream/187312-wg-async-foundations/topic/run.20to.20completion.20async.20fn\">https://rust-lang.zulipchat.com/#narrow/stream/187312-wg-async-foundations/topic/run.20to.20completion.20async.20fn</a></li>\n<li>Also mentioned in Carl's latest blog post: <a href=\"https://carllerche.com/2021/06/17/six-ways-to-make-async-rust-easier/\">https://carllerche.com/2021/06/17/six-ways-to-make-async-rust-easier/</a></li>\n</ul>",
        "id": 243953283,
        "sender_full_name": "Matthias247",
        "timestamp": 1624645856
    },
    {
        "content": "<p>And if they do, they clear the borrow on the buffer and can use it at the same time as the DMA, they can even pop the stack of the buffer...</p>",
        "id": 243953295,
        "sender_full_name": "Thales Fragoso",
        "timestamp": 1624645861
    },
    {
        "content": "<blockquote>\n<p>The problem is that I can't cancel if the user forgets the future/transfer</p>\n</blockquote>\n<p>It shouldn't matter. Even if the user forgets it, the task would still complete, and the completion should release the resource?</p>",
        "id": 243953361,
        "sender_full_name": "Matthias247",
        "timestamp": 1624645897
    },
    {
        "content": "<p>The problem is that I can't use alloc</p>",
        "id": 243953461,
        "sender_full_name": "Thales Fragoso",
        "timestamp": 1624645943
    },
    {
        "content": "<p>The user controls the resource, the future only borrows it</p>",
        "id": 243953557,
        "sender_full_name": "Thales Fragoso",
        "timestamp": 1624646016
    },
    {
        "content": "<p>Yeah, that's the detail thats super easy to miss unfortunately. The only ideas I have are around some sort of a flag inside a buffer type itself, that knows that buffer is being used for DMA.</p>",
        "id": 243959432,
        "sender_full_name": "nagisa",
        "timestamp": 1624649132
    },
    {
        "content": "<p>that way if the buffer is used after future is forgotten, you can panic or something; and if it is dropped (i.e. released) you can still cancel the DMA operation in the buffer's drop.</p>",
        "id": 243959584,
        "sender_full_name": "nagisa",
        "timestamp": 1624649191
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"123586\">@nagisa</span> yeah, I thought about that too, but one would need some fn pointer or something inside this const generic buffer wrapper, to be able to stop the DMA, and worse, you would need to pin it</p>",
        "id": 243959701,
        "sender_full_name": "Thales Fragoso",
        "timestamp": 1624649256
    },
    {
        "content": "<p>Panic might also be a solution, like a Drop bomb with an unsafe disarm, but having to pin the buffer itself is awful</p>",
        "id": 243959883,
        "sender_full_name": "Thales Fragoso",
        "timestamp": 1624649339
    },
    {
        "content": "<p>It would also probably incur full GAT if used inside traits</p>",
        "id": 243959969,
        "sender_full_name": "Thales Fragoso",
        "timestamp": 1624649390
    }
]