[
    {
        "content": "<p>Hi there, I have been trying for some time to find a way how to apply functional patterns like Free Monads or Tagless Final to Rust. At the same time I have also never really liked both solutions. Then recently I came across the solution that Scala's zio library takes (nicely explained in <a href=\"https://www.youtube.com/watch?v=p98W4bUtbO8\">https://www.youtube.com/watch?v=p98W4bUtbO8</a>). Basically, the idea there is to add the environment (eg DB connection) to the type signature of the effect itself, so you end up with ZIO[R,E,T]. My question: I have the vague understanding that this could actually work in combination with Rust futures nicely. Maybe by adding the environment as an associated Input type to the Future, thereby allowing an environment to be 'threaded through' the future chain. I am much to new to Rust to verify the usefulness of this idea myself - can someone here give me a hint if this is worth exploring or if it is just a stupid idea of a guy that want's to be a little more functional in Rust :-)</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"p98W4bUtbO8\" href=\"https://www.youtube.com/watch?v=p98W4bUtbO8\"><img src=\"https://i.ytimg.com/vi/p98W4bUtbO8/default.jpg\"></a></div>",
        "id": 228067027,
        "sender_full_name": "Jan Algermissen",
        "timestamp": 1614442286
    },
    {
        "content": "<p>I think it depends a little on what you want to achieve. Are you trying experiment with a pattern, inspired from FP, that can be fruitful for async Rust development generally? Are you asking what's the idiomatic way of solving this class of problems in Rust today? Or do you have a specific application or library in mind?</p>",
        "id": 228505316,
        "sender_full_name": "Didrik Nordstrom",
        "timestamp": 1614727305
    },
    {
        "content": "<p>In case you're not familiar with Rust futures, <code>Future</code> is a trait which can be implemented by any type, so you have a large amount of flexibility in how you want your types to behave and what data you want to represent. One important limitation you should be aware of is that the associated <code>Output</code> type cannot currently be generic. The missing feature is called Generic Associated Types (GAT) and is a long-standing feature request in Rust. Oftentimes when you want to create high-level abstractions, you'll find yourself missing GATs.</p>",
        "id": 228505847,
        "sender_full_name": "Didrik Nordstrom",
        "timestamp": 1614727600
    },
    {
        "content": "<p>On the topic of \"threading through\" contexts/environments, this problem has a few idiomatic solutions. Most of them are explicit - e.g. passing a context type as a parameter. Using globals or thread locals is possible, but usually considered a last resort, due to the fact that they're non-hermetic, hard to test, and often hard to read.</p>",
        "id": 228506250,
        "sender_full_name": "Didrik Nordstrom",
        "timestamp": 1614727815
    },
    {
        "content": "<p>I guess what I am up to can be best described as 'being able to combine a Reader Monad capability with futures so that we can have the future combinators \"pass through\" the environment and make it available to each future\" - I think it could be done with an <em>Input</em> associated type on the future trait. The closest thing I know in Rust is the warp Filter Extract associated type: <a href=\"https://github.com/seanmonstar/warp/blob/68ac3a595a1969347df6ef66ca327d315b12ab7d/src/filter/mod.rs#L39\">https://github.com/seanmonstar/warp/blob/68ac3a595a1969347df6ef66ca327d315b12ab7d/src/filter/mod.rs#L39</a></p>\n<p>But again, I am mostly trying to understand if this is worthwhile pursuing - I find it especially interesting because the solution implemented by the above referenced ZIO library does not need HKTs.</p>",
        "id": 228974250,
        "sender_full_name": "Jan Algermissen",
        "timestamp": 1614959042
    }
]