[
    {
        "content": "<p>I've long been wanting to rename this group to just \"wg-async\". The current name is a mouthful and while I think it had historical importance, I don't think it carries its own weight anymore. We can define the scope of the WG more clearly on the website / in a WG charter.</p>",
        "id": 268467545,
        "sender_full_name": "tmandry",
        "timestamp": 1642546317
    },
    {
        "content": "<p>but I don't want to do this without warning :)</p>",
        "id": 268467668,
        "sender_full_name": "tmandry",
        "timestamp": 1642546379
    },
    {
        "content": "<p>barring any concerns, I'll plan to make the rename happen in a week or so</p>",
        "id": 268467703,
        "sender_full_name": "tmandry",
        "timestamp": 1642546413
    },
    {
        "content": "<p>it would be done in such a way that old URLs for everything continue to work</p>",
        "id": 268467724,
        "sender_full_name": "tmandry",
        "timestamp": 1642546439
    },
    {
        "content": "<p>There's exactly one reason I can think of to not do this.</p>",
        "id": 268495864,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1642572447
    },
    {
        "content": "<p>async-foundations is, for want of a better phrase, less confrontational/presumptive to the async ecosystem.</p>",
        "id": 268495930,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1642572500
    },
    {
        "content": "<p>wg-async <em>sounds</em> like something with much bigger scope that far more people would go \"hey why am I not being consulted?!\"</p>",
        "id": 268495945,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1642572537
    },
    {
        "content": "<p>I'm not suggesting that the work should be different.</p>",
        "id": 268495957,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1642572552
    },
    {
        "content": "<p>But \"foundations\" does suggest a bit of a <em>prioritization</em> of scopes.</p>",
        "id": 268495972,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1642572588
    },
    {
        "content": "<p>I tend to refer to it as the Async Working Group anyway, so the change makes sense to me. I think <span class=\"user-mention silent\" data-user-id=\"239881\">Josh Triplett</span> makes good points too, although maybe we should try and pull more of the async ecosystem into the wg.</p>",
        "id": 268565334,
        "sender_full_name": "eholk",
        "timestamp": 1642609722
    },
    {
        "content": "<p>I think its a good idea. I think we have explained quite well the scope of what we plan to do and I think that is understood, so I don't worry about people over estimating our scope</p>",
        "id": 268569669,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1642611388
    },
    {
        "content": "<p>Perhaps we could change the name simultaneously with rationalising the membership?</p>",
        "id": 268569717,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1642611413
    },
    {
        "content": "<p>The Async Rust in 2022 blog post seems like a good place to announce the change, maybe say something like \"we're changing the name to better reflect the scope of what we are working on\"</p>",
        "id": 268585532,
        "sender_full_name": "eholk",
        "timestamp": 1642618054
    },
    {
        "content": "<p>I like that. I think it should emphasize that the scope of the working group isn't changing to include ecosystem crates, but that we do want to <em>involve</em> people in the ecosystem more by having something like a monthly newsletter</p>",
        "id": 268592550,
        "sender_full_name": "tmandry",
        "timestamp": 1642621113
    }
]