[
    {
        "content": "<p>Hi all, I would like to propose we refresh the async foundations WG. I see two issues, the easier one to address is that the official composition of the group (<a href=\"https://github.com/rust-lang/team/blob/master/teams/wg-async-foundations.toml\">https://github.com/rust-lang/team/blob/master/teams/wg-async-foundations.toml</a>) is out of date, or at least does not reflect who is currently active in doing work, coming to meetings, etc.</p>\n<p>The more substantial issue, is that I would like to have an easily addressable group of stakeholders (maintainers of async runtimes, users of async doing particularly interesting things, etc.) who won't want to come to meetings or get every notification, but do want to keep abreast of developments and should be easy to pull in to discussion as required (and have made a commitment to contribute to such discussions when asked). I'm not sure whether that should be a separate group, or a mailing list, or part of our WG or what. Thoughts?</p>",
        "id": 267451180,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1641827680
    },
    {
        "content": "<p>Regarding the first question, I agree it's time to do some \"spring cleaning\"</p>",
        "id": 267463470,
        "sender_full_name": "tmandry",
        "timestamp": 1641832585
    },
    {
        "content": "<p>For the second, that's exactly what we did for async-fundamentals-initiative with the <a href=\"https://rust-lang.github.io/async-fundamentals-initiative/stakeholders.html\">\"stakeholders program\"</a>, which has only had one meeting so far</p>",
        "id": 267466361,
        "sender_full_name": "tmandry",
        "timestamp": 1641833636
    },
    {
        "content": "<p>Do you have a good number of people signed up?</p>",
        "id": 267466581,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1641833701
    },
    {
        "content": "<p>The exact set of stakeholder orgs might vary a bit from one initiative to another, but there's probably significant overlap. We can see about possibly using this group to bootstrap another one for portability.</p>",
        "id": 267466603,
        "sender_full_name": "tmandry",
        "timestamp": 1641833706
    },
    {
        "content": "<p>You can see the list of folks in the <a href=\"https://rust-lang.github.io/async-fundamentals-initiative/stakeholders/2021-nov.html\">meeting notes</a></p>",
        "id": 267466639,
        "sender_full_name": "tmandry",
        "timestamp": 1641833717
    },
    {
        "content": "<p>Heh, was just typing something like that</p>",
        "id": 267466657,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1641833723
    },
    {
        "content": "<p>Maybe in the next meeting we can let stakeholders know that your effort is spinning up <span class=\"user-mention\" data-user-id=\"256841\">@Nick Cameron</span> and that you're looking for stakeholders to get involved?</p>",
        "id": 267467028,
        "sender_full_name": "tmandry",
        "timestamp": 1641833861
    },
    {
        "content": "<p>I'm also not sure if async-fundamentals will end up needing the full time commitment that we said we would; we didn't have a December meeting but that was in part because of the holidays. Maybe there's an opportunity for some \"crossover\" meetings, not sure yet</p>",
        "id": 267467345,
        "sender_full_name": "tmandry",
        "timestamp": 1641833976
    },
    {
        "content": "<p>Maybe having one stakeholder group for all the initiatives will about match that initial time estimate?</p>",
        "id": 267467613,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1641834053
    },
    {
        "content": "<p>On the first point, I was added to the WG many moons ago, while doing some work on status-quo story writing, but I haven't been involved since.   I'd be happy to be removed from the WG, as I don't want to be misrepresenting my position/status.  I'm not a stakeholder either (I'm just one of thousands of \"regular async users\"), though I'm trying to stay up-to-date with various developments in the async world by following this zulip channel.</p>",
        "id": 267467916,
        "sender_full_name": "Andrew Chin (eminence)",
        "timestamp": 1641834157
    },
    {
        "content": "<p>The main issue, as I see it, is there is no efficient mechanism for a good feedback cycle between Tokio &amp; the work happening here. I was not aware of the effort tmandry mentioned and the wg-async-foundations is too noisy for me to watch efficiently as it is (rightfully) geared towards contributors.</p>",
        "id": 267478855,
        "sender_full_name": "Carl Lerche",
        "timestamp": 1641838879
    },
    {
        "content": "<p>e.g. the join! macro landing std. It is totally great to lower the burden of getting experimental work in std, but I have no idea how to track proposals / additions to provide feedback / thoughts from Tokio's POV. Short of watching issues / PRs to rust-lang. I can't even keep up with everything happening in tokio-rs :)</p>",
        "id": 267479122,
        "sender_full_name": "Carl Lerche",
        "timestamp": 1641839012
    },
    {
        "content": "<p>Yeah, it can be hard to keep track (even for me sometimes). Maybe we need a newsletter.. \"This Month in Async Rust\" (TMAR)</p>",
        "id": 267638802,
        "sender_full_name": "tmandry",
        "timestamp": 1641932133
    },
    {
        "content": "<p>Niko and I were discussing criteria for WG membership. Here's what we came up with:</p>\n<p>WG members must have active participation in last 6 months, where participation is one of the following:</p>\n<div class=\"codehilite\"><pre><span></span><code>    * attended triage/sprint meetings\n    * opened PRs\n    * reviewed PRs\n    * mentored people to fix polish issues\n    * led an initiative\n</code></pre></div>",
        "id": 267639838,
        "sender_full_name": "tmandry",
        "timestamp": 1641932620
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116883\">tmandry</span> <a href=\"#narrow/stream/187312-wg-async-foundations/topic/The.20WG/near/267638802\">said</a>:</p>\n<blockquote>\n<p>Yeah, it can be hard to keep track (even for me sometimes). Maybe we need a newsletter.. \"This Month in Async Rust\" (TMAR)</p>\n</blockquote>\n<p>I would <em>love</em> to read that, if someone wanted to write that. :)</p>",
        "id": 267641508,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1641933476
    },
    {
        "content": "<blockquote>\n<p>WG members must have active participation in last 6 months, where participation is one of the following</p>\n</blockquote>\n<p>This sounds reasonable.  I like that it's objective and not subjective.  I would slightly expect similar rules to be applied across the whole org, but I wouldn't necessarily let a lack of consistent global rules prevent wg-async-foundations from applying them locally</p>",
        "id": 267643600,
        "sender_full_name": "Andrew Chin (eminence)",
        "timestamp": 1641934570
    },
    {
        "content": "<p>What does membership actually mean vs. non member?</p>",
        "id": 267651790,
        "sender_full_name": "Carl Lerche",
        "timestamp": 1641938394
    },
    {
        "content": "<p>Mainly it comes with <a href=\"https://www.rust-lang.org/governance/wgs/wg-async-foundations\">recognition</a> and some privileges (access to repo, rustbot, WG hackmd)</p>",
        "id": 267674088,
        "sender_full_name": "tmandry",
        "timestamp": 1641953066
    },
    {
        "content": "<p>I was also thinking about newsletters, but thinking about one per initiative</p>",
        "id": 267704694,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1641982382
    },
    {
        "content": "<p>I think one could just say the wg has active members and the leads decide what that means case by case. Trying to make formal rules for social situations seems doomed to failure</p>",
        "id": 267704836,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1641982474
    },
    {
        "content": "<p>Agreed that there is an aspect of judgment and I would draw a distinction between joining the WG and remaining in it. Deciding the latter is more amenable to having a formal rule/guideline. It's really difficult to make those calls without one, imo.</p>",
        "id": 267780147,
        "sender_full_name": "tmandry",
        "timestamp": 1642018661
    },
    {
        "content": "<p>PR to update membership is <a href=\"https://github.com/rust-lang/team/pull/696\">https://github.com/rust-lang/team/pull/696</a></p>",
        "id": 268901810,
        "sender_full_name": "tmandry",
        "timestamp": 1642798461
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 268952116,
        "sender_full_name": "Nick Cameron",
        "timestamp": 1642849681
    }
]