[
    {
        "content": "<p>Hey all <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> Are there any opinions in here about automatically publishing releases for some rust-lang libs crates (log, getopts etc) to <a href=\"http://crates.io\">crates.io</a>? Fiddling with local publishing is a bit of a barrier to keeping code flowing on those rarely touched libs and causes big risky releases to build up over years. This could be more of a t-libs thing, but wanted to see what you all thought about automatic publishing</p>",
        "id": 278249948,
        "sender_full_name": "Ashley Mannix",
        "timestamp": 1649384380
    },
    {
        "content": "<p>I'm not opposed to publishing crates from CI!</p>",
        "id": 278416635,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1649519991
    },
    {
        "content": "<p>the only open question would be which token to use in CIs, and with <a href=\"http://crates.io\">crates.io</a> not supporting token scopes that'd likely mean creating a github account for each crate we want to publish, which is annoying</p>",
        "id": 278416680,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1649520004
    },
    {
        "content": "<p>I don't think we need token scopes, we just need to have a centralized job (either on GHA or AWS) that pulls and cargo publishes a bunch of repositories nightly or so.</p>",
        "id": 278421187,
        "sender_full_name": "simulacrum",
        "timestamp": 1649525589
    },
    {
        "content": "<p>Nightly publishing would probably work too <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span> And centralizing/simplifying token management sounds nice (realistically the scope of most libs team member’s tokens would cover the same set of repositories anyways so it doesn’t seem like a bigger risk to me). One pain I have in publishing within larger orgs in other package managers with CI is that there’s _always_ an expired token in use somewhere that needs updating</p>",
        "id": 278679150,
        "sender_full_name": "Ashley Mannix",
        "timestamp": 1649762997
    },
    {
        "content": "<p>I think <a href=\"http://crates.io\">crates.io</a> tokens don't expire, and part of my goal here would probably be to see about removing libs (and in general humans) from having default access to <a href=\"http://crates.io\">crates.io</a>, to prevent those accounts having immediate publish rights to critical packages that the whole world depends on.</p>",
        "id": 278680364,
        "sender_full_name": "simulacrum",
        "timestamp": 1649763777
    }
]