[
    {
        "content": "<p>From here: <a href=\"https://github.com/rust-lang/rust/pull/78801#discussion_r523728344\">https://github.com/rust-lang/rust/pull/78801#discussion_r523728344</a></p>\n<p>I get the idea to break things as little as possible in general and especially around beta/stable releases. But for the toolset that goes along with rustc shouldn't their beta version keep compiling with beta-rustc be the goal? Instead of the latest toolset and beta rustc. </p>\n<p>Also, PRs other than those that are being backported to beta won't/ shouldn't affect beta rustc release. </p>\n<p>I guess my question is how can merging PRs into rust-master break rustc-beta and same for tool shipped along with beta</p>",
        "id": 216819705,
        "sender_full_name": "Aman Arora",
        "timestamp": 1605481302
    },
    {
        "content": "<p>In the week before nightly is promoted to beta it isn't allowed to break tools. Otherwise it is very likely that the tool would still be broken by the time the beta promotion happens.</p>",
        "id": 216820328,
        "sender_full_name": "bjorn3",
        "timestamp": 1605482357
    },
    {
        "content": "<p>Yes, that's right. Though if someone wanted to shorten beta week we could stop it starting with the bump to the next version (i.e., it would read src/version to decide when the week should be).</p>",
        "id": 216821634,
        "sender_full_name": "simulacrum",
        "timestamp": 1605484683
    },
    {
        "content": "<p>I thought the way it worked was every <code>x</code> interval we would pick commits that have been in the tree for 6 weeks to beta</p>",
        "id": 216821820,
        "sender_full_name": "Aman Arora",
        "timestamp": 1605484952
    },
    {
        "content": "<p>beta is branched from master about 2 days before the release from a commit on master that is about 4 days old.  Then the beta branch sites mostly quietly with the occasional backports for the next 6 weeks.  The process is documented <a href=\"https://forge.rust-lang.org/release/process.html\">here</a> (and <a href=\"https://forge.rust-lang.org/release/beta-backporting.html\">here</a> for beta backports).</p>",
        "id": 216822196,
        "sender_full_name": "Eric Huss",
        "timestamp": 1605485566
    },
    {
        "content": "<p>thank you <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 216822847,
        "sender_full_name": "Aman Arora",
        "timestamp": 1605486756
    }
]