[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"120827\">(Saethlin) Ben Kimock</span> has marked this topic as unresolved.</p>",
        "id": 265746221,
        "sender_full_name": "Notification Bot",
        "timestamp": 1640128469
    },
    {
        "content": "<p>Do crater jobs run builds with 1 or multiple CPUs/jobs?</p>\n<p>I tried to run crater myself to see, but it doesn't build it just OOMS.</p>",
        "id": 265864604,
        "sender_full_name": "(Saethlin) Ben Kimock",
        "timestamp": 1640214406
    },
    {
        "content": "<p>they spawn as many jobs as your CPU cores</p>",
        "id": 265864868,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1640214641
    },
    {
        "content": "<p>That makes sense, but I'm thinking about interpreting the crater build logs. Are those builds done with one or multiple jobs?</p>",
        "id": 265871879,
        "sender_full_name": "(Saethlin) Ben Kimock",
        "timestamp": 1640220409
    },
    {
        "content": "<p>Multiple jobs, typically whatever the core count is on that machine</p>",
        "id": 265875758,
        "sender_full_name": "simulacrum",
        "timestamp": 1640224730
    },
    {
        "content": "<p>(some of our build machines have more vCPUs, some less)</p>",
        "id": 265875770,
        "sender_full_name": "simulacrum",
        "timestamp": 1640224746
    },
    {
        "content": "<p>Ah. That explains some things. Is there an inconsistent memory limit on each too? Perhaps \"whatever that VM happens to have\"?</p>",
        "id": 265885057,
        "sender_full_name": "(Saethlin) Ben Kimock",
        "timestamp": 1640237377
    },
    {
        "content": "<p>there is a hard cap of I think 1.5gb?</p>",
        "id": 265898871,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1640252008
    },
    {
        "content": "<p>the machines have enough capacity for each crate to reach the quota without the host ram running out</p>",
        "id": 265898960,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1640252063
    },
    {
        "content": "<p>It looks to me like about a third of all the build-fail cases could be root-caused to the combination of too low a memory limit for the provided build parallelism. Has there been any kind of triaging or study done on the jobs that exit due to SIGKILL before? I just want to make sure I'm not repeating previous work or something.</p>",
        "id": 265963690,
        "sender_full_name": "(Saethlin) Ben Kimock",
        "timestamp": 1640303327
    },
    {
        "content": "<p>Not to my knowledge. In general making cargo / rustc better handle low memory and reduce parallelism (i.e., not just for crater) would be great.</p>",
        "id": 265963735,
        "sender_full_name": "simulacrum",
        "timestamp": 1640303391
    },
    {
        "content": "<p>Is there somewhere I can query for all crater logs from a particular crate? I'm looking at a few crates that were recently classified as \"fixed\" but I'm convinced they all just have flaky tests and I'm not hugely keen on clicking through the crater site.</p>",
        "id": 266455228,
        "sender_full_name": "(Saethlin) Ben Kimock",
        "timestamp": 1640895248
    },
    {
        "content": "<p>That does seem like it'd be a useful axis to navigate along.</p>",
        "id": 266458637,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1640898697
    },
    {
        "content": "<p>No index is readily available, but e.g. beta crater runs are fairly deterministic in terms of naming scheme and so the result files for those should be at readily discoverable places.</p>\n<p>If you plan to collect a bunch of crates, though, the tarballs are likely a better path - it'll be faster to download just a couple larger files, most likely.</p>",
        "id": 266463875,
        "sender_full_name": "simulacrum",
        "timestamp": 1640903825
    },
    {
        "content": "<p>Hm yeah I think for now I'll just manually punch in URLs and get some shell scripts with fd and rg going</p>",
        "id": 266480779,
        "sender_full_name": "(Saethlin) Ben Kimock",
        "timestamp": 1640925273
    }
]