[
    {
        "content": "<p>we recently made a change via rust-lang/team to convert rustup and rustfmt working groups to teams. this worked as expected, but i noticed that in github there's now duplicative teams where the old github team for the wg remains. is this expected behavior or did i forget to do something in r-l/team to get rid of the old wg github team?</p>\n<p>if it is expected (or at least anticipated), is deleting the github team \"wg-rustfmt\" something the  infra team has access to do?</p>\n<p><a href=\"https://github.com/orgs/rust-lang/teams/wg-rustfmt\">https://github.com/orgs/rust-lang/teams/wg-rustfmt</a><br>\n<a href=\"https://github.com/orgs/rust-lang/teams/rustfmt\">https://github.com/orgs/rust-lang/teams/rustfmt</a></p>",
        "id": 277537771,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1648915840
    },
    {
        "content": "<p>hmm, renaming is not \"supported\" and has to be done manually</p>",
        "id": 277541504,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1648920669
    },
    {
        "content": "<p>thanks, would it suffice to delete the old team in this case? everything with the new team seems to be wired up and functioning correctly everywhere else.</p>\n<p>i'd also ask if it would be worth trying to incorporate renames into the automation in r-l/team, but figure that doesn't happen often enough to be worth the effort</p>",
        "id": 277541995,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1648921326
    },
    {
        "content": "<blockquote>\n<p>i'd also ask if it would be worth trying to incorporate renames into the automation in r-l/team, but figure that doesn't happen often enough to be worth the effort</p>\n</blockquote>\n<p>actually there's a number of github teams that aren't managed by r-l/team aren't there, so it seems like that would be borderline impossible</p>",
        "id": 277542097,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1648921521
    },
    {
        "content": "<p>yeah, once everything is managed through the team repo that will be possible, but we're a long way from that</p>",
        "id": 277542391,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1648921926
    },
    {
        "content": "<p>did you actually change all perms everywhere to point to the new github team?</p>",
        "id": 277542403,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1648921943
    },
    {
        "content": "<p>otherwise I can delete the new team and rename wg-rustfmt to rustfmt from the UI, keeping perms intact</p>",
        "id": 277542425,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1648921970
    },
    {
        "content": "<p>I don't think that change was done, we should probably rename the teams as you suggest.</p>",
        "id": 277546198,
        "sender_full_name": "simulacrum",
        "timestamp": 1648926578
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"320317\">@Caleb Cartwright</span> I see perms on the rustfmt repo are not managed through teams</p>",
        "id": 277602468,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1648977963
    },
    {
        "content": "<p>anyway, renamed the team so that existing permissions are preserved</p>",
        "id": 277602546,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1648978003
    },
    {
        "content": "<p>and removed scampi/calebcartwright/topecongiro's direct access, replacing it with granting access to the rustfmt team directly</p>",
        "id": 277602782,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1648978137
    },
    {
        "content": "<p>I also see karyon/ytmimi have triage perms and nrc has write perms, are those expected?</p>",
        "id": 277602821,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1648978163
    },
    {
        "content": "<p>if so they should probably be moved over to teams (ideally creating a rustfmt-triagers team or something like that)</p>",
        "id": 277602841,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1648978179
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"121055\">Pietro Albini</span> <a href=\"#narrow/stream/242791-t-infra/topic/duplicate.20github.20teams/near/277602782\">said</a>:</p>\n<blockquote>\n<p>and removed scampi/calebcartwright/topecongiro's direct access, replacing it with granting access to the rustfmt team directly</p>\n</blockquote>\n<p>so this poses a bit of a challenge as it's removed my admin permissions to the repo and thus my ability to make some changes i had mind, and wasn't a change i wanted</p>",
        "id": 277747044,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1649085674
    },
    {
        "content": "<p>i really just wanted to get rid of the duplicative teams to avoid any confusion, and not lose permissions to the repo. if there's a need to change the way we're managing access to the repo that's fine but would like to go back to what we had until we have everything in place to make that change</p>",
        "id": 277747349,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1649085791
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"320317\">@Caleb Cartwright</span> Can you share what changes you were hoping to make? I just moved the rustfmt team to 'maintain' access, but as we figure out appropriate ACLs over time I'm trying to collect reports of that being insufficient</p>",
        "id": 277754656,
        "sender_full_name": "simulacrum",
        "timestamp": 1649088592
    },
    {
        "content": "<p>yeah, knowing the need for admin access would be helpful. to be clear, it's ok to give admin access to (a subset of) team members, I'm just curious if it's something we can improve without the need for admin access</p>",
        "id": 277755003,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1649088726
    },
    {
        "content": "<p>sorry for removing the admin perms you had, I missed you had them when I consolidated permissions into a team, and that wasn't the intention <span aria-label=\"slight frown\" class=\"emoji emoji-1f641\" role=\"img\" title=\"slight frown\">:slight_frown:</span></p>",
        "id": 277755083,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1649088766
    },
    {
        "content": "<p>in general we should strive for managing permissions with teams rather than individuals, as that prevents people accidentally keeping write access to repositories after they leave teams</p>",
        "id": 277755158,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1649088824
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116122\">simulacrum</span> <a href=\"#narrow/stream/242791-t-infra/topic/duplicate.20github.20teams/near/277754656\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"320317\">Caleb Cartwright</span> Can you share what changes you were hoping to make? I just moved the rustfmt team to 'maintain' access, but as we figure out appropriate ACLs over time I'm trying to collect reports of that being insufficient</p>\n</blockquote>\n<p>sure! though also admit i may be overly opinionated as i'm dealing with the same at my day job and trying to get github to provide more levels of permission granularity that are available when defining custom roles for an org/enterprise.</p>\n<p>the biggest gap i see is that the entirety of branch protection policies are gated under the Admin role. Maintain helps a bit in that it opens up access to control a _few_ things like merge strategy, but it's still quite limited.</p>\n<p>this is also yet another case where i think there's benefits in being able to differentiate between leads and a team at large, wherein i'd think the standard Write role would suffice for the team while leads could have a Maintain+ role (in a custom role world, wherein the Maintain role is used as the base perm set with a few additive perm grants) or Admin in the absence of custom roles</p>",
        "id": 277759136,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1649090440
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"121055\">Pietro Albini</span> <a href=\"#narrow/stream/242791-t-infra/topic/duplicate.20github.20teams/near/277755083\">said</a>:</p>\n<blockquote>\n<p>sorry for removing the admin perms you had, I missed you had them when I consolidated permissions into a team, and that wasn't the intention <span aria-label=\"slight frown\" class=\"emoji emoji-1f641\" role=\"img\" title=\"slight frown\">:slight_frown:</span></p>\n</blockquote>\n<p>no worries, i'm all for moving in whatever the right direction is, but there's some things i'd like to tidy up/get in place before relinquishing my admin rights (specifically branch prot. policies and probably removing one of the folks i'd added manually as a collaborator)</p>",
        "id": 277759447,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1649090539
    },
    {
        "content": "<p>I've wanted team-repo managed ACLs on repositories for a while, and I could easily imagine us moving branch protection to primarily being controlled through that route as well - though it's probably not ideal - as a stopgap.</p>\n<p>But yeah, that makes sense. I think mapping leads to a dedicated GitHub team might be one way, though I've also thought about temporary privilege escalation with logging in something like #t-infra or so.</p>",
        "id": 277760239,
        "sender_full_name": "simulacrum",
        "timestamp": 1649090849
    },
    {
        "content": "<p>Was talking to <span class=\"user-mention\" data-user-id=\"121055\">@Pietro Albini</span> a bit. I might take some time in the coming week to try to document what the status quo is for GitHub permissions and then we can come up with a plan for moving towards an ideal.</p>",
        "id": 277760613,
        "sender_full_name": "rylev",
        "timestamp": 1649090993
    },
    {
        "content": "<p>if we need temporary permissions for things like changing ACLs once then privilege escalation/sudo sounds like a better approach</p>",
        "id": 277760769,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1649091048
    },
    {
        "content": "<p>which would be even more awesome for owner access (with core, infra, mods and security occasionally needing owner bits)</p>",
        "id": 277760833,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1649091080
    },
    {
        "content": "<p>a chat ops-style \"sudo make-this-new-github-check-passing-required-for-merge\" sounds awesome <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 277761096,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1649091184
    },
    {
        "content": "<p>that'd be more like \"please make me admin on rust-lang/rustfmt for 10 minutes\" with logging</p>",
        "id": 277761134,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1649091206
    },
    {
        "content": "<p>Given the limited need for this, does it make sense to ever grant full admin access? Presumably we could aim to enumerate the common things folks need admin access for and provide specific one time access capabilities for those things.</p>",
        "id": 277761334,
        "sender_full_name": "rylev",
        "timestamp": 1649091283
    },
    {
        "content": "<p>fair, and certainly a lot more practical as the checks/check status APIs are a bit of a beast (although the former would be awesome in many contexts outside Rust world)</p>",
        "id": 277761337,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1649091284
    },
    {
        "content": "<p>I guess if the functionality in question is really complex it might not be feasible to do anything more than temp sudo access.</p>",
        "id": 277761431,
        "sender_full_name": "rylev",
        "timestamp": 1649091329
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"224872\">rylev</span> <a href=\"#narrow/stream/242791-t-infra/topic/duplicate.20github.20teams/near/277761334\">said</a>:</p>\n<blockquote>\n<p>Given the limited need for this, does it make sense to ever grant full admin access? Presumably we could aim to enumerate the common things folks need admin access for and provide specific one time access capabilities for those things.</p>\n</blockquote>\n<p>i think that's probably also fair, especially given the number of repositories in the r-l org. one on-going piece i've been debating with myself on though is the merge strategies wherein we typically only want to support squash/rebase, with the one exception being subtree syncs where merge commits are necessary.</p>\n<p>we can certainly work around that particular scenario as a team via process, but it also makes me think there's other scenarios (and yes acknowledge that as a maintain role vs. admin role)</p>",
        "id": 277761631,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1649091413
    },
    {
        "content": "<p>smaller teams (especially those that oscillate between 1 and 2 maintainers) could also struggle with the required reviewers branch protection policy config without having a team admin that can override.</p>\n<p>starts to become more a question of degree of autonomy imo</p>",
        "id": 277762577,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1649091733
    },
    {
        "content": "<p>if that becomes a bottleneck where admin perms are often used to override the branch protection policy, that policy should likely be revised instead of always using admin perms to bypass it</p>",
        "id": 277763741,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1649092184
    },
    {
        "content": "<p>i mention it as an example of where repository configuration may not simply be a one-and-done thing, wherein the team/leads/etc. would have to come back to infra in some shape or form to request changes, as changing the policy and bypassing the policy both require Admin</p>",
        "id": 277769848,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1649094804
    },
    {
        "content": "<p>I'm a fan of the idea of eliminating the <em>need</em> for admin permissions, but at the same time, I <em>love</em> the idea of \"escalate me to owner permissions, and log that request and everything I do to the repository to a Zulip channel\".</p>",
        "id": 277809419,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1649116149
    },
    {
        "content": "<p>I would also like an escalate permissions system. I ran into limitations with Clippy before, where I couldn't even add secrets for our CI to the repository and had to ask Manish to do that. Giving me access for doing that for 10 minutes would've been enough, without the need of permanent admin access.</p>",
        "id": 277843734,
        "sender_full_name": "flip1995",
        "timestamp": 1649147700
    },
    {
        "content": "<p>Agreed with all the above sentiments. In the interim until such a solution in place, would it be possible for me to get my admin permissions back on rust-lang/rustfmt <span class=\"user-mention\" data-user-id=\"121055\">@Pietro Albini</span>?</p>",
        "id": 277882198,
        "sender_full_name": "Caleb Cartwright",
        "timestamp": 1649167004
    },
    {
        "content": "<p>done</p>",
        "id": 277882298,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1649167047
    }
]