[
    {
        "content": "<p>I am receiving more and more spam sent to me via <code>@rust-lang.org</code> addresses which I dare not pass to my classifiers because that risks them deciding that <code>@rust-lang.org</code> is a spam provider.  Is there anything infra can do to capture/reduce these, and if so, is there an address I should forward uncaught things to?</p>",
        "id": 231617247,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1616584657
    },
    {
        "content": "<p>Hm, I'm a bit wary of you directly forwarding (in case <em>you</em> get marked as a spammer). I'm not sure how much we can do right now, but there's been some thinking about the communications infrastructure in general, and I suspect that this particular problem is potentially solvable with some investment. Maybe you can screenshot a couple and send an email to infra@? That would help at least understand what they look like :)</p>",
        "id": 231618516,
        "sender_full_name": "simulacrum",
        "timestamp": 1616585321
    },
    {
        "content": "<p>I am also getting a lot of spam. It has a To address of team@. Most of it is that something is \"ready for delivery\" and you need to give your address to deliver it to. Or they have a \"new product\". On several occasions the DKIM(?) was incorrect, so I think it gets directly sent to my own email rather than through a forward from team@.</p>",
        "id": 231621685,
        "sender_full_name": "bjorn3",
        "timestamp": 1616587322
    },
    {
        "content": "<p>I only have one to hand, but I'll send a png of it, and of its headers.</p>",
        "id": 231636440,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1616593840
    },
    {
        "content": "<p>Thanks. I'm not sure how much we can do, but it's definitely a useful data point, thank you for raising it.</p>",
        "id": 231637958,
        "sender_full_name": "simulacrum",
        "timestamp": 1616594394
    },
    {
        "content": "<p>If there were a way to get mailgun to classify the mails, then I could add a custom rule to take that into account directly.  It's hard for systems downstream of something like mailgun to sensibly apply learning to such mails without risking identifying mailgun or <a href=\"http://rust-lang.org\">rust-lang.org</a> as spammers</p>",
        "id": 231638249,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1616594464
    },
    {
        "content": "<p>google already classifies all of that mail as spam fwiw, there are robots, massage chairs and whatnot in there.</p>",
        "id": 231638321,
        "sender_full_name": "nagisa",
        "timestamp": 1616594485
    },
    {
        "content": "<p>Yeah, my personal threshold is higher than google's because I have a number of less-good family members who forward things to me and are sad when my mail system learns them as spammers</p>",
        "id": 231638509,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1616594535
    },
    {
        "content": "<p>But as a corollary, I often have to go spam-bin diving on my gmail to retrieve non-spams, so it's swings and roundabouts</p>",
        "id": 231638602,
        "sender_full_name": "Daniel Silverstone",
        "timestamp": 1616594565
    }
]