[
    {
        "content": "<p>The <a class=\"stream\" data-stream-id=\"247081\" href=\"/#narrow/stream/247081-t-compiler.2Fperformance\">#t-compiler/performance</a> team would like to start investigating some potential new ways to help compiler performance that could be automated. For example, we'd like to investigate <a href=\"#narrow/stream/247081-t-compiler.2Fperformance/topic/Preventing.20bad.20rollups\">limiting rollups based on the contents of the PR</a> (e.g., if a PR changes dependencies then we could consider marking the PR as rollup=never). </p>\n<p>I believe the best way to accomplish this would be to extend rustbot/triagebot to be able to respond to more than user input. Any thoughts on the right way to experiment here? Any gotchas I should look out for?</p>",
        "id": 278541217,
        "sender_full_name": "rylev",
        "timestamp": 1649677563
    },
    {
        "content": "<p>Triagebot already receives all GitHub sent webhooks, so it should \"just\" be a matter of writing the right handler. I'm happy to schedule some time to talk about my recommendations for a design if that's helpful.</p>",
        "id": 278542917,
        "sender_full_name": "simulacrum",
        "timestamp": 1649678572
    },
    {
        "content": "<p>That sounds good. We can schedule a time in DMs. In the meantime, I can get more familiar with the code.</p>",
        "id": 278544260,
        "sender_full_name": "rylev",
        "timestamp": 1649679367
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224872\">@rylev</span> you can probably just copy over <a href=\"https://github.com/rust-lang/triagebot/blob/master/src/handlers/autolabel.rs\">https://github.com/rust-lang/triagebot/blob/master/src/handlers/autolabel.rs</a> to be a separate handler for not just labeling but 'comment writing', with configuration living in rust-lang/rust to the tune of \"/Cargo.lock\" -&gt; \"@bors rollup=never\".</p>\n<p>We'll also want to make sure bors listens to rustbot for rollup=never; I forget if that's a permissionless command or if rustbot has the right ACL. I think making rollup status permissionless is probably OK, or at least making rustbot special in that regard, so I'd go down that road.</p>\n<p>There will be some concern over writing this <em>each</em> time the PR is pushed, since that's noisy; we don't currently have an amazing way of dealing with that. Bors doesn't have an API to tell you the rollup state today of a given PR (though it could, maybe the right approach). Alternatively, you can (a) limit to applying this hook just on PR opens, (b) add a database table tracking this information, (c) use the rustbot \"github as a database\" support (<a href=\"https://github.com/rust-lang/triagebot/blob/master/src/interactions.rs#L64\">https://github.com/rust-lang/triagebot/blob/master/src/interactions.rs#L64</a>).</p>\n<p>I think of these I'd probably say (a) and (c) are the current right approach.</p>",
        "id": 278550835,
        "sender_full_name": "simulacrum",
        "timestamp": 1649682646
    },
    {
        "content": "<p>It may also make sense for bors to just not provide a rollup checkbox on some PRs; that may be an easier change with less moving parts, though also potentially confusing.</p>",
        "id": 278550915,
        "sender_full_name": "simulacrum",
        "timestamp": 1649682702
    },
    {
        "content": "<p>yeh we could do only when pr opens (the same way highfive works for assignment + submodules)</p>",
        "id": 278555772,
        "sender_full_name": "DPC",
        "timestamp": 1649684887
    },
    {
        "content": "<p>Well, (c) means we can do it always, it's my preference above (a), particularly for something like this.</p>",
        "id": 278555894,
        "sender_full_name": "simulacrum",
        "timestamp": 1649684946
    },
    {
        "content": "<p>bors doing this on rollup creation also wouldn't be too hard, but it presents a slightly worse interface to those creating rollups of course.</p>",
        "id": 278555950,
        "sender_full_name": "simulacrum",
        "timestamp": 1649684977
    },
    {
        "content": "<p>(c) sounds better, especially because it'd allow to switch from <code>rollup=maybe</code> to <code>rollup=never</code> only if someone didn't manually override that (i.e. if the rollup=foo rustbot did set before is different than the one currently set)</p>",
        "id": 278561822,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1649687347
    },
    {
        "content": "<p>but that'd hardcode handling rollups rather than a generic \"comment if file is changed\"</p>",
        "id": 278562073,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1649687444
    },
    {
        "content": "<p>Ok cool. I'll take a look into this with approach (c) and see how far I can get.</p>",
        "id": 278573841,
        "sender_full_name": "rylev",
        "timestamp": 1649691960
    },
    {
        "content": "<p>(c) doesn't help hugely with user submission of rollup status change, since that's not tracked by rustbot presumably, if we want that I would have bors expose an API endpoint - which shouldn't be too hard, I suspect.</p>",
        "id": 278574290,
        "sender_full_name": "simulacrum",
        "timestamp": 1649692128
    },
    {
        "content": "<p>If rustbot only tries to determine rollup elligbility when new code is pushed, then perhaps the correct implementation is to always apply the <code>rollup=never</code> regardless of what user input was previously given.</p>",
        "id": 278574581,
        "sender_full_name": "rylev",
        "timestamp": 1649692263
    },
    {
        "content": "<p>Yeah, that may be right, I'm just saying that leaving that comment regardless of current state is likely noisy. Maybe we can delete our known state on any user comment in the intervening period, or user comment with bors mentioned.... an API starts looking better though the more I think about it.</p>",
        "id": 278574949,
        "sender_full_name": "simulacrum",
        "timestamp": 1649692404
    }
]