[
    {
        "content": "<p>This bors queue is pretty deep. What is the current thinking on how to manage this going forward? Are we limited on CI resources, or is Microsoft donating as much as we can use? Specifically, it would be cool if bors did speculative runs, i.e. assume that the current CI run succeeds, pick the next PR as well and merge it on top, and then run that speculatively in parallel, so that if the first succeeds, two PRs can potentially get merged in quick succession.</p>",
        "id": 200519964,
        "sender_full_name": "trevyn",
        "timestamp": 1591866142
    },
    {
        "content": "<p>We are already doing rollups to improve throughput. Rollups combine multiple PR's together to test them at once. Doing speculative CI will waste a lot of resources because about half of the time CI runs fail, as can be seen at <a href=\"https://dev.azure.com/rust-lang/rust/_build?definitionId=25\">https://dev.azure.com/rust-lang/rust/_build?definitionId=25</a>. (runs where one jobs fails are automatically canceled) Also I think Microsoft has reserved specific machines for the Rust CI.</p>",
        "id": 200520711,
        "sender_full_name": "bjorn3",
        "timestamp": 1591866664
    },
    {
        "content": "<p>Understood that it is less efficient and that rollups are a current strategy; I want to understand what Microsoft is willing to contribute going forward. As a new contributor, it is somewhat discouraging to see my PR take a week to go from approval to CI run, and I can't help but think that this has an impact on Rust iteration speed in general.</p>",
        "id": 200521430,
        "sender_full_name": "trevyn",
        "timestamp": 1591867162
    },
    {
        "content": "<p>I think the infra team is trying github actions to replace Azure, and build seems way faster but its not reliable enough right now iirc.</p>",
        "id": 200521928,
        "sender_full_name": "marmeladema",
        "timestamp": 1591867524
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"281572\">@marmeladema</span> ! Can you point me to where this is being discussed?</p>",
        "id": 200522729,
        "sender_full_name": "trevyn",
        "timestamp": 1591868052
    },
    {
        "content": "<p>This is the issue for the reliability problem: <a href=\"https://github.com/rust-lang/rust/issues/71988\">https://github.com/rust-lang/rust/issues/71988</a></p>",
        "id": 200522813,
        "sender_full_name": "bjorn3",
        "timestamp": 1591868122
    },
    {
        "content": "<p><a href=\"https://github.com/rust-lang/rust/issues?q=is%3Aissue+is%3Aopen+label%3AA-github-actions\">https://github.com/rust-lang/rust/issues?q=is%3Aissue+is%3Aopen+label%3AA-github-actions</a> is the list of all github actions related issues.</p>",
        "id": 200522948,
        "sender_full_name": "bjorn3",
        "timestamp": 1591868220
    },
    {
        "content": "<p>Cool, thank you! Have we reached out to our contacts at Google and Amazon regarding their willingness to contribute to CI runs?</p>",
        "id": 200523392,
        "sender_full_name": "trevyn",
        "timestamp": 1591868600
    },
    {
        "content": "<p>Specifically also looping in the teams at Google that we know use Rust... ;)</p>",
        "id": 200523506,
        "sender_full_name": "trevyn",
        "timestamp": 1591868691
    },
    {
        "content": "<p>Just to add that the queue is deep right now because we had an issue with wasm target yesterday so had to close the queue for around 6-8 hours in the evening. Normally the queue looks much better than this. <br>\nNot part of the infra team, but from what I know there are certain discussions that are happening and we will get updates regarding it.</p>",
        "id": 200524560,
        "sender_full_name": "DPC",
        "timestamp": 1591869511
    },
    {
        "content": "<p>A while back I suggested incremental retesting, where only tests affected by the changed code would be run. So for example, if you only modify rustdoc files, you don't have to rerun all the thousands of UI tests. That was rejected because there was worried about making CI less dependable and more magic: <a href=\"https://discord.com/channels/442252698964721669/443148319431065610/672615346997428249\">https://discord.com/channels/442252698964721669/443148319431065610/672615346997428249</a></p>",
        "id": 200533333,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1591876201
    },
    {
        "content": "<p>For PR tests I think CI being less dependable would be less of a problem than for the final tests before merge. It would still have the problem of being more complex to maintain though.</p>",
        "id": 200534454,
        "sender_full_name": "bjorn3",
        "timestamp": 1591876935
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"232545\">@Joshua Nelson</span> it is difficult given that certain changes could cause regression in other parts. It doesn't happen that often but it has occurred in the past that a test has failed because it depends on the changed code transitively instead of directly.</p>",
        "id": 200535620,
        "sender_full_name": "DPC",
        "timestamp": 1591877711
    },
    {
        "content": "<blockquote>\n<p>it has occurred in the past that a test has failed because it depends on the changed code transitively instead of directly.</p>\n</blockquote>\n<p>My idea took care of that by calculating <em>all</em> dependencies recursively ... It makes me a little sad people weren't listening. That does take the scope from \"add code to x.py\" to \"write an independently maintained project\" but I was offering to do all the work</p>",
        "id": 200535974,
        "sender_full_name": "Joshua Nelson",
        "timestamp": 1591877915
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"232545\">@Joshua Nelson</span> <a href=\"#narrow/stream/242791-t-infra/topic/Speculative.20CI.3F/near/200535974\">said</a>:</p>\n<blockquote>\n<p>My idea took care of that by calculating <em>all</em> dependencies recursively ... It makes me a little sad people weren't listening. That does take the scope from \"add code to x.py\" to \"write an independently maintained project\" but I was offering to do all the work</p>\n</blockquote>\n<p>to be honest running the actual tests doesn't take much long, and it's something that can be fixed by throwing more cores at the problem, while last time I checked most of the time was spent compiling the compiler (or other tooling in dist builders) instead of running tests</p>",
        "id": 200541776,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1591881146
    },
    {
        "content": "<blockquote>\n<p>This bors queue is pretty deep. What is the current thinking on how to manage this going forward? Are we limited on CI resources, or is Microsoft donating as much as we can use?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"278163\">@trevyn</span> currently we're limited by the hosted builders on azure pipelines, that are only available with 2 cores -- we're already working with microsoft to migrate to everything to github actions, which has a custom 8-core hosted VMs pool dedicated just for the rust project</p>",
        "id": 200542060,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1591881291
    },
    {
        "content": "<p>progress on that is slower than I'd like (we're blocked on macOS builders being really flaky, and github is investigating into it), but hopefully it'll be ready soon</p>",
        "id": 200542229,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1591881374
    },
    {
        "content": "<p>with how many builders we use, speculative execution is probably going to be way more wasteful than just making single builds faster and doing rollups</p>",
        "id": 200542252,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1591881390
    },
    {
        "content": "<p>I also wondered, but maybe that's impossible or totally none sense, but could the some parts like the standard library be hosted in another repo and have a lighter build / testing process? Lik</p>",
        "id": 200550352,
        "sender_full_name": "marmeladema",
        "timestamp": 1591885136
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281572\">@marmeladema</span> that's what we're already doing with some of the tools and the toolstate system, but I don't think it's suitable for the stdlib</p>",
        "id": 200563156,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1591890550
    },
    {
        "content": "<p>the problem with that tooling is that sometimes changes to the compiler are made that break one of the submodules, and that submodule stops being available on nightly until a separate PR is sent to the submodule and another PR bumps the submodule on the main repo</p>",
        "id": 200563329,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1591890612
    },
    {
        "content": "<p>we don't care <em>too much</em> if rustfmt or clippy are missing for a nightly or two, but not having the stdlib available would make the nightly useless</p>",
        "id": 200563397,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1591890644
    },
    {
        "content": "<p>also I know there are some efforts to scale down the number of submodules we manage, as the setup is a bit problematic for contributors</p>",
        "id": 200563464,
        "sender_full_name": "Pietro Albini",
        "timestamp": 1591890677
    },
    {
        "content": "<p>I thought subtree kind of solve that issue? I don't know much about substree though but i thought maybe the standard library could use the same feature.</p>",
        "id": 200565298,
        "sender_full_name": "marmeladema",
        "timestamp": 1591891339
    }
]