[
    {
        "content": "<p>Hi all. There was a chat in <a class=\"stream-topic\" data-stream-id=\"122651\" href=\"/#narrow/stream/122651-general/topic/Mac.20Builders\">#general &gt; Mac Builders</a> about how much slower the Mac CI runs are than the others. I wanted to see whether there was anything (in terms of donating more computation cycles) that AWS could help with here.</p>",
        "id": 228428978,
        "sender_full_name": "pnkfelix",
        "timestamp": 1614699066
    },
    {
        "content": "<p>The official support for Mac is relatively new at AWS, and its provided by Mac Mini level hardware, so its possible that AWS wouldn't offer any advantages over whatever is currently used. But I couldn't figure out from reading forge what the specs are for the current CI for Mac.</p>",
        "id": 228429182,
        "sender_full_name": "pnkfelix",
        "timestamp": 1614699135
    },
    {
        "content": "<p>Is current CI for Mac running on <em><a href=\"https://docs.github.com/en/actions/using-github-hosted-runners/about-github-hosted-runners\">standard</a></em> GitHub Actions runners?<br>\n<a href=\"https://github.com/rust-lang/rust/blob/edeee915b1c52f97411e57ef6b1a8bd46548a37a/.github/workflows/ci.yml#L307\">https://github.com/rust-lang/rust/blob/edeee915b1c52f97411e57ef6b1a8bd46548a37a/.github/workflows/ci.yml#L307</a></p>",
        "id": 228430844,
        "sender_full_name": "hyd-dev",
        "timestamp": 1614699683
    },
    {
        "content": "<p>Yea, it is standard GitHub hosted mac hardware. They don't publicly talk about what it is other than a 3-core, 14GB RAM system.  It appears to be running VMware.  Azure says they use Mac Pros, but I believe GitHub has their own thing.  Looking at the hardware info we collect, I would guess they are minis.</p>\n<p>I suspect more hardware won't be particularly fruitful in the short term.  I would start by taking a close look at the slowest job (dist-aarch64-apple) and figure out what's taking so long.  My instinct is that a dist job should not take anywhere close to 3 hours to finish, so I would think there is a lot of opportunity for improvement.</p>\n<p>I recently took a quick look at Cargo's testsuite, and was able to get a 3x speed boost  on my laptop doing some simple changes.  Probably won't be that easy with rustc, but I think it would be worth at least looking at what's taking so long.</p>",
        "id": 228443432,
        "sender_full_name": "Eric Huss",
        "timestamp": 1614703924
    }
]