[
    {
        "content": "<p>Whenever we perf-test a pr, the pr is marked as <code>rollup=never</code> even if rustbot says there were no interesting perf changes.<br>\nWould it make sense to not apply rollup=never in this case?</p>\n<p>I think for the past 2 weeks the queue never  managed to even fully catch up with all the rollup=never prs, so basically you can only have a pr merged if its<br>\n1) rolled up or<br>\n2) rollup=never (we didn't even touch the \"rollup=iffy\" at part of the queue yet so basically rollup=iff == merge=never, unless the iffy pr is added to a rollup which I'm hesitant to do because I don't want to it to somehow fail the rollup ci if I can avoid it)<br>\nJust yesterday we went from like 2-3 approved rollup=never prs to ~10 at the top of the queue, and just that would take maybe around 2 days/30-40 hours of ci-time to merge.</p>",
        "id": 268346342,
        "sender_full_name": "matthiaskrgr",
        "timestamp": 1642485085
    },
    {
        "content": "<p><a href=\"/user_uploads/4715/0CvRHLCbPTDvAOznOO2Eapuc/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/4715/0CvRHLCbPTDvAOznOO2Eapuc/image.png\" title=\"image.png\"><img src=\"/user_uploads/4715/0CvRHLCbPTDvAOznOO2Eapuc/image.png\"></a></div>",
        "id": 268346409,
        "sender_full_name": "matthiaskrgr",
        "timestamp": 1642485142
    },
    {
        "content": "<p>How many of those ~10 rollup=never PRs had no interesting perf changes? Seems like a reasonable change to me if this number is non-zero...</p>",
        "id": 268356046,
        "sender_full_name": "nnethercote",
        "timestamp": 1642493666
    },
    {
        "content": "<p>\"no interesting\" and actually no changes are often distinct; we don't always say there are changes even if they're present. I would be wary of introducing more noise into rollups. That said, it should be plausible to rollup <em>only</em> perf benched PRs, which should generally be pretty safe, particularly if we don't do too many at once (e.g., limit of 3).</p>",
        "id": 268386972,
        "sender_full_name": "simulacrum",
        "timestamp": 1642510849
    }
]