[
    {
        "content": "<p>Is there an easy way of downloading the data (or its subset) from perf.rlo into a SQLite file? It would be useful for filling local data when working on the perf.rlo site.</p>",
        "id": 274747732,
        "sender_full_name": "Jakub Ber치nek",
        "timestamp": 1646857661
    },
    {
        "content": "<p>Not currently, no, there's some outdated archives though</p>",
        "id": 274751956,
        "sender_full_name": "simulacrum",
        "timestamp": 1646859735
    },
    {
        "content": "<p>there's a tool in the repo to download the old db</p>",
        "id": 274751980,
        "sender_full_name": "simulacrum",
        "timestamp": 1646859749
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"481680\">Michael Wigard</span> has marked this topic as unresolved.</p>",
        "id": 275092488,
        "sender_full_name": "Notification Bot",
        "timestamp": 1647085477
    },
    {
        "content": "<p>Unfortunately since the introduction of benchmark categories, the old file doesn't seem to work anymore without some minor fixing up... In any case I think it would be useful to have some recent data to test with...</p>",
        "id": 275092560,
        "sender_full_name": "Michael Wigard",
        "timestamp": 1647085582
    },
    {
        "content": "<p>You're right, after adding the category it's not very usable. It would be nice to add some API/endpoint for exporting some recent subset of data.</p>",
        "id": 275093366,
        "sender_full_name": "Jakub Ber치nek",
        "timestamp": 1647086735
    },
    {
        "content": "<p>The main reason we haven't is that it currently takes a really long time to prepare the export; I haven't had the time to particularly optimize but I'm not sure that much improvement is possible.</p>",
        "id": 275095160,
        "sender_full_name": "simulacrum",
        "timestamp": 1647089498
    },
    {
        "content": "<p>even if e.g. only the last week worth of data was exported?</p>",
        "id": 275151438,
        "sender_full_name": "Jakub Ber치nek",
        "timestamp": 1647175189
    },
    {
        "content": "<p>I think so, but not sure. Last week also is likely a pretty short window for some things (e.g. statistical analysis).</p>\n<p>I have a to-do item to investigate export into Parquet via AWS functionality and then converting that to SQLite, but haven't had the time to look into it more.</p>",
        "id": 275156120,
        "sender_full_name": "simulacrum",
        "timestamp": 1647180336
    },
    {
        "content": "<p>I think that even just a week of data would be useful, just to test/develop locally with a lot of data</p>",
        "id": 275257988,
        "sender_full_name": "Jakub Ber치nek",
        "timestamp": 1647273867
    }
]