[
    {
        "content": "<p>Regarding <span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span>'s <a href=\"https://github.com/rust-lang/compiler-team/issues/400\">meeting proposal for improving triage</a> I have several comments and questions:</p>\n<ul>\n<li>Can the classification of performance regression, improvement, mixed be more fine tuned? I believe we can use better heuristics for more accurately classifying. </li>\n<li>Can we automate regression testing for rollups? It would be nice to have a @bors command that allows us to quickly quick off a revert of a given rollup PR coupled with a perf run</li>\n<li>Related to the above, can we automate alerting PR authors and reviewers of performance regressions?</li>\n<li>Should we pay less attention to improvements? Perhaps the noting of improvements generated by the report tool is enough and we shouldn't provide any more info on why an improvement was made. </li>\n</ul>\n<p>As I understand it, the purpose of the triage report is to keep the compiler team (and the wider community) informed about the progression of compiler performance. A consequence of this, is that we often alert compiler devs when something has regressed. I think the triage report is doing a poor job of its main purpose of informing but doing a decent job of ensuring regressions are looked into. </p>\n<p>I think we should focus on improving the perf dashboard as a means of addressing the desire to track compiler perf and we should invest in some of the automation above to continue to ensure that devs are informed when their changes cause regressions. I'm not sure the compilation of a report (at least in its current form) is the right way to continue to track compiler performance.</p>",
        "id": 222865726,
        "sender_full_name": "rylev",
        "timestamp": 1610721773
    },
    {
        "content": "<p>heh, we actually have the automated regression testing, I should teach you it</p>",
        "id": 222868145,
        "sender_full_name": "simulacrum",
        "timestamp": 1610722780
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116122\">simulacrum</span> <a href=\"#narrow/stream/247081-t-compiler.2Fperformance/topic/Improving.20Triage/near/222868145\">said</a>:</p>\n<blockquote>\n<p>heh, we actually have the automated regression testing, I should teach you it</p>\n</blockquote>\n<p>🤯</p>",
        "id": 222868296,
        "sender_full_name": "rylev",
        "timestamp": 1610722813
    },
    {
        "content": "<p>overall though I agree with your points, would be great to invest time here, I'm really busy</p>",
        "id": 222868333,
        "sender_full_name": "simulacrum",
        "timestamp": 1610722822
    },
    {
        "content": "<p><a href=\"https://github.com/rust-lang/rustc-perf/pull/701\">https://github.com/rust-lang/rustc-perf/pull/701</a></p>",
        "id": 222868503,
        "sender_full_name": "simulacrum",
        "timestamp": 1610722863
    },
    {
        "content": "<p>I forget if there was an unfixed bug in that and I forget what that bug precisely was, but I think it should work</p>",
        "id": 222868798,
        "sender_full_name": "simulacrum",
        "timestamp": 1610722949
    },
    {
        "content": "<p>I think for the community it would be nice to have summaries improvements across a longer timeframe. njn's blog posts used to serve that purpose.</p>",
        "id": 222882213,
        "sender_full_name": "The 8472",
        "timestamp": 1610727748
    }
]