[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span> I think it was your slot to do triage this week- I likely can spend the time tomorrow if needed, let me know.</p>",
        "id": 249063558,
        "sender_full_name": "simulacrum",
        "timestamp": 1628650645
    },
    {
        "content": "<p>Hmm, weird; I had thought i put an event with the right cadence in my calendar, but i don’t see it here at the moment on my mobile device. Nonetheless, i think i should be able to do it.</p>",
        "id": 249063751,
        "sender_full_name": "pnkfelix",
        "timestamp": 1628650839
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span> I have a <a href=\"https://github.com/rust-lang/rustc-perf/pull/956\">change</a> for how we classify comparisons as regressions, improvements, or mixed. Instead of the simple approach from before we're using a slightly more sophisticated algorithm for determining how to categorize things. </p>\n<p>Previously we only looked to see if there were any significant improvements or regressions in a comparison. If there were only improvements, we classified it as an improvement. If there were only regressions, we classified the comparison as a regression, and if there were both, it was mixed. </p>\n<p>Now we take into account the magnitude of changes (large changes count more) and are a bit more lenient with classification (e.g., if 1 of 20 changes was a regression but that regression was small, we classify the comparison as an improvement and not mixed like we did before). You can read more about how we do classification <a href=\"https://github.com/rust-lang/rustc-perf/blob/0af149a4388f25b7ccbd95e8025f22c095115def/docs/comparison-analysis.md\">here</a>. </p>\n<p><strong>Question</strong>: would you mind if I merged that change, and we can see if we agree with how it now classifies things? I've tried with local data and it seems to work well.</p>",
        "id": 249094573,
        "sender_full_name": "rylev",
        "timestamp": 1628681240
    },
    {
        "content": "<blockquote>\n<p>Question: would you mind if I merged that change, and we can see if we agree with how it now classifies things? I've tried with local data and it seems to work well.</p>\n</blockquote>\n<p>Hmm. I think I’d prefer if you waited until after I do today’s triage. If I had started the triage on time, then I’d be more willing to go ahead with experiments. </p>\n<p>But since I’m already starting late, I think I would prefer to ensure that I can complete the task, rather than make changes that might cause the system to break for me.</p>",
        "id": 249115461,
        "sender_full_name": "pnkfelix",
        "timestamp": 1628692007
    },
    {
        "content": "<p>However, maybe right after I finish doing triage ... that is, you can land it <em>after</em> I finish, and then I can immediate look over the results and double-check that they match my expectations? I think that sounds like a good path to follow.</p>",
        "id": 249115555,
        "sender_full_name": "pnkfelix",
        "timestamp": 1628692058
    },
    {
        "content": "<p>okay I’m about done with triage. but I’m still not clear about what to do with the list of Untriaged Pull Requests.</p>",
        "id": 249124776,
        "sender_full_name": "pnkfelix",
        "timestamp": 1628695981
    },
    {
        "content": "<p>I guess I should look over the list and see if any of them are resolved, and if so, remove the perf-regression label from them?</p>",
        "id": 249124975,
        "sender_full_name": "pnkfelix",
        "timestamp": 1628696053
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span> add perf-regression-triaged, I believe, not remove</p>",
        "id": 249125759,
        "sender_full_name": "simulacrum",
        "timestamp": 1628696428
    },
    {
        "content": "<p>but that's about it. we should have a meeting or something to figure out how to get them in T-compiler queues, really, we should be assigning them to someone probably for investigation</p>",
        "id": 249125814,
        "sender_full_name": "simulacrum",
        "timestamp": 1628696458
    },
    {
        "content": "<p>(though capacity in terms of time for that is likely ~nonexistent)</p>",
        "id": 249125853,
        "sender_full_name": "simulacrum",
        "timestamp": 1628696479
    },
    {
        "content": "<p>Okay, I’ll fix what I did with the labels</p>",
        "id": 249126031,
        "sender_full_name": "pnkfelix",
        "timestamp": 1628696552
    },
    {
        "content": "<p>Okay, posted PR <a href=\"https://github.com/rust-lang/rustc-perf/pull/963\">https://github.com/rust-lang/rustc-perf/pull/963</a> for this week’s report. <span class=\"user-mention\" data-user-id=\"224872\">@rylev</span> , if you’re still up and active, feel free to make your change. After its made, let me know, and I’ll double-check how it looks.</p>",
        "id": 249130136,
        "sender_full_name": "pnkfelix",
        "timestamp": 1628698277
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span> merged <a href=\"https://github.com/rust-lang/rustc-perf/pull/956\">https://github.com/rust-lang/rustc-perf/pull/956</a> and once it deploys (~10-15 minutes) you can re-run curl to get a new report</p>",
        "id": 249130652,
        "sender_full_name": "simulacrum",
        "timestamp": 1628698497
    },
    {
        "content": "<p>the new report didn’t include PR <a href=\"https://github.com/rust-lang/rust/issues/87736\">#87736</a>, for better or for worse. (The old endpoint tagged it as an improvement: \"Moderate improvement in <a href=\"https://perf.rust-lang.org/compare.html?start=7f3dc0464422ebadf3b8647f591bcf6e3107e805&amp;end=6fe0886723c9e08b800c9951f1c6f6a57b2bf22c&amp;stat=instructions:u\">instruction counts</a> (up to -1.7% on <code>full</code> builds of <code>regex-opt</code>)\".)</p>",
        "id": 249134707,
        "sender_full_name": "pnkfelix",
        "timestamp": 1628700342
    },
    {
        "content": "<p>(That PR was pretty isolated in its effect. However, it was made to address a previously marked regression, from <a href=\"https://github.com/rust-lang/rust/issues/87387\">#87387</a>, so it was useful that it had been called out by the script…)</p>",
        "id": 249134892,
        "sender_full_name": "pnkfelix",
        "timestamp": 1628700433
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span> did it also not include it in the \"probably changed\" section?</p>",
        "id": 249137556,
        "sender_full_name": "rylev",
        "timestamp": 1628701610
    },
    {
        "content": "<p>The concrete reason that PR was not included is because there is only one medium size changed (the corecisions debug change is not considered medium since it's a noisy benchmark and the change isn't big enough). That compared with only a few small changes made it sneak by. We _could_ make a policy of showing any comparisons with any changes that are considered medium and above....</p>",
        "id": 249137844,
        "sender_full_name": "rylev",
        "timestamp": 1628701735
    },
    {
        "content": "<p>I think we should distinguish significance and effect size. a low noise benchmark can show significant changes even when the size is small.</p>",
        "id": 249138745,
        "sender_full_name": "The 8472",
        "timestamp": 1628702149
    },
    {
        "content": "<p>This is important because we sometimes have very small changes creeping in over time. Look at the graphs for the last month. Between 2021-07-31 and 2021-08-07 the instructions:u summary keeps going up with every other commit for debug builds. Cumulatively it's just 0.2% so the individual effects are smaller but it's clearly visible even on low-noise benchmarks.</p>",
        "id": 249139378,
        "sender_full_name": "The 8472",
        "timestamp": 1628702413
    },
    {
        "content": "<p>We already distinguish significance and size (what we call magnitude). The truth is that under the current system small but consistent regressions are unlikely to go noticed. But in order to address that we’ll likely want to do trend analysis over historical results.</p>",
        "id": 249139737,
        "sender_full_name": "rylev",
        "timestamp": 1628702583
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"224872\">rylev</span> <a href=\"#narrow/stream/247081-t-compiler.2Fperformance/topic/perf.20triage.202021-08-10/near/249137556\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"116083\">pnkfelix</span> did it also not include it in the \"probably changed\" section?</p>\n</blockquote>\n<p>I didn’t see it anywhere in the output.</p>",
        "id": 249150681,
        "sender_full_name": "pnkfelix",
        "timestamp": 1628707222
    },
    {
        "content": "<p>(my hope is that reading over the untriaged PR’s would have eventually led me to that PR anyway. Whether I would have then added it to the report, I’m not sure.)</p>",
        "id": 249152170,
        "sender_full_name": "pnkfelix",
        "timestamp": 1628707859
    },
    {
        "content": "<p>Following up on this - I noticed that there were a few comparisons that were originally labeled as \"probably changed\" that <span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span> included in their triage report. I'd like to discuss if we should adjust our metrics to make sure they were included:</p>\n<ul>\n<li><a href=\"https://perf.rust-lang.org/compare.html?start=1f94abcda6884893d4723304102089198caa0839&amp;end=4c29cc8fd09889880880cb6081174c79744ab1b6&amp;stat=instructions:u\">This</a> comparison was not included because it only has 3 \"medium\" size changes (and no larger ones). Under our current scheme we only consider something definitely relevant if it has 4 medium size changes or more (assuming no larger changes). Is this too strict a definition? Also, this was previously labeled as a regression even though our current scheme would mark this as mixed. This is because more than 15% of the changes were improvements. We don't really have a good definition of what a \"mixed\" performance change means. </li>\n<li><a href=\"https://perf.rust-lang.org/compare.html?start=db3cb435c1197ef3e3919c03b7f81ca8bffbd007&amp;end=996ff2e0a0f911f52bb1de6bdd0cfd5704de1fc9&amp;stat=instructions:u\">This</a> comparison is now considered a mixed result, but in the old scheme it was labeled as a regression. This is despite there being many (albeit all small) improvements. If large changes all clump in one direction (regression or improvement) do we want to consider that comparison as being that direction even if there are many small changes in both directions?</li>\n</ul>",
        "id": 249207117,
        "sender_full_name": "rylev",
        "timestamp": 1628755141
    },
    {
        "content": "<ul>\n<li>Also, I have a PR coming which will make sure that changes like <a href=\"https://github.com/rust-lang/rust/issues/87736\">#87736</a> are included in \"probably relevant\", but <span class=\"user-mention\" data-user-id=\"116083\">@pnkfelix</span> can you talk about why you felt that this should be included in the triage report? Do you think anything that has medium sized and above changes should be included in the report?</li>\n</ul>",
        "id": 249207394,
        "sender_full_name": "rylev",
        "timestamp": 1628755392
    },
    {
        "content": "<p>(<a href=\"https://github.com/rust-lang/rustc-perf/pull/965\">Here's</a> the PR making any comparison with medium and above sized changes to be considered at least \"probably relevant\")</p>",
        "id": 249207998,
        "sender_full_name": "rylev",
        "timestamp": 1628755900
    },
    {
        "content": "<p>First off, I was using the old report generator, and my memory is that under the old report generator, <a href=\"https://github.com/rust-lang/rust/issues/87736\">#87736</a> showed up as an outright improvement. So that’s the primary reason I included it in my report. However, I think in an ideal world, <a href=\"https://github.com/rust-lang/rust/issues/87736\">#87736</a> would have been included <em>somewhere</em>, because it was addressing a regression that the performance sub team had <a href=\"https://github.com/rust-lang/rust/pull/87387#issuecomment-891942661\">previously flagged</a>. We should acknowledge when that kind of corrective work is done, right?</p>",
        "id": 249238292,
        "sender_full_name": "pnkfelix",
        "timestamp": 1628776943
    },
    {
        "content": "<p>We may potentially need to always leave the \"probably relevant\" changes in the triage report for humans to look over. These changes, although relatively small, should probably be reviewed. We at least seem to no longer be in a situation where we previously were where the triage report would sometimes include comparisons that weren't actually legitimate performance changes (due to noise)</p>",
        "id": 249239906,
        "sender_full_name": "rylev",
        "timestamp": 1628777691
    }
]