[
    {
        "content": "<p>The PR comment that is posted by <code>rust-timer</code> after a perf. run only contains information about instruction counts. While other data (RSS, cycles, walltime) can be notoriously unstable, I still think that it could be useful to at least provide some warning in the comment if they change (with some quite large thresholds to filter out noise).</p>\n<p>Sometimes these values can change even though icount stays largely the same, which can be problematic if no one takes the time to look at them. For example, <a href=\"https://github.com/rust-lang/rust/pull/95171#issuecomment-1077613520\">here</a> icounts are basically the same, but RSS has improved significantly (and, seemingly, consistently).</p>\n<p>What about including some text to the comment if a large change is detected, at least for RSS? Let's say that if RSS detects a lot of significant changes (or if the changes are almost exclusively to one side) or if the arithmetic mean is larger than a few percent, we could include some text like \"It looks like RSS has changed significantly. While it may be noise, you can check the results <a href=\"http://link\">here</a>.\".</p>",
        "id": 276474286,
        "sender_full_name": "Jakub Beránek",
        "timestamp": 1648128069
    },
    {
        "content": "<p>I'd be in favor of including more. We just don't have a good grip on what the threshold between noise and truly relevant changes to RSS actually is. Once we come to an agreement on that, I think we should try including something.</p>",
        "id": 276475949,
        "sender_full_name": "rylev",
        "timestamp": 1648128958
    },
    {
        "content": "<p>As an FYI: there's an issue open right now examining ways to improve the messaging posted after perf runs: <a href=\"https://github.com/rust-lang/rustc-perf/issues/1214\">https://github.com/rust-lang/rustc-perf/issues/1214</a></p>",
        "id": 276476022,
        "sender_full_name": "rylev",
        "timestamp": 1648128980
    },
    {
        "content": "<p>I saw that and I like the table very much! After you reach a consensus I can implement it.</p>",
        "id": 276478751,
        "sender_full_name": "Jakub Beránek",
        "timestamp": 1648130265
    },
    {
        "content": "<p>I think we should take the change across all benchmarks into account to reduce noise.</p>",
        "id": 276479933,
        "sender_full_name": "bjorn3",
        "timestamp": 1648130787
    },
    {
        "content": "<p>The basic idea here is great, the challenge is implementing it in an effective manner <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 276550310,
        "sender_full_name": "nnethercote",
        "timestamp": 1648162844
    },
    {
        "content": "<p>It would be quite useful to have the ability to download historical data from RLO to experiment with this analysis of e.g. RSS.</p>",
        "id": 276584212,
        "sender_full_name": "Jakub Beránek",
        "timestamp": 1648193637
    }
]