[
    {
        "content": "<p>In <a href=\"https://github.com/purpleprotocol/mimalloc_rust/issues/41\">https://github.com/purpleprotocol/mimalloc_rust/issues/41</a> there's some discussion about overriding malloc on macOS for use with rustc, and in particular the implication is that apparently you believe that you use jemalloc's overriding on mac (you <a href=\"https://github.com/gnzlbg/jemallocator/blob/master/jemalloc-sys/build.rs#L45\">don't</a>, and likely can't).</p>\n<p>The performance of macOS's system allocator (well, <code>free</code> really) is atrocious, mostly because it makes some guarantees about <code>free(p)</code> for invalid <code>p</code> being safe and fine (for example, <code>free(p)</code> has to be able to handle pointers allocated out of a custom zone, and has to walk all the zones checking if that pointer belongs to them), which the system libraries <a href=\"https://github.com/opensource-apple/objc4/blob/master/runtime/hashtable2.mm#L68\">do take advantage of</a>.</p>\n<p>This is also why it's so hard to override malloc on macOS — your malloc has to either support, or sufficiently replace the zone system so that the system libraries don't hit these cases, and if you do so, you must do it early enough that it's before any system libraries allocate pointers — difficult because dyld has similar issues. (<code>mimalloc</code> has a mode that does try to override the zone system sufficiently, but it doesn't work as a static library, and requires setting DYLD_FORCE_FLAT_NAMESPACE in the env which often breaks other things).</p>\n<p>Anyway, I had assumed that it was known that on macOS you were using the system allocator, and not jemalloc. I had believed y'all knew that you weren't doing this, mostly because overriding malloc on macOS is fraught with peril as mentioined above. I give some vague suggestions on how it can be done there, but <em>just</em> setting a <code>#[global_allocator]</code> would probably still help a lot.</p>\n<p>Note: I'm not suggesting switching to mimalloc, you could continue to use jemalloc and set a <code>#[global_allocator]</code> of course, or even do the steps I describe <a href=\"https://github.com/purpleprotocol/mimalloc_rust/issues/41#issuecomment-775256749\">here</a> with jemalloc</p>\n<p>(EDIT: I guess maybe it would be good to switch to mimalloc also given these numbers: <a href=\"https://github.com/rust-lang/rust/pull/81782\">https://github.com/rust-lang/rust/pull/81782</a>, but that's a different conversation)</p>",
        "id": 225572350,
        "sender_full_name": "Thom Chiovoloni",
        "timestamp": 1612802862
    },
    {
        "content": "<blockquote>\n<p>apparently you believe that you use jemalloc's overriding on mac (you don't, and likely can't).</p>\n</blockquote>\n<p>Who is \"you\" in that sentence? The compiler team?</p>",
        "id": 225591970,
        "sender_full_name": "pnkfelix",
        "timestamp": 1612811075
    },
    {
        "content": "<p>Okay, I guess it is, based on the comment thread on <a href=\"https://github.com/purpleprotocol/mimalloc_rust/issues/41#issuecomment-775271617\">the linked issue</a></p>",
        "id": 225592078,
        "sender_full_name": "pnkfelix",
        "timestamp": 1612811132
    },
    {
        "content": "<p>The interpretation I have from the <code>config.toml</code> is that we are not overriding the allocator to use <code>jemalloc</code>. We may be claiming that one <em>could</em> (by setting <code>rust.jemalloc</code> to true in the <code>config.toml</code>), and it sounds like that claim is incorrect (or at least, that is what you are trying to alert us about).</p>",
        "id": 225592538,
        "sender_full_name": "pnkfelix",
        "timestamp": 1612811329
    },
    {
        "content": "<p>(I need to review the jemallocator comment more carefully.)</p>",
        "id": 225592798,
        "sender_full_name": "pnkfelix",
        "timestamp": 1612811461
    },
    {
        "content": "<p>I filed <a href=\"https://github.com/rust-lang/rust/issues/82423\">#82423</a> to track this issue.  From my testing, I believe it is correct that jemalloc is not working as expected on macos.</p>",
        "id": 227356528,
        "sender_full_name": "Eric Huss",
        "timestamp": 1614036037
    },
    {
        "content": "<p>I didn't think we were enabling it to be honest, but sounds like we are</p>",
        "id": 227356579,
        "sender_full_name": "simulacrum",
        "timestamp": 1614036068
    },
    {
        "content": "<p>Yes, in ci.yml, it is explicitly enabled.</p>",
        "id": 227356620,
        "sender_full_name": "Eric Huss",
        "timestamp": 1614036098
    }
]