[
    {
        "content": "<p>I've pushed a PR to my fork for moving the comparison page to Vue.js <a href=\"https://github.com/rylev/rustc-perf/pull/1\">https://github.com/rylev/rustc-perf/pull/1</a></p>\n<p>The reason for this PR is that we are currently doing direct DOM manipulation by building strings of HTML and setting innerHTML on some elements. This is pretty error prone and hard to extend.</p>\n<p>I don't want to introduce added build complexities and Vue doesn't require any pre-processing or compilation steps. It's pretty small and very straight-forward if you're familiar with react or similar types of libraries. The guide page is also pretty short, and we're only using features mentioned on that page. </p>\n<p><span class=\"user-mention\" data-user-id=\"116122\">@simulacrum</span> any concern with moving to vue?</p>",
        "id": 246392695,
        "sender_full_name": "rylev",
        "timestamp": 1626634280
    },
    {
        "content": "<p>(the next steps after this are to hide \"non-significant\" changes by default)</p>",
        "id": 246392772,
        "sender_full_name": "rylev",
        "timestamp": 1626634429
    },
    {
        "content": "<p>I've used it before. I think it's fine, shouldn't be a big deal to add it.</p>",
        "id": 246393125,
        "sender_full_name": "simulacrum",
        "timestamp": 1626634917
    },
    {
        "content": "<p>What about preact? It is much smaller.</p>",
        "id": 246394823,
        "sender_full_name": "bjorn3",
        "timestamp": 1626637428
    },
    {
        "content": "<p>It is also simpler. I tried to use vue a couple of days ago to work on Graphite and it gave me some opaque error when trying to use v-model for a custom element. Maybe reading the documentation would help me understand it, but react/preact don't really need explanation at all beyond the basic concept.</p>",
        "id": 246394963,
        "sender_full_name": "bjorn3",
        "timestamp": 1626637617
    },
    {
        "content": "<p>I have no particular opinion on framework; I don't really actively use any of them but imagine they're all about as equally OK for our use case.</p>",
        "id": 246395053,
        "sender_full_name": "simulacrum",
        "timestamp": 1626637742
    },
    {
        "content": "<p>One important thing was to not require pre-compilation steps. I've not used preact before, but it's my understanding that using it without jsx (and thus a pre-compilation step) is suboptimal. Vue just works in plain HTML</p>",
        "id": 246395280,
        "sender_full_name": "rylev",
        "timestamp": 1626638049
    },
    {
        "content": "<p>(plus the code is already written and uses Vue, so I'd need a pretty good argument why Vue is a poor choice)</p>",
        "id": 246395297,
        "sender_full_name": "rylev",
        "timestamp": 1626638090
    }
]