[
    {
        "content": "<blockquote>\n<p>(Also, can someone remind me: Do we not do perf runs on rollups ahead of time because ... it would overload the perf runner? Because people doing rollups would not know what to do with the results? I'm having difficulty understanding why we wouldn't do this safeguard <em>ahead</em> of time here.)</p>\n</blockquote>\n<p>To be clear, there are three interesting outcomes I can foresee if we started doing the perf run ahead of time:</p>\n<ul>\n<li>pre-merge run says no regression, and merge run says regression. We would investigate but it would definitely provide some initial evidence that noise/nondeterminism is to blame.</li>\n<li>pre-merge run says regression, but it is deemed acceptable. Merge run will either register a less-or-equal regression (which we will then continue to treat as acceptable), or the merge run will say it had greater regression. Which would again yield an investigation, but hopefully a more informed one. (and also, it would provide some rough idea that <em>some</em> amount of regression was considered acceptable.)</li>\n<li>pre-merge run says regression, and it is deemed inacceptable. Thus, PR doesn't land in that state. That's a win, in my opinion.</li>\n</ul>",
        "id": 274753484,
        "sender_full_name": "pnkfelix",
        "timestamp": 1646860592
    },
    {
        "content": "<p>It takes at minimum ~3 hours for a perf run to complete with current CI and perf hardware (both parts could be made faster with extra resources, probably; some people/engineering cost involved too), so by the time that would have finished the rollup has spent enough time that there's probably a larger rollup <em>possible</em></p>",
        "id": 274756478,
        "sender_full_name": "simulacrum",
        "timestamp": 1646862139
    },
    {
        "content": "<p>(And the person making the rollup has gone on and is doing other things).</p>",
        "id": 274756498,
        "sender_full_name": "simulacrum",
        "timestamp": 1646862157
    },
    {
        "content": "<p>okay. I can understand that reasoning. (And of course, sequencing the perf runs on actual merges to master ensures that there is a sensible queue dictating that workload)</p>",
        "id": 274756875,
        "sender_full_name": "pnkfelix",
        "timestamp": 1646862371
    },
    {
        "content": "<p>it does lead to this state where when a rollup PR <em>is</em> associated with a performance regression, there's some amount of work attached to \"is there any PR here that can be readily identified as the cause\", and then if that fails, it turns into \"okay, so do I just chalk this up to the usual random noise caused by code placement, inlining decisions, etc...\"</p>",
        "id": 274757219,
        "sender_full_name": "pnkfelix",
        "timestamp": 1646862583
    },
    {
        "content": "<p>(a question which would arise regardless of <em>when</em> the perf runs are done)</p>",
        "id": 274757315,
        "sender_full_name": "pnkfelix",
        "timestamp": 1646862611
    },
    {
        "content": "<p>Absolutely. I think there's a lot of value in making CI fast enough to where rollups aren't necessary -- or at least, much more infrequent -- and I am pretty confident we could get there with some (not insignificant, but not <em>enormous</em> investment).</p>",
        "id": 274757424,
        "sender_full_name": "simulacrum",
        "timestamp": 1646862675
    },
    {
        "content": "<p>(The problem you describe is not all that unique to rollups, just exacerbated by the larger amount of changes and diffusion of responsibility).</p>",
        "id": 274757456,
        "sender_full_name": "simulacrum",
        "timestamp": 1646862702
    },
    {
        "content": "<p>yes exactly; I'm coming around to that viewpoint that this is <em>not really</em> about rollups</p>",
        "id": 274757475,
        "sender_full_name": "pnkfelix",
        "timestamp": 1646862718
    },
    {
        "content": "<p>could we start the ci for the merge and a perf run at the same time and fail the merge if there is a noticeable perf impact?</p>",
        "id": 274818477,
        "sender_full_name": "lcnr",
        "timestamp": 1646909620
    },
    {
        "content": "<p>I don't think so. Doing a perf run will first require a try build. By the time both the try build and the perf run are done I am pretty sure a regular r+ would have already finished for like an hour. Also the perf run may not be able to start immediately due to still benchmarking the previous merged PR.</p>",
        "id": 274818834,
        "sender_full_name": "bjorn3",
        "timestamp": 1646909822
    },
    {
        "content": "<p>This may just be my perspective but I think one of the more common friction points nowadays is \"something that works on x86 doesn't work on aarch64\" or vice versa, and I think we might significantly reduce thrash in PRs if one of the initial builders (alongside the tool check, etc.) was an aarch64 one, but I don't know about the spare resources for that.</p>\n<p>This isn't really about performance per se or even rollups but about making the PR queue \"smoother\" so that less clogging events happen that require rollups to address.</p>",
        "id": 276421599,
        "sender_full_name": "Jubilee",
        "timestamp": 1648083055
    },
    {
        "content": "<p>This may be my perspective and the kinds of PRs I primarily review, but I've noticed few failures due to CPU differences, and far more due to OS differences; for instance, code that fails on WebAssembly, or Android, or macOS.</p>",
        "id": 276436501,
        "sender_full_name": "Josh Triplett",
        "timestamp": 1648102738
    },
    {
        "content": "<p>Yeah, I was thinking aarch64-android might be nice, actually (aarch64-darwin honestly would be my first choice but uhhhhhhhh, finding spare builders for that...?).</p>",
        "id": 276519707,
        "sender_full_name": "Jubilee",
        "timestamp": 1648146102
    }
]